{
  "query_id": "001",
  "query_text": "I made that very clear in 2020. I will not ban fracking. …I have not banned fracking as Vice President of the United States. And, in fact, I was the tie-breaking vote on the Inflation Reduction Act, which opened new leases for fracking.",
  "query_topics": [
    "Climate",
    "Government Policy"
  ],
  "speaker": "Harris",
  "results": {
    "I made that very clear in 2020. I will not ban fracking. …I have not banned fracking as Vice President of the United States. And, in fact, I was the tie-breaking vote on the Inflation Reduction Act, which opened new leases for fracking.": [
      {
        "match_score": 0.5356654,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "028",
          "title": "Vice President Harris and President Zelenskyy Speak to the Press Transcript",
          "date": "20240218",
          "topics": "Foreign Policy"
        },
        "matched_segment": {
          "segment_id": 3,
          "text": "And as it relates to the supplemental, we have been clear, the President and I both in private conversations with members of the United States Congress and in public, we are clear and certain that for the majority in both the United States Senate and the United States House of Representative, there is bipartisan support for this approach. There is bipartisan support for what America is and what we stand for. And we are unwavering and that has nothing to do with an election cycle."
        },
        "context": {
          "previous": "Political gamesmanship has no role to play in what is fundamentally about the significance of standing with an ally as it endures an unprovoked aggression. () Politics should play no role in standing for the fact that Vladimir Putin through his leadership of Russia, has shown himself to be fundamentally hostile to democratic principles. Not to mention what we learned about in the last 24 hours in terms of the killing of Navalny. So this is about where we stand as a nation.",
          "next": "It has to do with who we are and what kind of country we want to be, one that stands with our friends. President Zelenskyy? President Zelenskyy If you want to. There's only plan A, which is to ensure that Ukraine receives what it needs. I will emphasize that an indication of where we can and frankly must be is that there is bipartisan support in both of our houses of Congress on the Senate side and the House of Representatives."
        }
      },
      {
        "match_score": 0.52989686,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "052",
          "title": "Vice President Harris Speaks at Peace Summit in Ukraine",
          "date": "20240617",
          "topics": "Foreign Policy"
        },
        "matched_segment": {
          "segment_id": 2,
          "text": "() As I discussed with President Zelensky earlier today, President Biden and I have made clear over the past three years we are committed to uphold international rules and norms, to defend democratic values and stand up to dictators, and to stand with our allies and partners. This approach has provided for our security and prosperity for generations, and it continues to do so today. This approach makes America strong and it keeps Americans safe, and this approach bolsters global stability."
        },
        "context": {
          "previous": "On that same day, I addressed the Munich Security Conference and made clear that the United States of America is a steadfast supporter of the principles, that people have a right to choose their own form of government, nations have a right to choose their own alliances. There are inalienable rights governments must protect. The rule of law must be cherished. Sovereignty and territorial integrity of all states must be respected. And national borders should not be changed by force.",
          "next": "() Russia's aggression is not only attack on the lives and the freedom of the people of Ukraine, it is not only an attack on global food security and energy supplies. Russia's aggression is also an attack on international rules and norms and the principles embodied in the UN Charter. Russia is a permanent member of the United Nations Security Council, nevertheless, for nearly two-and-a-half years, it has shamelessly violated the core tenets of that charter."
        }
      },
      {
        "match_score": 0.5209332,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "115",
          "title": "Harris Speech in Pittsburgh",
          "date": "20240926",
          "topics": "Economy, Healthcare, Government Policy, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 5,
          "text": "I believe an active partnership between government and the private sector is one of the most effective ways to fully unlock economic opportunity. And that is what I'll do when I'm president. I will target the major barriers to opportunity and remove them. We will identify common sense solutions to help Americans buy a home, start a business, and build wealth, and we will adopt them. () So let's start then with the first pillar of an opportunity economy, which is lowering costs."
        },
        "context": {
          "previous": "For 500 heart-pounding miles, these fierce competitors will chase the checkered flag, fight for the Harley J. Earl trophy, and make their play for pure American glory. And that's what it is, pure American glory. As we wait for the green flag, we give thanks to this beloved country, for the heroes who keep us safe, and for the God who made us free. To all of the drivers, technicians, and pit crews here today, good luck and may the best team win. God bless you. God bless our military.",
          "next": "So I made that our top priority for obvious reasons, because if we want the middle class to be the growth engine of our economy, we need to restore basic economic security for middle-class families. To that end, the most practical thing we can do right now, is to cut taxes for middle-class families and individuals. And that's what we'll do."
        }
      }
    ]
  }
}