{
  "query_id": "002",
  "query_text": "My position is that we have got to invest in diverse sources of energy so we reduce our reliance on foreign oil. ",
  "query_topics": [
    "Economy",
    "Climate",
    "Government Policy"
  ],
  "speaker": "Harris",
  "results": {
    "My position is that we have got to invest in diverse sources of energy so we reduce our reliance on foreign oil. ": [
      {
        "match_score": 0.59169364,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "017",
          "title": "Kamala Harris Singapore Speech on Afghanistan, China Transcript August 24",
          "date": "20210824",
          "topics": "Foreign Policy, Technology, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 14,
          "text": "Our vision includes investing in a clean energy future and building resilient communities, and the relationship between the United States and Singapore and its climate partnership that we announced yesterday will focus on sustainable finance, as just one example of the work we are committed to doing together. The nations of Southeast Asia know the impact of the climate crisis all too well. The rising sea levels, the typhoons, the floods; these disasters have cost human life and livelihoods."
        },
        "context": {
          "previous": "In fact, today I am proud to announce that the United States is offering to host APEC in 2023. Through APEC, or the Asian Pacific Economic Cooperation Forum, the United States has long worked with our partners in Asia and Latin America to build an interconnected region that advances our collective economic prosperity. A vital part of our agenda is also related to addressing the climate crisis.",
          "next": "And as we know, the crisis of course is getting much more urgent. I'm sure many of you read and saw the report recently from the United Nations. And in our interconnected world, this issue affects us all, and it requires a collective vision, and it requires collective action. And then of course, there's another issue that truly knows no borders, the pandemic."
        }
      },
      {
        "match_score": 0.5912777,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "045",
          "title": "Vice President Harris Attends the 28th ESSENCE Festival of Culture Transcript",
          "date": "20220703",
          "topics": "Healthcare, Social Justice, Government Policy"
        },
        "matched_segment": {
          "segment_id": 25,
          "text": "I just recently convened the Caribbean prime ministers and presidents around what we should do as the United States, seeing them as our neighbors in the Western hemisphere and giving appropriate support there. So we have to multitask. Looking at what we need to do domestically, what we need to do to bring down the cost of gas. Don't do that. Don't do that. Please, don't do that. Well, first and foremost, and I don't need to say to you Kiki, because you really do use your voice in such an extraordinary way."
        },
        "context": {
          "previous": "We have extended the child tax credit. And in that, in, so doing in the first year reduced black child poverty by almost 40%, cannot get a Republican to help us extend it beyond. But these are some of the things that we have been doing, understanding the generational impact. Not to mention the work that we need to do that is about foreign policy. I have met with, I don't know, probably at least two dozen foreign leaders, prime ministers, presidents.",
          "next": "No, you really do. You really do. You have the courage to speak out and you're not concerned about putting your finger in the air to see if it's popular, you speak truth, and I really appreciate, and respect and admire that. But I will say let's not discount what young leaders are doing right now, because there's a lot of extraordinary leadership happening from our young leaders. When I think about civil rights movement and my parents and what they were doing, they were in their 20s. Don't forget, Dr."
        }
      },
      {
        "match_score": 0.56958324,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "103",
          "title": "Kamala Harris Campaign Speech Transcript McAllen, Texas October 30",
          "date": "20201030",
          "topics": "Economy, Healthcare, Social Justice, Climate"
        },
        "matched_segment": {
          "segment_id": 29,
          "text": "Joe knows this is not only about what we need to do for our environment, the opportunity in the moment is we can also create jobs. We can invest in infrastructure, in renewable energies, in solar and wind, and that will be millions of jobs. Joe also knows this is an environmental justice issue. When you're looking at the fact that in all of the areas in the country that have poor air quality, 70% of the people who live in those places are people of color."
        },
        "context": {
          "previous": "They name a storm because it's that bad; five. The most recent one being Zeta. We're looking at what's been happening in the Midwest; farmers losing a whole season of crops because of the floods. Joe Biden says, we need to embrace science. We need to speak truth. We need to deal with this with timelines and a sense of urgency because we need to be able to breathe clean air and drink clean water, and see the connection between human behaviors and the crisis we are facing.",
          "next": "Joe knows that and he understands how we can build back better in a way that we deal with the science. We build up an infrastructure where we'll create millions of jobs and we do it in a way that is about equitable outcomes and we build back better. On the other hand, you have Donald Trump. Okay. So here's the thing."
        }
      }
    ]
  }
}