{
  "query_id": "003",
  "query_text": "And my focus then, on protecting women and children from violent crime, is based on a value that is deeply grounded in the importance of standing up for those who are most vulnerable. ",
  "query_topics": [
    "Social Justice"
  ],
  "speaker": "Harris",
  "results": {
    "And my focus then, on protecting women and children from violent crime, is based on a value that is deeply grounded in the importance of standing up for those who are most vulnerable. ": [
      {
        "match_score": 0.5669009,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "068",
          "title": "Kamala Harris speaks after meeting with Guatemalan President",
          "date": "20240326",
          "topics": "Economy, Foreign Policy, Government Policy, Social Justice, Immigration"
        },
        "matched_segment": {
          "segment_id": 3,
          "text": "That strategy rests on five pillars. One, to invest in economic development in the region. Two, to combat corruption and promote good governance. Three, to respect human rights and labor rights. In addition to reduced violence. And finally, to address gender-based violence. This work is improving lives and livelihoods in the region and addressing the factors that drive people to migrate to the United States. Mr."
        },
        "context": {
          "previous": "() And despite the challenges that have been posed to Guatemala's democratic process, the United States was proud to stand with you, Mr. President, following a free and fair election and throughout your transition. And the will of the people of Guatemala via our observation has triumphed. For the past three years, I have led our administration's efforts to address the root causes of migration from Northern Central America and to create what we have named the Root Causes Strategy.",
          "next": "President, I believe your presidency offers an important opportunity for us to strengthen US-Guatemalan relations and make further progress on each of the five pillars I have outlined. () In particular, Mr. President, I commend you for your steadfast commitment to combat corruption. Corruption, of course, erodes trust in democracy and prevents governments from responding to the needs of their people. Corruption is also an impediment to US investment and threatens economic growth."
        }
      },
      {
        "match_score": 0.55541986,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "070",
          "title": "VP Kamala Harris Speech During Meeting with Religious Leaders Transcript",
          "date": "20210331",
          "topics": "Economy, Social Justice, Government Policy"
        },
        "matched_segment": {
          "segment_id": 23,
          "text": "And that is one of the first areas that I'd like to discuss with you, but also on my mind today or what we need to do and collectively what we can do informed by you around what we're seeing around hate crime in America, what we are seeing around people turning on each other, treating their fellow human being as the other, and what we have the ability to do to see this moment of crisis in that regard as also an opportunity for coalition building. So that's on my mind. I'm doing work on the Northern Triangle."
        },
        "context": {
          "previous": "The work we are doing to hopefully help people survive through this moment so they can get back up on their feet. So we see light at the end of the tunnel, and in large part because of the vaccinations that are happening, because of the vaccine. And so I want to talk with you about your thoughts, about how we can, and you in particular as our faith-based leaders, can help us to make sure that everyone, when it is their turn, gets a vaccine.",
          "next": "Part of the reason I was a bit delayed for this meeting is I was just meeting with our secretary of state. And I know that a lot of you are working on this issue in many ways, but to the extent that you have thoughts and experience about what we can do to address some of the root causes that cause people to flee their home, because as we all know, most people like being at home. They like being where they grew up, they like being in a place where they understand the culture."
        }
      },
      {
        "match_score": 0.55541986,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "070",
          "title": "VP Kamala Harris Speech During Meeting with Religious Leaders Transcript",
          "date": "20210331",
          "topics": "Economy, Social Justice, Government Policy"
        },
        "matched_segment": {
          "segment_id": 9,
          "text": "And that is one of the first areas that I'd like to discuss with you, but also on my mind today or what we need to do and collectively what we can do informed by you around what we're seeing around hate crime in America, what we are seeing around people turning on each other, treating their fellow human being as the other, and what we have the ability to do to see this moment of crisis in that regard as also an opportunity for coalition building. So that's on my mind. I'm doing work on the Northern Triangle."
        },
        "context": {
          "previous": "The work we are doing to hopefully help people survive through this moment so they can get back up on their feet. So we see light at the end of the tunnel, and in large part because of the vaccinations that are happening, because of the vaccine. And so I want to talk with you about your thoughts, about how we can, and you in particular as our faith-based leaders, can help us to make sure that everyone, when it is their turn, gets a vaccine.",
          "next": "Part of the reason I was a bit delayed for this meeting is I was just meeting with our secretary of state. And I know that a lot of you are working on this issue in many ways, but to the extent that you have thoughts and experience about what we can do to address some of the root causes that cause people to flee their home, because as we all know, most people like being at home. They like being where they grew up, they like being in a place where they understand the culture."
        }
      }
    ]
  }
}