{
  "query_id": "004",
  "query_text": "Understand, in his(Trump’s) Project 2025 there would be a national abortion--a monitor that would be monitoring your pregnancies, your miscarriages. ",
  "query_topics": [
    "Healthcare",
    "Government Policy"
  ],
  "results": {
    "Understand, in his(Trump’s) Project 2025 there would be a national abortion--a monitor that would be monitoring your pregnancies, your miscarriages. ": {
      "Trump": [
        {
          "match_score": 0.61198187,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "224",
            "title": "Trump Speaks at Faith & Freedom Coalition Gala Transcript",
            "date": "20230626",
            "topics": "Foreign Policy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 83,
            "text": "Remember I said that during my campaign? Everyone said, \"That's not going to happen.\" Nobody thought that was going to happen. But I will fight for you like no president has ever fought before. We'll get something done for the country. We're going to be for the country. We will defeat the radical Democrat policy of extreme late-term abortion, and we will bring everybody together to protect our precious unborn babies in a very, very big way. And now you have the power to do it because we terminated Roe v. Wade."
          },
          "context": {
            "previous": "But the three exceptions, and Ronald Reagan was there a long time ago. And I got through two very successful campaigns. Actually, my second campaign was much more successful. I got 12 million more votes. So I wonder what happened. I wonder what happened. However, there of course remains a vital role for the federal government in protecting unborn life. And it's very important. And I propose for you tonight, just as I did when I said that we will win the Supreme Court decision on abortion ...",
            "next": "Every child born and unborn is sacred gift from God. (:36) Thank you. Thank you. But you're in a much different position than you were before. Before you had nothing to negotiate with. Today you're you're in the driver's seat, very much in the driver's seat. Under my leadership, the United States will also rejoin the Geneva Consensus Declaration, created by my administration and signed by 36 nations, to reject the globalist claim of an international right to abortion."
          }
        },
        {
          "match_score": 0.6108045,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "441",
            "title": "Meet The Press Full Donald Trump Interview Transcript",
            "date": "20230918",
            "topics": "Economy, Immigration, Foreign Policy, Veterans Affairs, Government Policy"
          },
          "matched_segment": {
            "segment_id": 51,
            "text": "You go, life of the mother, rape, incest. I think most of them are there. That's a big statement. Well, I don't know what he's saying, because before he wanted you can't have abortion. Excuse me. Now, all of a sudden, he's saying 15 weeks. I said, wow, where did that come from? That's a radical change. Look, something is going to happen that's going to be good for everybody. I'm, almost like, a mediator in this case. They wanted Roe v. Wade terminated, because it was inappropriate. We got it done."
          },
          "context": {
            "previous": "The most powerful people that are anti- abortion are okay with that now. And you know what? They weren't okay with that even a year ago. Well, Mike Pence said something about 15 weeks, too, which was a big change for Mike Pence, because Mike Pence had no exceptions. I have exceptions, by the way. I think people should have exceptions. I think if it's rape or incest or the life of the mother, I think, you have to have exceptions. Now, I will tell you that I think most people, most Republicans are willing.",
            "next": "Something's going to happen. It's going to be a number of weeks. Something's going to happen where both sides are going to be able to come together, and then we'll be able to go onto other things like the economy or military. What I say is very, simple because you can't put words in my mouth like that. Because you've been hearing me talk about this issue, and I think, I talk about it very productively. It could be a state ban, it could be a federal ban, but Democrats want that too."
          }
        },
        {
          "match_score": 0.6024802,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "441",
            "title": "Meet The Press Full Donald Trump Interview Transcript",
            "date": "20230918",
            "topics": "Economy, Immigration, Foreign Policy, Veterans Affairs, Government Policy"
          },
          "matched_segment": {
            "segment_id": 48,
            "text": "We have to bring the country together on this issue. I care about it, too. Oh, I care about it, too. No, I don't think you should be allowed to have abortions well into a pregnancy. No. We're going to agree to a number of weeks or months or however you want to define it. And both sides are going to come together. And both sides, and this is a big statement. Both sides will come together and for the first time in 52 years, you'll have an issue that we can put behind us. It could be state or it could be federal."
          },
          "context": {
            "previous": "And Kristen, you have to look at this because you said no. You have some states that are allowed to kill the child after birth, and you can't allow that. But you have legislation. Kristen, you have legislation in certain states, where it's allowed. The governor of Virginia, previous governor, who was a wack... I call him the Michael Jackson governor. Excuse me. That governor said you can kill the baby after birth. We'll agree to a number of weeks, where both sides will be happy.",
            "next": "I don't frankly care. I would say this, everybody and including the great legal scholars love the idea of Roe v. Wade terminated, so it'd be brought back to the states. I would say this, from a pure standpoint, from a legal standpoint, I think, it's probably better, but I can live with it either way. It's much more important the number of weeks, but something will happen with the number of weeks, the amount of time after which you can't do it. And you know what?"
          }
        }
      ],
      "Harris": [],
      "Trump_avg_score": 0.6084,
      "Combined_avg_score": 0.6084
    }
  }
}