{
  "query_id": "004",
  "query_text": "What we know is that this war(Israel-Hamas war) must end. It must when--end immediately, and the way it will end is we need a cease-fire deal and we need the hostages out. ",
  "query_topics": [
    "Foreign Policy"
  ],
  "speaker": "Harris",
  "results": {
    "What we know is that this war(Israel-Hamas war) must end. It must when--end immediately, and the way it will end is we need a cease-fire deal and we need the hostages out. ": [
      {
        "match_score": 0.5839732,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "061",
          "title": "Vice President Harris Delivers Remarks at Israel’s Independence Day Celebration Transcript",
          "date": "20230607",
          "topics": "Foreign Policy"
        },
        "matched_segment": {
          "segment_id": 10,
          "text": "That is why we will continue to build on Israel's peace treaties with Egypt and Jordan, and on Israel's historic agreements with the UAE, Bahrain, and Morocco. Also understanding this all is to support Israel's normalization with countries in the region and beyond. As we do that, the Biden-Harris administration will continue to work toward a world where Israelis and Palestinians can live safely and securely and enjoy equal measures of freedom, prosperity, and democracy."
        },
        "context": {
          "previous": "And know this, whether replenishing Iron Dome, working together to develop a new laser defense system or countering Iran and its proxies, the commitment of the United States and its commitment to Israel's security will remain unwavering. () Our administration believes that in order to promote the security of Israel, the region, and the United States, we must continue to create a more integrated and interconnected Middle East.",
          "next": "And under President Joe Biden and our administration, America will continue to stand for the values that have been the bedrock of the US-Israel relationship, which includes continuing to strengthen our democracies, which as the ambassador has said, are both built on strong institutions, checks and balances, and I'll add, an independent judiciary."
        }
      },
      {
        "match_score": 0.5666273,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "061",
          "title": "Vice President Harris Delivers Remarks at Israel’s Independence Day Celebration Transcript",
          "date": "20230607",
          "topics": "Foreign Policy"
        },
        "matched_segment": {
          "segment_id": 15,
          "text": "It says, and I'll quote, \"It is not your duty to finish the work, but neither are you at liberty to neglect it.\" I'm going to repeat. \"It is not your duty to finish the work, but neither are we at liberty to neglect it.\" While Israel and the United States have achieved so much together, there is still so much more work to do. Previous generations willed the dream of Israel into reality and established enduring bonds between our nations and our people."
        },
        "context": {
          "previous": "Israel is a nation full of innovators, entrepreneurs and visionaries, whether on autonomous vehicles, cybersecurity, or FinTech, it is clear Israel helps point the world toward the future. () So I will conclude by looking toward the future and quoting one of my favorite lines from the Talmud, a line that inspired an extended discussion during our first Seder at the Vice President's residence.",
          "next": "And now for our generation, we have the baton in the long relay race of history, and it is then up to us to strengthen these bonds even further. President Biden and I look forward to the next 75 years of progress and partnership. And so congratulations on this momentous anniversary and let us celebrate all that our nations have achieved together and all that is yet to come. Thank you all."
        }
      },
      {
        "match_score": 0.55906266,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "052",
          "title": "Vice President Harris Speaks at Peace Summit in Ukraine",
          "date": "20240617",
          "topics": "Foreign Policy"
        },
        "matched_segment": {
          "segment_id": 5,
          "text": "() President Zelensky, the United States shares your vision for the end of this war and an end to the suffering of the Ukrainian people. And let us all then commit to the imperative of returning innocent children kidnapped by Russia returning them to their homes. Let us also agree a practical benefit of the work of this Peace Summit is to increase global food and energy security. And let nothing about the end of this war be decided without Ukraine."
        },
        "context": {
          "previous": "() If the world fails to respond when an aggressor invades its neighbor, other aggressors will undoubtedly become emboldened. It leads to the potential of a war of conquest and chaos, not order and stability, which threatens all nations. President Joe Biden and I will continue to support Ukraine and continue to impose costs on Russia, and we will continue to work toward a just and lasting peace based on the principles of the United Nations Charter and the will of the people of Ukraine.",
          "next": "() By contrast, however, yesterday Putin put forward a proposal, but we must speak truth. He is not calling for negotiations. He is calling for surrender. America stands with Ukraine, not out of charity, but because it is in our strategic interest. We stand with delegations from more than 90 nations who also have a strategic interest in a just peace in Ukraine. Among us, no doubt, exists a diverse range of views on many of the global challenges and opportunities we face."
        }
      }
    ]
  }
}