{
  "query_id": "006",
  "query_text": "I have a plan that is about allowing people to be able to pursue what has been fleeting in terms of the American dream, by offering a help with down payment of $25,000, down payment assistance for first-time home buyers. ",
  "query_topics": [
    "Economy",
    "Government Policy"
  ],
  "speaker": "Harris",
  "results": {
    "I have a plan that is about allowing people to be able to pursue what has been fleeting in terms of the American dream, by offering a help with down payment of $25,000, down payment assistance for first-time home buyers. ": [
      {
        "match_score": 0.73018265,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "115",
          "title": "Harris Speech in Pittsburgh",
          "date": "20240926",
          "topics": "Economy, Healthcare, Government Policy, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 11,
          "text": "We will also help first-time home buyers just get their foot in the door with the $25,000 down payment assistance. Because the goal is clear, let's help more Americans afford to buy a home, which we know is a critical step in their ability to grow their wealth and intergenerational wealth. () And we will work to reduce other big costs for middle class families. We will take on bad actors who exploit emergencies and drive up grocery prices by enacting the first ever federal ban on corporate price gouging."
        },
        "context": {
          "previous": "And one of those, some would argue one of the biggest, is the cost of housing. So here's what we will do. We will cut the red tape that stops homes from being built and take on in addition, corporate landlords who are hiking rental prices. And we will work with builders and developers to construct 3 million new homes and rentals for the middle class because increasing the housing supply will help drive down the cost of housing.",
          "next": "I had the experience of dealing with that when I was Attorney General. We will take on big pharma, and cap the cost of prescription drugs for all Americans just like we did for our seniors. Now, by contrast, Donald Trump has no intention of lowering costs for the middle class. In fact, his economic agenda would actually raise prices. And listen, that's not just my opinion."
        }
      },
      {
        "match_score": 0.6107197,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "102",
          "title": "Kamala Harris Campaign Event Speech Transcript Houston, TX October 30",
          "date": "20201030",
          "topics": "Economy, Social Justice, Government Policy"
        },
        "matched_segment": {
          "segment_id": 16,
          "text": "Joe Biden says we will not raise taxes on anyone that makes less than $400,000 a year and we will cut middle class taxes. Joe Biden says you're a first time homeowner, you will get a home, first time home buyer, you will get a $15,000 tax credit with downpayment and closing cost because we know home ownership is one of the greatest ways that any American family accumulates wealth."
        },
        "context": {
          "previous": "Here in Texas, one in four small businesses is describing having to shut down with concerns they will never be able to reopen. And then on the one hand, you have a Joe Biden who says on the issue of the economy, if you want to know about how I think the economy is doing, then tell me how working people are doing, how are working families doing. Joe Biden says let's get $150 billion in low interest loans and access to capital to our small businesses with an emphasis on minority owned businesses.",
          "next": "Joe Biden says if you are a student that wants to go to college coming from a family that makes less than $125,000 a year, you will go to a four year public college for free including an HBCU and a private HBCU. On the other hand, you have Donald Trump who when asked about the economy asks, well, how are rich people doing? How is the stock market doing?"
        }
      },
      {
        "match_score": 0.60411614,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "115",
          "title": "Harris Speech in Pittsburgh",
          "date": "20240926",
          "topics": "Economy, Healthcare, Government Policy, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 5,
          "text": "I believe an active partnership between government and the private sector is one of the most effective ways to fully unlock economic opportunity. And that is what I'll do when I'm president. I will target the major barriers to opportunity and remove them. We will identify common sense solutions to help Americans buy a home, start a business, and build wealth, and we will adopt them. () So let's start then with the first pillar of an opportunity economy, which is lowering costs."
        },
        "context": {
          "previous": "For 500 heart-pounding miles, these fierce competitors will chase the checkered flag, fight for the Harley J. Earl trophy, and make their play for pure American glory. And that's what it is, pure American glory. As we wait for the green flag, we give thanks to this beloved country, for the heroes who keep us safe, and for the God who made us free. To all of the drivers, technicians, and pit crews here today, good luck and may the best team win. God bless you. God bless our military.",
          "next": "So I made that our top priority for obvious reasons, because if we want the middle class to be the growth engine of our economy, we need to restore basic economic security for middle-class families. To that end, the most practical thing we can do right now, is to cut taxes for middle-class families and individuals. And that's what we'll do."
        }
      }
    ]
  }
}