{
  "query_id": "007",
  "query_text": "Tim Walz and I are both gun owners. We're not taking anybody's guns away. ",
  "query_topics": [
    "Gun Control"
  ],
  "speaker": "Harris",
  "results": {
    "Tim Walz and I are both gun owners. We're not taking anybody's guns away. ": [
      {
        "match_score": 0.69044155,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "020",
          "title": "Harris and Walz Hold First Rally",
          "date": "20240807",
          "topics": "Economy, Healthcare, Education, Social Justice, Gun Control, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 21,
          "text": "As Governor, he signed the most significant expansion of voting rights in Minnesota in over 50 years. And with Governor Walz's help when I am President, we are going to finally pass the John Lewis Voting Rights Act and the Freedom to Vote Act. We're going to get it done. So Tim is a hunter and a gun owner who believes, as the majority of gun owners do that, we need reasonable gun safety laws in America. So as governor, he expanded background checks and increased penalties for illegal firearm sales."
        },
        "context": {
          "previous": "After Roe was overturned, he was the first governor in the country to sign a new law that enshrined reproductive freedom as a fundamental right. And with Tim Walz by my side, when I am President of the United States and we win majorities in the United States Congress, we will pass a bill to restore reproductive freedom, and I will properly sign it into law. (:28) Tim Walz has also defended the sacred freedom to vote.",
          "next": "And together, when we win in November, we are finally going to pass universal background checks, red flag laws and an assault weapons ban. (:05) Through his work, Tim, the way I think about it, he really does shine a light on a brighter future that we can build together. In his state, he has been a model chief executive. And with his experience, I'm telling you, Tim Walz will be ready on day one."
        }
      },
      {
        "match_score": 0.6891217,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "020",
          "title": "Harris and Walz Hold First Rally",
          "date": "20240807",
          "topics": "Economy, Healthcare, Education, Social Justice, Gun Control, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 19,
          "text": "Think about that. (:55) Well, Tim and I have a message for Trump and others who want to turn back the clock on our fundamental freedoms: we're not going back. We're not going back. We're not going back. We're not going back. We're not going back. We're not going back. And so let me say, about Tim Walz, he has shown up to stand against these attacks long before he stood on the stage with me."
        },
        "context": {
          "previous": "(:47) So Pennsylvania, ours is a fight for the future of the middle class, and it is a fight for freedom. In this moment, we are witnessing a full-on attack against hard fought, hard won freedoms and rights. Take reproductive freedom. Now think about this, Donald Trump said he wants to punish women. And as a result of his actions today in America, one out of three women live in a state with a Trump abortion ban, one out of three. Some of these bans go back to the 1800s, even before women had a right to vote.",
          "next": "After Roe was overturned, he was the first governor in the country to sign a new law that enshrined reproductive freedom as a fundamental right. And with Tim Walz by my side, when I am President of the United States and we win majorities in the United States Congress, we will pass a bill to restore reproductive freedom, and I will properly sign it into law. (:28) Tim Walz has also defended the sacred freedom to vote."
        }
      },
      {
        "match_score": 0.6743834,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "020",
          "title": "Harris and Walz Hold First Rally",
          "date": "20240807",
          "topics": "Economy, Healthcare, Education, Social Justice, Gun Control, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 22,
          "text": "And together, when we win in November, we are finally going to pass universal background checks, red flag laws and an assault weapons ban. (:05) Through his work, Tim, the way I think about it, he really does shine a light on a brighter future that we can build together. In his state, he has been a model chief executive. And with his experience, I'm telling you, Tim Walz will be ready on day one."
        },
        "context": {
          "previous": "As Governor, he signed the most significant expansion of voting rights in Minnesota in over 50 years. And with Governor Walz's help when I am President, we are going to finally pass the John Lewis Voting Rights Act and the Freedom to Vote Act. We're going to get it done. So Tim is a hunter and a gun owner who believes, as the majority of gun owners do that, we need reasonable gun safety laws in America. So as governor, he expanded background checks and increased penalties for illegal firearm sales.",
          "next": "In fact, when you compare his resume, shall we, to Trump's running mate, well, some might say it's like it's a matchup between the varsity team and the JV squad. So Pennsylvania, ultimately in this election, we each face a question, what kind of country do we want to live in? A country of freedom, compassion and rule of law? Or a country of chaos, fear and hate? And here's the beauty of our democracy, we each have the power to answer that question. We each have the power to answer that question."
        }
      }
    ]
  }
}