{
  "query_id": "008",
  "query_text": "And when I am President we will do that for all people, understanding that the value I bring to this is that access to health care should be a right and not just a privilege of those who can afford it. And the plan has to be to strengthen the Affordable Care Act, not get rid of it--the past is prologue in terms of where Donald Trump stands on that.",
  "query_topics": [
    "Healthcare",
    "Government Policy"
  ],
  "speaker": "Harris",
  "results": {
    "And when I am President we will do that for all people, understanding that the value I bring to this is that access to health care should be a right and not just a privilege of those who can afford it. And the plan has to be to strengthen the Affordable Care Act, not get rid of it--the past is prologue in terms of where Donald Trump stands on that.": [
      {
        "match_score": 0.82391465,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "020",
          "title": "Harris and Walz Hold First Rally",
          "date": "20240807",
          "topics": "Economy, Healthcare, Education, Social Justice, Gun Control, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 16,
          "text": "So on that last topic, if Donald Trump gets the chance, he will end the Affordable Care Act and take us back to a time when insurance companies have the power to deny people with pre-existing conditions. You remember what that was like? Children with asthma, breast cancer survivors, grandparents with diabetes. Well, Governor Walz and I will not let that happen because we believe healthcare should be a right and not just a privilege for those who can afford it."
        },
        "context": {
          "previous": "(:44) In Washington, Tim worked to raise the minimum §wage, to protect the freedom of workers to join a union, and he cast one of the critical votes to pass the Affordable Care Act, which of course gave health insurance to tens of millions of Americans. I'm going to tell you, when we win, Tim and I will continue to make the Affordable Care Act even stronger. We will. (:46) Now let's talk about what we're dealing with on the other side.",
          "next": "As governor, Tim has continued to fight for working families. He secured paid leave for workers in Minnesota and he refused as governor to allow any student in their public schools to go hungry, so he made school breakfast and lunch free for every child. And Tim Walz and I, we agree about many things including when our middle class is strong, America is strong. And strengthening in the middle class will be my defining goal as I am President of the United States."
        }
      },
      {
        "match_score": 0.7330715,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "102",
          "title": "Kamala Harris Campaign Event Speech Transcript Houston, TX October 30",
          "date": "20201030",
          "topics": "Economy, Social Justice, Government Policy"
        },
        "matched_segment": {
          "segment_id": 13,
          "text": "We need to expand the protections for folks with pre-existing conditions. We need to bring down the cost of prescription drugs. We will lower the cost of premiums. We will bring down the age of Medicare eligibility to 60. We understand that when you're talking about healthcare, let's be clear. The body doesn't just start from the neck down. It also includes the neck up and we need to deal with mental health care in America. Joe understands these issues. There's a clear choice in this election."
        },
        "context": {
          "previous": "Raise your hand if your relative has lupus. Raise your hand if you know somebody who has breast cancer and is surviving. Raise your hand if you know somebody who got COVID. And the man's in court trying to get rid of the protection for people with pre-existing conditions here in Texas, 10 million people have preexisting conditions. So, there is a real choice in this election, on this point. Because you see, on the other hand, you have Joe Biden, who is saying we need to expand Obamacare.",
          "next": "We are dealing with an economic crisis, of a proportion that parallels the Great Depression. Over 30 million people in the last several months had to file for unemployment. One in five mothers is describing her children under the age of 12 as being hungry in America. We are in the midst of a hunger crisis. People aren't talking enough about that. Here in Texas, 1 in 10 households is describing members of their family as having been hungry. One in six households is describing an inability to pay the rent."
        }
      },
      {
        "match_score": 0.7093654,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "103",
          "title": "Kamala Harris Campaign Speech Transcript McAllen, Texas October 30",
          "date": "20201030",
          "topics": "Economy, Healthcare, Social Justice, Climate"
        },
        "matched_segment": {
          "segment_id": 13,
          "text": "And you see, Barack Obama, together with Vice President Biden, created the Affordable Care Act knowing people with preexisting conditions, including the 10 million Texans who have preexisting conditions, should be protected. But Donald Trump's in court right now trying to get rid of that. And part of the issue that I see, let's remember this, from the time the guy was running for office until now, Donald Trump has had this weird obsession with trying to get rid of whatever Barack Obama and Joe Biden created."
        },
        "context": {
          "previous": "And in the midst of this public health pandemic, where hundreds of thousands of people have died, where nine million people have contracted the virus, Donald Trump and his boy, Bill Barr, are in the United States Supreme Court suing to get rid of the Affordable Care Act that brought health care to over 20 million people, including protecting people with preexisting conditions. Honk if you know anybody who has diabetes. Honk if you know anybody who has high blood pressure. Lupus. Breast cancer.",
          "next": "Joe Biden, who was saying, \"We will expand health coverage, we will bring down the cost of premiums, we wil bring down the cost of prescription drugs, we will lower Medicare eligibility to age 60, we know that health care means understanding the body doesn't just start from the neck down, it includes the neck up, and that's called mental health care.\" There are clear choices in this election. And on the other hand, you have the current president who's trying to get rid of coverage for over 20 million people."
        }
      }
    ]
  }
}