{
  "query_id": "009",
  "query_text": "And I am proud that as Vice President over the last four years we have invested a trillion dollars in a clean energy economy while we have also increased domestic gas production to historic levels. ",
  "query_topics": [
    "Economy",
    "Climate",
    "Government Policy"
  ],
  "speaker": "Harris",
  "results": {
    "And I am proud that as Vice President over the last four years we have invested a trillion dollars in a clean energy economy while we have also increased domestic gas production to historic levels. ": [
      {
        "match_score": 0.62840253,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "089",
          "title": "Kamala Harris Joins Family Care Town Hall Transcript",
          "date": "20211014",
          "topics": "Economy, Healthcare, Social Justice, Government Policy"
        },
        "matched_segment": {
          "segment_id": 21,
          "text": "It is wonderful to have, but it does require a lot of work, especially for the generation that's in the middle of those multi-generations. And so we appreciate all that you all are doing. And thank you. And we're going to keep fighting for you. We got to build back better. Thank you. Speaker 2: () Thank vice president. Thank you. Speaker 1: () That's right. We got to build back better. And I don't know about all of you, but I'm feeling energized and inspired. Next up."
        },
        "context": {
          "previous": "And it ranges on the scale of support and care, right? Sometimes it's a little bit of one, sometimes it's more of the other. But families need help doing that. And it should be our collective interest in supporting that approach because it's just simply the right thing to do. And so, again, I want to thank you all for your courage to tell your story. It's great to see all three of you. I know you are a multi-generational family and there's so much that is great about that.",
          "next": "We're going to hear from [Nelia Calda :20], who is a home care worker in Scottsdale, Arizona and owns her own home care agency. Welcome, Nelia. Thank you. Nelia, well, first let me just give you a little background on my perspective. One, I spent a day with a home healthcare worker, a member of SEIU by the name of Wendy [Cogh :19] years ago. I spent the whole day with her. The work she did during those long hours of that day was extraordinary."
        }
      },
      {
        "match_score": 0.5978279,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "070",
          "title": "VP Kamala Harris Speech During Meeting with Religious Leaders Transcript",
          "date": "20210331",
          "topics": "Economy, Social Justice, Government Policy"
        },
        "matched_segment": {
          "segment_id": 21,
          "text": "And then wanted to talk with you about some of the light that we are seeing as an administration. And I, of course, bring you greetings from the president, from President Biden. And we are seeing light that also comes from the work that we have a responsibility to do as elected leaders around, for example, the American Rescue Plan and the $1,400 checks lifting half of America's children out of poverty. We're so excited about that."
        },
        "context": {
          "previous": "And so I wanted to bring you together in this season to, first of all, thank you and by extension all of the leaders and our faith leaders around the country for the work you have done to be part of the strength and the guideposts and the pillars that in this moment of such turbulence, they've been holding up our ability to retain our faith and maintain our sense of hope. So first, I want to thank you for all of that.",
          "next": "The work we are doing to hopefully help people survive through this moment so they can get back up on their feet. So we see light at the end of the tunnel, and in large part because of the vaccinations that are happening, because of the vaccine. And so I want to talk with you about your thoughts, about how we can, and you in particular as our faith-based leaders, can help us to make sure that everyone, when it is their turn, gets a vaccine."
        }
      },
      {
        "match_score": 0.5978279,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "070",
          "title": "VP Kamala Harris Speech During Meeting with Religious Leaders Transcript",
          "date": "20210331",
          "topics": "Economy, Social Justice, Government Policy"
        },
        "matched_segment": {
          "segment_id": 7,
          "text": "And then wanted to talk with you about some of the light that we are seeing as an administration. And I, of course, bring you greetings from the president, from President Biden. And we are seeing light that also comes from the work that we have a responsibility to do as elected leaders around, for example, the American Rescue Plan and the $1,400 checks lifting half of America's children out of poverty. We're so excited about that."
        },
        "context": {
          "previous": "And so I wanted to bring you together in this season to, first of all, thank you and by extension all of the leaders and our faith leaders around the country for the work you have done to be part of the strength and the guideposts and the pillars that in this moment of such turbulence, they've been holding up our ability to retain our faith and maintain our sense of hope. So first, I want to thank you for all of that.",
          "next": "The work we are doing to hopefully help people survive through this moment so they can get back up on their feet. So we see light at the end of the tunnel, and in large part because of the vaccinations that are happening, because of the vaccine. And so I want to talk with you about your thoughts, about how we can, and you in particular as our faith-based leaders, can help us to make sure that everyone, when it is their turn, gets a vaccine."
        }
      }
    ]
  }
}