{
  "query_id": "010",
  "query_text": "I will be a President that will protect our fundamental rights and freedoms including the right of a woman to make decisions about her own body and not have her government tell her what to do. ",
  "query_topics": [
    "Healthcare",
    "Social Justice",
    "Government Policy"
  ],
  "speaker": "Harris",
  "results": {
    "I will be a President that will protect our fundamental rights and freedoms including the right of a woman to make decisions about her own body and not have her government tell her what to do. ": [
      {
        "match_score": 0.75970286,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "112",
          "title": "Harris Rally in Wisconsin",
          "date": "20240923",
          "topics": "Economy, Social Justice, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 26,
          "text": "And when Congress passes the bill to restore reproductive freedom, as President of the United States, I will proudly sign it into law. Proudly. And across our nation, we are witnessing a full-on assault on other hard-fought, hard-won fundamental rights and freedoms like the freedom to vote, the freedom to be safe from gun violence, the freedom to join a union, the freedom to love who you love openly and with pride. () So we know what we are up against. We are clear-eyed about what we are up against."
        },
        "context": {
          "previous": "And she was so proud that she had worked so hard and she was finally gaining independence, that she found an apartment in a safe community. It had a little pool where her son could play. This is one example of what is happening around our country right now. And this is a healthcare crisis. And Donald Trump is the architect. So I will say to you, because of why we are here, we're going to get Tammy re-elected to the United States Senate.",
          "next": "And we remember that generations of Americans before us led the fight for freedom. And now the baton is in our hands. Now it's in our hands. It's in our hands. And so much is on the line in this election. And this is not 2016 or 2020. The stakes are even higher, because remember two months ago, the United States Supreme Court basically told the former President that he will effectively be immune no matter what he does in the White House. But think about that. Think about what that means."
        }
      },
      {
        "match_score": 0.6721225,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "020",
          "title": "Harris and Walz Hold First Rally",
          "date": "20240807",
          "topics": "Economy, Healthcare, Education, Social Justice, Gun Control, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 20,
          "text": "After Roe was overturned, he was the first governor in the country to sign a new law that enshrined reproductive freedom as a fundamental right. And with Tim Walz by my side, when I am President of the United States and we win majorities in the United States Congress, we will pass a bill to restore reproductive freedom, and I will properly sign it into law. (:28) Tim Walz has also defended the sacred freedom to vote."
        },
        "context": {
          "previous": "Think about that. (:55) Well, Tim and I have a message for Trump and others who want to turn back the clock on our fundamental freedoms: we're not going back. We're not going back. We're not going back. We're not going back. We're not going back. We're not going back. And so let me say, about Tim Walz, he has shown up to stand against these attacks long before he stood on the stage with me.",
          "next": "As Governor, he signed the most significant expansion of voting rights in Minnesota in over 50 years. And with Governor Walz's help when I am President, we are going to finally pass the John Lewis Voting Rights Act and the Freedom to Vote Act. We're going to get it done. So Tim is a hunter and a gun owner who believes, as the majority of gun owners do that, we need reasonable gun safety laws in America. So as governor, he expanded background checks and increased penalties for illegal firearm sales."
        }
      },
      {
        "match_score": 0.62870884,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "052",
          "title": "Vice President Harris Speaks at Peace Summit in Ukraine",
          "date": "20240617",
          "topics": "Foreign Policy"
        },
        "matched_segment": {
          "segment_id": 1,
          "text": "On that same day, I addressed the Munich Security Conference and made clear that the United States of America is a steadfast supporter of the principles, that people have a right to choose their own form of government, nations have a right to choose their own alliances. There are inalienable rights governments must protect. The rule of law must be cherished. Sovereignty and territorial integrity of all states must be respected. And national borders should not be changed by force."
        },
        "context": {
          "previous": "Thank you. Thank you, President Amherd and President Zelensky for hosting the summit. It is my honor to be here with all of the leaders today. () I first met President Zelensky in February of 2022, just five days before Russia invaded Ukraine, an outrageous attempt to subjugate a free people and an attempt to wipe a sovereign state off the map.",
          "next": "() As I discussed with President Zelensky earlier today, President Biden and I have made clear over the past three years we are committed to uphold international rules and norms, to defend democratic values and stand up to dictators, and to stand with our allies and partners. This approach has provided for our security and prosperity for generations, and it continues to do so today. This approach makes America strong and it keeps Americans safe, and this approach bolsters global stability."
        }
      }
    ]
  }
}