{
  "query_id": "011",
  "query_text": "And I intend on extending a tax cut for those families of $6,000, which is the largest child tax credit that we have given in a long time. ",
  "query_topics": [
    "Economy",
    "Government Policy"
  ],
  "speaker": "Harris",
  "results": {
    "And I intend on extending a tax cut for those families of $6,000, which is the largest child tax credit that we have given in a long time. ": [
      {
        "match_score": 0.70649856,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "115",
          "title": "Harris Speech in Pittsburgh",
          "date": "20240926",
          "topics": "Economy, Healthcare, Government Policy, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 7,
          "text": "Under my plan, more than 100 million Americans will get a middle-class tax break that includes $6,000 for new parents during the first year of their child's life to help families cover everything from car seats to cribs. We'll also cut the cost of child care and elder care. And finally give all working people access to paid leave, which will help everyone caring for children, caring for aging parents, and that sandwich generation, which is caring for both. () So I have a personal experience with caregiving."
        },
        "context": {
          "previous": "So I made that our top priority for obvious reasons, because if we want the middle class to be the growth engine of our economy, we need to restore basic economic security for middle-class families. To that end, the most practical thing we can do right now, is to cut taxes for middle-class families and individuals. And that's what we'll do.",
          "next": "I remember being there for my mother when she was diagnosed with cancer, cooking meals for her, taking her to her appointments, just trying to make her comfortable, figuring out which clothes were soft enough that they wouldn't irritate her, and telling her stories to try and make her laugh. I know caregiving is about dignity. It really is."
        }
      },
      {
        "match_score": 0.66955143,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "115",
          "title": "Harris Speech in Pittsburgh",
          "date": "20240926",
          "topics": "Economy, Healthcare, Government Policy, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 6,
          "text": "So I made that our top priority for obvious reasons, because if we want the middle class to be the growth engine of our economy, we need to restore basic economic security for middle-class families. To that end, the most practical thing we can do right now, is to cut taxes for middle-class families and individuals. And that's what we'll do."
        },
        "context": {
          "previous": "I believe an active partnership between government and the private sector is one of the most effective ways to fully unlock economic opportunity. And that is what I'll do when I'm president. I will target the major barriers to opportunity and remove them. We will identify common sense solutions to help Americans buy a home, start a business, and build wealth, and we will adopt them. () So let's start then with the first pillar of an opportunity economy, which is lowering costs.",
          "next": "Under my plan, more than 100 million Americans will get a middle-class tax break that includes $6,000 for new parents during the first year of their child's life to help families cover everything from car seats to cribs. We'll also cut the cost of child care and elder care. And finally give all working people access to paid leave, which will help everyone caring for children, caring for aging parents, and that sandwich generation, which is caring for both. () So I have a personal experience with caregiving."
        }
      },
      {
        "match_score": 0.65504086,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "045",
          "title": "Vice President Harris Attends the 28th ESSENCE Festival of Culture Transcript",
          "date": "20220703",
          "topics": "Healthcare, Social Justice, Government Policy"
        },
        "matched_segment": {
          "segment_id": 24,
          "text": "We have extended the child tax credit. And in that, in, so doing in the first year reduced black child poverty by almost 40%, cannot get a Republican to help us extend it beyond. But these are some of the things that we have been doing, understanding the generational impact. Not to mention the work that we need to do that is about foreign policy. I have met with, I don't know, probably at least two dozen foreign leaders, prime ministers, presidents."
        },
        "context": {
          "previous": "And we're very happy that he was the first country I would say. And you're going to see many other things happening in The Middle East over a fairly short period of time. But this is the first time in more than 25 years. And UAE is big stuff. UAE is very powerful, very strong- Speaker 14: () Do you know when the government- Has one of the strongest militaries. It's big stuff. Speaker 14: () Do you know when the delegations are going to meet, specifically? Very soon. I guess they'll be setting up the meetings.",
          "next": "I just recently convened the Caribbean prime ministers and presidents around what we should do as the United States, seeing them as our neighbors in the Western hemisphere and giving appropriate support there. So we have to multitask. Looking at what we need to do domestically, what we need to do to bring down the cost of gas. Don't do that. Don't do that. Please, don't do that. Well, first and foremost, and I don't need to say to you Kiki, because you really do use your voice in such an extraordinary way."
        }
      }
    ]
  }
}