{
  "query_id": "014",
  "query_text": "Donald Trump hand-selected three members of the United States Supreme Court with the intention that they would undo the protections of Roe v. Wade. And they did exactly as he intended. ",
  "query_topics": [
    "Social Justice",
    "Government Policy"
  ],
  "speaker": "Harris",
  "results": {
    "Donald Trump hand-selected three members of the United States Supreme Court with the intention that they would undo the protections of Roe v. Wade. And they did exactly as he intended. ": [
      {
        "match_score": 0.67130077,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "112",
          "title": "Harris Rally in Wisconsin",
          "date": "20240923",
          "topics": "Economy, Social Justice, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 28,
          "text": "So before at least there was some threat of consequence, and now the court has made this decision. Think about that. Just imagine Donald Trump with no guardrails. He who has vowed to be a dictator on day one, he who has called for \"the termination of the Constitution of the United States of America.\" And let us be very clear, someone who suggests we should terminate the Constitution of the United States should never again stand behind the seal of the President of the United States. Never again. Never again."
        },
        "context": {
          "previous": "And we remember that generations of Americans before us led the fight for freedom. And now the baton is in our hands. Now it's in our hands. It's in our hands. And so much is on the line in this election. And this is not 2016 or 2020. The stakes are even higher, because remember two months ago, the United States Supreme Court basically told the former President that he will effectively be immune no matter what he does in the White House. But think about that. Think about what that means.",
          "next": "Never again. () So Wisconsin, it all comes down to this. We are here together because we love our country. We love our country. And we understand the awesome responsibility that comes with the greatest privilege on earth, the privilege and pride of being an American, the privilege and pride of being an American. And I do believe that it is one of the highest forms of patriotism to fight for the ideals of our country and to fight to realize the promise of America. So Madison, election day, yes, in 46 days."
        }
      },
      {
        "match_score": 0.59167814,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "020",
          "title": "Harris and Walz Hold First Rally",
          "date": "20240807",
          "topics": "Economy, Healthcare, Education, Social Justice, Gun Control, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 20,
          "text": "After Roe was overturned, he was the first governor in the country to sign a new law that enshrined reproductive freedom as a fundamental right. And with Tim Walz by my side, when I am President of the United States and we win majorities in the United States Congress, we will pass a bill to restore reproductive freedom, and I will properly sign it into law. (:28) Tim Walz has also defended the sacred freedom to vote."
        },
        "context": {
          "previous": "Think about that. (:55) Well, Tim and I have a message for Trump and others who want to turn back the clock on our fundamental freedoms: we're not going back. We're not going back. We're not going back. We're not going back. We're not going back. We're not going back. And so let me say, about Tim Walz, he has shown up to stand against these attacks long before he stood on the stage with me.",
          "next": "As Governor, he signed the most significant expansion of voting rights in Minnesota in over 50 years. And with Governor Walz's help when I am President, we are going to finally pass the John Lewis Voting Rights Act and the Freedom to Vote Act. We're going to get it done. So Tim is a hunter and a gun owner who believes, as the majority of gun owners do that, we need reasonable gun safety laws in America. So as governor, he expanded background checks and increased penalties for illegal firearm sales."
        }
      },
      {
        "match_score": 0.578127,
        "metadata": {
          "speaker": "Harris",
          "speech_id": "020",
          "title": "Harris and Walz Hold First Rally",
          "date": "20240807",
          "topics": "Economy, Healthcare, Education, Social Justice, Gun Control, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 18,
          "text": "(:47) So Pennsylvania, ours is a fight for the future of the middle class, and it is a fight for freedom. In this moment, we are witnessing a full-on attack against hard fought, hard won freedoms and rights. Take reproductive freedom. Now think about this, Donald Trump said he wants to punish women. And as a result of his actions today in America, one out of three women live in a state with a Trump abortion ban, one out of three. Some of these bans go back to the 1800s, even before women had a right to vote."
        },
        "context": {
          "previous": "As governor, Tim has continued to fight for working families. He secured paid leave for workers in Minnesota and he refused as governor to allow any student in their public schools to go hungry, so he made school breakfast and lunch free for every child. And Tim Walz and I, we agree about many things including when our middle class is strong, America is strong. And strengthening in the middle class will be my defining goal as I am President of the United States.",
          "next": "Think about that. (:55) Well, Tim and I have a message for Trump and others who want to turn back the clock on our fundamental freedoms: we're not going back. We're not going back. We're not going back. We're not going back. We're not going back. We're not going back. And so let me say, about Tim Walz, he has shown up to stand against these attacks long before he stood on the stage with me."
        }
      }
    ]
  }
}