{
  "speech_id": "001",
  "title": "Kamala Harris Speech Transcript April 15: The American Rescue Plan’s Investment in Child Care",
  "date": "20210415",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-speech-transcript-april-15-the-american-rescue-plans-investment-in-child-care",
  "topics": "Economy, Healthcare, Education, Social Justice, Government Policy",
  "num_segments": 17,
  "content": [
    {
      "text": "Thank you, Isabel. What you and your staff have done continues to be acts of heroism, it's heroic. The care you provide makes it possible for parents to work, knowing that their children are safe and that they're loved. It's an incredible gift that you give, so thank you, thank you, and to all the childcare providers. So today we are announcing the single largest investment in childcare in our nation's history, the single largest investment in childcare in our nation's history."
    },
    {
      "text": "This investment is part of the American Rescue Plan, which the president signed into law just over one month ago. And before I talk about this investment, the president has asked me to update you on the implementation of the plan. As you know, it was very important to the president and me that the relief we were delivered would be felt immediately and tangibly by the American people. And under the leadership of Gene Sperling, it is."
    },
    {
      "text": "As of yesterday, 159 million checks have gone out, by the time all of the money is distributed more than 85% of American households will have received a check. At the same time, the $20 billion in funding for vaccine administration and distribution has been put to work. And it's helping us to increase confidence to reach our hardest hit communities and expand access through federally supported community vaccination centers, mass vaccination sites, and mobile vaccination units."
    },
    {
      "text": "We're now administering an average of over three million shots a day, over 20 million shots a week. To safely reopen our nation schools, $81 billion has been sent out to the States to help schools get back to in-person instruction and address the learning, social and emotional needs of our students. And there are millions of Americans who lost their jobs, due to no fault of their own, and are receiving unemployment insurance through programs that would not exist without the American Rescue Plan."
    },
    {
      "text": "The American Rescue Plan is also making healthcare more affordable by reducing the cost of coverage for nine million people who are currently receiving financial assistance. At the Department of Housing and Urban Development Secretary Marcia Fudge announced that nearly $5 billion has been allocated to provide services to people who are experiencing or are at risk of homelessness, and to help communities create more permanent affordable housing solutions."
    },
    {
      "text": "The Department of Agriculture has been using funds to help 12 million families with children who are food insecure, reimbursing families who are now buying food that their children would have received in school. The list goes on and the message is clear, help is here. Hope is here. And we've already seen what happens when you help those who are hurting the most, when you build an economy from the bottom up and the middle out."
    },
    {
      "text": "We have created more new jobs in these first two months than any administration in history and things are looking up, to be sure, but we also have a lot more work to do. We need to defeat this virus, get American workers back on the job and lift up American families. And so that brings me to today's announcement, because when it comes to childcare in country, families need help. Even before the pandemic, childcare cost too much, and it was too hard to find, and for too many families, outside of their reach."
    },
    {
      "text": "The pandemic has accelerated the flaws and the fissures in our systems, nearly half of parents say their current childcare situation is unsustainable. For providers, childcare costs are up with new expenses like PPE, more cleaning supplies and everything else that providers need to keep children safe. At the same time, revenues are down with fewer kids enrolled. These are small businesses and nonprofits with thin margins to begin with."
    },
    {
      "text": "According to one survey, one in four childcare centers that was open at the start of the pandemic is now closed. When childcare centers go out of business, four things happen. One, a small business owner, most likely a woman, loses everything. Two, childcare workers, again, most likely women, women of color, they lose their jobs. There are 164,000 fewer childcare jobs now than there were last year. Number three, without consistent affordable childcare, parents, mostly mothers, are not able to go back to work."
    },
    {
      "text": "In fact, about two million women have been forced to leave the workforce many due to childcare challenges. And number four, children lose the safe, nurturing learning environment that they need to grow. The strength of our country, the resilience of our economy depends on the affordability and availability of childcare. Today, we are enrolling $39 billion and announcing $39 billion that will go to States and Tribes and Territories."
    },
    {
      "text": "These funds will help childcare centers and family childcare providers to reopen or stay open by helping to cover rent or mortgage payments, utility and insurance payments. They will help providers as they take the steps needed to provide safe and healthy learning environments, including purchasing masks, improving ventilation, and making other changes that allow for physical distancing. These funds will also help providers keep people on the payroll or rehire those who have been laid off."
    },
    {
      "text": "All told, with these funds States can help hundreds of thousands of providers serving more than five million children. The American Rescue Plan is also making childcare more affordable for families in two big ways. It gives States enough funding to provide over 800,000 families with subsidies to pay for childcare."
    },
    {
      "text": "And it dramatically expands the Child and Dependent Care tax credit, which allows families to get back as much as a tax credit for as much as half of their spending on childcare for children under the age of 13. So if your family is making less than $125,000 a year, and you pay $8,000 a year for childcare for one child, you can get $4,000 off of your taxes. Families who don't owe a lot in taxes will still get the full benefit. And families who make more than $125,000 a year can still receive a partial credit."
    },
    {
      "text": "Again, this is a dramatic expansion and a significant help for more than seven million families. We will be releasing information soon on how parents can claim this tax credit for next year. Taken together, this historic investment will give childcare providers a chance. It will give childcare providers and workers a lifeline, and it will give parents peace of mind. So you may know my mother was a breast cancer researcher. In fact, she had two goals in her life to raise her two daughters and end breast cancer."
    },
    {
      "text": "And every weekday, and on many weekends, my mother went to work in the lab. And when she did, my sister and I would walk two houses down to the home of Mrs. Regina Shelton, who became a second mother to us and who also ran a childcare center. Without the care Mrs. Shelton provided, my mother would not have been able to go to work. Without the care that Mrs. Shelton provided, my mother would not have been able to make the contributions that she did in the effort to find a cure for breast cancer."
    },
    {
      "text": "And I tell you this to make probably an obvious point, for many, many people and many women in particular, childcare has often been the prerequisite for their ability to work, and for many others, childcare is their work. And that's why in America, childcare should be readily available and affordable for all those who need it. Childcare workers should be paid fairly and treated with dignity and respect. And small business owners who run childcare centers must be fully supported."
    },
    {
      "text": "We have a lot of work to do, we have a lot of challenges ahead. By putting the American Rescue Plan to work, by making sure the American people can feel its benefits, we are earning their trust. We are showing them that we can vaccinate our nation, that we can get our kids safely back in school, that we can get our small businesses safely back open. We are giving the people of our nation help with checks, with lower healthcare costs, with childcare assistance and so much more. We are giving America hope."
    }
  ]
}