{
  "speech_id": "004",
  "title": "Joe Biden & Kamala Harris Earth Day Speech Transcript: Leaders Summit on Climate Session 1",
  "date": "20210422",
  "url": "https://www.rev.com/blog/transcripts/joe-biden-kamala-harris-earth-day-speech-transcript-leaders-summit-on-climate-session-1",
  "topics": "Climate, Economy, Social Justice, Technology",
  "num_segments": 6,
  "content": [
    {
      "text": "Your excellencies, distinguished leaders, and esteemed colleagues from around the world, welcome to this historic Leaders Summit on Climate. I want to thank you for being here, and for your leadership. I have spoken with a number of you about the climate crisis. We have talked about the scarcity of water, we have talked about the need to build resilience, and we have talked about the importance of investing in clean technologies."
    },
    {
      "text": "Together, of course, we come from very different places, but we share this common concern and this common threat. Here in the United States, the storms hitting our Gulf Coast are worse every year. The wildfires in my home state of California have grown in intensity. And of course, no nation or region is immune."
    },
    {
      "text": "Whether it is Western Europe, where heatwaves have made it very difficult to stay indoors while risking a health risk, or the Pacific Islands, where rising sea levels threaten to encroach on the land and homes of lifelong residents, or in Central America, where last year, two major hurricanes devastated entire communities. As a global community, it is imperative that we act quickly and together to confront this crisis, and this will require innovation and collaboration around the world."
    },
    {
      "text": "It will require the use of renewable energy and new technologies, and it will give each of our nations the opportunity to build healthier communities and stronger economies. Here, we believe tackling climate change, improving communities, and creating jobs can occur simultaneously, and we must recognize the importance of course, of justice, in the work that we do."
    },
    {
      "text": "The communities hardest hit by climate change are the same communities harmed by wealth and gender inequality, toxic air pollution, and so much more. This truth holds around the world. So I urge all of us to focus on these communities, including Indigenous communities, and consider their insight and experience in our efforts moving forward. They are critical leaders in this fight."
    },
    {
      "text": "Friends, the health of our communities, the well-being of our workers, and the strength of our economies depend on what we do now, and I can think of no one more committed to achieving our collective goals, than President Joe Biden. The president was one of the first members in the United States Congress to take the issue of climate change, and on our first day in office, he led the fact that we would rejoin the Paris Agreement."
    }
  ]
}