{
  "speech_id": "005",
  "title": "Vice President Harris and President Yoon Deliver Remarks to the Press Transcript",
  "date": "20230426",
  "url": "https://www.rev.com/blog/transcripts/vice-president-harris-and-president-yoon-deliver-remarks-to-the-press-transcript",
  "topics": "Foreign Policy, Climate, Technology",
  "num_segments": 11,
  "content": [
    {
      "text": "Good afternoon. NASA Deputy Administrator, Pam Melroy. Thank you for welcoming us once again and hosting us. Astronaut Johnny Kim who was here earlier. Johnny, I want to thank you and all of the Korean-American NASA experts and all of the experts who work here for the work you do every day. ()\nPresident Yoon, welcome to the United States. It is good to see you again."
    },
    {
      "text": "I thank you for the warm welcome you showed me when I was in Seoul, and I welcome you on behalf of the United States to Goddard, a place of great pride for us as Americans, and the work that is happening here through NASA is always awe-inspiring for me. And I hope you have enjoyed the tour we've had today. ()\nDuring my visit to Seoul, as well as the state visit, you and I and the president, our countries are demonstrating the expansive agenda between our two nations."
    },
    {
      "text": "And we are demonstrating yet once again that our alliance is truly a global one. Our alliance is leading on some of the most important and pressing issues of our time. In Seoul, you and I spoke, for example, about our collective defense in the face of aggression and provocation in the region. We spoke about standing up for the international rules-based order, and we strategized on our work together to address the climate crisis, economic security, and advanced technologies for our two nations."
    },
    {
      "text": "And we consulted, of course, on our cooperation in space, which you and I are both quite enthusiastic about. ()\nThis year, we celebrate the 70th anniversary of the alliance between the United States and South Korea, which has been a linchpin of security and prosperity in the Indo-Pacific and around the world. As part of this state visit, our administration looks forward to strengthening our alliance."
    },
    {
      "text": "And so today, we focus on one component of our alliance, in particular, space, understanding the connection to our shared priorities on the issues of security and prosperity for our nations. ()\nIn our last meeting together, Mr. President, we agreed that we would strengthen our partnership on space. And to that end, earlier today, our governments signed a joint statement to strengthen that cooperation. With regard to this afternoon, here at Goddard, we discussed our cooperation on the issue of space exploration."
    },
    {
      "text": "Notably, last year, South Korea placed a satellite in lunar orbit that carries a high resolution camera from NASA and will continue to work to search for water on the moon. South Korea will soon fly payloads through NASA's Commercial Lunar Payload Services program. I like to think of it as our version of a ride-share program for space exploration."
    },
    {
      "text": "And in the future, we look forward to expanding our collaboration on the Artemis program, which will return astronauts to the moon for the first time in 50 years and lay the groundwork for our mission to Mars. ()\nWith regard to the climate crisis, we agree the climate crisis poses an existential threat to our world. And to meet this threat, we must partner together to use satellite technology to monitor the impacts of that crisis on earth."
    },
    {
      "text": "As one example, together, our nations have built and placed satellites in orbit that can track air pollution in North America and Asia. Today, I have also directed the National Space Council, which I lead, to expand this network to ensure that it also covers the Southern Hemisphere, specifically the continent of Africa and South America. This cannot be a global initiative if any nations around the world are excluded."
    },
    {
      "text": "President Yoon, as you establish a national space agency, we look forward to continuing our priority on this very important issue of addressing the climate crisis. ()\nAnd finally, regarding our work on space, our two nations are also working to establish international rules and norms for the peaceful and responsible use of space."
    },
    {
      "text": "One year ago, I issued a challenge to all nations to join our commitment that I made on behalf of the United States to not conduct destructive, direct ascent, anti-satellite missile testing. You and I discussed this topic during our meeting last year in Seoul, and following that, you joined our commitment. In fact, I am pleased to report that thus far, 155 nations have supported this effort at the United Nations."
    },
    {
      "text": "()\nWe are also grateful for South Korea's signing of the Artemis Accords, which will help create a safe and transparent environment for the civil use of space. So I'll conclude by saying again, we renew our commitment to strengthen our cooperation in the next frontier of our expanding alliance. And of course, that is space. Space presents undiscovered and unrealized opportunity for our nations and for the entire world."
    }
  ]
}