{
  "speech_id": "008",
  "title": "Vice President Harris Reflects on a Historic Trip to the Continent of Africa Transcript",
  "date": "20230406",
  "url": "https://www.rev.com/blog/transcripts/vice-president-harris-reflects-on-a-historic-trip-to-the-continent-of-africa-transcript",
  "topics": "Foreign Policy, Social Justice",
  "num_segments": 44,
  "content": [
    {
      "text": "Good afternoon everybody. Good afternoon. I know. The last time I saw you was in Ghana. Just a few days ago, practically. Yeah. Yeah. Okay. So first of all, let me thank both of you for being such a big part of the trip. I hope we can cover in this short time we all have together the layers of what that trip was and the nuances. That being said, so as Vice President of the United States, I have now traveled to many places around the world in my capacity as Vice President."
    },
    {
      "text": "I have, at this point, met with over 100 world leaders, be they presidents, prime ministers, chancellors or kings. ()\nAnd in these meetings and in these travels, it is always with a sense of the responsibility that we have as the United States of America to be present, to be engaged with our allies, with our partners, with people with whom we have great interdependence and intersection in so many ways. And so I have traveled all over the world, practically."
    },
    {
      "text": "And this trip to the continent of Africa was very much in line with that approach, but with an incredible sense of optimism about what is happening on the continent. The median age on the continent of Africa is 19. ()\nBy 2050, one in four people occupying space on Mother Earth will be on the continent of Africa."
    },
    {
      "text": "Think about what that means in terms of the opportunity, in terms of the future, in terms of the obvious fact, I believe, as evidenced by the demographics I've just shared, which is that what happens on that continent will impact the entire globe. Not to mention what is the intertwined history that we have and share with the continent. Not to mention the history and present innovation and ingenuity that is on that continent."
    },
    {
      "text": "Not to mention what that continent has done to inform culture in so many ways around the globe. Not to mention the connection in terms of the diaspora and what that means in terms of the untapped yet I think in terms of maximized power of the diaspora to participate in this partnership we have. ()\nAnd so all of that was the motivation for the trip."
    },
    {
      "text": "And as captured in the speech I gave, our second full day there in Ghana, and I wrote and delivered that speech with a very clear intention, which is to highlight the innovation and the excitement and the opportunity and the momentum that is happening there and what should be our engagement for so many, I think at this point, obvious reasons."
    },
    {
      "text": "And it was also in follow up to the US-Africa Leaders Summit that we hosted here in December of last year, where our President, Joe Biden, made clear and said from a podium, the United States is all in on Africa. ()\nAnd so it was my intention to reinforce that point and to explain what that means, all in. All in as a partner. Not to go in with a sense of like this is about our benevolence. No, this is about a partnership with the continent and its leaders, tapping into all that is there."
    },
    {
      "text": "So the speech I gave, as you know, was at the Black Star, at the monument where independence is honored and it's about freedom and justice. And the speech was then, the emphasis was on the excitement that we feel, and then to also talk about, in particular, then what we can do to uplift a couple of specific areas of focus for me in terms of the trip and going forward."
    },
    {
      "text": "()\nAnd so one is the importance of digital inclusion, because let's be clear, 21st century economies require digital inclusion for the economic empowerment of anyone and all people. And it was about also, again, in my role as Vice President, being there to uplift the importance of good governance and democracy. And so I had bilateral meetings, which are just one-on-one meetings, with the three presidents of the three countries."
    },
    {
      "text": "So raising that it is important when we're looking at in particular private investment and US private investment on the continent, that there's going to be certain priorities that include, we're going to want to know that there's freedom of the press, that rule of law, human rights, that these will be issues for Americans in terms of shareholders or consumers to know that we are engaged in a way that there are certain shared priorities in terms of those goals."
    },
    {
      "text": "So these were the areas of focus for the trip as captured in the second day that we were there with the speech that I gave Black Star Monument. Speaker 1 In many ways, I'm still processing it. It's one thing to read about it and learn history as most of us have since the day we were born, and then to be at that site, which is one, sadly, of many such sites."
    },
    {
      "text": "And the tour guide, I don't want to call him a tour guide, he was a historian, taking us through the various dungeons, the section for men, the section for women, the section for the troublemakers, where pregnant women were kept because they had been raped. The details of the fact that women were being raped by their captors and then the baby taken away on the day she gave birth so she could be sold, the mother. And then if the baby lived, would be put to work in that very place."
    },
    {
      "text": "It's like this monument to all that we are discussing today. There is something about being in a physical space that if you have learned about what it represents, you feel what it represents. And that's how it felt. It's a place of horror, it's a place of horror. ()\nBecause let's remember, first of all, people were kidnapped from their homes and taken for miles, hundreds of miles to this place. They didn't know where they were headed."
    },
    {
      "text": "Untold numbers died on that voyage then to be put in dungeons where there's a hole toward the ceiling where the light could come, but also depending on whether there was a pathway behind it is where the guards would watch. And from time to time they might give water, and the water, it was so little that he described about how these people who had been kidnapped, these victims of a horrible crime would try to survive, including drinking the water off of somebody else's hair."
    },
    {
      "text": "()\nAnd you see this place, and it's horrendous, it's horrendous. We had press with us on the trip, and after, I'd spoke to the press and I had some prepared comments. And I looked down at the prepared comments and I was like, \"I'm not doing that.\" And I just said what I felt. And it was about, yes, in the midst of so-called leaders who are trying to erase history in our country, what we must all do to stand up and speak out about this as loud as we can."
    },
    {
      "text": "It's not just about forget, they're trying to erase history. Let's understand what this means. And there are historical precedents for this kind of approach and what it means and what could come next. So there was that piece of it, in terms of my comments that day. There was also the piece of it that I spoke of that was about, well, we are not going to be defeated and we weren't defeated."
    },
    {
      "text": "()\nAnd out of that incredible pain and those crimes, the survivors and the descendants, carrying traditions and culture and faith, and a memory of family, endured generation after generation, and in this country included the freedom fighters who fought for civil rights and all of those who benefited across the board, whether their ancestors were at that slave, I don't even calling it a castle by the way."
    },
    {
      "text": "And what we should do then to also celebrate the strength of our people to come through that and go on to be astronauts. I just spoke yesterday with Astronaut Glover. Do you guys know who he is? He's about to go on the Artemis II mission to circle the Moon. I just talked to him yesterday. ()\nAnd so the scientists and the astronauts and the mathematicians and all of the people. Speaker 1 And the Vice President of the United States. Right."
    },
    {
      "text": "And so I felt it important at that moment there to bring up all these points, the importance of teaching history, the importance of speaking it, the importance of speaking out against those crimes against humanity. And then to also remember how we must celebrate the endurance and the strength of the will to survive and thrive. So there you are. Yeah. Speaker 1 Yes. Speaker 1 Yeah. Speaker 1 She's the only woman on the continent to lead a country."
    },
    {
      "text": "And before her, Ellen Johnson, who was the first and the last elected woman to lead a country on the continent. So there is still work to be done there and here, obviously. But for example, we convened these women entrepreneurs who are just phenomenal and doing all this extraordinary work. I'm sure there was a picture up here somewhere of that meeting. We're doing all this extraordinary work. One of the women is finding ways that is about sustainable agriculture and smart agriculture."
    },
    {
      "text": "She's, I think, the major producer of mushrooms, So each of these three countries is really focusing on the issue of good governance and democracy. For example, Zambia, the president there came into office through a democratic process where young people turned out in record numbers to vote. And he is doing a lot to address what he needs to do around good governance. And so each of them has a commitment to that. And I wanted to highlight that."
    },
    {
      "text": "A lot of the method to the approach for this trip and for the work going forward, is about public private partnership. And in order for that to make sense and work for all the partners, there has to be an infrastructure that is about rule of law, that is about good governance, that is about an explicit intention to fight corruption, because otherwise the economic investment that these countries want just can't happen because it doesn't make business sense for those who would invest."
    },
    {
      "text": "()\nAnd so talking with them about these issues and highlighting what's happening on the continent is important. And it's also important because I think there are a lot of stereotypes about what's happening on the continent, and who are African leaders and how do they lead. And so to bring whatever capacity I have to bear on highlighting the work that is happening that is about working toward democratic reforms was important."
    },
    {
      "text": "So there's a backstory to it, which partly is that early in our administration, I had a focus on what was happening around the northern part of Central America. Honduras, Guatemala, El Salvador. Because of the irregular migration that we were seeing. And we created a public-private partnership, that we ended up getting commitments over $4.2 billion for those three countries in that region. And as a result of that work, thank you."
    },
    {
      "text": "And so as a result of that work, already we have four million people online, that had not been, one million people in the banking system, that had not been. So I knew it works because we tried it and it worked. So it was always my intention, let's take that to the continent of Africa. So I literally got on the phone and called a bunch of the partners there and then more and said, \"Hey, we're going to take this approach."
    },
    {
      "text": "We have a model that's worked.\" Many of them knew about it, if they hadn't been a part of it, and 2:01 they said, \"Count us in.\"\n()\nSo Microsoft, HP, Cisco, MasterCard, Visa, Ford Foundation, MacArthur Foundation, Melinda Gates, all said yes. And so through this, we then pulled together $8 billion. Seven billion, which is focused on climate, so that's resilience, adaptation, all that we need to do there. And one billion on the women's inclusion piece. And it is not only US investment."
    },
    {
      "text": "African private sector leaders are a part of this. Because let's be clear also, there are very successful private sector leaders on the continent who have already been doing the work and we are partnering them with them on this engagement. And so it culminated in a convening where I had 30 of them represented at a meeting that we did the last day that we were on the continent in Lusaka. ()\nAnd we had a two-hour meeting where we talked about a number of things."
    },
    {
      "text": "We talked about the importance of digital inclusion, but let's make sure that we are making it accessible and affordable. Let us talk about human rights and continue to make that a point of emphasis because it is critical if we are talking about equitable outcomes, and making sure no one is left outside or left behind, much less suppressed. We talked about the importance of metrics in terms of our analysis of our effectiveness."
    },
    {
      "text": "So for example, back on the piece about women, that it is important that we understand this is not only about inclusion of women, it's also about leadership. Because we can let all the women in the room, if you just want to go with a metaphor of a room and who's not in, you can let everybody in, but then and other people are leading? Let's make sure that we're also focused on women as leaders and cultivating their leadership. ()\nSo these are the kinds of things that came out of that."
    },
    {
      "text": "And $8 billion already committed to this approach. And it's very exciting because the exponential benefit of that is going to be much bigger than that eight billion. And that's just so far what we've got. Yeah. Okay. Speaker 2 That's how it started. Speaker 2 And then I don't know whether it's how it's going, but well here we are. Speaker 2 Oh, there it is."
    },
    {
      "text": "Speaker 2 The president of Zambia greeted me and said, \"Welcome home.\" And so my grandfather, my mother's father, went to Zambia, and he and my grandmother and my aunt actually lived in Lusaka because out of solidarity with the independence movement, But my grandfather, those independence movements, that was my connection to it in many ways, in terms of a personal connection. And he would always talk about the importance of fighting for freedom. He would talk about the importance of an independent people."
    },
    {
      "text": "Because of course, when we're talking about these fights against colonization, there was a through line: the importance of the people running, and the people ruling and governing for themselves, the importance of fighting against corruption. So I used to talk a lot with my grandfather from my earliest days, where I think I understood a little bit of it, and then as I got older, understood a lot of it. ()\nAnd so to go back there, and then we found the plot where they lived."
    },
    {
      "text": "It's now been a new building is there. But also my aunt worked with... She's a OB/GYN, and she worked at the hospital down the street delivering babies. It was then called Lusaka Hospital something. It's now changed its name: it's a teaching hospital now. So I called my aunt to ask her, and she said, \"Well, you should check, because one of my best friends lived down the street, and he and I would walk to the hospital together, and we then did a bunch of stuff over their careers.\" So I asked her his name."
    },
    {
      "text": "It turned out he ended up being the minister of health for Zambia later, and was responsible for reform of the healthcare system. So when we went to Lusaka, my team found his daughter, and I met with her. And it was just the most special thing. And so we talked, and she's actually writing a book about her father, and his significance to the independence and present-day Zambia, on the healthcare system piece of it."
    },
    {
      "text": "So there were so many pieces of that trip that were about everything from a bilateral meeting with the president, to talk about security issues and democracy. And we talked about, for example, in another big issue affecting a lot of African countries, which is debt, and how we must address that and be aligned. And by the way we stand, we've been very clear in the IMF, and everywhere else, that there should be bilateral participation in terms of restructuring the debt issues that a lot of these countries face."
    },
    {
      "text": "But it was everything from that to meeting the daughter of a colleague of my aunt's and what that meant for, I think, she and I, in terms of just full circle how things work out sometimes. Speaker 3 Yeah. Well, I was obviously very honored and humbled about what it meant. And it was such a wonderful trip for all the reasons we have discussed, and more. But here's my takeaway, and it's where I started: I am extremely excited, not just optimistic, excited about this future."
    },
    {
      "text": "I encourage everyone to really make sure you understand. And I don't mean any you, you, you; but just we understand what's happening on that continent. It is so exciting. ()\nFor example, there is right now technology that originated on the continent, that they've used drones and drone technology to deliver critical medical supplies in a fraction of the time it otherwise was taking."
    },
    {
      "text": "And that technology that was created on the continent is being replicated by different countries on the continent, and right here in the United States. Technology that was created there is being used here. Not to mention, if you look at the range, Afrobeats. I hope y'all have seen my Spotify list. Because we didn't even talk about that: we went to a studio. It's called Vibrate Studio, and these, I mean talented incred-... There it is. ()\nAnd there's Cheryl and Idris, and we were all hanging out. And that's it."
    },
    {
      "text": "And then you go in, and that's the woman who actually runs it, and it's a studio. And so what she's done is created... So it's also a community center, and it's also a skate park. So it's actually skateboarding is there too. And she's created this community center, and obviously so much about technology helps people. You can go on YouTube and learn how to play an instrument."
    },
    {
      "text": "()\nAnd so my feeling about the trip was, whatever we were able to do with us all being there together, because we were all there together, to highlight, and maybe for some who didn't know now you know, what is happening on that continent, and reordering and repositioning, or at least thinking about the next era in this relationship."
    },
    {
      "text": "And it is about a relationship that is based on the optimism and the excitement that we should all have, about what is happening there, how it will affect us here, but also based on the intertwined history, based on the demographics I mentioned at the beginning, why we must think of it as an imperative to engage as partners in investing in the future of the globe, and doing that by understanding the connection to that and the continent of Africa. I want to encourage us all, like I said, to just keep..."
    },
    {
      "text": "I mean the diaspora is phenomenal. One of the things that we have done also, coming out of the US Africa Leaders Summit... And you hosted us here for so much of that, where I stood on this very stage with the president of Ghana, for the YALI meeting that we had: the Young African Leaders Initiative."
    },
    {
      "text": "()\nSo let us continue to use our voices, in the context of the diaspora, in the context of having any concerns about the role of the United States of America in terms of our own, much less global, security and prosperity. Let us have an interest in uplifting it, if we had any level of excitement at all about the future, and what that could look like based on what we do right now."
    },
    {
      "text": "That's what I would ask that we all take away from this moment, and from our level of interest and exploration about all of these, in terms of the potential. It is great, and I'm very excited, and so we're just going to keep doing this work every day. I had a bunch of meetings today about what we're doing by way of follow up, and I'm very excited about it. And thank you for hosting us again for this conversation."
    }
  ]
}