{
  "speech_id": "009",
  "speaker": "Harris",
  "title": "VP Harris Roundtable for Student Debt Relief in Philadelphia",
  "date": "20240409",
  "url": "https://www.rev.com/blog/transcripts/vp-harris-roundtable-for-student-debt-relief-in-philadelphia",
  "topics": "Education, Healthcare, Social Justice",
  "num_segments": 23,
  "content": [
    {
      "text": "That was so good. Okay, we're ready. Okay, we're going to get started. Let me start by thanking the leaders of William Cramp Elementary School. I was just saying to the leaders at this table that it's such a joy to walk around a school where there is clearly so much love and dedication that the school workers, the administrators, the teachers, the folks who work here are giving to the children of our country."
    },
    {
      "text": "So I want to thank everybody, and in their absence, all of the teachers and those workers at this school, for what you do every day for the children of America. Representative Dwight Evans, it is wonderful to be with you as always. I know you from your work in Congress and I know you from your work here in this beautiful state, and you have been a very important advisor and friend to the president and me. () So thank you."
    },
    {
      "text": "So this is intended to be a discussion about student loan debt, but really it is, from my perspective, a discussion about who are our public servants and what we as a society and as a country owe them for the gift that they possess and then give to so many people, often without the praise on a daily basis that they deserve, but their value to the strength of our country, their value to our well-being is immeasurable. () And who are our public servants?"
    },
    {
      "text": "They are teachers, they are nurses, they're firefighters, they're police officers, they're librarians, they're bus drivers, and social workers. They are people who have dedicated themselves to serving the public, often serving on behalf of people that they otherwise had never met and would otherwise have no obligation to other than the fact that they care and they understand the strength and the importance of lifting up other people and by extension, all of us."
    },
    {
      "text": "() Our public servants then do some of the most noble and selfless work that anyone can do. I think about our teachers, our teachers who have the calling to teach other people's children and to do that work often without the resources they need. Most of the teachers, public school teachers I have met over the years come out of their own pocket to help pay for school supplies. We don't pay our teachers nearly what they deserve in terms of the value that they give to society as a whole."
    },
    {
      "text": "And I will say that also as a proud public school, former public school student. My first grade teacher, Mrs. Frances Wilson, God rest her, attended my law school graduation, wouldn't be here except for the strength of our teachers. And, of course, the family in which I was raised. () School nurses, nurses office. Many of us had the good fortune of attending schools where there was a school nurse."
    },
    {
      "text": "But sadly, we have not supported our nurses enough so that we can have enough of them in the pipeline to serve all of the schools that need a school nurse. But our school nurses are, they are leaders. They are known by the students. They are known as the people who care for the students. Often, the nurse's office is an oasis of comfort and sanctity for so many students."
    },
    {
      "text": "Our social workers who help children in foster care, children who have, through no fault of their own, been in circumstances where they need the support and they need the encouragement of a social worker to help them know that they are special and important. This is who our public servants are, and yet many are silently struggling with student loan debt."
    },
    {
      "text": "() God knows we don't pay them enough in the first place, but so many of them nonetheless, will choose to stay in these important roles because it is a calling for them. Whereas they could potentially opt into a different profession with their skills that would pay them more, but they stay where they are because they care."
    },
    {
      "text": "And we as a society and a country should reciprocate that care by alleviating the burden that so many of them are caring with this enormous debt that prevents them from being able to get through the month stress-free, prevents them, in many cases, from being able to buy a home or even start a family."
    },
    {
      "text": "And so the work that President Biden and I have been doing throughout the last three years has been to address one of the big issues facing not only our public servants, but many people who carry student loan debt, which is, what can we do to relieve some of the burden? () Because we do believe not only for public service, but most people should not have to carry this kind of worry. And so far then we have forgiven, on average, $70,000 of student loan debt for over 850,000 public servants."
    },
    {
      "text": "And for folks in general, we have forgiven over $144 billion for over four million people. And that means, of course, for those individuals who have received this for forgiveness, that's more money in their pocket to pay for things like child care, more money in their pocket to get through the month in terms of rent or mortgage."
    },
    {
      "text": "And so today then building on the work that we've done thus far, I'm announcing a new plan to forgive more loans for 25 million more Americans, including millions of our public servants. And that means, for example, if you've paid undergrad loans for 20-plus years or graduate loans for 25 or more years, your loans will be completely forgiven regardless of your income and even if you did not graduate. () So I'm going to repeat that."
    },
    {
      "text": "If you've paid undergraduate loans for more than 20 years or graduate loans for more than 25 years, those loans will be completely forgiven regardless of your income and even if you did not graduate. And forgiveness will be automatic for the vast majority of the 25 million people that we believe will benefit from this approach. And to see if you could be eligible, I would urge everyone to go to studentaid.gov. That's studentaid.gov. And I'll close with this."
    },
    {
      "text": "() The president and I continue to do and will do much more to build on this work. Again, understanding that we want to create incentives for people to acquire the kinds of skills, like the professionals at this table, to do the work that they do that benefits so many others and benefits all of us as a nation."
    },
    {
      "text": "And so I thank the leaders who are at this table for being willing to tell your stories in a way that I think will inspire others to apply for the forgiveness and to do the work that we know can be done to honor our public servants and so many others. And with that, I'm going to turn it over to Tonya Pendleton to moderate our conversation."
    },
    {
      "text": "Well, and also it is a very difficult thing to lose a parent, or anyone that you love, but what a parent will worry most about is if their children will be okay so that they can go in peace. And you also had that experience. Just as a person who experiences that kind of thing, in addition to what you do as a professional, I'm sure that that was an added weight that was lifted from you, to let your father know that you were going to be okay. Yeah."
    },
    {
      "text": "Well, let me just say that I cannot thank each of you enough for the life that you have decided to live. And you have answered a calling. Each one of you has answered a calling to serve in an extraordinary way. When I think about the story that each of you have shared, and it's important that people understand this, that when we are looking at something like forgiving student loan debt for public servants, this is who we're talking about."
    },
    {
      "text": "We're talking about teachers who, Tanya described her workplace as her home because that's the kind of person that you are and that our teachers are, that you give of yourself as though the children that you are teaching are your own children. Speaker 2 Right. And she said, \"They are.\" Beth, what you have done and to continue to go to school, deciding and making a conscious decision, you wanted to be a public health nurse."
    },
    {
      "text": "There are many places you could have gone, and we know we have a shortage, sadly, of nurses in our country, and you could have been paid much more. But you wanted to be a public health nurse and serve in our public schools and take care of our children, the children of the community with the debt you were carrying. I mean, Kelly, the story of somebody who is caring for... We talk about the least of these, the children who have been abused and neglected."
    },
    {
      "text": "And this is what you have decided to do with your life for 20 years carrying over $300,000 of debt. What Kelly did not share, because I had the honor of meeting her daughter, is Kelly's daughter graduated Spelman College as class president. Speaker 2 But was carrying this debt. And so it's important in this conversation that folks understand when President Joe Biden and I and our administration decided to do this, it really was, yes, about the individuals who are here."
    },
    {
      "text": "But I have to keep emphasizing, everyone is benefiting because of the work that you each do. And we want you to stay in these jobs doing this work. We need you to stay in these jobs doing this work, and you shouldn't have to make a decision about whether you serve or be able to pay your bills. And that's part of the spirit behind the work that we are doing. It's because we know who you are and we applaud you. We thank you in every way possible. Yeah, that's right. It is. Thank you Congressman."
    },
    {
      "text": "Well, again, I want to thank everybody, and please just keep doing what you are doing. Please keep doing what you're doing and just know that your country needs you and that we are benefiting in profound ways because of the sacrifice and the work that you all do every day. It really is the most noble work anybody can do, and thank you. Thank you. Speaker 2 Thank you."
    }
  ]
}