{
  "speech_id": "010",
  "title": "Kamala Harris Affordable Care Act, Healthcare Speech Transcript August 10",
  "date": "20210810",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-affordable-care-act-healthcare-speech-transcript-august-10",
  "topics": "Healthcare, Government Policy",
  "num_segments": 20,
  "content": [
    {
      "text": "Good morning. Good morning. Good morning. Laura, thank you for that. And where's Olivia? Congratulations. Congratulations. How about that? And give your brother Simon my best, okay? Thank him for his courage. So thank you all. It's so wonderful to be here, and thank you for telling your story and sharing your story. I know it takes a lot out of you, but your story is sadly a common story, which is how families struggle, but also the strength that families show in the midst of that struggle that inspires so many others."
    },
    {
      "text": "So thank you for your inspiration. Vincent Keane, Dr. Jessica Henderson Boyd, thank you for all that you do and thank you for welcoming us this morning. And on this National Health Center Week, let me thank all of the healthcare workers, the technicians, the administrators, the custodians, nurses, and doctors who keep our community health centers running and keep our community health centers as part of the fabric and the trusted centers of leadership in our communities."
    },
    {
      "text": "It's so good to be here, and it's wonderful to be with you because there is so much to talk about that is based on the work that you all do every day. And we're talking about healthcare, an issue that is as personal as it is important. President Joe Biden and I believe that healthcare for that reason must be a right, not a privilege, a right, to which all people are entitled. We also believe that health care in the form of health insurance must be affordable for all Americans."
    },
    {
      "text": "Affordable health insurance gives people the opportunity to determine their own future. And I believe strongly in this concept of self-determination, the importance of allowing the ability to have control of their own lives, to make the decisions that are relevant to themselves and their families. And on this issue of affordable health insurance, this is one of those points. When people have affordable health insurance, they have the opportunity to make decisions about their life, they have options."
    },
    {
      "text": "But without affordable health insurance, those options are limited and life can then be daunting. Let's think about the parent sitting in a hospital parking lot with their sick child, terrified as she or he is sitting in the car, the child is in the back seat, they're in the parking lot looking at those sliding glass doors of the emergency room, pausing because they know if they walk into those sliding glass doors and walk into that emergency room without health insurance, they may be out as much as $4,000."
    },
    {
      "text": "So they're there with a sick child having to make a decision about literally whether they can afford to keep their home or be homeless or get their child the medical help that child needs. That's just not right, that's just not right and nobody should have to go through that. And that is why the Affordable Care Act is so important. More than 30 million people have health insurance coverage because of the Affordable Care Act, they called it Obamacare also, 30 million people."
    },
    {
      "text": "More people today are covered through the Affordable Care Act than ever before, and President Joe Biden and I, are purposely and intentionally building on its success to further bring down healthcare costs. In February, we made the decision to open a special enrollment period through healthcare.gov, you know I came with a website. Healthcare.gov, so that all Americans would have the opportunity to sign up for health coverage."
    },
    {
      "text": "And today I am proud to announce that because of that more than two and a half million people since then have signed up for health coverage, two and a half million people. That is two and a half million people who can rest easier knowing that they can go to the doctor without taking on debt, or heaven forbid, if there is a sudden accident or illness that they can get the care they need."
    },
    {
      "text": "And I don't need to tell anybody here, this is especially important now while we are in the middle of a major public health crisis. A lot of people put off going to the doctor this past year because of the pandemic, people missed their regular appointments, be it for a mammogram or just checkups in terms of their progress, in terms of cancer. Some had to ignore the symptoms and the signs and the pain that they were experiencing because of that and people without health insurance could continue to suffer."
    },
    {
      "text": "And then that is why we are encouraging everyone to sign up. On Sunday, August 15th, the special enrollment period will end. On Sunday, August 15th, the special enrollment period will end, that's six days from today. So if you need health insurance, please visit healthcare care. Do not wait, sign up today. And now we know that when people have the opportunity to sign up, they do. And that is why we're here today, and why we have to continue to get the word out over these next six days."
    },
    {
      "text": "The demand is there, by the way. The demand is there. We saw that when we extended the open enrollment period and two and a half million people signed up. So this is the thing that we do know, people want affordable health coverage, but we just have to make it accessible, and we have to let them know what's available. So through our American Rescue Plan, we have lowered healthcare costs with new tax cuts and healthcare.gov consumers have seen their premiums dropped by an average of 40%."
    },
    {
      "text": "For folks returning to the exchange, that is an average savings of $40 a month. For a family of four, that is almost $2,000 a year, and that financial freedom can make all the difference. America, the President and I are just getting started. This week, the Senate will begin to vote on our administration's Build Back Better agenda, and a big part of that agenda is lowering healthcare costs. The tax cuts that I just mentioned are giving our nation's families much needed relief."
    },
    {
      "text": "Our administration is pushing Congress to extend those cuts to keep premiums low. If we are able together to do that, four million additional people will get covered, four million additional people, and the nine million people currently saving money will keep saving money. But if we do not extend these tax cuts, people will lose out and they will probably lose their coverage, so we have to get this done."
    },
    {
      "text": "We also must work together to call on Congress to advance other components of our Build Back agenda, to expand Medicaid in every state, to expand Medicaid in every state. People live in every state, that's the logic. To include dental, vision, and hearing services with Medicare coverage. I don't have to tell you how much and how expensive that is, especially for our seniors."
    },
    {
      "text": "And it's all about their ability, again, back to that point about self-determination, to be able to be independent, to be able to enjoy life, but with hearing aids costing thousands of dollars, being shut out of what they are entitled to have in terms of a quality of life. And to change the law then, which is what we need to do, so that we can finally negotiate lower prescription drug prices for seniors and families."
    },
    {
      "text": "These are the things we are urging Congress to do, and I don't need to tell you it's long overdue. So I do believe we can get this done, I know we can get this done. And this brings me back to you, to the importance of our community health centers. Community health centers are a Testament to our ability to accomplish big things and build on those accomplishments. Community health centers began in the 1960s as part of President Lyndon Baines Johnson's war on poverty."
    },
    {
      "text": "Sadly, that war on poverty was short lived, but there were some important components which lasted, including community health centers. And then decades later, President George W. Bush built on President Johnson's vision pushing for a major expansion of the community health center program. And then fast forward to President Obama and then Vice President Joe Biden, who increased the funding for community health centers during their administration."
    },
    {
      "text": "They know they will walk in these doors and be in a safe place without judgment, where they can be, especially for any of us when we're talking about healthcare, can be vulnerable and at the same time be treated in a way that helps alleviate pain and extend life. This is the work you all do every day. It is an incredible gift that you have and give. And I know it takes great sacrifice to do this work, and especially over this last year and a half."
    },
    {
      "text": "So on behalf of the President and me, we thank you on behalf of our country and all our communities for the work you do. And let us remember that as we work to lower healthcare costs, it is also the work of saying, I see you, I hear you, we are all in this together and in that way, we will be stronger as a community. When we touch and have impact on all communities, our society benefits and our country benefits."
    },
    {
      "text": "So thank you all for the work you do, please to everybody let's pass out and pass on the information, sign up for coverage at healthcare.gov by August 15th. And with that, again, I say, thank you, may God bless you and may God bless America. Thank you all very much."
    }
  ]
}