{
  "speech_id": "011",
  "speaker": "Harris",
  "title": "Kamala Harris Rally in Las Vegas",
  "date": "20240812",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-rally-in-las-vegas",
  "topics": "Economy, Social Justice, Government Policy",
  "num_segments": 24,
  "content": [
    {
      "text": "Hey, Nevada. Can we hear it for Tim Walz? Oh, it's so good to be back. Good evening, everyone. Good evening. Good evening. Oh, I see lots of friends. Oh, it is good to be back. It is good to be back. Thank you all. My goodness. (:13) But seriously, isn't Tim Walz fantastic? And I know for some folks you're just getting to know him and you've heard he's had many titles over his life, governor, congressman, dad, husband, coach."
    },
    {
      "text": "But in 87 days, our nation is going to know Coach Walz as Vice President of the United States of America. That's right. (:51) And it is so good to be here with so many incredible leaders, including my dear friends, Catherine Cortez Masto, Senator Jacky Rosen who we will reelect to the United States Senate, Congress members, Dina Titus, Steven Horsford and Susie Lee. And I know Culinary 226 is in the house."
    },
    {
      "text": "And the Culinary Union, as everyone in Nevada knows, they have helped lead the way in our country for workers' rights and workers' dignity. And I have to say, for years, I've been so proud to work by your side. When I was attorney general of California, we worked together to crack down on wage theft. (:19) When I was the United States senator, we fought together for paid family leave and medical leave. And earlier this year, right here in Vegas, we celebrated your historic contract win."
    },
    {
      "text": "And it is my promise to everyone here when I am president, we will continue our fight for working families of America, including to raise the minimum wage and eliminate taxes on tips for service and hospitality workers. And Nevada today, I also bring greetings from our incredible president, Joe Biden. Joe. We love Joe. That's great. And I'm going to tell him what y'all just said. And I know we are all so deeply grateful to Joe Biden for his lifetime of service to our nation. And he's not done. And he's not done."
    },
    {
      "text": "So as I said, it's so good to be back in Las Vegas. The last time I was here, I stopped by the practice for the men's national basketball team before they headed out to the Olympics. And maybe you saw it on your phone. But just a few hours ago in Paris, they won the gold. And I got more for you. A few hours before that, our women's national soccer team won the gold as well. USA. USA. That's great. So in one sport after another, Team USA continues to make our nation proud. So much to celebrate, so much to celebrate."
    },
    {
      "text": "So Nevada, we have 87 days until the election, 87 days. And here's the thing. But here's the thing, here's the thing. We know this will be a tight race until the very end. And so let's not pay too much attention to the polls because we have some hard work ahead of us, but we like hard work. Hard work is good work. And with your help this November, we will win. We will win. We will win. We will win. And I know we are all clear toward that win. We are all clear about what we are up against."
    },
    {
      "text": "As many of you know, before I was elected vice president, before I was elected a United States senator, I was an elected attorney general and before that, district attorney. And before that, I was state courtroom prosecutor. (:44) In those roles, in those roles, I took on perpetrators of all kinds, predators who abused women, fraudsters who ripped off consumers, scammers who broke the rules for personal gain. So Nevada, hear me when I say I know Donald Trump's type. I know."
    },
    {
      "text": "(:11) Well, well, hold on, hold on, hold on, hold on. The court's going to take care of that. We're just going to beat him in November. We'll beat him in November. We'll beat him in November. But I've certainly been dealing with people like him my entire career. For example, as Attorney General California, I took on one of our country's largest for-profit colleges that scammed students. (:50) Well, Donald Trump ran a for-profit college that scammed students. Remember that."
    },
    {
      "text": "As a prosecutor, I specialized in cases of sexual abuse. Well, Donald Trump was found liable for committing sexual abuse. As attorney general, I held Wall Street Banks accountable for fraud. Well, Donald Trump was just found guilty of fraud, 34 counts. (:43) All of this is to say, in this campaign, I will proudly put my record against his every day of the week, every day of the week. That being said, let's make no mistake. This campaign is not just about us versus Donald Trump."
    },
    {
      "text": "It is about two different visions for our nation. One, ours focused on the future. The other focused on the past. We're not going back. We're not going back. We are not going back. And we're not going back because Nevada, we fight for the future, a future with affordable healthcare, affordable child care, and paid leave. We fight for a future where we build a broad-based economy where every American has an opportunity to own a home, to start a business, and to build wealth."
    },
    {
      "text": "(:22) We believe in a future where we lower the cost of living for America's families so they have a chance not just to get by, but to get ahead, to get ahead, because, look, while our economy is doing well by many measures, prices for everyday things like groceries are still too high. You know it, and I know it. When I was attorney general, I went after price-fixing schemes. And when I am president, I will continue that work to bring down prices."
    },
    {
      "text": "(:05) I will take on big corporations that engage in illegal price gouging, corporate landlords that unfairly raise rents on working families, and take on big pharma and cap the cost of prescription drugs for all Americans. Unlike Donald Trump, I will always, I promise you, put the middle class and working families first because you see, Tim Walz and I may not appear to have a whole lot in common, but we have so much in common. And I' We are not going back. We are not going back. We're not going back."
    },
    {
      "text": "We're not going back. We're not going back. We're not going back. No. And we are going to move forward. We will move forward. And in moving forward, we will take on the biggest issues facing our nation. For example, we will address the issue of immigration. (:58) I was the attorney of a border state, attorney general of a border state. I went after transnational gangs, drug cartels, and human traffickers who came into our country illegally. I prosecuted them in case after case and I won."
    },
    {
      "text": "(:18) We know our immigration system is broken and we know what it takes to fix it. Comprehensive reform that includes yes, strong border security and an earned pathway to citizenship. (:43) But Donald Trump don't want to fix this problem. He talks a big game about a lot of things, but he talks a big game about border security, but he does not walk the walk. Earlier this year, we had a chance to pass the toughest bipartisan board of security bill in decades."
    },
    {
      "text": "Across our nation we have been witnessing a full-on assault on hard-won, hard-fought freedoms and fundamental rights, the freedom to vote, the freedom to be safe from gun violence, the freedom to love who you love openly and with pride, and the freedom of a woman to make decisions about her own body and not have her government tell her what to do, a fight for freedom. (:29) And on that last point, we all know how we got here."
    },
    {
      "text": "When he was President, Donald Trump hand-picked three members of the United States Supreme Court because he intended for them to undo the protections of Roe v. Wade. And as he intended, they did. Now, in more than 20 states, there is a Trump abortion ban, many with no exceptions, even for rape and incest. (:08) And be sure if he were to win, he would sign a national abortion ban, which would outlaw abortion in every state, even Nevada. But we are not going to let that happen because we trust women."
    },
    {
      "text": "(:34) And when I am President of the United States and Congress passes a bill to restore reproductive freedoms, I will sign it into law. So I know the folks who are here. I know the people of Nevada. You are battle-born. You are battle-born. And if Donald Trump wants to pick a fight over our most fundamental freedoms, we say bring it on. Bring it on. Bring it on. 'Cause we're ready. We're ready. So Nevada, generations, generations of Americans before us led the fight for freedom."
    },
    {
      "text": "Now the baton is in our hands, each and every one of us. So we who believe in the sacred freedom to vote will finally pass the John Lewis Voting Rights Act and the Freedom to Vote Act. (:28) And we who believe in the freedom to live safe from gun violence will finally pass an assault weapons ban, universal background checks and red flag laws. (:47) So much is on the line. So much is on the line in this election. And understand, this is not 2016. This is not 2020. This time around the stakes are even higher."
    },
    {
      "text": "And that's because last month the Supreme Court of the United States basically told the former President that going forward he will effectively be immune no matter what he does in the White House. But think about what that means. Think about what that means. So Donald Trump has vowed to be a dictator on day one if re-elected. He said he will weaponize essentially the Department of Justice against his political enemies, and even called for the \"termination\" of the Constitution of the United States."
    },
    {
      "text": "(:06) Let us be very clear. Someone who suggests we should terminate the Constitution of the United States should never again stand behind the seal of President of the United States. Never again. That's right. That's right. That's right. That's right. We know what we stand for as Americans. And it all comes down to this. We are here together because we love our country. We love our country. And I do believe it is the highest form of patriotism to fight for the ideals of our country."
    },
    {
      "text": "That is how we preserve the promise of America. (:29) And think about it. After all, the promise of America is what makes it possible for Tim Waltz and me to be together on this stage today. Think about that. Think about that. Think about it. Two middle-class kids. One, a daughter of Oakland, California who was raised by a working mother. I had a summer job at McDonald's. The other, a son of the Nebraska Plains who grew up working on a farm. Think about it. Think about it."
    },
    {
      "text": "Only in America is it possible that the two of them would be running together all the way to the White House. Only in America. Only in America. (:42) So look, and I love you back. I love you back. So look, we are together. We are running this campaign on behalf of all Americans, from red states to blue states, from the heartland to the coast. And when elected, we will govern on behalf of all Americans. All Americans."
    },
    {
      "text": "(:22) So Nevada ultimately in this election, I believe we each face a question, what kind of country do we want to live in? A country of chaos, fear and hate, or a country of freedom, compassion and rule of law. (:51) And the beauty. And the beauty of our democracy. Here's the thing, the beauty of our democracy is we each, each person has the power. Each person has the power to answer that question. The power is with the people. The power is with the people. It's with the people."
    },
    {
      "text": "(:26) And so in the next 87 days, we need you to use your power to knock on doors, register folks to vote, and make your voices heard. (:57) So Nevada, today I ask you, are you ready to make your voices heard? Do we believe in freedom? Do we believe in opportunity? Do we believe in the promise of America? And are we ready to fight for it? And when we fight, we win. God bless you. God bless the United States of America."
    }
  ]
}