{
  "speech_id": "015",
  "title": "VP Kamala Harris & PM Lee Singapore Press Conference Transcript",
  "date": "20210823",
  "url": "https://www.rev.com/blog/transcripts/vp-kamala-harris-pm-lee-singapore-press-conference-transcript",
  "topics": "Foreign Policy, Healthcare, Economy, Climate, Technology",
  "num_segments": 31,
  "content": [
    {
      "text": "Thank you, Prime minister Lee. You have been a longstanding friend of the United States. You have been a counselor and a friend to many of my predecessors who have talked with me about the friendship and the history of work together, and I was honored to be a part of that tradition with this visit today in our extensive conversations about many topics. So thank you, and thank you for the warm welcome."
    },
    {
      "text": "And I am here because the United States has a longstanding and enduring relationship with Singapore, with Singapore in the context of Southeast Asia and in the context of the United States being a member of the Indo- Pacific region and we take that membership seriously. It is a partnership that we have with Singapore and Southeast Asia that belies on the priorities of the United States that are both priorities that relate to our security, as well as our economic wellbeing."
    },
    {
      "text": "And increasingly, certainly the pandemic has highlighted the importance of working together as partners on the issue of global health. The conversation that we had today was also in many ways defined by what I think we all understand to be a new era that we're embarking on, a new era as defined by many of the issues that I mentioned. The issue of pandemic and global health, the issue of the climate crisis, which we spoke extensively about, the issue of cybersecurity."
    },
    {
      "text": "And on these issues as well as the traditional issues that we have partnered with Singapore on, we are looking forward to strengthening this relationship and our collaboration and partnership. And today, we are in Singapore to stress and reaffirm our enduring relationship to this country and in this region, and to reinforce a shared vision of a free and open Indo-Pacific region and to reaffirm our mutual interests in peace and stability in Southeast Asia."
    },
    {
      "text": "Prime Minister Lee and I had a productive conversation on how our two nations can partner together to fulfill this vision- ... can partner together to fulfill this vision. In that context, Prime Minister, I thank you for the very generous software that you've made to assist the United States in our evacuations from Afghanistan. And we look forward to following up on that discussion."
    },
    {
      "text": "On the issues that we discussed, I'll start with the issue of global health because it is one of the dominant issues that is impacting all nations. And on that issue, we discussed the importance of working together to end this pandemic, but also to prevent future pandemics. Singapore's approach to managing the pandemic has been commendable. But we all must do more to not only end the current pandemic, but to invest in what we know will be more."
    },
    {
      "text": "From day one, President Biden has been clear about the importance of vaccinating people in the United States against COVID-19 and our commitment to being an arsenal of vaccines for the world. That is why we have provided millions of vaccine doses to countries within Southeast Asia. And Singapore has been very generous in the way that it has contributed to the work that needs to be done in this region and around the world."
    },
    {
      "text": "As the Delta variant threatens communities, the prime minister and I discussed how the United States and Singapore can partner to increase the capacity of Southeast Asia to identify new COVID variants and boost regional preparedness. Secondly, we discussed our partnership's importance to the prosperity of our two countries and the broader region."
    },
    {
      "text": "This pandemic has had a profound impact on economies and a profound impact on families and workers and has exposed what many knew before, but had been highlighted through the pandemic, which is the vulnerability of our supply chains. In America, we all remember the early days of the pandemic when folks couldn't figure out where they could get a mask, where they could get PPEs. And that was because of the shortage of basic goods around the globe."
    },
    {
      "text": "Supply chains, without any question, are critical to ensuring that businesses can source the materials they need and get products to market and enable people to buy these products. For example, semiconductor chips, they power everything from smartphones to laptops to cars. And if we're not producing enough semiconductors as a world, as a globe, our automobile factories in the United States will be impacted as they've been. And it will impact then families and consumers."
    },
    {
      "text": "You just ask anybody who's thinking about trying to buy a new car or a used car. And it is more difficult than it has been in a long time, because of course, supply chain issues impact production lines and impact goods getting to market. So working together with partners like Singapore on strengthening supply chains is critical in not only getting goods to the folks who need them, but keeping Americans working and on the job and ensuring Americans can provide for their families."
    },
    {
      "text": "So that is why tomorrow I will be meeting with key business leaders here in Singapore to discuss what more we can do together in this region of the world with private and public sectors, including our own in the United States, to shore up supply lines and supply chains. And that is why the prime minister and I agreed to launch a dialogue on how our two countries can better work together to strengthen supply chain resiliency in this region."
    },
    {
      "text": "Third, on the issue of security, a long-standing source and reason for the priority that our two countries have placed in our partnership. I reaffirmed in our meeting the United States' commitment to working with our allies and partners around the Indo-Pacific to uphold the rules-based international order and freedom of navigation, including in the South China Sea."
    },
    {
      "text": "The prime minister and I also agreed that the United States and Singapore must expand cyber security cooperation to address growing threats and to protect our countries from cyber attacks, for example, on financial institutions and on our defense establishments. Turning to the issue of values, the United States is deeply committed to advancing respect for human rights at home and abroad."
    },
    {
      "text": "In our meeting today, the prime minister and I discussed the crisis in Burma and the role the international community must play in helping the people of Burma restore democracy to their country. And lastly, during our meeting, we spoke about the need to coordinate our efforts to address climate and the climate crisis. I no longer call it climate change, Prime Minister, climate crisis as evidenced by the UN report that recently came out."
    },
    {
      "text": "As two of the world's leaders in the financial sector, the United States and Singapore can work together on sustainable finance in this regard. And that is why today our countries are launching a new climate partnership to create standards for sustainable financing, to address financial sector climate risk, and to mobilize private capital for climate mitigation and adaptation."
    },
    {
      "text": "So those are just some of the areas we touched upon today, reflective of the breadth and the depth of the partnership between the United States and Singapore. And as I said at the beginning of my remarks, our administration is committed to enduring engagement in Singapore, into Southeast Asia and the Indo-Pacific. And I look forward, Prime Minister, for continuing and strengthening our relationship for years to come. And thank you again. Thank you, Prime Minister. And that is exactly the point."
    },
    {
      "text": "I am here in Singapore as a reaffirmation of our commitment to our membership in the Indo-Pacific region, our long standing partnerships with Southeast Asia, and a long standing relationship with Singapore as it relates to our issues and our mutual issues on security and economic strength and development, and now increasingly, global health."
    },
    {
      "text": "So this visit, combined with the agreements we have made and the work we continue to do as a nation to reinforce our commitment to these relationships, speak, I believe, volumes in terms of the integrity of the relationships that the United States has around the world on many issues, based on our shared priorities and our shared vision, of not only the challenges we face, but the future and the potential, based on the opportunities that this moment also presents."
    },
    {
      "text": "But right now, we are singularly focused on evacuating American citizens, Afghans who worked with us, and Afghans who are vulnerable, including women and children, and that is our singular focus at this time, understanding that we have a priority in making sure that the people that, in particular, helped America achieve its responsibilities in terms of our priorities and the reason we went to Afghanistan in the first place, that we have a responsibility and we feel a deep commitment to making sure that folks who helped us are safe."
    },
    {
      "text": "But there's no question that what many of us have seen on television, as the President has said... The President has, I think, shown great emotion in expressing sadness about some of the images we have seen, but we cannot be, in any way, distracted in any way from what must be our primary mission right now, which is evacuating people from that region who deserve to be evacuated."
    },
    {
      "text": "So I'll repeat what I said, which is that there's- I'll repeat what I said, which is that there's no question there will be and should be a robust analysis of what has happened. But right now, there is no question that our focus has to be on evacuating American citizens, Afghans who worked with us, and vulnerable Afghans, including women and children. That has to be our primary focus and where we are placing our attention on the issue of Afghanistan."
    },
    {
      "text": "And to that end, we have seen a successful drawdown of the embassy. And thankfully, without any American casualties. We have seen thousands of people who have been evacuated from the airport in Afghanistan, where the United States, military, doing very hard and difficult work, were able to contain that airport so that we could successfully evacuate the people who have been evacuated so far. So as the president has said, listen, this is a difficult mission. There's no question about that."
    },
    {
      "text": "But our focus has to be on the task at hand. As it relates to America's relationship around the world, I am standing here in Singapore because our commitment to a long standing relationship, which is an enduring relationship with the Indo-Pacific region, with Southeast Asian countries. And in particular, with Singapore."
    },
    {
      "text": "The agreements that the prime minister and I have reached today are evidence of that enduring relationship and commitment and founded on the long standing priorities that relate to our security interests and our economic issues, but also a commitment going forward as it relates to the challenge just that we faced in the 21st century and the challenges we are going to face moving forward, such as in the inevitable, which is future pandemics and what we will do together to research and to do what we can to stop those pandemics from wreaking the kind of havoc on the world that COVID has."
    },
    {
      "text": "A commitment moving forward to work together on the issue of cyber security, to work together on the issue of the climate crisis. All of these agreements are evidence of America's strength and enduring relationships around the globe. And in particular, our knowledge that as we move forward and think about where we go in the 21st century, Southeast Asia and the Indo-Pacific will in large part, I believe, dictate the future of our world."
    },
    {
      "text": "America's commitment then and partnerships with the country in this region and the countries in this region are about where we are going and also founded on the relationships that we have had in this region. Thank you, [inaudible :51]. Speaker 1: () Thank you. Now, the last question from Singapore journalists [inaudible :56] from the Singapore First Holdings. Speaker 3: () Hi, thank you very much. I'd like to bring a discussion back to the region."
    },
    {
      "text": "And as PMD and Vice President Harris, how the US can work with Singapore and other partners to contribute to the broader stability and security of the region, and also to strengthen people to people ties? Thank you. The prime minister has said it well, which is, this is a relationship that is based on a shared vision, both in terms of the challenges we face, but also the opportunities that we face to work together to meet those challenges."
    },
    {
      "text": "And it relates again to the historic relationship that we have on the issue of security and economic strength, but it is also about what we can do to work together, to discover the medicines that might attack and deal with the next virus. It is about the future in terms of our mutual commitment, curiosity, and interest, and what we can do in space. It is about what we have in terms of shared values for the need for universal norms on the issue of cyber security."
    },
    {
      "text": "It is about the interests that we have in being a global partner on the issue of vaccines, for example, and our shared commitment, understanding that when we have the resources, that we will share them with the world. These are the things that Singapore and the United States have in common and with that common purpose and with a similar approach to our responsibility for our own citizens and our responsibility as a global citizen."
    },
    {
      "text": "I believe that with this commitment, as evidenced again by this visit today, we will continue to partner in a way that benefits not only Singaporeans and Americans, but the rest of the world. Speaker 1: () Thank you, Madam Vice President. And with that, I bring the joint press conference now to a close. Thank you journalists for joining us and everyone online. Thank you."
    }
  ]
}