{
  "speech_id": "018",
  "title": "VP Kamala Harris Vietnam Press Conference Transcript",
  "date": "20210826",
  "url": "https://www.rev.com/blog/transcripts/vp-kamala-harris-vietnam-press-conference-transcript",
  "topics": "Economy, Healthcare, Climate, Foreign Policy, Technology",
  "num_segments": 33,
  "content": [
    {
      "text": "Good afternoon. Can I give a few remarks and then I'll take questions? First, I want to thank our Vietnamese host for so warmly welcoming us to Vietnam. As many of you know, I am the first vice president to visit Vietnam since diplomatic relations were established in 1995. And I believe that this trip signals the beginning of the next chapter in the relationship between the United States and Vietnam."
    },
    {
      "text": "We have had an enduring commitment to this relationship because it matters to the people, to the security and to the prosperity of the American people, and we believe the people of Vietnam. In fact, our cooperation on a whole host of issues today shows that the trajectory of our relationship since the normalization has been nothing short of remarkable. When we think about where we've been, where we are and where we are headed, now we are strengthening our partnership."
    },
    {
      "text": "First, I know that the COVID-19 surge is the number one issue for the Vietnamese people right now as evidenced by the trip we took recently just this afternoon to the National Institutes of Hygiene to deliver one million vaccines from the United States to the people of Vietnam on top of the five million that we've already shared."
    },
    {
      "text": "Just as you stood with us and I say this to the people of Vietnam during the earliest days of the pandemic as early as spring of 2020, we now are here for you in this moment of need. More United States sourced vaccinations arrived through COVAX in Hanoi this morning. We are also supplying freezers to distribute the vaccines and providing millions in public health assistance, millions of dollars in public health assistance. And we opened a new CDC Southeast Asia regional office."
    },
    {
      "text": "We do intend and hope that the people of Vietnam know that we will be with you as you battle this surge. Even in the midst of the pandemic, we will continue to partner together to strengthen our economic ties. For example, during our meetings with the officials and leaders here in Vietnam, I advocated for a reduction of tariffs on American agricultural goods and there was a positive reaction. And we're looking forward to following up on that conversation."
    },
    {
      "text": "We also launched initiatives that will help Vietnam transition to a more digital economy and it will help grow women and ethnic minority-owned businesses. As part of our economic partnership, we have also reached agreements about the importance of addressing the climate crisis and collaborating toward a clean energy future."
    },
    {
      "text": "In addition to the extensive conversations that I've had with the leaders of the Vietnamese government, I've also had conversations with young leaders who are working in the community on this very issue. We launched as part of our initiative on working together in partnership on the climate crisis, the Mekong Coastal Habitat Conservation Program to help with issues that are impacting the Mekong Delta region."
    },
    {
      "text": "And I welcome to Vietnam in joining the Agricultural Innovation Mission for Climate, because we know we need to accelerate the adoption of climate smart agriculture. And in fact, I had extensive conversations also with the prime minister yesterday about the connection between that technology and the work that we are doing in the United States in terms of space program."
    },
    {
      "text": "And the prime minister expressed a real interest in working together with us understanding that part of that program would include what we can do around satellite technology, helping farmers in terms of predicting weather cycles. We all agree and certainly the UN published the report in the last couple of weeks that the climate issue has reached crisis proportions."
    },
    {
      "text": "When, as we all know, the United Nations issued a report with broad global consensus that by the year 2030, we can see temperatures rise as much as 2.7 degrees Fahrenheit. And the crisis then is urgent and we are proud to stand with Vietnam and other partners and allies around the globe in meeting this moment. Throughout my visit here, I also reaffirmed the commitment that the United States has to our common vision for a free and open Indo-Pacific."
    },
    {
      "text": "The United States will continue our high level security cooperation in support of a strong, prosperous, and independent Vietnam. And we will continue to work with Vietnam to push back against threats, to freedom of navigation and the rule-based international order. I also raised the issue of human rights in my meetings and made clear the importance that the United States places on human rights."
    },
    {
      "text": "We will always be true to our and will not shy away from speaking out, even when those conversations may be difficult to have and perhaps difficult to hear. When we talk about opening up the next chapter, we also are very proud that during this trip we were able to sign a lease for 99 years to establish the United States Embassy here in Hanoi. And we take as a point of pride that it is a 99-year lease as evidence of our enduring commitment to the partnership we have with Vietnam."
    },
    {
      "text": "In the same vein, our commitment, as I've said at the beginning of this trip is in full appreciation and pride of the role of the United States as a member of the Indo-Pacific region. Understanding that Southeast Asia is that the seat of this region and that the country of Vietnam holds a particular importance and significance to the United States as does the first stop on this trip, which is when we were in the country of Singapore."
    },
    {
      "text": "Whether in Singapore or Vietnam, Southeast Asia or the Indo-Pacific region, the United States intends to strengthen our participation and partnership with our partners and allies and further and strengthen our interest in a way that is collaborative meeting the challenges of the moment and the challenges of tomorrow together. Throughout this trip and in many meetings with government officials, business leaders or civil society, I was reminded about just how much potential there is in this region."
    },
    {
      "text": "And dare I say, the potential that we all have when we have the ability to see what is possible and then have the ambition to achieve what is possible around common interests and common goals. We know it matters deeply to the well-being of the American people that we maintain and strengthen these partnerships."
    },
    {
      "text": "And that's why in the years ahead, we will be coming back time and time again as we follow through and chart this next chapter and the partnership and the relationship we have with the spirit of understanding that it is mutually beneficial and that there is much that we can do together. With that, I'll take questions. Speaker 2: ()\nMy first question will come from [Nguyen Kane :37] from [inaudible :38]. Sure."
    },
    {
      "text": "As I said, there were extensive conversations and a joining of perspective during the meetings that we held here particularly yesterday with Vietnamese officials where we talked, for example, about the issue of COVID as just the current example of a global public health crisis and what we can do together to join forces to not only deal with the current moment, as I've said and previously mentioned, the issue of vaccines and what we can do. Vietnam helped the United States out around PPE."
    },
    {
      "text": "We are helping Vietnam with vaccines, but also what we can do together to be prepared, we call it preparedness for the inevitable next pandemic. That is part of what it means to strengthen this relationship strategically. Strategically meaning thinking about what might be our challenges, but also what are our opportunities. For example, we also spent a lot of time talking about what we can do together as it relates to the supply chain."
    },
    {
      "text": "And how we understand and know that, one, there's a connection between a global public health crisis like COVID and the production then of necessary goods and how that can have a global impact on economies, but also the workforce. We talked extensively, for example, about what that means in terms of increasing the strength of our workforce, but also increasing the strength of our supply chain. So those are some of the many examples, but again going through the list, it relates to that."
    },
    {
      "text": "It relates to what we can do together on the issue of climate. I will tell you that it was a very productive and in-depth conversation about how we share the concerns. You look at the Mekong River and what is happening in terms of erosion there, we're seeing the same kind of issues in the United States and what we can do together. That's both about an investment in innovation and technology, and also thinking about how we can grow our economies around thinking about things like renewable energy."
    },
    {
      "text": "So that's what that conversation was and those are examples of what it means to strengthen the strategic relationship. Speaker 2: ()\nOur next question will come from Alex Jaffe of the Associated Press. Hi. Okay. On the issue of the health incidents and we call them anomalous as you've mentioned, health incidents. I will tell you that we're looking into it and I'm not able to share much more at this time."
    },
    {
      "text": "But on your point about embassy staff, I've met with them today and then also saw them yesterday during the lease signing ceremony. And I will tell you that the people who work in our embassies be it here in Mission Vietnam or around the globe are some of the most courageous and selfless public servants that you can meet. I talked with them extensively about the importance of their work, and also a recognition of the sacrifice they make."
    },
    {
      "text": "For example during the last year and a half around the COVID crisis, many of them sadly were unable to go home even when they lost family members to COVID. We talked about the significance of their work in doing the groundwork that we need to do around the globe with our partners and our allies of strengthening the relationships around people to people ties and relationships. And that is the work they do and their safety insecurity is one of the highest priorities."
    },
    {
      "text": "As I've said before and as you've noted, our highest priority right now is evacuating American citizens, evacuating Afghans who worked with us and Afghans who are at risk with a priority around women and children. And we have made significant progress in that regard. I believe since August 14th I believe, we have evacuated over 80,000 people. And as you know each day and night, we continue to evacuate thousands of people understanding that it is risky for them to be there."
    },
    {
      "text": "It is a dangerous and difficult mission, but it must be seen through and we intend to see it through as best as we can. Speaker 2: ()\nThank you. Our next question will come from Jenny Leonard from Bloomberg. Okay. Thank you. So on your last point, those issues were raised and discussed as was the issue of human rights, both with the leaders of the Vietnamese government as well as with civil society leaders because it is a real concern for the United States."
    },
    {
      "text": "And as I said in my opening comments, we're not going to shy away from difficult conversations. Difficult conversations often must be had with the people that you otherwise may have a partnership with. And we do have a partnership with Vietnam in addition to concerns about human rights issues."
    },
    {
      "text": "We have a partnership as it relates to, for example, again, and I've said the reciprocal relationship that we've had around assisting the citizens of each of our countries during this global health crisis called COVID-19. We have a relationship with Vietnam when it comes to issues that relate to our economic strength, including for example, the concern that American farmers have about tariffs. And that is why I raised the issue of the possibility of a reduction of tariffs around American agricultural goods."
    },
    {
      "text": "So there is a lot of work to be done. There's no question about it. That is both about strengthening our nations and in particular our security concerns. And as you said, freedom of navigation is a high priority for us. It relates not only to security, but also to commerce and what we must do to continue to speak up when necessary about human rights issues. And we'll continue to do that. Speaker 2: ()\nOur next question will come from Tarini Parti of the Wall Street Journal and Tarini's right over there. Yeah."
    },
    {
      "text": "And this relates to the last question as well. When it comes to Beijing, let me be very clear and the president has been very clear. We welcome stiff competition. We do not seek conflict, but on issues like you raised the South China Sea, we're going to speak up. We're going to speak up when there are actions that Beijing takes that threaten the rules-based international order. Again, such as activity in the South China Sea."
    },
    {
      "text": "And the issue in particular of freedom of navigation in that regard is a vital issue for this region. I spoke of it both in Singapore and here in Vietnam. And we are going to continue to do what we can to make sure that we stay committed to our partners and our allies on these important kinds of issues. But our policy is much broader than the South China Sea and the partnership that we have here in Southeast Asia."
    },
    {
      "text": "Again, and I will repeat myself, has to do with a number of issues that are about productivity and about strengthening the standing of each of our countries. Speaker 2: ()\nAnd our final question will come from Sally Bronson from NBC. Sally is right over there. Yeah. Well, you are right. I have worked almost my entire career on a number of issues, but with a particular emphasis on the protection of women and children."
    },
    {
      "text": "And there's no question that any of us are paying attention are concerned about that issue in Afghanistan. We have said before and I will say again that we are going to do what we are able to do in terms of the evacuation process. But in addition to that, what we are able to do politically and diplomatically to secure and to continue to work on the protection of women and children in that region, including working with our allies."
    },
    {
      "text": "And it is no secret that many of our allies are prepared to join with us in ensuring that we keep a focus on that issue in that region and do everything that we can, and to do it together as a global community. Speaker 2: ()\nThank you, everyone. That concludes our press conference. Okay."
    }
  ]
}