{
  "speech_id": "021",
  "speaker": "Harris",
  "title": "Harris and Walz Hold Campaign Rally in Wisconsin",
  "date": "20240808",
  "url": "https://www.rev.com/blog/transcripts/harris-and-walz-hold-campaign-rally-in-wisconsin",
  "topics": "Education, Social Justice, Government Policy, Veterans Affairs",
  "num_segments": 27,
  "content": [
    {
      "text": "Good afternoon, Wisconsin. (:18) Good afternoon. Oh, it's good to be back. Good afternoon everybody. Can we hear it for Tim Walz? Oh, I'm so happy to be running with him, let me tell you. (:33) So let me start by thanking Les, your words, your leadership, your voice it's so important. Les, thank you for everything you are and everything you do for our country. And it is good to be with so many incredible leaders, including the most magnificent, wonderful governor, Tony Evers."
    },
    {
      "text": "Every time I come to Wisconsin, Tony meets me on the tarmac. He's such an incredible human being. I want to thank Secretary of State Sarah Godlewski. Chair of the Wisconsin Democratic Party, Ben Wickler. And my dear, dear friend, Senator Tammy Baldwin. (:27) I served with Tammy when I was in the United States Senate and I'ma tell you, she was always, always fighting for the people of this state. And in November we are going to re-elect her to the United States Senate."
    },
    {
      "text": "And please, give it up one more time for Wisconsin's own Bon Iver. It's a good afternoon. It's a good afternoon. (:58) And let me say, I also want to bring greetings from our incredible president, Joe Biden. He loves Wisconsin, he loves Wisconsin. And I know we are all deeply grateful for his lifetime of service to our nation and for all he continues to do. That's right. That's right. I'm going to tell him what you said. (:51) So Wisconsin, this has been a big week."
    },
    {
      "text": "Speaker 10 On Monday, I officially became the Democratic nominee for President of the United States. And yesterday, I announced my running mate in this campaign, Governor Tim Walz. And as you just heard and the Minnesotans here know, Tim has an incredible record as governor of the great state of Minnesota. And to those who know him best, Tim is more than a governor. To his wife, Gwen, he is a husband. To his kids, Hope and Gus, he is dad. To his fellow veterans, he is Sergeant Major Walz."
    },
    {
      "text": "To the people of Southern Minnesota for 12 years he was a congressman. To his former high school students, he was Mr. Walz. And to his former high school football players, he was Coach, Coach. And in 90 days the nation will know Coach Walz by a new title, Vice President of the United States of America. That's right. Oh, it really is good to be back in Wisconsin. (:56) So listen, let me tell you, I am clear, the path to the White House runs right through this state. And with your help, we will win in November."
    },
    {
      "text": "We are going to win. We are going to win. And I've been here many times, as you all know, recently and even before. And many of you know then, before I was elected vice president, before I was elected United States senator, I was an elected attorney general. And before that, an elected district attorney. And before that and before that I was a courtroom prosecutor. (:42) So in those roles, I took on perpetrators of all kinds. Predators, who abused women. Fraudsters, who ripped off consumers."
    },
    {
      "text": "Scammers, who broke the rules for personal gain. So hear me when I say, I know Donald Trump's type. I know it's type. In fact, I've been dealing with people like him my whole career. For example, as Attorney General of California... Well hold on, you know what? The courts are going to handle that part of it. What we're going to do is beat them in November. (:41) So I'll tell you, as Attorney General, I took on one of our country's largest for-profit colleges that scammed students."
    },
    {
      "text": "Well, Donald Trump ran a for-profit college that scammed students. (:55) As a prosecutor, I specialized in cases of sexual abuse. Well, Donald Trump was found liable for committing sexual abuse. (:06) As Attorney General, I held the big Wall Street banks accountable for fraud. Well, Donald Trump was just found guilty of fraud, 34 counts. (:22) So in this campaign, I'll tell you, I will proudly put my record against his any day of the week. Any day of the week."
    },
    {
      "text": "(:40) But let's make no mistake, this campaign is not just about us versus Donald Trump. It's about two very different visions for our nation. Two very different visions. One, for us, focused on the future. The other, focused on the past. And Wisconsin, we here, we fight for the future. We fight for a future where every worker has the freedom to join a union. (:15) Union strong. We fight for a future where every senior can retire with dignity. A future where we build a broad-based economy."
    },
    {
      "text": "And one where every American has the opportunity to own a home, to start a business, to build wealth. And understand in this fight, as Tim Walz likes to point out, we are joyful warriors. Joyful warriors because we know that while fighting for a brighter future may be hard work, hard work is good work, hard work is good work. And so, we will continue to fight for affordable housing, for affordable healthcare, affordable child care, and paid leave."
    },
    {
      "text": "We believe in a future where we lower the cost of living for America's families so that they have a chance not just to get by, but to get ahead. (:50) Because while our economy is doing well, by many measures, prices for everyday things like groceries are still too high. You know it and I know it. When I was Attorney General, I went after price fixing schemes. And when I am president, it will be a day one priority to fight to bring down prices."
    },
    {
      "text": "I will take on big corporations that engage in illegal price gouging. I will take on corporate landlords that unfairly raise rents on working families. I will take on Big Pharma and cap the cost of prescription drugs for all Americans. And continue to bring manufacturing jobs back to America. And back to communities like Eau Claire. (:49) So, all this is to say, strengthening our economy and building up the middle class will be a defining goal of my presidency."
    },
    {
      "text": "Because you see, Coach Walz and I know when America's middle class is strong, America is strong. And as we work to move our nation forward, Donald Trump intends to take our nation backward. There is so much evidence of that point, there really is. But look at most recently, Project 2025 and that agenda. Project 2025, if you have some time to take a look at it, I'm telling you it is a plan to weaken the middle class. It is a plan to weaken the middle class."
    },
    {
      "text": "(:50) If he is elected, Donald Trump intends to give tax breaks to billionaires and big corporations. He intends to cut Social Security and Medicare. He intends to surrender our fight against the climate crisis. And he intends to end the Affordable Care Act. And because we all remember what it was like before the Affordable Care Act, we understand what that means. That's about taking us back to a time when insurance companies had the power to deny people with pre-existing conditions. You remember that?"
    },
    {
      "text": "What that was like when... We're not going back. We're not going back. We're not going back. We are not going back. We are not going back. But in order to know where we need to go, let's remember the past and what that was like 'cause we cannot forget. On that point about the ACA, remember, people with pre- existing conditions being denied? Children with asthma, breast cancer survivors, grandparents with diabetes, that was no joke."
    },
    {
      "text": "(:08) Our nation, we have been witnessing a full-on assault against hard-fought, hard-won freedoms and rights. The freedom to vote, to love who you love openly and with pride. And the freedom of a woman to make decisions about her own body and not have her government telling her what to do. (:34) And let's remember the traditions of our great country. Generations of Americans before us led in the fight for freedom. And now then, as they would expect, the baton is in our hands."
    },
    {
      "text": "The baton is in our hands, each and every one of us. So we then, who believe in the sacred freedom to vote, will finally pass the John Lewis Voting Rights Act and the Freedom to Vote Act. We, who believe in the freedom to live safe from gun violence will finally pass universal background checks, red flag laws and an assault weapons ban. We, who believe in reproductive freedom will fight for a woman's right to choose."
    },
    {
      "text": "(:41) And we, remember that when he was president, Donald Trump hand-picked three members of the United States Supreme Court, the court of Thurgood and RBG, because he intended for them to overturn Roe v wade. And, as he intended, they did. And now, more than 20 states in our country have a Trump abortion ban. Many with no exceptions, even for rape and incest. And if he wins, we all know he will sign a national abortion ban to outlaw abortion in every state, even in Wisconsin."
    },
    {
      "text": "But we are not going to let that happen. Because we trust women. And when I am President of the United States and when Congress passes a bill to restore the protections of Roe v wade, I will sign it into law. Thank you all. (:08) So listen, everyone took time out of your busy lives, and days and all your obligations to come out here and to be together as one community. And I know you did it also because we all know, listen, so much is on the line in this election. It can't be said seriously enough."
    },
    {
      "text": "So much is on the line. And compounded with everything else that we knew was on the line, think about the fact that last month the United States Supreme Court, basically, told the former president, who has been convicted of fraud, that going forward he will be immune, no matter what he does in the White House. (:53) Think about what that means and the changed circumstances since 16/6/20 when you think about what that court decision means."
    },
    {
      "text": "Donald Trump has openly vowed if re-elected, he will be a dictator on day one. That he would weaponize the Department of Justice against his political enemies. That he would round up peaceful protesters and throw them out of our country. And even, \"Terminate the United States Constitution.\" So let us be clear, let us be clear, someone who suggests we should terminate the Constitution of the United States should never again have a chance to stand behind the seal of the President of the United States."
    },
    {
      "text": "So basically, I think it all comes down to this, we're all here because we love our country. We love our country. We love our country. And I do believe it is the highest form of patriotism to fight for the ideals of our country. And that's how we preserve the promise of America 'cause, after all, the promise of America is what makes it possible, by the way, for Governor Walz and me to stand on this stage today."
    },
    {
      "text": "Just think about it, two middle-class kids one, a daughter of Oakland, California, who was raised by a working mother and had a summer job at McDonald's. The other, a son of the Nebraska Plains who grew up working on a farm. Think about that. Only in America is it possible for them, together, to make it all the way together to the White House. Only in America. Only in America. (:27) So this is a fight to make real the promise of America for every person in our nation."
    },
    {
      "text": "And also I'll tell you, and I promise you, our campaign's going to reach out to everyone, from red states, from blue states, from the heartland to the coast. We are running a campaign on behalf of all Americans. And when elected, we will govern on behalf of all Americans because Coach Walz and I know, and we're clear about this unlike the other side, we work for you. We work for you, the American people. And we will always fight for you, for your family, for your freedoms, and for your future."
    },
    {
      "text": "(:19) So Wisconsin, ultimately, this election is about a question that we each face. We each face a question in this election. And that is, what kind of country do we want to live in? Do we want to live in a country of freedom, of compassion, of rule of law? Or a country of chaos, fear and hate? And the beauty of our democracy is we each have the power individually and collectively. We each have the power in a democracy to answer that question. The power is with the people. The power is with the people."
    },
    {
      "text": "(:17) So in the next 90 days, we need you to use your power. We need you to knock on doors. We need you to register folks to vote. We need you to energize, and organize, and mobilize and make your voices heard. (:39) And I'll tell you about an hour ago after I landed on Air Force 2, I met a collection of young leaders from Girl Scout Troop 3307. Oh, they were spectacular. Oh, they were spectacular. None of them taller than three feet. They all made just... They were spectacular."
    },
    {
      "text": "And one of those young leaders had a shirt on that said, \"You are powerful and your voice matters.\" Right? From the mouths of babes they're telling us, they're telling us. And so, let's remember that. Let's remember our power. Let's remember our voice matters. And with that then I ask, are you ready to make your voices heard? Do we believe in freedom? Do we believe in opportunity? Do we believe in the promise of America? And are we ready to fight for it? And when we fight, we win."
    }
  ]
}