{
  "speech_id": "024",
  "title": "Kamala Harris Receives COVID-19 Vaccine & Speaks to Media: Transcript",
  "date": "20201229",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-receives-covid-19-vaccine-speaks-to-media-transcript",
  "topics": "Healthcare",
  "num_segments": 6,
  "content": [
    {
      "text": "Yes, of course. Thank you. I'm looking forward to it. Got it. How are you doing today? It's good to be here at United Medical Center. You guys do such good work here. Okay. Let's do it. I'm ready. That was easy. Thank you. I barely felt it. I barely felt it. Okay. Awesome, thank you, Patricia! Thank you. Well, I want to thank United Medical Center for the work that you do in Southeast DC, serving a community that is often overlooked. So it is good to be here."
    },
    {
      "text": "And I've now been vaccinated, as Joe likes to say, there's a big difference between the vaccine and vaccinations. I want to encourage everyone to get the vaccine. It is relatively painless. It happens really quickly. It is safe. The Moderna, the Pfizer. Today I had the Moderna vaccine. My husband is going to have it today as well. I look forward to getting the second vaccine. And literally this is about saving lives, it's literally about saving lives. I trust the scientists."
    },
    {
      "text": "And it is the scientists who've created and approved this vaccine. So I urge everyone when it is your turn, get vaccinated. It's about saving your life, the life of your family members, and the life of your community. And so thank you and let's all just do what we need to do to stay healthy and safe this holiday, and every day of the year. Thank you all. Speaker 3: ()\nMadam Vice President-elect, I have two questions."
    },
    {
      "text": "[crosstalk :22] So I am at Acacia today, because first of all, we have phenomenal health care providers like nurse Patricia, who serves the community and we have hospitals and medical centers and clinics like this all over the country, who are staffed by people who understand the community, who often come from the community and who administer, all year round, trusted health care."
    },
    {
      "text": "And so I want to remind people that right in your community is where you can take the vaccine, where you will receive the vaccine by folks you may know. Folks who otherwise are working in the same hospital where your children are born. Folks who are working in the same hospital where an elderly relative receive the kind of care that they needed. So I want to remind people that they have trusted sources of help, and that's where they will be able to go to get the vaccine. So I encourage them to do that."
    },
    {
      "text": "Speaker 3: ()\nAnd lastly on the stimulus check, Trump was trying to increase it to $20000. Looking at it since yesterday, it may not pass, Mitch McConnell is holding it up. What say you? Well, I actually have a bill for that. Where a while back I recommended that folks receive a $2,000 check. And so I would urge Mitch McConnell to put my bill on the floor for a vote."
    }
  ]
}