{
  "speech_id": "025",
  "title": "Vice President Harris Speaks in Dubai on Diplomacy Efforts Concerning the Israel-Hamas War Transcript",
  "date": "20231204",
  "url": "https://www.rev.com/blog/transcripts/vice-president-harris-speaks-in-dubai-on-diplomacy-efforts-concerning-the-israel-hamas-war-transcript",
  "topics": "Foreign Policy, Social Justice",
  "num_segments": 17,
  "content": [
    {
      "text": "Today I had productive meetings with the leaders of the United Arab Emirates, Jordan, and Egypt, and I spoke to the Emir of Qatar to discuss developments in Gaza and to accelerate planning for the day after the fighting. I'll get to those conversations in a moment, but first, let's take a step back. () On October 7th, Hamas terrorists launched a terrorist attack that killed 1,200 innocent people in Israel, including 35 Americans. It was a brutal and horrific massacre. Babies and Holocaust survivors were killed."
    },
    {
      "text": "Young people who were simply attending a concert were shot dead. 240 hostages were taken from their homes. And over then, the past eight weeks, President Biden and I have been clear, Israel has a right to defend itself and we will remain steadfast in that conviction. We are working with Israel and our partners in the region to secure the release of all the hostages, which includes Americans. () The recent pause in the fighting proved effective."
    },
    {
      "text": "More than 100 hostages were reunited with their families during this time, including two more Americans and humanitarian aid surged into Gaza. As I told the families of American hostages when I met with them, we will not waver in our commitment to bring them home. () Let me be also very clear, as I've said before, we cannot conflate Hamas with the Palestinian people. Hamas is a brutal terrorist organization. Hamas has vowed to repeat October y until Israel is annihilated."
    },
    {
      "text": "No nation could possibly live with such danger, which is why we support Israel's legitimate military objectives to eliminate the threat of Hamas. President Biden and I have also been clear with the Israeli government in public and in private many times. As Israel defends itself, it matters how. The United States is unequivocal. International humanitarian law must be respected. Too many innocent Palestinians have been killed."
    },
    {
      "text": "Frankly, the scale of civilian suffering and the images and videos coming from Gaza are devastating. () I have spoken with members of the Palestinian, Arab and Muslim communities of America, including those who have lost loved ones in Gaza and American citizens who were injured and evacuated from Gaza. It is truly heartbreaking. As Israel pursues its military objectives in Gaza, we believe Israel must do more to protect innocent civilians."
    },
    {
      "text": "() So we all want this conflict to end as soon as possible and to ensure Israel's security and ensure security for the Palestinian people. We must accelerate efforts to build an enduring peace. And that begins with planning for what happens the day after the fighting ends. Shortly after October 7th, President Biden and I began discussions with our national security team about post-conflict Gaza."
    },
    {
      "text": "We have begun to engage partners in the region and around the world in these conversations, and this has been a key priority over the last eight weeks. () Five principles guide our approach for post-conflict Gaza, no forcible displacement, no reoccupation, no siege or blockade, no reduction in territory, and no use of Gaza as a platform for terrorism. We want to see a unified Gaza and West Bank under the Palestinian authority, and Palestinian voices and aspirations must be at the center of this work."
    },
    {
      "text": "() At a certain point, the intense fighting and the phase of fighting will end, and we will begin implementing our plans for the day after. To develop these plans then, we will continue to work with both Israelis and Palestinians. But there must also be regional consensus and support. To that end, I've had a number of in-depth conversations with Arab leaders here in Dubai. Specifically, I proposed three areas of focus. One, reconstruction."
    },
    {
      "text": "The international community must dedicate significant resources to support short and long-term recovery in Gaza. For example, rebuilding hospitals and housing, restoring electricity and clean water, and ensuring that bakeries can reopen and be restocked. () Second, security. The Palestinian authority security forces must be strengthened to eventually assume security responsibilities in Gaza."
    },
    {
      "text": "Until then, there must be security arrangements that are acceptable to Israel, the people of Gaza, the Palestinian authority, and the international partners. And to reiterate, and this is very important, terrorists will not be permitted to continue to threaten Israel. () Third, governance. The Palestinian authority must be revitalized, driven by the will of the Palestinian people, which will allow them to benefit from the rule of law and a transparent, responsive government."
    },
    {
      "text": "Eventually, this revitalized PA must have the capacity to govern Gaza as well as the West Bank. We believe progress on these three areas, reconstruction, security, and governance, will improve the lives and livelihoods of the Palestinian people. Further, we have been clear the Palestinians have a right to dignity and self-determination, and Israelis and Palestinians must enjoy equal measures of prosperity and freedom. They also deserve, all deserve, a sense of safety and security."
    },
    {
      "text": "And a two-state solution then remains the best path we believe toward a durable peace. The President and I are committed to that goal. () In conclusion, when this conflict ends, Hamas cannot control Gaza and Israel must be secure. Palestinians need a hopeful political horizon, economic opportunity and freedom. And the region more broadly must be integrated and prosperous. And we must work toward that vision. So with that, I'll take your questions."
    },
    {
      "text": "Speaker 2 So I'm not going to reveal the details of the conversation, but I did speak with the Amir. And the work and their commitment to this work is ongoing, as is ours. Our work is ongoing to support some ability to reopen the pause and to have a deal going forward where there will be a pause so that we can get hostages out and get aid in. Speaker 2 Of course. Speaker 3 Well, let me just say that the conversations that we have were very productive."
    },
    {
      "text": "And there is, I believe, a mutual desire to figure out how we are going to approach and think about the day after in a way that brings stability and peace to this region and reinforces, as I said earlier, Israel's security, the sense of security and safety for both the Palestinians and Israelis, doing what is necessary to ensure there are equal measures of prosperity and freedom and security for the Palestinian people and for Israel."
    },
    {
      "text": "Speaker 3 Well, as I said, we have to revitalize the Palestinian authority, which means giving the support that is necessary for good governance, understanding that on the issues that must be resolved as we think of a plan for the day after, it is about good governance, which will bring transparency and accountability to the people of Gaza and the West Bank. It's also about what we need to do to recognize there must be some plan for security for the region."
    },
    {
      "text": "And I suspect as a plan develops, it will take into account interim and then longer-term. And finally, what we must do in terms of rebuilding Gaza and a commitment to that. Speaker 3 What is the question exactly? Speaker 3 We have not waited on that. Speaker 4 I do believe that they have listened."
    },
    {
      "text": "Speaker 4 I don't have the details to tell you exactly who was killed, but I will say this, we have been very clear about where we stand on this, which is innocent civilian lives should not be intentionally targeted and that Israel must do more to protect innocent life in Gaza and innocent civilians in Gaza. And we've been very clear about that and we continue to make that point, not only privately, but publicly as well as you see. Speaker 2 Okay. Speaker 2 Thank you. Speaker 5 Okay, thanks guys. Speaker 2"
    }
  ]
}