{
  "speech_id": "028",
  "speaker": "Harris",
  "title": "Vice President Harris and President Zelenskyy Speak to the Press Transcript",
  "date": "20240218",
  "url": "https://www.rev.com/blog/transcripts/vice-president-harris-and-president-zelenskyy-speak-to-the-press-transcript",
  "topics": "Foreign Policy",
  "num_segments": 7,
  "content": [
    {
      "text": "Thank you. We'll take questions now from the press. Cleve Wootson of the Washington Post. Hello. The interpretation happening. No, I got it. I'll start. As I made very clear yesterday, the issue of supporting Ukraine and where the United States stands on that issue is integral to who we are as the United States of America. We have historically and currently stand as a global leader on certain fundamental democratic principles, including the principle of sovereignty and territorial integrity."
    },
    {
      "text": "We stand with our friends. Our membership in NATO has been a role that is about a commitment to our allies based on shared principles of what it means to abide by democratic principles that have historically insured stability and security for those participating in this partnership. As I made very clear yesterday, when we talk about the role of America as it relates to our support for Ukraine, we must be unwavering and we cannot play political games."
    },
    {
      "text": "Political gamesmanship has no role to play in what is fundamentally about the significance of standing with an ally as it endures an unprovoked aggression. () Politics should play no role in standing for the fact that Vladimir Putin through his leadership of Russia, has shown himself to be fundamentally hostile to democratic principles. Not to mention what we learned about in the last 24 hours in terms of the killing of Navalny. So this is about where we stand as a nation."
    },
    {
      "text": "And as it relates to the supplemental, we have been clear, the President and I both in private conversations with members of the United States Congress and in public, we are clear and certain that for the majority in both the United States Senate and the United States House of Representative, there is bipartisan support for this approach. There is bipartisan support for what America is and what we stand for. And we are unwavering and that has nothing to do with an election cycle."
    },
    {
      "text": "It has to do with who we are and what kind of country we want to be, one that stands with our friends. President Zelenskyy? President Zelenskyy If you want to. There's only plan A, which is to ensure that Ukraine receives what it needs. I will emphasize that an indication of where we can and frankly must be is that there is bipartisan support in both of our houses of Congress on the Senate side and the House of Representatives."
    },
    {
      "text": "And it is my full belief that were the supplemental packages security package to make it to the floor of the House of Representatives that it would actually pass. () I also believe that there is consensus across party lines in the United States Congress that recognizes the brutal nature of Moscow's aggression and that there must be a response that includes standing by our friends and supporting those who fight against that aggression."
    },
    {
      "text": "And I do believe there is consensus within the United States Congress that the American leadership, elected leaders in the United States Congress must be unified in their opposition to Russia's aggression as indicated over the course of the last 2+ years and the last 24 hours. And I do believe also there is consensus within the United States Congress that we must use everything that is available to us to support Ukraine in its fight to become and to maintain itself as an independent and democratic nation."
    }
  ]
}