{
  "speech_id": "029",
  "title": "Vice President Harris Delivers Remarks at the 2023 Munich Security Conference Transcript",
  "date": "20230219",
  "url": "https://www.rev.com/blog/transcripts/vice-president-harris-delivers-remarks-at-the-2023-munich-security-conference-transcript",
  "topics": "Foreign Policy, Social Justice",
  "num_segments": 24,
  "content": [
    {
      "text": "Thank you. Thank you, Christoph. Thank you, Christoph, thank you. Well, it is my honor to be back at the Munich Security Conference. As many of us remember last year on this stage, I warned of the imminent invasion of Ukraine by Russia. And let us all recall, many at the time wondered how we would all respond. Many wondered, could Russia be stopped? Would NATO come together? Would NATO break apart? And would Ukraine be prepared? Colleagues, today, a year later, we know. Kiev is still standing. Russia is weakened."
    },
    {
      "text": "The Transatlantic Alliance is stronger than ever. And most importantly, the spirit of the Ukrainian people endures. ()\nAnd under Joe Biden, President of the United States, our country has demonstrated decisive leadership. As President Biden often says, \"The United States will support Ukraine for as long as it takes. We will not waiver.\" And today, at this Munich Security Conference, I will then describe what we all continue to have at stake."
    },
    {
      "text": "The moral interest, the strategic interest, and the reason Ukraine matters for the people of America, for the people of Europe, and for people around the world. ()\nFirst, from the starting days of this unprovoked war, we have witnessed Russian forces engage in horrendous atrocities and war crimes. Their actions are an assault on our common values, an attack on our common humanity. And let us be clear, Russian forces have pursued a widespread and systemic attack against a civilian population."
    },
    {
      "text": "Gruesome acts of murder, torture, rape, and deportation. Execution style, killings, beatings, and electrocution. Russian authorities have forcibly deported hundreds of thousands of people from Ukraine to Russia, including children. They have cruelly separated children from their families. And we've all seen the images of the theater in Mariupol where hundreds of people were killed."
    },
    {
      "text": "Think of the image of the pregnant mother who was killed following a strike at a maternity hospital where she was preparing to give birth. Think of the images of Bucha civilians shot in cold blood, their bodies left in the street.The jarring photograph of the man who was riding his bike. Think of the four-year-old girl who the United Nations recently reported was sexually assaulted by a Russian soldier, a four-year-old child. Barbaric and inhumane."
    },
    {
      "text": "()\nLong before I was Vice President of the United States, I spent the majority of my career as a prosecutor, beginning as a young lawyer in the courtroom and later running the California Department of Justice. I know firsthand the importance of gathering facts and holding them up against the law. In the case of Russia's actions in Ukraine, we have examined the evidence. We know the legal standards. And there is no doubt these are crimes against humanity."
    },
    {
      "text": "()\nThe United States has formally determined that Russia has committed crimes against humanity. And I say to all of those who have perpetrated these crimes and to their superiors who are complicit in these crimes, you will be held to account. In the face of these indisputable facts, to all of us here in Munich, let us renew our commitment to accountability. Let us renew our commitment to the rule of law."
    },
    {
      "text": "As for the United States, we will continue to support the judicial process in Ukraine and international investigations because justice must be served. Let us all agree on behalf of all the victims, both known and unknown, justice must be served. Such is our moral interest. Thank you, Christoph. As I said, I believe and I believe the American people understand the stakes, and the stakes being our moral interest and our strategic interest."
    },
    {
      "text": "I will tell you, I travel around the United States and I have seen the Ukrainian flag fly in places most of you have probably never heard of in the United States. In storefronts, in front of homes, Americans proudly wearing the colors of Ukraine. The American people are aware of the images of Busha. The American people take great pride in a fight for independence, that being part of the foundation of our nation, and in our principles and values."
    },
    {
      "text": "I think about where the United States is going on this issue based on the track record of where we've been. You only have to look at where we were a year ago and where we are today in terms of the contributions and resources that America has put into, everything from ammunition to artillery, to air defense; from stingers to Abram Tanks, HIMARS, Javelins. I look at it in the context of the United States Congress, which is here in force."
    },
    {
      "text": "I'm told it is the largest delegation, bipartisan and bicameral of the United States Congress to this meeting, to this Munich Security Conference. ()\nAnd how forward the United States Congress in a bipartisan way has been in terms of the track record of our support just over the last year. Not to mention, it's a technical term called an omnibus in our budgetary processes. But at the end of last year, a dedicating another $45 billion for this upcoming year to support Ukraine."
    },
    {
      "text": "()\nOur priority is to ensure Ukraine's strength on the battlefield, and that is our commitment. And it is a commitment not only to the people of Ukraine, but it is a commitment to our values and the principles we hold dear as a nation. And I cannot be here without also mentioning the importance of the alliance, Europe and what it has done. Our host Germany, I was with Chancellor Scholz yesterday."
    },
    {
      "text": "What we collectively have done, we are not only joined, I think, by our values and our understanding of the stakes and what is at stake in terms of a moral and a strategic interest, we have been great colleagues in terms of pooling our resources, coordinating our resources in a way that, I believe, will give Ukraine this best support they need to fight this fight. Yes, the Inflation Reduction Act. Yeah. I'm very happy that you chose to raise this topic."
    },
    {
      "text": "Let me start with the spirit and the intent behind the Inflation Reduction Act. One very important area of focus for us has been to address and take our responsibility for what we must do in terms of the climate crisis, which of course is global in nature. And in fact our friends in Europe have been asking for years that we would actually step up and do more."
    },
    {
      "text": "So, under President Biden's leadership, we are proud that the United States has invested an historic amount in what we must do to take on our role of responsibility in the climate crisis. And by that I mean we have, with the support of Congress, dedicated $370 billion to this effort."
    },
    {
      "text": "()\nWhen I think of the impact on our friends and the interconnection and interdependence, if you will, between whatever we do in each of or any of our nations and the effect on the others, we think of this investment as having a global impact in predominantly two ways. One, the United States, I say this sadly, is one of the biggest emitters in the world."
    },
    {
      "text": "And we need to reduce our emissions not only for the sake of the health and wellbeing of the people of our own country, but as we know the people of the world are impacted. So, this is an historic and very significant investment to actually turn the tide on that. And as you know, as many of our European friends and others around the globe have done, we have set strict standards for ourselves based on timelines. So, there is that, which is the goal of reducing emissions."
    },
    {
      "text": "()\nThe other piece of it is, we are very excited about thinking about the investment that we are making to spur innovation. We are entering a moment where we are creating a new economy, a clean energy economy. And if you think of us as being an investor, if you will, In creating incentives for the private sector, for scientists and academics, to research, develop, and innovate around a clean energy economy. This investment that we are making will do that and have global impact. So that is how we think of it."
    },
    {
      "text": "But to your point, there are also issues that we need to address and do that in close consultation with our friends around the world. We have created a task force, the United States-EU Task Force, closely coordinating and in consultation around working out some of the specific concerns. Those conversations are continuing. I met with President Macron yesterday and Chancellor Scholz, and I think we are seeing some progress there and the work will continue. Oh, we have to treat them as partners."
    },
    {
      "text": "You and I talked about this briefly as we were walking in, and I thank you and I will thank you in front of the friends for bringing this issue to the stage and making it a part of the agenda for this conference. I agree it's an important subject. ()\nI have met with many African leaders, leaders in the Caribbean, CARICOM, and Southeast Asia. What I believe is that they are right to want to make sure their voices are heard on every level on this topic, including the impact to their nations."
    },
    {
      "text": "You look at, for example, African nations and what Russia's aggression in Ukraine has meant in terms of food insecurity, energy insecurity. These are nations, as we know, that are great importers of food and energy. So when the supply decreases, it has a significant impact on their nations. ()\nSo I think it is important for us to recognize the impact that Russia's war has had on these nations."
    },
    {
      "text": "I think of it in the context of what we must do to also, on the previous discussion, consider the impact of the climate crisis on those nations. We are some of the biggest emitters, and the impacts are clear. ()\nI meet with CARICOM nations, so island nations in the Caribbean, and they tell me about how they're seeing land erosion, how they are seeing, through the extreme climate occurrences, a reduction in tourism and what that means in terms of a depletion of their GDP."
    },
    {
      "text": "()\nAnd so, these are issues that we must keep in mind when we have this discussion with them as partners around what the solutions look like, including standing in a unified way on these principles of sovereignty and territorial integrity. My friend, the president of Ghana, I believe, spoke yesterday, and I think he captured it well when ..."
    },
    {
      "text": "I'm going to paraphrase, but my understanding is he said that we need to dispense with this paradigm that is about us versus them, and think differently about the relationship that we have. For all of those reasons, I thank you for raising this. I think it is worthy of the type of elevation and the discussion that you are giving it. Thank you."
    }
  ]
}