{
  "speech_id": "030",
  "speaker": "Harris",
  "title": "Joe Biden & Kamala Harris Speak at State Department Transcript February 4",
  "date": "20210204",
  "url": "https://www.rev.com/blog/transcripts/joe-biden-kamala-harris-speak-at-state-department-transcript-february-4",
  "topics": "Foreign Policy, Social Justice, Climate, Government Policy, Economy",
  "num_segments": 4,
  "content": [
    {
      "text": "Thank you, Secretary Blinken. It was my great honor to swear you in last Wednesday. And thank you for the warm welcome, everyone, for me and the president. We are here as one of our highest priorities to thank you for your dedication to our country and the work you have tirelessly been doing. And when I swore in the secretary, you may know that he placed his hand on a copy of the very document that we all swore to protect and defend. And that, of course, is the United States Constitution."
    },
    {
      "text": "And it was a simple, and it is a sacred oath. One many of you, the dedicated staff of the State Department, have taken. And we know that we cannot take those words for granted, to support and defend. Every day, we have to breathe new life into them. That is our duty. As difficult as these past years have been, you have remained committed to democracy, to human rights, and the rule of law. On behalf of our nation, we thank you for your service and for your sacrifice."
    },
    {
      "text": "Today, we are here in person to tell you that we are committed to upholding the highest standards of integrity and accountability, inclusivity, and diplomacy. On the global stage, as a partner and a leader, this is the foundation on which we stand. We build on that foundation, both by what we do abroad, restoring our alliances and supporting international institutions, and also by what we do within our own shores. Our foreign and domestic imperatives are intrinsically linked."
    },
    {
      "text": "Everything you do, every policy you advance, every partnership you forge makes a difference in the lives of everyday Americans. At the same time, our strength in the world depends on your strength and our strength here at home. And that is why we are working to reinforce our democracy, to rescue our nation from this pandemic, to rebuild our economy, to confront racial injustice, and to combat climate change. The world is counting on us."
    }
  ]
}