{
  "speech_id": "031",
  "title": "Kamala Harris & Janet Yellen Meeting with Black Chambers of Congress Transcript February 5",
  "date": "20210205",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-janet-yellen-meeting-with-black-chambers-of-congress-transcript-february-5",
  "topics": "Economy, Healthcare, Social Justice",
  "num_segments": 48,
  "content": [
    {
      "text": "You can speak into that camera. Thank you, Secretary Yellen, and greetings to everyone. I'm looking on this big screen at all of you. I see so many friends, and I see a screen full of national leaders. And so I want to thank you all for the time that you are giving to this conversation. Ron Busby, I thank you for bringing us together, my Oakland brother, but I just want to thank everyone."
    },
    {
      "text": "And let me just say, the secretary mentioned the conversation that she and I had when I swore her in, but we had a conversation before that, Madam Secretary, and it was during the time, it was before she was actually nominated and the process was in place. And we had a conversation about how she was thinking of the job. And she's the one who brought up racial disparities with me."
    },
    {
      "text": "And so I can tell you that we are very fortunate with all that she brings to this position in terms of her experience, her expertise, her knowledge, her so profoundly respected knowledge around how our economy works and how we can make it work. We're very fortunate to have you serve as the secretary, and we thank you for this commitment that you have made to our country. So thank you all. And this is a conversation we are going to be having a lot. Yes, this is February."
    },
    {
      "text": "And you know, frankly, when I think about who you are and your members, in terms of the chambers, who they are, we're talking, yes, about business leaders, but what we also know is that those business leaders are often also community leaders, civic leaders, and opinion leaders. And so the role of responsibility is transcendent in terms of the impact it has on the community."
    },
    {
      "text": "The role and the responsibility includes being part of the fabric of the community, contributing to the culture of the community, contributing to the growth and the pride of the community in which you work and where you are established. And so that is the lens through which the president and I and the secretary are thinking about your role of leadership, and the partnership that we have, and we'll continue to grow. But yeah, I did basically a rough assessment."
    },
    {
      "text": "And when we look at our Black businesses in our country, they range. We are talking about software companies. We're talking about healthcare companies. Yes, we're also talking about the beauty shop and the barbershop, but we are also talking about healthcare. We are also talking about childcare. We're also talking about manufacturing, because Black businesses, of course, are engaged in the business of keeping America running. And so in every sector, these businesses are present."
    },
    {
      "text": "And that is how we think of, then, the role that you play, but also our responsibility to support you in all of those sectors. And during this pandemic, as the secretary has said, this has been rough. We have all seen estimates that as many as 40 to 50% of Black businesses have closed, perhaps permanently. Nationally, we know small businesses, of which the majority of Black businesses are, employ 50% of America's workforce, either because that worker is a small business owner or works for a small business."
    },
    {
      "text": "So when we're talking about the impact on the overall economy and country, it's profound, and our research also has shown that in the pandemic, and this is something that is a lived experience for many of you and your members, the PPP program was not accessible to so many of our Black owned businesses. And it had to do with the multiple... ... of our black owned businesses. And it had to do with the multitude of issues, which included that those businesses were not necessarily engaged with the big banks."
    },
    {
      "text": "Didn't necessarily have the familiar or the consistent relationship, if not any relationship, with a banker who could then call somebody up and say, \"Ms. Smith, this thing is coming down and this is how you apply for it.\" But what we know is those relationships do exist. And so for whom those relationships are intact, they got the benefit. And for whom those relationships are not intact, they did not get the benefit of the PPP."
    },
    {
      "text": "So the president and I together with the secretary have been looking at how we can do better, knowing the mistakes that were made and improve on what we need to do to bring relief to the businesses of our country, to help our economy grow. So we are thinking of it in two ways, as a general matter. There is the piece of it that is about what we need to do to get control of the public health component crisis of the pandemic. And so I'm going to talk for a minute about vaccines."
    },
    {
      "text": "And it is about getting our businesses back up and running. Understanding those two points are inextricably linked. That one of the reasons we got into the catastrophe, the most recent catastrophe, I'm going to put aside preexisting issues, but the most recent catastrophe around our black businesses is because also we need to get control of the pandemic. So on the subject of the pandemic, we have crafted and the president has proposed the American Rescue Plan."
    },
    {
      "text": "And a large part of that plan is focused on vaccinations. And so for example, we are putting in $400 billion to have a vaccine distribution plan that is going to include, for example, in Oakland, California, at Oakland Coliseum and in Los Angeles, California at the Cal State LA, the first federally supported along with the state, vaccine distribution center. We're very excited about that. That's going to be up and running, we believe, by February 15th."
    },
    {
      "text": "And this is the first time that the federal government has come in, sadly, since the pandemic started to support states to do the vaccine distribution piece. But that's going to be up and running. So part of what we're going to ask is for your assistance and support for that component, not only of the American Rescue Plan, but what we need to do to actually make it work, meaning getting folks to go and get vaccinated."
    },
    {
      "text": "Because it's good to have a vaccine, but if folks don't get vaccinated, it won't save the lives we intend to save. We also have a part that is basically about bringing the economy back to full employment and doing that in a way that we understand that black workers see the biggest wage gains when the economy is at full employment. So the way we are going to do that is, yes, by the vaccinations, but also we need to reopen schools and reopen them safely. So that is part of our American Rescue Plan."
    },
    {
      "text": "Also, we made a commitment for $2,000 of relief to families. There was a down payment on that in the previous bill of $600 and we intend, with this next bill, the American Rescue Plan, to have $1,400 checks going out to those folks who are most in need by way of relief. To help them get through this moment of crisis so that at the end of it, they can get back up and recover in the way that we intend."
    },
    {
      "text": "And also more specifically for our businesses, we are also creating a specific package of relief that is about $15 billion. This did not exist in previous bills, in the relief bills. $15 billion going to grant programs, not loans, grants, targeted at our smallest businesses of which the majority of black businesses are and targeted at our black and brown and minority owned businesses."
    },
    {
      "text": "So this is some of the work we are doing, in addition to, as the secretary said, what we are doing around the CDFIs, the community development financial institutions. And as a point of personal pride, that was one of the last things I worked on when I was in the Senate together with Senator Cory Booker, Senator Mark Warner and others."
    },
    {
      "text": "And the idea is basically to put more capital, to infuse more resources into our community banks, knowing that those are the ones that have the relationships with our businesses and are best equipped to support them, not only by way of grants and loans, but also by way of helping them grow their businesses, helping and surrounding them with the infrastructure of skills and resources they need to sustain a business. So these are some of the areas of focus."
    },
    {
      "text": "And my last point would be this, back in May I actually spoke with the California Black Chambers about the Paycheck Protection Program and the concern about the existing lines at lending banks and folks getting turned away. And so let us just say that we believe and the president believes this very strongly. If relief is not available to everyone who needs it, then we are not doing enough."
    },
    {
      "text": "And so part of the spirit behind the American Rescue Plan is to broaden the folks who are actually receiving the relief they need. And with that, I look forward to our conversation. Again, I want to thank all of you for what you do every day. And we look forward to this partnership as we go forward. Thank you, Cathy. And it's so good to see you. It is so good to see you. So I will tell you, the president, and he and I have been spending a lot of time together before we got sworn in on January 20th and since."
    },
    {
      "text": "And I will tell you, he has such a deep commitment to equity. Really, he brings it up all the time. He challenges the team to make sure that we are keeping in mind that there's a big difference between equality and equity, right? Which is that, well, everyone can get an equal amount, but if you don't start out in the same place, you don't end up in the same place. Equity suggests that we take into account that people start out in different places and we want everyone to have equal access to opportunity."
    },
    {
      "text": "So this is a very big principle as it relates to this issue and so many others in the way that the president thinks, specifically. So $400 billion is directed, in our American Rescue Plan, to stop the pandemic and in particular around the health piece. And so again, I'll say that the piece that's about the vaccination centers and the federal vaccination centers is a very big deal. We are putting that money into these vaccination centers and mobile vaccination sites."
    },
    {
      "text": "Because one of the things that we realized, and we all know this, is that when we're talking about folks who live in rural communities, when we're talking about folks who don't have access to transportation, they don't have a car, they should not be left out. And so we are creating these federally supported large vaccination sites to places like the Oakland Coliseum where people know how to get there and there are good transit routes to get there, public transit routes, but also mobile vaccine centers."
    },
    {
      "text": "And that's going to have a huge impact on, again, equitable distribution of the vaccine, ensuring that black folks, brown folks, those who have been left out and have been disproportionately contracting COVID and dying from it, that they have equal access to the help that they need to save lives and to save lives of their families and their communities. We're also investing over $1 trillion of the American Rescue Plan in families."
    },
    {
      "text": "And so that's going to be about what I said that the commitment was the $2,000, the 600 already happened, the $1,400 checks. It's also about an extension of unemployment insurance, so that we're going to extend the additional $400 a month. And here's the thing that you probably know, between November and December of 2020, so just a couple months ago, 82,000 black workers lost their jobs. 82,000. Part of the assistance for families is going to be about an extension of the moratoriums on evictions, right?"
    },
    {
      "text": "And what we know is that almost 10% of black renters in the United States said they would be evicted in March. So this is a huge piece of it because, of course, if we're talking about business owners or the customers of those businesses and in those communities, the first order of business is people need to have a roof over their head if they're going to be able to be productive at all. So this is a big piece. Money is going for the schools to reopen."
    },
    {
      "text": "It's also about making sure that we have the resources in our public schools around plexiglass and those things that are needed in the infrastructure, the physical infrastructure of the school to ensure that the students and the teachers and all staff are safe. And then we are also extending the EITC, the child tax credit. And that's something that I'm really excited about. And that, Cathy, when we get that part of this passed in our bill, will lift up half of America's children who are in poverty."
    },
    {
      "text": "This child tax credit, half, can you imagine half of the children who are living in poverty right now will be lifted out of poverty by this one piece. It's so important as you can imagine. And then the $15 billion in grants as opposed to loans for small businesses. So those are some of the things that we'll do. And please, Secretary Yellen. Ron, hold on. One more thing, including by the way- Brian, hold on. One more thing... Including by the way. As you can tell, we're very excited about this plan."
    },
    {
      "text": "There's so there's a lot of good stuff in it, including federal support for behavioral health. Right? One of the things we've not been talking enough about in this pandemic has been the impact on mental health. And the way the president and I, and all of us, think about healthcare is that health care isn't just about the body from the neck down. It's also about the body from the neck up. And there's been a lot of undiagnosed and untreated trauma, a lot of depression and all of those things."
    },
    {
      "text": "And in particular, when we're talking about minority communities, Black and Brown communities. So there is a significant component of what we're doing in this plan that is also about mental health and behavioral health and giving support to those services. Correct. So, I'll start. And then I'm going to... Greetings Mr. Coleman and thank you to everyone in Atlanta and Georgia. Yes, Mr. Busby, I was there voting at five o'clock this morning."
    },
    {
      "text": "No, but let me tell you, it was it enjoyable to be there and I got some time with the two new senators from Georgia while I was there to check on them. So I had a little bit of time with Reverend Warnock, I had a little bit of time with Senator Ossoff. And so thank you for sending them to the United States Senate."
    },
    {
      "text": "I will say that, first, it's really important to recognize the advocacy that so many of our business leaders, you and the Black chambers, did around the need to understand that in addition to the PPP, we needed to have grants. And your advocacy in that way had a lot of influence in this new component, this new approach, which is in the American Rescue Plan to put $15 billion into the grants."
    },
    {
      "text": "Which are obviously, they don't need to be paid back, and people need to qualify for them, but it really is about creating support for communities that have been devastated and so hard hit. And so the plan was structured in a way that it's, again, it's about equity. And also understanding that in many ways the PPP was structured and certainly was implemented in a way that helped big businesses, but our smaller businesses also need help."
    },
    {
      "text": "Black owned businesses, the average Black owned business has 10 or fewer employees. Right? And so we recognize that's a different dynamic. And the grant program is also about not only saving businesses that are on the edge through no fault of their own, but giving them the support to not only survive but thrive. And I'll pass it to the secretary. Thank you, Ms. Garrett. So first of all, from the December bill... We're going to actually give you the website and I'm looking for it right now. I think it's sba."
    },
    {
      "text": "gov is the website? But we want to make sure that people know to go there, to apply for what currently exists in the PPP program. But we have to make it better in a number of ways. One, we intend to support the SBA for distribution of the support for the small businesses by having navigators. So that's one of the things that did not exist before. Right? And having navigators who help our small businesses."
    },
    {
      "text": "So, as the secretary said, they don't have to fill out 50 page reports that don't apply to their business model. I'll never forget, a small business in California reached out to my office at the beginning of the pandemic and she said, \"Look, they want me to fill out this form. And they want me to tell them about my,\" she has a salon."
    },
    {
      "text": "She said, \"They want me to give them all the names of my vendors.\" She said, \"Well, I go to the beauty supply store to get all my stuff.\" And so we need to understand who the businesses are and their business model, and then make it accessible to them because they are no less a small business owner than anybody else. Right? And so that's where the navigator comes into play. And then also helping the SBA with what they need to do more to provide technical assistance to our small businesses."
    },
    {
      "text": "And not only technical assistance to help people take the benefit of these relief plans, but technical assistance. Because now in the midst of this crisis, one of the opportunities we have seen and small businesses have seen is how they can adopt technology to talk with their clients and to move their products. Right?"
    },
    {
      "text": "And so let's seed the opportunity presented in this moment to give them even more technical assistance, to think about how they can grow their business now in a way that uses technology to perform their business. And it is one of our highest priorities, all of that being said, to fix the assistance piece of the PPP program and I'll pass it to the secretary. That's great. That's an excellent point, Mr. O'Neal, and thank you for your leadership. So, we need to get this rescue plan passed."
    },
    {
      "text": "And the reason I was in the Senate now as the President of the Senate to break the tie, was so we can get that moving along to get that relief- ... so we can get that moving along to get that relief to families and to small businesses as quickly as possible to deal with the immediate issues; including what cannot be overlooked, even since December, when the last package was passed, almost 100,000 people have died. Right?"
    },
    {
      "text": "When we think about this moment we're in, the way I think of it, and you'll appreciate this from Texas, I think of it is like a hurricane, right? Sometimes we tend to think, \"Okay, we now need to clean up after the hurricane.\" No, we're still in the hurricane, and it's picking up speed. Right? That as much as anything is the motivation and the spirit behind the rescue plan, which is people are hurting right now."
    },
    {
      "text": "Back to the housing piece, back to the child poverty piece, back to the piece we're seeing all over the country, including as you know in Texas where people are in lines in their car, standing in lines for hours and hours because their families are hungry. There is that, but one of the things that the president is very committed to is a very deep part of his commitment to the future of our country is an investment in infrastructure and the creation of jobs."
    },
    {
      "text": "Look to that in the horizon, in the not too far distant future. Right? How does that relate to small businesses? Well, in so many ways. I mean, again, understanding that let's not engage in any kind of myths about who Black businesses are. Black businesses are every business, right? Including manufacturing, including contractors and construction companies, including all of those businesses that will benefit from an investment in America's infrastructure, be that roads or bridges."
    },
    {
      "text": "But also one of the pieces that we are committed to is broadband now, which relates to everything from not only the disparities along racial lines in rural America and urban America, around our children having access to broadband and the internet when they're missing critical stages of their education, but also for our, again, for our businesses, because those businesses who do not have access to broadband cannot thrive in this environment, in this year of our Lord, 2021, without that infrastructure in place, and that is part of our great commitment."
    },
    {
      "text": "These are the kinds of things that are on the horizon, but really, infrastructure, infrastructure, jobs, jobs, jobs. In that way, our businesses will benefit. I think, in a very significant way. Madame Secretary, if you want to add anything? It looks like you're closing out, but I have one more thing. Vaccines. Help us get the word out. I'm going to just end where we started about you are opinion leaders, you are civic leaders, you are community leaders. Our communities are dying at disproportionately high rates."
    },
    {
      "text": "I got my second vaccine just last week. We've got to remind people that the vaccines are safe, that they will save lives. We've got to remind folk there's a Black woman, a doctor, who helped create the vaccine that is now being used. I urge you to please get the vaccine when it's your turn, but also to encourage your members, their employees to get vaccinated. If we're going to build back up our economy, we've got to get control of this."
    },
    {
      "text": "We really want to make sure that people know they have within their power the ability to save their lives, the lives of their family members, their community, but they got to get vaccinated. Like I said, in California, throughout the country we're opening up these federal, large vaccination sites. We will follow up by getting each of you information about how you can let the folks on your list know where they can find information about where they can get vaccinated, but please help us with that."
    },
    {
      "text": "We need your help, our community and our nation needs your help with that in addition to everything else you do. With that, again, thank you. And, please, if you want to close us out. That's right. Thank you. Thank you all. Thank you. Speaker 1: () [inaudible :47]. Thank you. Speaker 1: () My pleasure. Thank you. We're just going to get on the road with you and I. Oh right, you're here. Speaker 2: () I'm here. Soon. Thank you all. Speaker 2: () Thank you. Speaker 4: () Thank you."
    }
  ]
}