{
  "speech_id": "036",
  "title": "President Biden and Vice President Harris Deliver Remarks at Celebration of the Safer Community Act 7/11/22",
  "date": "20220712",
  "url": "https://www.rev.com/blog/transcripts/president-biden-and-vice-president-harris-deliver-remarks-at-celebration-of-the-safer-community-act-7-11-22",
  "topics": "Gun Control, Government Policy",
  "num_segments": 7,
  "content": [
    {
      "text": "Good morning. Thank you, Dr. Guerrero for the introduction and for your courage and your compassion. You have been such a source of strength to the families of Vivaldi. And I know that is not without personal sacrifice. Thank you for your leadership. To our President, Joe Biden members of Congress, members of our administration, friends and fellow Americans, today is indeed an historic day. For 30 years, our nation has failed to pass meaningful gun violence legislation."
    },
    {
      "text": "For my whole career, addressing gun violence has been one of my top priorities, first as a courtroom prosecutor, then as district attorney of San Francisco, where we created a gun specialist unit to go after violent offenders. Then of course, as attorney general, where our office worked closely with the California bureau of firearms to investigate and seize firearms from those who unlawfully possess them."
    },
    {
      "text": "As a United States Senator, together with my former colleagues in the Senate, we supported various pieces of legislation to address this crisis. So I knew, and I know now, as so many of you do, that we are overdue in getting this work done, and I know it will save lives. Together, we gather with many of the leaders who made this law a reality."
    },
    {
      "text": "To the friends and family members of the victims of gun violence, in the face of so much pain, you have shown incredible strength, and it is a profound honor to stand with you today. To the members of Congress who are here with us in the face of so much pessimism, you passed a bipartisan law, you worked across the aisle and the product of that work will make our communities safer. And that deserves applause."
    },
    {
      "text": "But as all of us know gathered here today, we would not be here, were it not for the vision, the courage, the unwavering determination of one particular individual, Joe Biden. Our president Joe Biden has fought for decades to end the terror of gun violence. He has taken on the gun lobby and won. As a Senator, Joe helped pass... Then I would've called him Joe, now I call him Mr. President..."
    },
    {
      "text": "The Brady Handgun Violence Prevention Act, which as we know is a background check system that has prevented more than 3 million firearms from falling into dangerous hands. And he passed a 10 year ban on assault weapons in high capacity magazines. As vice president, Joe Biden led the Obama/Biden administration's efforts to reduce gun violence. President Joe Biden knows the tremendous pain of gun violence. He has seen it up close. He has held hands with parents. He has seen it up close."
    },
    {
      "text": "He has held hands with parents who lost children and with children who lost parents. President Biden knows the urgency of this fight and he will continue to do all in his power to protect the people of our nation. And now it is my honor to welcome Garnell Whitfield Jr., who I spent time with, and his family, mourning the loss of his beloved mother. Mr. Whitfield. Garnell Whitfield Jr.: () Thank you. Good morning. Good morning. We're going to go this way."
    }
  ]
}