{
  "speech_id": "037",
  "speaker": "Harris",
  "title": "President Biden and Vice President Harris Receive a Briefing on James Webb Space Telescope Images Transcript",
  "date": "20220712",
  "url": "https://www.rev.com/blog/transcripts/president-biden-and-vice-president-harris-receive-a-briefing-on-james-webb-space-telescope-images-transcript",
  "topics": "Technology, Foreign Policy",
  "num_segments": 5,
  "content": [
    {
      "text": "Thank you, thank you. Well, good evening, everyone. I am very honored to be with you all. President Joe Biden and I talk often about our mutual passion for everything you all do. This is a very exciting moment to join you for the unveiling of the work that you have been laboring on for decades. So to our president, Joe Biden, thank you for your leadership around all of these issues. Our NASA administrator, Bill Nelson, and the Office of Science and Technology Policy acting director, Dr. Alondra Nelson."
    },
    {
      "text": "Thank you also to our colleagues from across the White House and NASA, and everyone else joining us from home. So yes, as chair of the National Space Council, I know that today represents an exciting new chapter in the exploration of our universe. From the beginning of history, humans have looked up to the night sky with wonder. And thanks to dedicated people who have been working for decades in engineering and on scientific marvels, we can look to the sky with new understanding."
    },
    {
      "text": "When NASA launched the Hubble Space Telescope in 1990, we were able to see the stars unobstructed by the Earth's atmosphere and understand the universe in ways we could have never imagined even a few decades earlier. And now, we enter a new phase of scientific discovery. Building on the legacy of Hubble, the James Webb Space Telescope allows us to see deeper into space than ever before, and in stunning clarity."
    },
    {
      "text": "It will enhance what we know about the origins of our universe, our solar system, and possibly, life itself. This was made possible by partnership among nations. And it is an example of how a scientific endeavor can build upon the international rules and norms that govern our cooperation in space."
    },
    {
      "text": "This telescope is one of humanity's great engineering achievements, and the images we will see today are a testament to the amazing work done by the thousands of workers across our nation who dedicated years to this project. They embarked on this complex endeavor for the benefit of humankind and, in the process, accelerated American innovation, strengthened partnerships with our allies, and will undoubtedly inspire generations to look to the heavens with excitement and ambition."
    }
  ]
}