{
  "speech_id": "038",
  "title": "Vice President Harris Hosts the White House Summit on the American Rescue Plan and Workforce Transcript",
  "date": "20220714",
  "url": "https://www.rev.com/blog/transcripts/vice-president-harris-hosts-the-white-house-summit-on-the-american-rescue-plan-and-workforce-transcript",
  "topics": "Economy, Healthcare",
  "num_segments": 15,
  "content": [
    {
      "text": "Good morning, everyone. Good morning. Thank you. Speaker 5: ()\nGood morning. Good morning. Good morning. What an array of extraordinary American leaders. I thank you all for being here and for the work you're doing every day. Secretary Walsh, I want to thank you for that introduction, but mostly I want to thank you for the work that you have done your entire career. As he said, he and I have been traveling the country together and he is an extraordinary fighter for the working people of America."
    },
    {
      "text": "It is also good to be here with Gene Sperling and he has, as I had mentioned to many of the leaders earlier, he has been working day and night to coordinate with you to ensure that the American people benefit directly from the American rescue plan. So, Gene, I want to thank you for your leadership. I want to also recognize a long standing public servant and leader, Governor Roy Cooper, along with Governor Tom Wolf, who has done an extraordinary job during difficult times."
    },
    {
      "text": "So thank you all, and to all of the local and state elected leaders for being here today. Before I begin, I will address this month's CPI report. There is no question that we still have work to do, but it is important to note that these numbers do not fully reflect the recent drop in gas prices. Average national gas prices have fallen every day for nearly 30 days. Since mid-June, prices are down 40 cents a gallon."
    },
    {
      "text": "Fighting inflation is one of our administration's top economic priorities, which is why we have taken action to lower the cost of living for Americans, millions of Americans. We are releasing one million barrels of oil a day from the strategic petroleum reserve to lower prices at the pump. We have reduced high speed internet bills for millions of Americans."
    },
    {
      "text": "We passed a tax cut to give working families up to $8,000 a year, which means giving folks more room in their budgets to buy food, medication, and school supplies for their children. President Joe Biden and I are always fighting to make sure that working families can get ahead and stay ahead. That is why we continue to call on Congress to pass legislation, to lower the price of prescription drugs, of healthcare, and the other everyday essentials that will meet the needs of American families."
    },
    {
      "text": "So helping working families is why we are here today. When President Biden and I took office, our nation was facing its worst economic crisis in generations. We all remember millions of jobs had been lost. Millions of small businesses, closed. Millions of families pushed right to the edge, but we were not deterred. These leaders were not deterred. From day one, President Biden and I knew that to overcome these historic economic challenges, we needed to make an historic investment in our nations' working families."
    },
    {
      "text": "We needed to build an economy that works for working people. That is why with your help we fought for and passed the American Rescue Plan, which included among many things, a $40 billion investment in workforce development. Just think about that. When we talk about an investment in workforce development, that is about a direct investment in working people in America. It's a direct investment in human capacity."
    },
    {
      "text": "For that reason, I know we're all excited about what it means and the potential for where this will go for generations of workers in America. So today it is an honor to gather with a group of leaders who are putting ARP dollars to work in communities across our nation. Governors and mayors, city commissioners, and county executives, workers, and labor leaders, with your help we are creating good paying jobs in small towns and big cities."
    },
    {
      "text": "Jobs for nurses and doctors, jobs for steel workers, pipe fitters, and engineers. Together we are investing in training programs and apprenticeships that give workers the skills they need to take on the jobs with better wages and better benefits, in particular, workers from underrepresented backgrounds. Together we are expanding access to transportation. Seems like maybe it's a small issue. It's a big issue. You need to get to go and need to be able to get where you need to go to do the work and get home."
    },
    {
      "text": "So we have expanded access to transportation, including what we need to do to invest in public transit. Understanding that the infrastructure in our country around public transit is and has been in disrepair in many areas of our country. So that is the investment that we have put in there. Together we are fighting to improve and expand our childcare and healthcare workforce so that everyone who needs better care can have access to better care, no matter where they live and no matter how much money they make."
    },
    {
      "text": "That includes eight million Americans who are part of the so-called sandwich generation, which means they're right there in the middle, taking care of both their children and their parents. That includes people with mental and physical disabilities. So they can access the critical care and support they need to succeed and to thrive, to succeed and to thrive. Together we are doing so much important and impactful work."
    },
    {
      "text": "We have therefore convened this summit with these extraordinary leaders so they can share their stories and share the stories of the people they represent. So we can discuss how we can continue to work together on behalf of the working people of our nation. I have seen firsthand how much is possible when we collaborate across lines that relate to the direct benefit of the people of our nation. In fact, earlier this year I visited a union training facility in Milwaukee, Wisconsin. It's called WRPT Big Step."
    },
    {
      "text": "At Big Step I met workers who had received training to remove and replace the lead pipes and service lines that are poisoning our communities. It was truly an inspiration. As a result of their training those workers can now access good paying union jobs, jobs they can raise a family on. Jobs they can build a future on. Jobs that are helping us build a better future for our entire nation. Today as many as 10 million homes and 400,000 schools and childcare facilities receive their water through lead pipes."
    },
    {
      "text": "Graduates of Big Step are already removing lead pipes in Milwaukee. We have leaders from Milwaukee with us here today, and in communities across America. Big Step is one of hundreds of job training facilities around our nation that received funding through the ARP. Here with us today is Lindsay Blumer, president of WRTP Big Step. Lindsay, where are you? There you are. Lindsay, and all of the leaders here, I want to thank you for all that you have done to make real the promise of the American Rescue Plan."
    },
    {
      "text": "Since President Joe Biden and I took office, we have accomplished so much with your help, but we still have more to do. We must continue our work together to build a nation where every worker is treated with dignity, where every community is safe and healthy, and where every child can reach their God given potential because every person in our nation, no matter where they start deserves the opportunity to succeed and to thrive. That is the future we are all fighting for."
    }
  ]
}