{
  "speech_id": "039",
  "title": "Joe Biden & Kamala Harris Speech Transcript on Child Tax Credit Relief Payments July 15",
  "date": "20210715",
  "url": "https://www.rev.com/blog/transcripts/joe-biden-kamala-harris-speech-transcript-on-child-tax-credit-relief-payments-july-15",
  "topics": "Economy, Government Policy",
  "num_segments": 6,
  "content": [
    {
      "text": "... our young leaders. Well, good morning, everyone. Good morning. Let us mark this day, Thursday, July 15th, 2021, as the day the American family got so much stronger. Today, the Expanded Child Tax Credit is here. Today, for families all over our country, for children all over our country, help is here. It is a good day, America."
    },
    {
      "text": "And I'll tell you, my mother, she worked hard at being a mother, whether it was waking up at the crack of dawn to pack our lunches and get us ready for school, or whether after we went to bed, sitting at our kitchen table and trying to just figure out how to make it all work. And I know it wasn't easy, even though she never said that. My family's story is not all that remarkable."
    },
    {
      "text": "Every month the rent becomes due, every month the childcare provider needs a check, a check that could take half an income, every month American families need to buy groceries and gas, to pay for rent or homeowners insurance, utilities and car loans. And even if they have enough to make ends meet, it is often just barely enough. One unexpected expense could mean the difference between taking on more debt or losing it all. In the wealthiest nation in the world, it should not be this way."
    },
    {
      "text": "And the President and I, well, we both believe that. So when we took office, we set out to provide American families with some relief, and that is exactly what we are doing. And I want to thank those members of Congress who led and voted to expand the Child Tax Credit. The President will detail the expansion, but let me underscore one important piece. This tax cut will be issued in monthly payments. This has never happened before, and America, yes, it is a big deal."
    },
    {
      "text": "I have been fighting for months and for quite some time, even when I was in the Senate, for monthly payments, because I know if the struggle to make ends meet is monthly the solution has to be also. So before I introduce our President, let me close with this. The payments may be monthly, but the impact of this Child Tax Credit will undoubtedly be generational. Indeed, it is the largest middle class tax cut in generations, and will lift up half of our nation's children who are living in poverty, out of poverty."
    },
    {
      "text": "And in lifting up those children and in lifting up the American family, it will lift up our entire nation. Today is a good day, America. It is a historic day. And we are here today because of the vision and the leadership of a fellow parent, of a president who believes with all his heart that the strength of our nation should be measured by the strength of our families and our children. It is my great honor to introduce President Joe Biden."
    }
  ]
}