{
  "speech_id": "043",
  "speaker": "Harris",
  "title": "Joe Biden & Kamala Harris Anniversary of Americans with Disabilities Act Speech Transcript",
  "date": "20210726",
  "url": "https://www.rev.com/blog/transcripts/joe-biden-kamala-harris-anniversary-of-americans-with-disabilities-act-speech-transcript",
  "topics": "Social Justice, Government Policy, Infrastructure",
  "num_segments": 8,
  "content": [
    {
      "text": "Good morning, everyone. Please have a seat. Good morning. Well, July 26th, 1990, was indeed an historic day. On that day, the Americans with Disabilities Act was signed into law. On that day, America became better. Because we know, an accessible America is a better America. Speaker Nancy Pelosi, Leader Kevin McCarthy, Chairman Pat Leahy, Senator Bob Casey, thank you all for your leadership. Steny Hoyer, I'm getting to you in a second, for being here today. Looking out, I see so many who helped make the ADA real."
    },
    {
      "text": "The activists who gave everything they had to fight for that bill. The advocates who helped to shape the bill title by title. The policy makers who worked tirelessly to pass it, including of course our own president, Joe Biden, house majority leader, Steny Hoyer, and Congressman Tony Coelho. Thank you all. Every day in every community, lives of the American people are better because of the work you all did."
    },
    {
      "text": "When people can ride a bus because it has a lift, when they can enter a building, because it has a ramp, when they can watch a movie with closed captions, when a student with a disability goes to school, instead of discrimination gets support, that is the ADA in action. The ADA gives all Americans the opportunity to fully participate in our democracy, in our economy and in our society. The ADA gives all Americans the opportunity to determine their own future."
    },
    {
      "text": "Self-determination, which I believe the government must facilitate, that is the impact of the ADA. And after all, the promise of America. At the same time, truth must be told. The ADA was a very important beginning, but there is still so much work to be done, both on enforcement and future legislation. And that is why I am so heartened to see the generations of leaders who are here and remain committed to doing this work."
    },
    {
      "text": "In fact, earlier this month, I met with several leaders of the disability community who are fighting for voting rights. And they told me about the obstacles voters with visible and invisible disabilities face when casting a ballot: long lines, rickety ramps, broken elevators, tables that are either too high or too low, complications with voting assistance. The list goes on and on."
    },
    {
      "text": "One of the leaders in fact said to me, she said, \"Vice President, equity cannot be achieved without disability being part of the equation.\" This is a fight that is a civil rights fight, a human rights fight. This is about equity. And whether or not we are truly committed to the principles of equity in every way that we as government and as a society can enforce those important principles. And as we all know, that truth is not just about voting then, it is also about employment."
    },
    {
      "text": "It is about an education starting with pre-K. It is about being able to live in your home and participate in your community, which is also why we must invest in in-home and community-based services. So folks, here's the bottom line, the president and I will continue to fight with you to make America more accessible for all people. This work is urgent."
    },
    {
      "text": "And the reason we do it is obviously important, because every person in our country deserves the opportunity to dream with ambition, to have choices, to shape their own future unencumbered by any barrier, free from any obstacle. Because this, as we know is the very definition of self-determination and this is the United States of America. So thank you all for your courage and for your commitment. And now it is my great honor to introduce a person, a leader who exemplifies all of that."
    }
  ]
}