{
  "speech_id": "045",
  "speaker": "Harris",
  "title": "Vice President Harris Attends the 28th ESSENCE Festival of Culture Transcript",
  "date": "20220703",
  "url": "https://www.rev.com/blog/transcripts/vice-president-harris-attends-the-28th-essence-festival-of-culture-transcript",
  "topics": "Healthcare, Social Justice, Government Policy",
  "num_segments": 38,
  "content": [
    {
      "text": "Well, first of all, it is so good to be with you, Keke- ... it is so good, and hello, ESSENCE Fest. We're back. We are back. That day, well, so you'll remember the election happened, but it took a while for it to be declared. So my husband and I were staying in Delaware so we could be near the President-elect at the time."
    },
    {
      "text": "I work out every morning, and so he and I worked out together and we were then going back to the house and he was like, \"I'm going to walk a little bit more and cool down,\" and so he started to walk. I went up to the house and I went upstairs to go take a shower- ... because I'm going to give you all kinds of information you weren't expecting. So I turned on the shower because it was cold, remember it was winter."
    },
    {
      "text": "So I turned on the shower, so the water could heat up and I got a text, and it said they declared the race. I ran downstairs. I didn't even turn off the shower- I ran downstairs and I come out the house, \"Doug! Doug!\" I'm trying to find my husband. He's down the pathway, and he's got his earbuds in. So I'm there saying, \"They called the race,\" and I'm waving at him and he's just waving back because he's listening to music. He's just waving back. Then he came up and then the President called, Joe Biden called."
    },
    {
      "text": "So that meme is from my husband standing there, videotaping me having the call with the president. That was that was. Yeah. Well, like I said, I work out every morning. I'll just give you kind of a day in the life. I work out every morning and I start my day reading the Presidential daily brief, we'd call it the PDB for sure- ... which is classified information generated by our intelligence community about hotspots around the world and threats to our national security."
    },
    {
      "text": "So I read that every morning and my office in the West Wing is, I don't know how many feet, not very far, a minute to get from my office to the Oval Office. Often, when I arrive at the West Wing, I'll walk down to the Oval Office and the President and I will have a meeting with the heads of our intelligence community, including often the Secretary of Defense will be there. The Secretary of State will be there."
    },
    {
      "text": "The Director of the CIA will be there and we will talk about the threats to our nation and the priorities that we face. So that is often how the day will start, and then there will be [inaudible :28] Well yeah, there's a lot of decisions to be made, and then the day we'll proceed. I'll tell you one of my favorite days recently was the day that I went over to the Capitol. You see, as the Vice President, I'm also the President of the Senate."
    },
    {
      "text": "Right now in the United States Senate, we have a 50/50 split between Democrats and Republicans, so it is often the case that I go to break the tie, so I'll go up to the Capitol. But this day I went up to the Capitol because there was a vote occurring on who would be the next justice on the United States Supreme Court. I was in very, very actively involved in that process of choosing her. So I went to the Senate so I could preside when she was then voted on to be the next Supreme Court Justice."
    },
    {
      "text": "Of course, I am talking about Ketanji Brown Jackson- Justice Ketanji Brown Jackson. It was so special, Keke, because I got there and then it was taking a while for the vote to happen. Then, two of my friends and colleagues when I was in the Senate, Raphael Warlock, Senator Warnock from Georgia, let's get him re-elected please, and Senator Corey Booker from New Jersey. So the two of them walked up when I was in the chair, because there was a pause."
    },
    {
      "text": "I had just finished on my stationary writing a note to my goddaughter, Helena, who's actually here with me today to talk to her about as a 17-year-old young, Black woman what this day would mean for her- ... and her life. I wrote her a note and I had some extra stationary. So when the two of them came up, I said, \"Well, y'all need to write a note to somebody too.\" I handed them my stationary and then each of them also wrote a note to someone in their life about the historic meaning of that day. Yes, yeah."
    },
    {
      "text": "This is a serious matter. And, it requires all of us to speak up, to speak out, and to be active. I was on my way to Aurora, Illinois, to meet with Congresswoman Lauren Underwood, who is an outstanding member of Congress, because she and I, over the years, when I was in the Senate, and now, as Vice President, have been working on the issue of maternal mortality, and in particular, black maternal mortality."
    },
    {
      "text": "We've been working on this issue for a very important reason, which is, in the United States, black women are three times more likely to die in connection with childbirth. Native women are twice as likely to die. Rural women, one and a half times likely to die. Understand that, among all so-called developed nations, we are the worst on this issue. It has been a longstanding area of focus for me, to focus on women's health, and safety, and wellbeing."
    },
    {
      "text": "I've been able to then, as Vice President, bring this issue to the stage of the White House, to talk about what we need to do to protect, and to ensure that women have the resources they need. For example, we've been able to encourage states to extend Medicaid coverage postpartum, from two months to 12 months, because a woman needs- Support beyond two months, when she has just given birth- To a human being. We have dealt with the fact that there is racial bias in the healthcare delivery system."
    },
    {
      "text": "What we need to do, when we recognize that a black woman walking into a clinic, or a doctor's office, or an emergency room, is less likely to be taken seriously. This is the work we've been doing. We've been looking at it in the context of the unique stressors that women face, and in particular, black women face, and what that does to have effects on their health and wellbeing. Lauren Underwood and I have been doing this work. I was flying from DC to Aurora, Illinois, to meet her in her district."
    },
    {
      "text": "To announce more work that we are doing on maternal health. And, wouldn't you know, on the course of that trip, the Supreme Court, with the Dobbs decision, for the first time in the history of our nation took a constitutional right that had been recognized, and took it from the women of America. Took a constitutional right. What is so outrageous about this on every level is, one, it is the taking of a right that was given and guaranteed, and something that we took for granted to be settled law."
    },
    {
      "text": "What that means then, in terms of what else might be vulnerable that we otherwise thought was settled law, including issues like contraception, including issues like same sex marriage. Including the intimate decisions that people should be able to make about what I call heart and home, without government interference. What essentially has happened is, the statement has been made that the government has a right to come in your home and tell you, as a woman, and as a family, what you should do with your body."
    },
    {
      "text": "The point has to be this. We have to recognize we're a nation that was founded on certain principles that are grounded in the concept of freedom and liberty. We also know that we've had a history in this country of government trying to claim ownership over human bodies. We had supposedly evolved from that time, and that way of thinking. This is very problematic on so many levels. The impact that it is going to have on women without means."
    },
    {
      "text": "Somebody who has financial means, this is really probably not going to have much of an effect on them. The facts are, the majority of women who get an abortion, the majority are mothers. If she has to leave her state to go for the reproductive healthcare she needs, we're looking at the fact that, if she works, which she probably does, she's going to lose time from work, potentially without paid leave."
    },
    {
      "text": "She's going to have to figure out what to do with her kids, and the cost of the childcare, at least for overnight. Not to mention bus fare, or train fare, or airfare, and a hotel room, all to make one of the most intimate decisions that she should have a right to make without government interference, that she should have a right to make with her pastor, or her priest, or her rabbi, and her family, but not getting permission from the government. Right. First, I'll say this."
    },
    {
      "text": "When we look at this issue, I think we have to, one, remember the words of Coretta Scott King, who I'll paraphrase, but she famously said, \"The fight for civil rights, which is the fight for freedom, the fight for Liberty, the fight for justice, the fight for civil rights must be fought and won with each generation.\" When she said that, I think we know that, one, she was saying that the very nature of these fights is that, whatever we gain, they will not necessarily be permanent."
    },
    {
      "text": "Therein lies the strength when we achieve the rights, with the fragility of those rights. Meaning, if we are not vigilant to secure and to fight for them, we can't take it for granted. There is that piece of it. But, I think the second point she was making is, because it is the nature of it, that you have to be vigilant, don't be overwhelmed. Don't be overwhelmed to the point that we are disheartened, and we think that we can't do anything about it. It's the nature of it that these gains will not be permanent."
    },
    {
      "text": "We must be vigilant, and we must remember, we are always going to have to fight to maintain these rights. That's right. That's right. Let me add to that. So on the housing piece, it includes this piece. What we know is that for generations, housing appraisers, the people who come in and tell you the value of your house, we have been tracking the racial bias in those assessments, such that we have examples of a black family getting an appraisal that was far lower than they knew the value of their house was."
    },
    {
      "text": "So then they have friends who were a white family and would have the white family come in and put up their family pictures and then get the house appraised and it appraised for much higher. So we're dealing with that too, which is a longstanding issue in terms of what needs to be reformed around just the appraisal system, much less what we need to do to make housing affordable and available to more families. Well, one, we got a multitask."
    },
    {
      "text": "We are good at that, none of us would be sitting here if we didn't figure that out at some point. So we have to multitask. But we have to look at what are the most critical issues. So for example, for me and for the President, one of the biggest issues that has been treated as maybe a small issue is anything that affects children. Sometimes in public policy, I think folks think because they're small people, it's a small issue."
    },
    {
      "text": "No, if you impact in a positive way the needs of a child, the entire community benefits for generations. And so we have been looking at what we need to do, for example, at also supporting children in the context of the family they are being raised. So that grandmother or that auntie, or that mother or that father. So what we have done for example is we have instituted a tax cut for childcare expenses, like medication and school supplies, $8,000 a year tax cut. Not one Republican voted for it."
    },
    {
      "text": "We have extended the child tax credit. And in that, in, so doing in the first year reduced black child poverty by almost 40%, cannot get a Republican to help us extend it beyond. But these are some of the things that we have been doing, understanding the generational impact. Not to mention the work that we need to do that is about foreign policy. I have met with, I don't know, probably at least two dozen foreign leaders, prime ministers, presidents."
    },
    {
      "text": "I just recently convened the Caribbean prime ministers and presidents around what we should do as the United States, seeing them as our neighbors in the Western hemisphere and giving appropriate support there. So we have to multitask. Looking at what we need to do domestically, what we need to do to bring down the cost of gas. Don't do that. Don't do that. Please, don't do that. Well, first and foremost, and I don't need to say to you Kiki, because you really do use your voice in such an extraordinary way."
    },
    {
      "text": "No, you really do. You really do. You have the courage to speak out and you're not concerned about putting your finger in the air to see if it's popular, you speak truth, and I really appreciate, and respect and admire that. But I will say let's not discount what young leaders are doing right now, because there's a lot of extraordinary leadership happening from our young leaders. When I think about civil rights movement and my parents and what they were doing, they were in their 20s. Don't forget, Dr."
    },
    {
      "text": "King was a very young man. So we have a history of these movements being fueled by students, by young leaders. And you could look at anything from who was taking to the street articulating with Black Lives Matter to who has been now out there, marching on choice, who is out there leading on so many of the issues that are about the climate crisis that is pounding on the door for attention and swift response. So I see a lot of leadership happening among younger leaders."
    },
    {
      "text": "But here's what I would encourage folks to do, who want to be more active. First of all, use your voice to talk to the people in your life, your family members, your neighbors, the people you work with about how issues are impacting you. Talk about how you know that if you were born, like my goddaughter who's here in 2004. Well, the world has put in dates around 2030 that we need to reduce- ... dates around 2030 that we need to reduce greenhouse gas emissions or we are looking at an inflection point."
    },
    {
      "text": "And so what that will mean for you and for your children and your grandchildren, speak that in a way that people understand that you have an immediate investment in the outcome of the issue. Similar, when we're talking about what's happening in terms of the work that we're doing on something like maternal mortality, similar to what we're talking about in terms of voting, where they are taking the rights of people, to be able to express their voice in a democracy through their vote."
    },
    {
      "text": "Speak about that in a way that you can energize the people in your life to understand that when elections come up, I know Kiki and she has passionately told me how this concerns her and how my vote could impact the outcome of this decision. I will. And I think what I'd encourage is, for example, I know that you have a variety of interests, choice being one of them."
    },
    {
      "text": "So there are a number of organizations that are working on that issue, and then figure out how you can volunteer there, how you can be an advocate, because the advocacy, the marching, the shouting is what brings about a lot of what has happened in terms of people being vocal about how the issue impact them. There's something else that's equally important and that is the power of coalition building."
    },
    {
      "text": "So for example, I mentioned earlier that there are in many of the states that are attacking a woman's right to choose, they're also attacking voting rights. Well, let's think about the fact that historically it's different communities that have worked on those issues, but we're all under the same roof if it's about understanding how liberties are being attacked, how our democracy is being attacked."
    },
    {
      "text": "So let's work on the coalition also, which is bringing folks together because there is power in those numbers and there is power in knowing that the vast majority of us have so much more in common than what separates us. See, the people who are trying to attack our rights are trying to make people feel small and feel alone. Because they want you to believe you don't have power and that you're out there by yourself. And so we are not going to let that happen."
    },
    {
      "text": "And one of the ways that we won't is to bring everyone together and remember that there is a community of people that is invested in this. Well, first of all, don't hear no. Don't hear it can't be done. Don't hear nobody like you has done this before. I like to say, I eat no for breakfast. Surround yourself with a community of people, it doesn't have to be a big group, who love you and who will cheer you on and who will sometimes push you out the door to go and do."
    },
    {
      "text": "Those people who love you and you trust enough that when you fall down, they'll be there to laugh with you because you fell, but to help pick you up and keep you going. So choose, especially to the young leaders I'd say, but to all of us of every generation, choose who is in your life based on loving yourself and requiring that from other people. It's so important. And so that's one thing. I would say the other thing is that to really know that you have so much to bring and you have to look inward."
    },
    {
      "text": "And also, have faith. Have faith and have faith in whatever it is you believe in, that you were destined to do great things even when the obstacles are there, but to believe in yourself and to have faith in yourself, that's so important. And then finally, just to remember you're not alone. I mean, so many of us have had the experience of walking into a room where we're the only one who looks like us or has had our life experience."
    },
    {
      "text": "And so to you, I would say, when you walk in these rooms, remember this room for a minute. Remember this room. And remember when you walk into those rooms that we're walking into that room with you. We are all in that room with you and we are applauding you. And we are expecting you will carry our voice into that room. And we are applauding you and we are with you every step of the way. So shoulders back, chin up and just be yourself, be your marvelous self. Just be yourself. Thank you. Thank you."
    }
  ]
}