{
  "speech_id": "047",
  "title": "Kamala Harris DNC Voting Rights Speech Transcript July 8",
  "date": "20210708",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-dnc-voting-rights-speech-transcript-july-8",
  "topics": "Healthcare, Social Justice",
  "num_segments": 18,
  "content": [
    {
      "text": "Hello, everyone. Hello. Can we please hear it for Kylie? We were hanging out backstage talking. And I'll tell you, Kylie, when I look at you and so many of our young leaders I'd know our future is bright. I'm so proud of you and you're right. Please sit everybody. But you spoke the truth about Howard University, because that is absolutely right. And I think many of you know, the first office I ever ran for was probably the most difficult campaign I've ever been in."
    },
    {
      "text": "And that was freshmen class representative of what was then called the liberal arts student council. And so it is so good to be home at Howard University. And I will tell you what you all know, Howard University is a very important part of why I stand before you at this moment as the vice president of the United States of America. And Jamie Harrison, thank you for your leadership."
    },
    {
      "text": "And on that point today, I am pleased to announce that the Democrats are making a $25 million investment to expand the I Will Vote campaign. This campaign is grounded in the firm belief that everyone's vote matters. That your vote matters. And we saw this in 2020. More Americans turned out to vote than ever before. In the middle of a pandemic. America, you masked up, you mailed in your ballots. You did not let anything stop you from making your voice heard. And let's think about what happens when we vote."
    },
    {
      "text": "Let's look back at history, Howard teaches us to always remember our history. In 1964, Americans awakened by the civil rights movement wanted the Voting Rights Act. They voted and they got it. In 2008, millions of Americans were uninsured, under insured, or were paying too much for healthcare insurance. Americans wanted affordable healthcare. They voted and they got the Affordable Care Act. The same thing happened last year. In 2020, you called for a national vaccination plan."
    },
    {
      "text": "You voted and now nearly 160 million Americans are vaccinated. You called for jobs. You voted and now more than 3 million jobs have been created. You called for relief, badly needed. Called for relief and $1,400 checks have been sent out. $2.6 billion have gone to HBCUs like Howard University. And starting next week, because you voted, tens of millions of American families will get monthly checks for the expanded child tax credit."
    },
    {
      "text": "And I want to emphasize, because you voted, through that, we will lift half of America's children out of poverty because you voted. Because you voted. So think of our democracy as a call and response, and every election then as an opportunity for the American people to be heard. In 2020, you were heard America, you were heard loud and clear, but there is another side to this story. So far this year, 17 state legislatures have enacted 28 new laws that will make it harder for Americans to vote."
    },
    {
      "text": "These bills now, be clear, but enacted, these bills have already become law. They are now on the books and that's not to mention the nearly 400 bills that state legislatures are attempting right now to pass. You know what's going on in Texas right now. This all is designed, I believe, to make it harder for you to vote so that you don't vote. And let's talk about what exactly these laws will do. What will they actually do? Well, let's say in the last election you may have voted early because you work long hours."
    },
    {
      "text": "Well, these laws will cut early voting. Let's say your cousin voted by mail to avoid the long lines. Well, these laws will cut vote by mail. Say your coworker, say your friend next to you, friend, voted in person on election day and put on that sticker with pride. Well, these laws will make it difficult for folks who wait in line. These laws create obstacle upon obstacle. These laws make it harder for you to vote because they don't want you to vote. And so I will say again, your vote matters. Your voice matters."
    },
    {
      "text": "Your will matters. Your desire for yourself and your families matters. And regardless of who you are, where you live, what party you belong to, your vote matters. Your vote is your power. And so I say, don't let anybody ever take your power from you. Don't let anybody take your power from you, especially the power of your voice. We will not let anyone take away our power. And that's why we are all here together today. We're not going to let that happen. And so we need to fight back."
    },
    {
      "text": "In some states, Americans have successfully blocked some of the anti voter bills from becoming law and others are being challenged in court. In Congress, leaders are working to pass two bills into law that would protect and strengthen voting rights. And there is another important component of our work together and that is mobilizing to ensure Americans vote in the elections coming up ahead. Now I know that there are some folks out there who are saying, \"Well, hold up, I just voted."
    },
    {
      "text": "I stood in that line like you asked me to last time. It was hot or it was cold. So why are you coming to me now talking about this now? I just voted.\" And that's fair. That's a fair point. Yes, it is early. And we have never really started this early before, but folks, it is never too early to defend your rights. So with these new laws that have been passed, or they're trying to pass, we have to start now to finish strong."
    },
    {
      "text": "And remember, this is not only about a national election, this is also about state and local elections. It's about who's going to be your sheriff or your mayor or your school board member. The folks get who elected and then make decisions that impact your everyday life. So America this year, next year, and every election year, the future of our nation is decided by us."
    },
    {
      "text": "You, the people and therefore the people must be able, without hindrance, without obstacle, certainly without insurmountable obstacle, to decide our country's future. To determine your future, the future of your children, the future of our nation and therein lies the power of your vote. With this $25 million, the Democrats are investing in the tools and technology to register voters, to educate voters, to turn out voters, to protect voters. People say, \"What's the strategy?\" Well, I just outlined it."
    },
    {
      "text": "We are going to assemble the largest voter protection team we have ever had sure to ensure that all Americans can vote and have your vote counted in a fair and transparent process. And again, I want to make clear that this is about all voters. It's about all voters. This is not about Democrats or Republicans, this is about Americans. Let's be clear about that."
    },
    {
      "text": "And who is prepared right now to stand up for what we say are some of our fundamental values, some of the fundamental pillars to a democracy, to our democracy. That's what this is about. So we want to help you vote and we want to help to make sure your vote is counted. And that is because our democracy is strongest when everyone participates and it is weaker, it is weaker, our democracy as a nation is weaker when people are left out. So this is the fight. This is the fight of our lifetime."
    },
    {
      "text": "This is the fight of our lifetime. We all stand on the shoulders of giants. We will always remember our history. We also understand their legacy and that we are a part of that. And in that way, there is a continuum. So I say in that context, this is the fight of our nation's lifetime. And we need your help. If you are not registered to vote, register. If you are registered, make sure your friends and family are registered. And I'm going to give you a website. You know I had to come with a website."
    },
    {
      "text": "Go to iwillvote.com, iwillvote.com. And go there to make just to sure you are registered and visit there to get all the information you need about how to get folks involved, how you can become involved. And with that, let me end where I began. America, we know what our nation is made of. In 2020, you showed the world what our nation is made of in the midst of a global crisis. Let's remember that. In the midst of a global crisis, more Americans voted than ever before. It's important."
    },
    {
      "text": "Look back on moments of crisis, moments of suffering as a measure of your strength and what did you do in those circumstances. And know we are strong. In a moment of crisis, people voted in numbers like never before. And that is a demonstration, is empirical evidence of the strength of our democracy and the determination of our people. And I do believe we will do that again. So I'll say it one more time, our vote matters. Your voice matters."
    }
  ]
}