{
  "speech_id": "048",
  "title": "Kamala Harris Child Tax Credit Speech Transcript June 11",
  "date": "20210611",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-child-tax-credit-speech-transcript-june-11",
  "topics": "Education, Economy, Social Justice",
  "num_segments": 22,
  "content": [
    {
      "text": "Thank you. Thank you, [inaudible :14]. You know, I so enjoyed meeting Kennedy. Where is she right now? I love meeting our young leaders, and Kennedy is one of them. I just visited one of the classrooms, Myrna, and I tell you, when we look at our children... And I was raised, and I think we all know, when we think of the children of the community, they are the children of the community. And when I look at our children and just was visiting with them, our future is bright. Our future is bright."
    },
    {
      "text": "It's such a particular age, in terms of the stages of development, our four and five year olds, because they haven't yet been encumbered or burdened by anyone's limited expectations, or just an inability to understand the capacity, the God-given capacity of every child. And they know they are going to be, they know it."
    },
    {
      "text": "And so it is our responsibility then as the adults of a community, the leaders of a community, to do everything we can, to send every message possible in every way to remind our children of how special they are and how important they are to us as a community. So it is such a joy to be with you all today, and I want to thank you for inviting me and for welcoming me."
    },
    {
      "text": "So as we think about what we are doing next, I do want to say that there is a lot to do in terms of knowing how incredible the children are here, these beautiful and brilliant children, and to thank also the parents and the providers for what you are doing. The children here remind me of a young girl I met several months ago. Her name is [Gaela :18], and she is five years old. And from the moment I walked into her classroom, she was glued to my side."
    },
    {
      "text": "At one moment, I bent down to speak to her, and I said, \"Gaela, you can be anything you want to be.\" And she reminded me of Kennedy, and all of the children I was just with. And I said to her, \"Gaela, you can be anything you want to be.\" And not unlike any of the children that I just visited with, she looked at me, looked at me in my eyes and said, \"Well, I want to be everything."
    },
    {
      "text": "Everything, everything.\" And I know that all the children here would the same thing, so President Joe Biden and I are determined to build a future that is right worthy of the aspiration and the ambition of our children. When we took office, we knew that building that future would not be easy. The president and I knew the serious challenges the children of our nation are facing. We know that the pandemic did not invent these challenges, but it's certainly accelerated these challenges."
    },
    {
      "text": "As you talked about, childcare centers were closed. Parents have been out of work. Families' budgets have been stretched. So many families who could count on grandparents to be part of the support system did not have that support system because of the nature of the pandemic. And of course, millions of children as a result of all of that fell into poverty, on top of the children who already were in poverty before the pandemic."
    },
    {
      "text": "So that is why we put the children of America at the center of our agenda, for all of those reasons. And that is why we put it at the center of the American Rescue Plan, and fought very hard to get that plan passed. And people ask me sometimes... They say, \"So what have you enjoyed most about being vice president?\" And I tell them every time, because this is just the honest to God truth, \"We will lift half of America's children out of poverty.\" We will lift half of America's children out of poverty."
    },
    {
      "text": "So with the American Rescue Plan, we did three big things, which is the subject of my conversation with you today in particular. We increased the child tax credit, we expanded the child and dependent care tax credit, and we made an historic investment in childcare. So today, I'm going to give you an update on the implementation of each of these three components. First, the child tax credit."
    },
    {
      "text": "So this credit is for families with children, and we increased the credit from $2,000 per child to $3,000 per child for children over the age of 6, and $3,600 for children under the age of 6. And now, it also applies to children up to age 17, so we increased the age. We've also expanded the credit to more families than ever before, so now, low-income families or parents with no income will also receive this credit for their children."
    },
    {
      "text": "Because before, it was a tax credit with the assumption that you'd get the credit if you had an income and had paid enough taxes to get the credit from what you had paid. Now, we have extended it to say, \"Well, no. Let's just talk about fairness.\" If we agree that parents need a little extra help, well, why would we differentiate between the parents that have a income high enough to pay taxes and those who don't? That's not logical, as a matter of fact, so that's why we extended it."
    },
    {
      "text": "And for the first time, another unique piece of this is families will get the credit every month instead of at the end of the year. And why is that? Well, it's pretty basic. Folks got to pay the bills every month, so let's make it actually real and connect it with the demands and the pressures of being a parent and raising a family, in particular with young children. So the checks will start dropping in July. That's part of the announcement today, to remind people and let them know. Thank you."
    },
    {
      "text": "And we want to make sure that every family with children who qualifies for this tax credit receives it, because of course they deserve it, and because that will help us lift half of those children I mentioned before, living in poverty, out of poverty. So on Monday June 21st, we are going to have a child tax credit awareness day. And I'm here to ask you all as leaders to be a part of that, of lifting up awareness about what has been designed to help folks, to make sure they know."
    },
    {
      "text": "So we're going to join with community organizations, faith-based groups, and local elected officials to get the word out about how folks can receive the credit, and we would love for you all to join us with that. Second, the child and dependent care tax credit, which is different. So this credit is for families who send their children to childcare programs, and this credit allows families to get back as much as half of their spending on childcare for children under the age of 13."
    },
    {
      "text": "And so as an example, if you spend $8,000 this year on childcare, you could get $4,000 off of your tax bill, and we have new guidance that will help families take full advantage of this credit. And I just want to stress one thing, and let's get the word out. Let's remind folks, to get what you are due, keeping your childcare receipts is really important. So let's remind folks of that. And you can visit irs.gov for more information. I had to come with a website, irs.gov."
    },
    {
      "text": "The third update relates to making childcare more affordable and accessible. So the last piece that I just mentioned of course will help with that. But through the American Rescue Plan, we sent out around $39 billion to states, to tribal nations, and territories. And today, we are instructing them on how to distribute the last $15 billion in the most effective and efficient way, so that these funds will actually benefit the children that were intended to benefit."
    },
    {
      "text": "So all of this to say we are making progress, and still there's more work to be done. While the American Rescue Plan has been critical in providing relief, we know more work needs to be done to reimagine these systems and these structures, to build a future that is worthy of every child's aspiration and ambition. And that is why the president and I have put forward the American Families Plan."
    },
    {
      "text": "So the American Families Plan would ensure no low or middle-income family pays more than 7% of their income on high quality care for young children. Because again, on this issue... And I don't have to tell Myrna, I don't have to tell the folks here. It's about accessible and affordable, and we need both. Not one or the other, both."
    },
    {
      "text": "Throughout the country, there are places that we refer to as childcare deserts, where there's literally no childcare available within a traveling distance for that parent, especially if they are working and the childcare is many, many miles out in this direction, and they got to go to work in that direction. So is it meaningful in terms of childcare availability, accessibility? The other piece is affordability."
    },
    {
      "text": "In so many places in our country, childcare costs more than college tuition, where parents then have to make a decision. Either I work because I want to work because I enjoy my job, or I stay home and not work, because if I go to work, I'm spending more on childcare than my salary. The system is not working so well for a lot of parents, so this is the point here, affordability and accessibility. And I believe this is some of the most important work we can do. We say we care about families."
    },
    {
      "text": "Well, then let's get in there on the details of what helps and makes families actually work and function as a family. And since we took office, there are fathers who have had to take unpaid leave to care for their children. I've met mothers who have had to bring their children to work with them, including women who are running small businesses, who had to kind of figure out where to put the kid, sometimes even in the storage area, to let them do their homework while they're running small business."
    },
    {
      "text": "I've met volunteers who are feeding families with children and drive-through food banks, and childcare providers who are caring for children while struggling to keep their childcare center open. So our children must be at the center of our priorities and our public policies. It is the smart thing to do, and it is the right thing to do, and so that is the work ahead. With our collective help, I truly believe America's children will be anything they want to be."
    }
  ]
}