{
  "speech_id": "050",
  "title": "Kamala Harris, Janet Yellen Providing Capital to Small Businesses Speech Transcript",
  "date": "20210615",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-janet-yellen-providing-capital-to-small-businesses-speech-transcript",
  "topics": "Economy, Social Justice, Government Policy",
  "num_segments": 15,
  "content": [
    {
      "text": "Thank you, thank you, thank you. Well good afternoon and thank you, Lisa. You have been an extraordinary leader. I have talked with many of our CDFIs, also known as community lenders, around the country and 201, they talk about your support and your leadership, especially during some of the most difficult times. So I thank you and I'm very honored to be with you as we make this announcement today."
    },
    {
      "text": "And of course, thank you to secretary Janet Yellen and Senator Mark Warner and chairwoman Maxine Waters for your leadership. Today as we encourage everyone to get vaccinated all across our nation, students are going back to school in person, people of faith are back in pews, and small businesses are back open. As we begin to emerge from the pandemic, we have the opportunity to take stock of where we've been and where we're going."
    },
    {
      "text": "And so this much is clear, the pandemic exposed the flaws, the fissures, and some of the failures in our economy. It has accelerated, in many ways, the inequities in our economy. And so when we took office, President Joe Biden and I knew that more than repair, we must reimagine our economy. Small businesses, of course, are at the center of this re-imagining. Small businesses create jobs. Small businesses create..."
    },
    {
      "text": "Small businesses create jobs, small businesses create wealth, small businesses employ half of America's workforce, and small businesses keep our nation competitive. And small businesses are critical, therefore, to our nation's future. Right now, small business owners don't just need relief, they need access to capital. That was true before the pandemic and it remains true today. I recently met with a small business owner named [Lorena :34]. She's the owner of an artisan empanada business in Colorado."
    },
    {
      "text": "She started her business, as so many have, in her own kitchen. But when she tried to get a loan to expand, the banks used a word she had not heard before. They told her she was, in their words, not bankable. Well, they were wrong. Through hard work, she proved them wrong, and her business has since expanded to multiple locations, and she has employed many people in her community and mentored many more. Lorena is not alone. I also recently met a small business owner named Rain."
    },
    {
      "text": "She owns a catering company in Oakland, California. And when she first started out to cater, to deliver her wares, she needed a van, but she couldn't even get a small loan from a traditional bank to purchase that van until she went to a community lender that agreed to support her and her small business. And here's the truth. Traditional banks have not always seen or understood the vision of women small business owners, small business owners of color, small business owners who serve low-income communities."
    },
    {
      "text": "Sometimes, their vision is something outside of the experience of the big banks to understand and see. Community lenders, on the other hand, were founded to see that vision, to get it. And over the past months, I have been in direct contact with many of the most active community lenders in our nation."
    },
    {
      "text": "Those who serve rural communities in Oregon, urban communities in California, those who serve low-income communities in the Mississippi Delta, tribal communities in the plains of South Dakota, where for example, native women are making quilts that are important to their community, are part of the tradition of the community, that are marketable in their community, and needed a community lender to recognize that fact, to support that work."
    },
    {
      "text": "You see, community lenders understand the value in providing access to capital directly to communities. And because they do, they add value to those communities, and by extension to our entire nation, which is why our administration is making a big investment in community lenders, and actively working to increase community lending capacity. We believe that American entrepreneurs deserve the opportunity to start and grow a business. When they've got a good idea, let's invest in them. We all benefit."
    },
    {
      "text": "I recently, just a couple but weeks ago, hosted two of the survivors of the Tulsa race massacre. And as we all know, we commemorated 100 years since the passing of that great tragedy. And so two of the survivors, one 107 years old, mother Viola Ford Fletcher, and her younger brother, 100-year-old Mr. Hughes Van Ellis, came to my office, and we talked about the Greenwood District and Black Wall Street."
    },
    {
      "text": "We talked about this essential principle of self-determination, and we talked about how access to capital can help small business owners and workers alike to determine their own future wherever they live. And that is why helping small businesses access capital through community lenders has been a focus of mine for a very long time now."
    },
    {
      "text": "In fact, one of the last actions I took in the United States Senate was to work with my colleagues, Mark Warner is here, to secure $12 billion for community lenders as part of the COVID-19 relief bill. And of course, I did not do this alone. It was a partnership with Leader Chuck Schumer, Chairman Sherrod Brown, Ranking Member Mike Crapo, Senator Mark Warner, Senator Cory Booker, and Chairwoman Maxine Waters."
    },
    {
      "text": "It was a full team effort, and today I am proud that we are announcing the Rapid Recovery Program, which that bill set up and is now operational. $1.25 billion will be distributed to community lenders through this program. Lenders can use these funds for critical needs, such as to recover from the pandemic themselves. Many of these community lenders, you can think of them as small businesses of their own. They're based in the community."
    },
    {
      "text": "They need the support, they need resources, they need technical assistance, so that's part of where this will go. It will help folks pay their own workers, create new products, and get more money out the door to small business owners. And I'm going to give you a website. Lenders can visit treasury.gov for more information. And now, I'm honored to hand it over to Secretary Yellen to share more details."
    },
    {
      "text": "I will tell you one of the first topics she and I discussed even before our inauguration, was how to increase community lending capacity. We'd been working together, our teams have been working together on this issue ever since. I know the Treasury Department has been hard at work to get the Rapid Recovery Program up and running. I thank you, Madam Secretary for all you do, and I will now pass the microphone to you. Thank you."
    }
  ]
}