{
  "speech_id": "051",
  "title": "Biden & Harris Press Conference on Making Juneteenth a National Holiday: Transcript",
  "date": "20210617",
  "url": "https://www.rev.com/blog/transcripts/biden-harris-press-conference-on-making-juneteenth-a-national-holiday-transcript",
  "topics": "Social Justice, Government Policy",
  "num_segments": 6,
  "content": [
    {
      "text": "Please have a seat. Good afternoon, everyone. Good afternoon. Speaker 2: () Good afternoon. Throughout history, Juneteenth has been known by many names, Jubilee Day, Freedom Day, Liberation Day, Emancipation Day, and today, a national holiday. [inaudible :59]. Looking out across this room, I see the advocates, the activists, the leaders who have been calling for this day for so long, including the one and only, Ms. Opal Lee, who just received a very special recognition from the President of the United States."
    },
    {
      "text": "I see members of Congress, members of the Congressional Black Caucus, members of the United States Senate, who passed this bill unanimously and all of whom, collectively, were responsible for delivering this bill to the president's desk. I thank you all. We thank you all. Your nation thanks you all. When we establish a national holiday, it makes an important statement. National holidays are something important."
    },
    {
      "text": "These are days when we as a nation have decided to stop and take stock, and often to acknowledge our history. As we establish Juneteenth as our newest national holiday, let us be clear about what happened on June 19th, 1865, the day we call Juneteenth, because you see that day was not the end of slavery in America. Yes, on that day, the enslaved people of Galveston, Texas learned that they were free, but in fact, two and a half years earlier, the Emancipation Proclamation ended slavery in the Confederacy."
    },
    {
      "text": "Think about that. For more than two years, the enslaved people of Texas were kept in servitude. For more than two years, they were intentionally kept from their freedom. For more than two years. Then on that summer day, 156 years ago, the enslaved people of Texas learned the news. They learned that they were free and they claimed their freedom. It was indeed an important day. And still let us also remember that day was not the end of slavery in America."
    },
    {
      "text": "The truth is it would be six more months before the 13th amendment was ratified, before enslaved people in the south in the north were free. As we commemorate the history of Juneteenth, as we did just weeks ago with the history of the Tulsa Race Massacre, we must learn from our history and we must teach our children our history, because it is part of our history as a nation. It is part of American history. Let me end by saying this, we are gathered here in a house built by enslaved people."
    },
    {
      "text": "We are footsteps away from where President Abraham Lincoln signed the Emancipation Proclamation. And we are here to witness president Joe Biden establish Juneteenth as a national holiday. We have come far and we have far to go, but today is a day of celebration. It is not only a day of pride. It is also a day for us to reaffirm and rededicate ourselves to action. With that, I say, happy Juneteenth, everybody. And with that, I introduce the President of the United States, Joe Biden. Why don't you stand next to me."
    }
  ]
}