{
  "speech_id": "052",
  "title": "Vice President Harris Speaks at Peace Summit in Ukraine",
  "date": "20240617",
  "url": "https://www.rev.com/blog/transcripts/vice-president-harris-speaks-at-peace-summit-in-ukraine",
  "topics": "Foreign Policy",
  "num_segments": 8,
  "content": [
    {
      "text": "Thank you. Thank you, President Amherd and President Zelensky for hosting the summit. It is my honor to be here with all of the leaders today. () I first met President Zelensky in February of 2022, just five days before Russia invaded Ukraine, an outrageous attempt to subjugate a free people and an attempt to wipe a sovereign state off the map."
    },
    {
      "text": "On that same day, I addressed the Munich Security Conference and made clear that the United States of America is a steadfast supporter of the principles, that people have a right to choose their own form of government, nations have a right to choose their own alliances. There are inalienable rights governments must protect. The rule of law must be cherished. Sovereignty and territorial integrity of all states must be respected. And national borders should not be changed by force."
    },
    {
      "text": "() As I discussed with President Zelensky earlier today, President Biden and I have made clear over the past three years we are committed to uphold international rules and norms, to defend democratic values and stand up to dictators, and to stand with our allies and partners. This approach has provided for our security and prosperity for generations, and it continues to do so today. This approach makes America strong and it keeps Americans safe, and this approach bolsters global stability."
    },
    {
      "text": "() Russia's aggression is not only attack on the lives and the freedom of the people of Ukraine, it is not only an attack on global food security and energy supplies. Russia's aggression is also an attack on international rules and norms and the principles embodied in the UN Charter. Russia is a permanent member of the United Nations Security Council, nevertheless, for nearly two-and-a-half years, it has shamelessly violated the core tenets of that charter."
    },
    {
      "text": "() If the world fails to respond when an aggressor invades its neighbor, other aggressors will undoubtedly become emboldened. It leads to the potential of a war of conquest and chaos, not order and stability, which threatens all nations. President Joe Biden and I will continue to support Ukraine and continue to impose costs on Russia, and we will continue to work toward a just and lasting peace based on the principles of the United Nations Charter and the will of the people of Ukraine."
    },
    {
      "text": "() President Zelensky, the United States shares your vision for the end of this war and an end to the suffering of the Ukrainian people. And let us all then commit to the imperative of returning innocent children kidnapped by Russia returning them to their homes. Let us also agree a practical benefit of the work of this Peace Summit is to increase global food and energy security. And let nothing about the end of this war be decided without Ukraine."
    },
    {
      "text": "() By contrast, however, yesterday Putin put forward a proposal, but we must speak truth. He is not calling for negotiations. He is calling for surrender. America stands with Ukraine, not out of charity, but because it is in our strategic interest. We stand with delegations from more than 90 nations who also have a strategic interest in a just peace in Ukraine. Among us, no doubt, exists a diverse range of views on many of the global challenges and opportunities we face."
    },
    {
      "text": "We don't always agree, however, regarding Putin's, unprovoked, unjustified war against Ukraine, there is unity and solidarity in support of international norms and rules. For President Joe Biden and me, it is one of our defining missions to uphold the international rules-based order, to defend it, strengthen it, and promote. And no doubt it must be a priority for us all. Thank you. Speaker 2"
    }
  ]
}