{
  "speech_id": "056",
  "speaker": "Harris",
  "title": "Vice President Harris Delivers Remarks at a Dobbs Anniversary Reproductive Rights Event Transcript",
  "date": "20230626",
  "url": "https://www.rev.com/blog/transcripts/vice-president-harris-delivers-remarks-at-a-dobbs-anniversary-reproductive-rights-event-transcript",
  "topics": "Healthcare, Social Justice",
  "num_segments": 21,
  "content": [
    {
      "text": "Four more years. Thank you all. Thank you, thank you, thank you all. Oh, it's good to be back in North Carolina, I can tell you that. It certainly is. Well, let me start by thanking Dr. Amy Bryant. You have heard from her, you know her, she's extraordinary. Like so many of our medical health professionals, these are very trying times."
    },
    {
      "text": "And I was talking with some folks backstage about the fact that in times like this, in times of struggle, in times of hardship, these moments also reveal the heroes among us, the people who have the courage to stand strong in service of others, and truly, Dr. Bryant is one of those people. So thank you for your introduction, and all that you do for your patients here in North Carolina. I also want to thank my husband, the first second gentleman of the United States."
    },
    {
      "text": "I want to thank my longstanding and dear friend, the governor of North Carolina, Roy Cooper. I think many of you may know, Roy and I actually served together when I was Attorney General of California and he was Attorney General of North Carolina. I have known him for a long time, he is an extraordinary leader, who always stands up for the rights and the freedoms of the people of North Carolina. Roy, thank you."
    },
    {
      "text": "() I also want to thank the other champions for reproductive freedom who are here, Secretary Xavier Becerra, who is here. Congresswoman Alma Adams. Congressman Jeff Jackson, who tells a real good story. North Carolina Attorney General Josh Stein. And Ethel Isaacs Williams, the national president of The Links, Incorporated. This is a room full of leaders, a room full of leaders. So we gather here with knowledge and a deep and profound belief that America is a promise. A promise."
    },
    {
      "text": "A promise of freedom and freedom for all. A promise that each person can determine their own future, dream with ambition, and live with dignity. A promise that every person truly has the ability to thrive. Since the founding of our country, we all know generations of Americans have struggled, sacrificed, and bled to make that promise real. They spoke out at Seneca Falls. They sat in at a lunch counter in Greensboro. They organized farm workers in California. They fought for equality at the Stonewall Inn."
    },
    {
      "text": "And in the relay race of history, the baton they carried is now in our hands. We, all of us, are now called upon to advance the promise of freedom, including the freedom of every woman to make decisions about her own body. Not the government telling her what to do."
    },
    {
      "text": "() We are here today because one year ago today, the United States Supreme Court, the highest court in our land, General Stein, the court of Thurgood, the court of RBG, took a constitutional right that had been recognized From the people of America, from the women of America, a fundamental right, a basic freedom. And I know most of us here remember where we were on that day a year ago when the court decided Dobbs, June 24th, 2022."
    },
    {
      "text": "I was actually on my way traveling from Washington, DC to a maternal health event in Illinois when I heard the news. Outraged, I called my husband, Doug, because there were a collection of words that were coming to mind that would not have been proper for me to speak with some other people. And together he and I talked, we talked about our daughter, we talked about my goddaughters, about my niece and her daughters."
    },
    {
      "text": "And I couldn't help but think that their generation would have fewer rights than my generation or my mother's generation. And so the three words that came to me that I publicly spoke were, \"How dare they? How dare they? How dare they?\" How dare they attack basic healthcare? How dare they attack our fundamental rights? How dare they attack our freedom? And sadly, one year ago, we accurately predicted what would happen in a world without Roe. We knew this decision would create a healthcare crisis in America."
    },
    {
      "text": "We knew that old abortion bans would immediately go back into effect, one which was written in 1849. Now, check this out, 1849. 1849, before women had the right to vote, 1849, before the elevator, the telephone, and even the light bulb had been invented. And now we know in the midst of this healthcare crisis, extremists, so- called leaders in states across our nation have proposed or passed more than 350 new laws to restrict these freedoms and the right to have access to reproductive healthcare."
    },
    {
      "text": "Right now in our country, 23 million women of reproductive age live in a state with an extreme abortion ban in effect. 23 million women, which means right now in our country, 1 in 3 women of reproductive age live in a state with a ban. States like Arizona, Florida, Georgia, Texas, and Wisconsin. Some with no exceptions even for survivors of the crimes of rape and incest."
    },
    {
      "text": "() Now, many of you know, I started my career as a prosecutor intent on protecting, in particular women and children who were the subject and survivors of violence. It's immoral that so-called leaders would not understand and have some compassion for what those exceptions should be. Some of the laws are banning at or before six weeks, the right to have an access to have an abortion."
    },
    {
      "text": "() Now, what most of us here know is that many women don't even know they are pregnant at six weeks, which by the way, tells us most of these politicians don't even understand how a woman's body actually works. They don't get it. They don't get it. And next week, overruling the will of the people, North Carolina will be the latest state with an extreme ban in spite of the best efforts of Governor Roy Cooper. And so, over the past 365 days, ... an agenda that, by the way, goes beyond reproductive rights."
    },
    {
      "text": "It's a lot of these same folks that attack the right to vote, that prevent the teaching of America's full history with book bans. Book bans. Book bans in this year of our Lord 2023? They tried to condemn Americans for being who they are, for loving who they are, and loving who they love openly and with pride. () So, let's see the big picture at play here. And, of course, a year after Dobbs, it is clear where this is headed. Extremist Republicans in Congress have proposed to ban abortion nationwide. Nationwide."
    },
    {
      "text": "But I have news for them: We're not having that. We're not having that. We're not standing for that. We won't let that happen. And, by the way, the majority of Americans are with us. The majority of Americans, I do believe, agree that one does not have to abandon their faith or deeply held beliefs to agree the government should not be telling her what to do with her body. If she chooses, she will talk with her pastor, her priest, her rabbi. But it should not be the government telling her what to do."
    },
    {
      "text": "() And I do believe that the majority of Americans agree that an important attribute of a true leader is the ability to have empathy, to truly have some curiosity and concern and care for the struggles of other people. This having been the approach, by the way, of people from Kentucky to California, voters of every party, who just last year protected reproductive rights. () And so, while Americans make their voices heard across our nation, President Biden and I will continue to do our part."
    },
    {
      "text": "Our administration has taken action to protect access to emergency medical care, to support women forced to travel out of state for care, and to protect women's privacy. But we know this fight will not truly be won until we secure this right for every American, which means, ultimately, the United States Congress must put back in place what the Supreme Court took away. And have the courage to stand for freedom in every way. The United States Congress must pass legislation to restore the protections of Roe v."
    },
    {
      "text": "Wade. And when they do, President Joe Biden will sign it. () So, North Carolina, all that to say also that elections matter and organizing works. So, together, let us continue to build this movement to- Speaker 3 A movement ... I love you. Let's build our movement, a movement to secure the rights every American. Today, 365 days after the Dobbs decision, people in states across our nation are making their voices heard."
    },
    {
      "text": "For example, in Florida and Ohio, folks are collecting signatures and registering people to vote to secure reproductive freedom on their ballot. Across our nation, people are speaking out. They're raising money to support reproductive freedom. And just look around. Just look around. Together, here, people of every background. I wish you could see what I'm looking at."
    },
    {
      "text": "People of every background, every age, from everywhere, together, are standing in defense of fundamental, foundational principles for our country; standing in defense for freedom and democracy, for civil rights and human rights and women's rights. And I do believe that when you know what you stand for, you know what to fight for. () So, North Carolina, let's stand because we believe medical decisions should be made by a woman and her doctor, not politicians."
    },
    {
      "text": "Stand if you want to end the crisis of maternal mortality, to institute national family and parent paid leave. Stand to pass the affordable child care and to uphold the rights of all people to own their future. Stand if you love our country. Because we are fueled by our love of country, and we stand knowing what we must fight for and what's at stake. And, again, I will say: When we fight, we win. Thank you."
    }
  ]
}