{
  "speech_id": "057",
  "speaker": "Harris",
  "title": "VP Kamala Harris sits down with CNN for her first interview after Roe overturn Transcript",
  "date": "20220628",
  "url": "https://www.rev.com/blog/transcripts/vp-kamala-harris-sits-down-with-cnn-for-her-first-interview-after-roe-overturn-transcript",
  "topics": "Healthcare, Social Justice, Government Policy",
  "num_segments": 14,
  "content": [
    {
      "text": "Yeah. Well, so I was on air force two heading to Aurora, Illinois to talk about maternal health. We were with Lauren Underwood, with the chair of judiciary, Dick Durbin, Senator judiciary. We were headed there to unveil a plan of based on the work we've been doing to ensure that women receive the kind of support they need during and post pregnancy. And we thought that the decision would come down sometime soon, but not at that moment. And I was shocked."
    },
    {
      "text": "And it's one thing when you know something's going to happen, it's another thing when it actually happens. And I just actually turned to CNN, and I couldn't believe it. I couldn't believe it because they actually did it. And here's what they did. The court actually took a constitutional right that has been recognized for half a century and took it from the women of America. That's shocking."
    },
    {
      "text": "When you think about it in terms of what that means in terms of democratic principles, in terms of the ideals upon which we were founded about Liberty, about freedom. I thought about it as a parent, we have two children who are in their 20s, a son and a daughter. I thought about it as a godparent of teenagers. I thought of it as an aunt of preschool children. And a woman, myself and the daughter of a woman, and a granddaughter of a woman. And my husband and I are actually talking about it."
    },
    {
      "text": "We have a 23 year old and my mother-in-law's in her 80s. Our daughter will not know the rights for the the amount of time that my mother-in-law knew these rights, which is the right that should be well settled that a woman should have to make decisions about her own body. And when we think about it, everyone has something at risk on this. First of all, if you are a parent of sons, do think about what this means for the life of your son, and what that will mean in terms of the choices he will have."
    },
    {
      "text": "Do think about it in the context of the fact that they wrote this decision, including concurring opinions that suggests that other rights such as the freedom to make decisions about when you were going to start a family. The freedom and the right to make decisions about contraception, IUDs, what this is going to mean in terms of in vitro fertilization. Right. I definitely believe this is not over. I do. I think he just said the quiet part out loud."
    },
    {
      "text": "And I think that is why we all must really understand the significance of what just happened. This is profound. And the way that this decision has come down has been so driven, I think, by the politics of the issue, versus what should be the values that we place on freedom and liberty in our country, right? The right to privacy. Let's think of this in the context of the laws that are being passed in states."
    },
    {
      "text": "As a former prosecutor who specialized in crimes of violence against women and girls, in particular, child sexual assault and rape, the idea that after a woman has endured such violence to her body, that she would not have the freedom and authority to decide whether she wanted to continue with a pregnancy that is a result of an act of violence is absolutely unthinkable."
    },
    {
      "text": "So the president rightly last week, when the decision came down, indicated that it quite unambiguously, that we will do everything within our power, as an administration, through the executive branch, to ensure that women have access to the medication they need, which has been by the way, FDA approved, and that they will have freedom of travel, and that travel should be unrestricted. I am sure that our department of justice is going to do that based on every statement that the attorney general has made."
    },
    {
      "text": "I think that what is most important right now is that we ensure that the restrictions that the states are trying to put up that would prohibit a woman from exercising what we still maintain is her right, that we do everything we can to empower women to not only seek, but to receive the care where it is available."
    },
    {
      "text": "And that's- It's not right now what we are discussing, but I will say that when I think about what is happening in terms of the states, we have to also recognize, Dana, that we are 130 odd days away from an election, which is going to include Senate races, right? Part of the issue here is that the court has acted, now Congress needs to act, but if you count the votes, don't appear to have the votes in the Senate. Well, there's an election happening in 130 odd days."
    },
    {
      "text": "For example, thinking of a Senate race in Georgia or North Carolina. There's a Senate race coming up just in a couple weeks in Colorado. And we need to change the balance, and have pro-choice legislators who have the power to make decisions about whether this constitutional right will be in law, right? We say codified, put it in law so that there will be no ambiguity about it. Okay. Yeah. I think we're pretty clear that to the extent that we can, we will."
    },
    {
      "text": "There's no question about that because again, it is FDA approved, and if it is prescribed that a woman should be able to have access to it, unfettered. I think you're asking a very important point... Making a very important point, which is what are the details that are going to go into ensuring that women have the ability to actually travel without impairment."
    },
    {
      "text": "And we know that on this issue, women who have access to resources will probably be far less impacted by this decision than women who don't have resources. So this is something that we are looking at because we know for example, in terms of how this is going to actually impact real people, over half of women who receive abortions in America are moms. That means that if they're going to have to travel, they've got to find daycare and pay for."
    },
    {
      "text": "It means that if they are working, which most are, they're going to have to have time from work. And if they don't have paid leave, they're going to have to figure out how to afford it. It means that they may have to put up money for a train or a bus or a plane, much less a hotel. And so we want to make sure that there does not result extreme disparities or any disparities based on who can receive care based on how much money they've got."
    }
  ]
}