{
  "speech_id": "060",
  "speaker": "Harris",
  "title": "Kamala Harris & Guatemala President Alejandro Giammattei Press Conference Transcript June 7",
  "date": "20210607",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-guatemala-president-alejandro-giammattei-press-conference-transcript-june-7",
  "topics": "Economy, Immigration, Foreign Policy, Education, Social Justice",
  "num_segments": 34,
  "content": [
    {
      "text": "Thank you, Mr. President, and thank you for warmly welcoming me and our delegation to Guatemala. We had a robust, candid, and a thorough conversation about the many issues that are priorities for each of our countries. The President and I discussed a fundamental belief that most people don't want to leave home. They don't want to leave the place where they grew up, where the language they know is spoken, where their culture that they know is present and has been, in this case, for centuries."
    },
    {
      "text": "Most people don't want to leave where their grandmother lives and when they do it is usually for one of two reasons, because they are fleeing some type of harm or because to stay means that they cannot provide for their essential needs and the needs of their family. The President and I share a firm belief that our responsibility and our capacity is to give people a sense of hope. We talked extensively about this through the many conversations we've had, including today."
    },
    {
      "text": "The power of hope, the ability that each of our governments has to give people a sense that help is on the way to let them know that they are seen, that they are heard, that we see their capacity, but we also understand their challenges and their need for support and the resources that any human being needs to be able to survive much less thrive. So that was fundamentally the spirit behind the conversation that we had. And as I mentioned, Mr."
    },
    {
      "text": "President, I believe that our world is interconnected and interdependent and certainly the most recent issues that have plagued our globe, including the pandemic, have made that point clear. Our world is interconnected and interdependent, and therefore what happens abroad is of priority to the United States of America. And that is why I am in Guatemala today and that is why President Joe Biden will travel to Europe later this week."
    },
    {
      "text": "We are renewing our relationships around the globe and our presence around the world. In fact, just last week I shared with the President that the United States will provide as a first donation, 500,000 vaccines to Guatemala. Again, understanding the interdependence, the connection between us, and the importance of looking out for and prioritizing the needs of one's neighbor."
    },
    {
      "text": "I am proud to report that the agreements between President Giammattei and I have made today will strengthen the security and the prosperity for both the people of Guatemala and the people of the United States. And before we get to the questions, I just want to highlight several of those agreements. First, on the issue of security, it is probably one of the highest priorities for each of our nations."
    },
    {
      "text": "The President and I agreed to continue our work to manage migration at Guatemala's Northern and Southern borders. We also discussed illicit drugs that are being smuggled and humans who are being trafficked across those borders, undermining the security of both the people of Guatemala and the people of the United States. Our nations have collaborated on these issues and we will create a smuggling and human trafficking task force which will work with local law enforcement to stop these crimes."
    },
    {
      "text": "And I have personally worked on these cases in my career and can say that when we see some of the most vulnerable in our communities being taken advantage of, being sold for profit, being abused, it should be a priority for all of us who care about the human condition and humanity. Second, on economic development, the President and I also discussed the root causes of migration, in particular the lack of economic opportunity for many people here in Guatemala."
    },
    {
      "text": "The United States recognizes that it is both in our interest and reflective of our values to help create that opportunity and to share in economic prosperity. We will launch a young women's empowerment initiative to increase education and economic opportunities for girls and women. Understanding here in Guatemala, there is a rich tradition of girls and women being a part of the culture and the economy."
    },
    {
      "text": "Girls and women being a part of the culture and the economy with extraordinary skills, and therefore the ability to thrive when seen as someone who can be the source of investment for the economic growth of the entire community. We will also invest in agribusiness and affordable housing and supporting entrepreneurs."
    },
    {
      "text": "President Giammattei has mentioned to me many times today and in previous conversations about his priority around what can happen in terms of the planting of trees and what that can mean in terms of ecology and our environment. Well, recently there's been a lot of talk about ecopreneurs, entrepreneurs who are focused on climate, who are focused on what might happen, which is to protect our environment, but also see the capacity for jobs and economic development as a connection with that pursuit."
    },
    {
      "text": "As I shared with you, in Washington, D.C., I recently convened some of our biggest CEOs who have a profound interest for many reasons on supporting the work that happens here and the work that can happen here in Guatemala to, again, uplift folks who may have been overlooked or neglected, but also uplift the natural capacity and resources of this beautiful country. Which brings me to our third area of discussion and agreement."
    },
    {
      "text": "The President and I discussed the importance of anti-corruption and the importance of an independent judiciary. The United States will create an anti-corruption task force, the first of its kind. Our Justice Department, our Treasury Department and our State Department will work together to conduct investigations and train local law enforcement to conduct their own. Our task force will support Guatemalan prosecutors, including [inaudible :15], and listen. No corruption."
    },
    {
      "text": "Corruption does not no borders, and we want to make sure that this is about transnational crime and we have to follow the money and we have to stop it. And that's what we intend to do. I can tell you from my work on this issue years ago, follow the money. The underlying reason for so much of what we are seeing in terms of this level and type of corruption is about profit. It is about profit without concern for the damage it creates to real human life, to families, to children, to communities."
    },
    {
      "text": "And I want to emphasize that the goal of our work is to help Guatemalans find hope at home. At the same time, I want to be clear to folks in this region who are thinking about making that dangerous trek to the United States-Mexico border, do not come. Do not come. The United States will continue to enforce our laws and secure our border. There are legal methods by which migration can and should occur, but we, as one of our priorities, will discourage illegal migration."
    },
    {
      "text": "And I believe if you come to our border, you will be turned back. So let's discourage our friends, our neighbors, our family members from embarking on what is otherwise an extremely dangerous journey, where in large part, the only people who benefit are coyotes. And let us do our work together, Mr. President, again, with our mutual commitment of knowing that hope is on the way. And I believe the actions we take together will improve the lives of Guatemalans."
    },
    {
      "text": "And as I meet with Guatemalan community members and leaders throughout this day, I will speak with them on what more can be done. Again, Mr. President, I want to thank you for such a productive conversation, for your role of leadership, and for the work we have yet to do together. Thank you. Speaker 3: () [foreign language :40] So on the issue of corruption, as you know, the President of the United States recently issued a very clear statement about where we as the United States stand on this issue."
    },
    {
      "text": "It was unambiguous that we will look to root out corruption wherever it exists because we know it is not in the best interest of a democracy. The President speaks, the United States President, Joe Biden, speaks a lot about this, and actually President Giammattei and I spoke about that today. If we are truly to have and fight for democracies, especially in a world where increasingly they are under attack, one essential ingredient of our priorities must be to fight corruption."
    },
    {
      "text": "It erodes the confidence that people have in their government and its leaders. It compromises the ability of any country to maximize its natural resources, to help and support its citizenry. On the issue of any corruption and on the issue of Guatemala, that has been one of our highest priorities in terms of the focus that we have placed here after the President asked me to take on this issue of focusing on this region of the world."
    },
    {
      "text": "And the work we are doing in furtherance then of that priority is the work of, again, creating an anti-corruption task force, bringing a renewed effort on behalf of the United States Department of Justice, the United States Treasury Department, the United States State Department to work collaboratively to identify, to support investigations, and ultimately, to support prosecutions and consequences for those who would endeavor to engage in corrupt behaviors."
    },
    {
      "text": "Furthermore, in bringing together the CEOs that we have been doing in the United States, and convening them, they've made very clear that when it comes to the private sector, be it there or I might venture to say here or anywhere around the world, they want to know if they're going to put their hard-earned resources into any issue or initiative, that it will go to its intended beneficiary, and that means going to the people who need that support and not corrupt hands."
    },
    {
      "text": "There are many reasons why this is one of our highest priorities, which I think the people of Guatemala know well and the people of the United States understand well. If we are to be effective, if we are to be true to our principles, we must root out corruption wherever it exists, and that is one of our highest priorities for that reason. On the issue of Republican's political attacks or criticism, or even concerns."
    },
    {
      "text": "The reason I am here in Guatemala as my first trip as Vice President of the United States is because this is one of our highest priorities and I came here to be here on the ground to speak with the leader of this nation, around what we can do in a way that is significant, is tangible and has real results. And I will continue to be focused on that kind of work as opposed to grand gestures. Speaker 2: () [foreign language :43] Thank you Ed."
    },
    {
      "text": "So on the issue of corruption, the conversation that I had with President Giammattei today was very frank, and very candid, and I think that this is a quality that he and I appreciate in each other. We don't have time for glossing over concerns that we have. And so we did have a very frank conversation about the importance of an independent judiciary. We had a conversation about the importance of a strong civil society."
    },
    {
      "text": "I expressed concerns about those issues, including what is the potential here for tax reform, something like tax reform, which is very much connected with a lot of the concerns that we have. And so we had a candid conversation as it relates to those concerns. And I do believe that with the work that we are doing, some of it which is new, there've been many attempts at collaboration between the United States and this region of the world over many years, as you know. Some have worked some have not."
    },
    {
      "text": "There are aspects of what we are doing now that are new, and also are based on this new era, again where there's, I think, a greater appreciation for the interdependence and the interconnection. And so we are creating this task force to address corruption. We are working on a taskforce that is about human smuggling. We are doing the work of requiring certain progress be made if we are going to attract US investment, private investment in this region."
    },
    {
      "text": "And that is also a new approach, a relatively new approach, which is to bring together the private sector, understanding that the United States government cannot alone do the kind of work that we believe we have collectively the capacity to do. So we have good reason to believe that we can have an impact. And in addition, there was a question about what's happening in terms of immigration as a general matter."
    },
    {
      "text": "Ale Mayorkas, of course is the Secretary of the Department of Homeland Security is going to be working on, through CVP, a relationship with Guatemalan border authorities on what we have named the Mobile Tactical Interdiction Unit. Again, focused on what needs to happen to put law enforcement resources as appropriate onto the issue of what is going on in terms of really abusive and criminal behaviors among people who are predatory in nature, and are preying on vulnerable people."
    },
    {
      "text": "Your final point, I'm honored to represent my country here in Guatemala. I am honored to be here in a nation that has a history that goes back thousands of years. As I was walking through this building and appreciating the Mayan art that adorns the walls knowing of the work that women and girls are doing, and have yet the capacity to do in Guatemala. And to the extent that I can have any impact based on my gender, and the fact that I am the first, I welcome that."
    },
    {
      "text": "I welcome showing anyone, whatever your race or gender, that you may be the first to do anything, make sure you're not the last, and in that way, let's pave a path where we create an opportunity for others to become the first in their family, or their community to do those things that perhaps others didn't think they were capable of, but God has given them that capacity to achieve. And with a little help, they will."
    },
    {
      "text": "One of the areas of focus for us is the issue of hunger, hurricanes, pandemic, and what these acute factors have caused in terms of the reason for the migration that we are seeing. And, when we look at then the capacity that we have to give support for people to be able to stay, we look at, as an example, what I mentioned earlier, the Young Women's Empowerment Initiative."
    },
    {
      "text": "In fact, Samantha Power, who is the new head of USAID is putting a lot of attention into the capacity we have to support the indigenous community here. It's a big area of focus for me, given the fact, and I've talked about this with the president, that we see that there are a lot of people from those regions of Guatemala that are leaving, not because they want to, but because they have no resources."
    },
    {
      "text": "So, this is the predominant approach that we are taking, which is to look at the root causes and the acute causes and deal with those in a productive way. And many of our initiatives, as I said earlier, are new initiatives. These are efforts that have not been tried in the past, which we believe will be quite productive, again, when we approach it in a collaborative way, not only from the U.S."
    },
    {
      "text": "government's perspective of an olive government approach, but bringing in the private sector, bringing in philanthropy, bringing in civil society, both here and Guatemala and around the world, and internationalizing our effort. For example, I have talked with the Prime Minister of Japan, the leader of South Korea who have all agreed to join us in our focus on Guatemala. And that is the way that we are approaching our work."
    }
  ]
}