{
  "speech_id": "062",
  "speaker": "Harris",
  "title": "Vice President Harris Delivers Remarks on Expanding Affordable High-Speed Internet Nationwide Transcript",
  "date": "20230301",
  "url": "https://www.rev.com/blog/transcripts/vice-president-harris-delivers-remarks-on-expanding-affordable-high-speed-internet-nationwide-transcript",
  "topics": "Education, Infrastructure, Technology, Social Justice",
  "num_segments": 20,
  "content": [
    {
      "text": "Good afternoon, everyone. Good afternoon. It is so good to be back in South Carolina. Thank you, Dr. Monica Adams [inaudible :51] for that introduction and for your work. Your work is just extraordinary. We have been talking about her vision not only for the future of education, but for the future of our country, and that future being captured in these bright young people that she is nurturing and investing in for the sake of all of our benefits. () So I thank you for that introduction."
    },
    {
      "text": "And it is good to be here, Mayor. Where are you, Rickenmann? Thank you for the warm welcome this afternoon. You've greeted me on the tarmac. I appreciate that and your leadership here. And to our president of Benedict College, Dr. Roslyn Clark Artis, it is good to be with you again and with all these bright young leaders. Thank you for all that you do. And, of course, it is a special honor to be here today with the great assistant leader, Jim Clyburn. () So I don't need to tell you."
    },
    {
      "text": "But he is a champion not only for the people of this state, but he is a national leader on so many issues, on the issues of poverty and civil rights and voting and, of course, a leader on the issue that brings us here together today. High-speed internet, for years, Assistant Leader Clyburn, has been fighting on this issue to connect families with high-speed internet. () I'm telling you, when I was in the Senate, I was the United States Senator for four years."
    },
    {
      "text": "Almost every conversation I'd have with him was about high-speed internet and the need for folks to step up and join him in his role of leadership. And in particular, of course, his work also was on the house rural broadband task force in the United States Congress. So Assistant Leader Clyburn, I thank you for inspiring and urging us as a nation to capture your vision for the families of America and for all you have done for our administration and our nation. Thank you. Thank you."
    },
    {
      "text": "() So today, I will begin with the simple truth, which you've heard spoken on this stage already. In America in the 21st century, the ability to connect to high-speed internet is not a luxury. It is a basic necessity. Every day in communities across our nation, students who have affordable access use the internet to do their homework. Parents use the internet to order groceries. Seniors use the internet to see a doctor without having to leave home."
    },
    {
      "text": "And small business owners use the internet to buy inventory, to manage the payroll, even to run their cash register. The internet is an essential part of everyday modern life. () And yet, more than 24 million American households still do not have internet access, including 137,000 families right here in South Carolina, either because they cannot afford the cost of high-speed internet or because they live in a community, often a rural community where high-speed internet is just not available."
    },
    {
      "text": "() So over the years, many of you know I have spent a lot of time in South Carolina. I have traveled from the upstate to the Midlands, from PD to the low country. And I've met with folks in rural communities like St. George and Darlington and Hemingway. And I've heard so many stories about what it means when folks don't have internet. () Students who have to sit in the parking lot of a fast food restaurant just to be able to submit their homework on public Wi-Fi."
    },
    {
      "text": "Parents who cannot take on good-paying remote work jobs because their internet is just too slow. Seniors who have to take their telemedicine visit in the corner of a public library because they don't have a connection in the privacy of their own home. Let us be clear. In America, in the 21st century, every person, no matter where they live, and no matter how much they earn, should have high-speed internet. It is simply a necessity."
    },
    {
      "text": "() So that is why building on the accessible affordable internet for all act written by Assistant Leader Clyburn and guided by his incredible vision, our administration invested an historic $65 billion through the bipartisan infrastructure law to connect every household in America with affordable and accessible high-speed internet. Now, for emphasis, affordable and accessible, both because one doesn't work without the other."
    },
    {
      "text": "() And so today, we have begun work to build infrastructure in more than 300 communities to construct thousands of miles of fiber optic lines that deliver high-speed internet. Places where I've been like Orangeburg and Chester, places where we have connected thousands of farms and churches and schools and small businesses with high-speed internet for the very first time. And the majority of those 300 communities are rural. () Now, think about it."
    },
    {
      "text": "In addition to all the benefit that comes from that, all of this work also creates jobs, good-paying jobs, jobs for electric workers who installed the fiber optic cables, jobs for technicians who will repair and replace those lines for years to come which brings me then to the affordability issue. As Mr. Clyburn mentioned just a few minutes ago when we took office, we created something called the Affordable Connectivity Program or the ACP."
    },
    {
      "text": "() Every month, this program gives more than 16 million working families a $30 discount on their internet bill. 800,000 households in South Carolina are eligible. And because we worked with internet service providers to make sure they offer plans for $30 or less per month with a $30 discount, a majority of these households can access internet for $0 a month. () That means, every month, families across our nation have more money in their pocket to pay for groceries and school supplies and home repairs."
    },
    {
      "text": "And nationally, every month, this program saves Americans more than half a billion dollars. Think about that. () Through this family, we also through this program realized and this family of networks of folks who are working on it realized, \"Okay. So that's good. So we're going to now check off the affordability issue and the access issue. But how am I going to get on the internet?\" Right?"
    },
    {
      "text": "And so that's where we designed into the program, a one-time discount of up to $100 for families to purchase a laptop or a desktop computer or a tablet, because obviously an internet connection is not much good if you don't have the technology to get online. () So I want to just now do a public service announcement. And I need all the leaders here to help me to check if you qualify for the ACP, look at your neighbor. To check If you qualify, go to getinternet.gov. To check if you qualify, go to internet.gov."
    },
    {
      "text": "As part of this work, we are also investing to connect our nation's HBCUs. So I say that as a proud graduate of an HBCU. Yes. So I know firsthand, our HBCUs are centers of academic excellence, academic excellence, HBCU students are leaders, yay, in their communities, in our nation, in and around the world as our students of all minority serving colleges and universities. () So let's make sure then that these leaders, these young leaders, can maximize their education."
    },
    {
      "text": "So today, we are investing more than $175 million to expand high-speed internet access and affordability at 61 HBCUs and minority serving institutions because we have to be intentional. We have to be intentional. And many of those that we have focused on currently do not have reliable access to high-speed internet on campus. So for South Carolina as an example, we are investing nearly $3 million in Claflin University and $3 million in Benedict College."
    },
    {
      "text": "And this means that more students will be able to use the internet for their everyday needs. Think about it like accessing telehealth appointments, including for mental healthcare- ... because here's the benefit. I was talking to some of the young leaders before we came out. Here's the benefit. On the issue of mental healthcare, let's be clear. When we talk about healthcare, healthcare doesn't just start from the neck down."
    },
    {
      "text": "And so, let's acknowledge that we need to make sure everyone has access to the total healthcare they need. But let's also acknowledge that some people don't necessarily want to be seen walking into the therapist's office. () But what does telehealth for Medicare mean. For medical care, that's mental health care, it means in the privacy of your dorm room or your home or even maybe your car, you can talk with somebody that gives you the help that you need."
    },
    {
      "text": "Think about all that access and affordability will open up in terms of truly giving people the ability and the opportunity to have the help they need. And because of the investments that we're talking about today, the schools that I mentioned and so many others, will also be able to expand their laptop loan program and update and upgrade campus Wi-Fi so that here at Benedict, when students are waiting for the COMET bus, they can open up their laptop and keep studying for their chemistry midterm."
    },
    {
      "text": "() So South Carolina, for so many people of every generation, these investments will be transformative because we know when we connect folks with high-speed internet, we connect them with opportunity, the opportunity to get an education, to train for a new career, to build a business, and to see a doctor. () We give people the power to build for our collective benefit, healthier, happier, and more prosperous lives for themselves and for the people they love."
    }
  ]
}