{
  "speech_id": "067",
  "title": "Joe Biden & Kamala Harris Speech on Violence Against AAPI Community at Emory Transcript",
  "date": "20210319",
  "url": "https://www.rev.com/blog/transcripts/joe-biden-kamala-harris-speech-on-violence-against-aapi-community-at-emory-transcript",
  "topics": "Social Justice, Gun Control",
  "num_segments": 5,
  "content": [
    {
      "text": "Good afternoon. Over the past week, the President and I have traveled across the country to mark the passage of the American Rescue Plan, to tell the American people about how 100 million checks are on their way, about how 100 million vaccines have been administered. Big news, good news. And we plan to come down here to Georgia, to the place that made it possible, to share that information. And then Tuesday night we learned that eight of our neighbors were killed in a heinous act of violence."
    },
    {
      "text": "Violence that has no place in the state of Georgia or in the United States of America. And we were reminded yet again, that the crises we face are many. That the foes face are many. As the President and I discussed with our AAPI community in a meeting earlier today, whatever the killer's motive, these facts are clear. Six out of the eight people killed on Tuesday night were of Asian descent. Seven were women. The shootings took place in businesses owned by Asian Americans."
    },
    {
      "text": "The shootings took place as violent hate crimes and discrimination against Asian Americans has risen dramatically over the last year and more. In fact, over the past year, 3,800 such incidents have been reported, two of three by women. Everything from physical assaults to verbal accusations, and it's all harmful. And sadly it's not new. Racism is real in America and it has always been. Xenophobia is real in America and always has been. Sexism too."
    },
    {
      "text": "In the 1860s, as Chinese workers built the Transcontinental Railroad, there were laws on the books in America forbidding them from owning property. In the 1940s, as Japanese American soldiers defended our nation, more than 120,000 Japanese Americans were forced to live in internment camps, an obvious and absolute abuse of their civil and human rights. Asian Americans have been attacked and scapegoated. People who are perceived as Muslim know what it was like to live in our country after 9/11."
    },
    {
      "text": "For the last year, we've had people in positions of incredible power scapegoating Asian-Americans. People with the biggest pulpits spreading this kind of hate. Ultimately, this is about who we are as a nation. This is about how we treat people with dignity and respect. Everyone has the right to go to work, to go to school, to walk down the street and be safe, and also the right to be recognized as an American. Not as the other, not as them, but as us. A harm against any one of us is a harm against all of us."
    }
  ]
}