{
  "speech_id": "070",
  "speaker": "Harris",
  "title": "VP Kamala Harris Speech During Meeting with Religious Leaders Transcript",
  "date": "20210331",
  "url": "https://www.rev.com/blog/transcripts/vp-kamala-harris-speech-during-meeting-with-religious-leaders-transcript",
  "topics": "Economy, Social Justice, Government Policy",
  "num_segments": 27,
  "content": [
    {
      "text": "... incredible leaders. I'm so looking forward to our conversation and this being the first of many. I have talked with my team about how over many, many years, Pastor Brown knows this, I've always relied on our faith leaders to partner with us in the work we do, to help guide the work we do and inform the work we do, and so I'm so excited to see all of you. This is the vice-president of the United States' official reception room and you are among some of the first groups that I have met with in this room."
    },
    {
      "text": "You may see, I brought in Frederick Douglass to join me. Actually, that was donated to us from [inaudible :46] Howard University. But I expect that he would be proud of the work that we will do in this room today and over the coming months and years. So thank you all. I'm honored to have you join us and be here this afternoon. And of course, this is a special time of the year, the holy season for so many. We just celebrated Passover, and of course, Easter is coming, Ramadan."
    },
    {
      "text": "And this is a time as we know that it's springtime and here in Washington D.C., the cherry blossoms are blooming. And around the world, we celebrate this time of year spring as a time of renewal and rebirth. A time when I think we know and believe that we can recommit ourselves to the values that we cherish and hold dear."
    },
    {
      "text": "So it's a special time of year, and I want to thank each of you as part of the leadership of our country for in particular, what you have been doing throughout your lives, but in particular, over this last year. This last year, when we look at the incredible loss caused by the pandemic, and it's the loss of life, the loss of jobs, but for so many, the loss of hope."
    },
    {
      "text": "These have been such difficult times, dark times where I think many, and sometimes even including myself, that have challenged our faith, our belief in what is possible, our question about why this is happening. And you all throughout this time have, as you always do, been a source of strength, a source of comfort, a source of counsel. You have worshiped with and held families virtually or in-person who have experienced tremendous loss."
    },
    {
      "text": "As our faith leaders, you have been housing the homeless, you have been feeding the hungry. This is what you do. And over this last year in particular, it has stretched the resources that are not only financial and physical, but spiritual. But yet you are unwavering, you are unwavering."
    },
    {
      "text": "And so I wanted to bring you together in this season to, first of all, thank you and by extension all of the leaders and our faith leaders around the country for the work you have done to be part of the strength and the guideposts and the pillars that in this moment of such turbulence, they've been holding up our ability to retain our faith and maintain our sense of hope. So first, I want to thank you for all of that."
    },
    {
      "text": "And then wanted to talk with you about some of the light that we are seeing as an administration. And I, of course, bring you greetings from the president, from President Biden. And we are seeing light that also comes from the work that we have a responsibility to do as elected leaders around, for example, the American Rescue Plan and the $1,400 checks lifting half of America's children out of poverty. We're so excited about that."
    },
    {
      "text": "The work we are doing to hopefully help people survive through this moment so they can get back up on their feet. So we see light at the end of the tunnel, and in large part because of the vaccinations that are happening, because of the vaccine. And so I want to talk with you about your thoughts, about how we can, and you in particular as our faith-based leaders, can help us to make sure that everyone, when it is their turn, gets a vaccine."
    },
    {
      "text": "And that is one of the first areas that I'd like to discuss with you, but also on my mind today or what we need to do and collectively what we can do informed by you around what we're seeing around hate crime in America, what we are seeing around people turning on each other, treating their fellow human being as the other, and what we have the ability to do to see this moment of crisis in that regard as also an opportunity for coalition building. So that's on my mind. I'm doing work on the Northern Triangle."
    },
    {
      "text": "Part of the reason I was a bit delayed for this meeting is I was just meeting with our secretary of state. And I know that a lot of you are working on this issue in many ways, but to the extent that you have thoughts and experience about what we can do to address some of the root causes that cause people to flee their home, because as we all know, most people like being at home. They like being where they grew up, they like being in a place where they understand the culture."
    },
    {
      "text": "It is part of their culture, they speak the language. So we have to ask, why do people leave that? And usually they leave because there is a lack of opportunity or it is just not safe. And so my area focused on the Northern Triangle is to deal with some of those issues. And then I would like to also share with you the concerns that I think many of us have about ensuring the right to vote and what we can do to talk with folks and remind them of that vote being an expression of their being."
    },
    {
      "text": "It's about validation in so many ways of one's voice and self-determination and one's ability to have some influence on what happens to their lives. And then what happens if we deprive people of that power and that ability to express themselves. So these are some of the things I'm thinking about. We can solve them over night, I'm being facetious. But I'm still happy to see all of you and it just does my heart and soul well. So thank you. I want to shout out to my pastor, Amos Brown, for joining us."
    },
    {
      "text": "And with that, let's begin our conversation. Speaker 2: () [inaudible :29]. Speaker 3: () Yep. Speaker 2: () Okay. Speaker 3: () Okay. [inaudible :57]. Okay. Well, good afternoon. Good afternoon to all these incredible leaders. I'm so looking forward to our conversation and this being the first of many."
    },
    {
      "text": "I have talked with my team about how over many, many years, Pastor Brown knows this, I've always relied on our faith leaders to partner with us in the work we do, to help guide the work we do and inform the work we do, and so I'm so excited to see all of you. This is the vice-president of the United States' official reception room and you are among some of the first groups that I have met with in this room. You may see, I brought in Frederick Douglass to join me."
    },
    {
      "text": "Actually, that was donated to us from [inaudible :47] Howard University. But I expect that he would be proud of the work that we will do in this room today and over the coming months and years. So thank you all. I'm honored to have you join us and be here this afternoon. And of course, this is a special time of the year, the holy season for so many. We just celebrated Passover, and of course, Easter is coming, Ramadan."
    },
    {
      "text": "And this is a time as we know that it's springtime and here in Washington D.C., the cherry blossoms are blooming. And around the world, we celebrate this time of year spring as a time of renewal and rebirth. A time when I think we know and believe that we can recommit ourselves to the values that we cherish and hold dear."
    },
    {
      "text": "So it's a special time of year, and I want to thank each of you as part of the leadership of our country for in particular, what you have been doing throughout your lives, but in particular, over this last year. This last year, when we look at the incredible loss caused by the pandemic, and it's the loss of life, the loss of jobs, but for so many, the loss of hope."
    },
    {
      "text": "These have been such difficult times, dark times where I think many, and sometimes even including myself, that have challenged our faith, our belief in what is possible, our question about why this is happening. And you all throughout this time have, as you always do, been a source of strength, a source of comfort, a source of counsel. You have worshiped with and held families virtually or in-person who have experienced tremendous loss."
    },
    {
      "text": "As our faith leaders, you have been housing the homeless, you have been feeding the hungry. This is what you do. And over this last year in particular, it has stretched the resources that are not only financial and physical, but spiritual. But yet you are unwavering, you are unwavering."
    },
    {
      "text": "And so I wanted to bring you together in this season to, first of all, thank you and by extension all of the leaders and our faith leaders around the country for the work you have done to be part of the strength and the guideposts and the pillars that in this moment of such turbulence, they've been holding up our ability to retain our faith and maintain our sense of hope. So first, I want to thank you for all of that."
    },
    {
      "text": "And then wanted to talk with you about some of the light that we are seeing as an administration. And I, of course, bring you greetings from the president, from President Biden. And we are seeing light that also comes from the work that we have a responsibility to do as elected leaders around, for example, the American Rescue Plan and the $1,400 checks lifting half of America's children out of poverty. We're so excited about that."
    },
    {
      "text": "The work we are doing to hopefully help people survive through this moment so they can get back up on their feet. So we see light at the end of the tunnel, and in large part because of the vaccinations that are happening, because of the vaccine. And so I want to talk with you about your thoughts, about how we can, and you in particular as our faith-based leaders, can help us to make sure that everyone, when it is their turn, gets a vaccine."
    },
    {
      "text": "And that is one of the first areas that I'd like to discuss with you, but also on my mind today or what we need to do and collectively what we can do informed by you around what we're seeing around hate crime in America, what we are seeing around people turning on each other, treating their fellow human being as the other, and what we have the ability to do to see this moment of crisis in that regard as also an opportunity for coalition building. So that's on my mind. I'm doing work on the Northern Triangle."
    },
    {
      "text": "Part of the reason I was a bit delayed for this meeting is I was just meeting with our secretary of state. And I know that a lot of you are working on this issue in many ways, but to the extent that you have thoughts and experience about what we can do to address some of the root causes that cause people to flee their home, because as we all know, most people like being at home. They like being where they grew up, they like being in a place where they understand the culture."
    },
    {
      "text": "It is part of their culture, they speak the language. So we have to ask, why do people leave that? And usually they leave because there is a lack of opportunity or it is just not safe. And so my area focused on the Northern Triangle is to deal with some of those issues. And then I would like to also share with you the concerns that I think many of us have about ensuring the right to vote and what we can do to talk with folks and remind them of that vote being an expression of their being."
    },
    {
      "text": "It's about validation in so many ways of one's voice and self-determination and one's ability to have some influence on what happens to their lives. And then what happens if we deprive people of that power and that ability to express themselves. So these are some of the things I'm thinking about. We can solve them over night, I'm being facetious. But I'm still happy to see all of you and it just does my heart and soul well. So thank you. I want to shout out to my pastor, Amos Brown, for joining us."
    }
  ]
}