{
  "speech_id": "071",
  "speaker": "Harris",
  "title": "Joe Biden, Kamala Harris, Lloyd Austin International Women’s Day Speeches Transcript March 8",
  "date": "20210308",
  "url": "https://www.rev.com/blog/transcripts/joe-biden-kamala-harris-lloyd-austin-international-womens-day-speeches-transcript-march-8",
  "topics": "Foreign Policy, Social Justice, Veterans Affairs",
  "num_segments": 6,
  "content": [
    {
      "text": "Mr. President, Mr. Secretary, military and national security leaders. We're here today for an extremely important occasion. At this moment, we face global threats to our climate and our health. To our physical security and cybersecurity. Our capacity to meet this moment is determined both by our diplomatic strength and by our ability to build a strong, smart, and sustainable military force. A force that recruits the most talented. A force that retains the most capable. A force that advances the best of the best."
    },
    {
      "text": "General Jacqueline Van Ovost and Lieutenant General Laura Richardson are some of the best and in fact I would say the best of the best. General Van Ovost graduated from the United States Air Force Academy in 1988. Since then, she has logged more than 4,200 hours in the air and she serves today as commander of the Air Mobility Command. Lieutenant General Richardson was commissioned into the United States Army Aviation Branch in 1986."
    },
    {
      "text": "She has flown Black Hawks and commanded battalions and today she serves as commanding general of the United States Army North. General Van Ovost and Lieutenant General Richardson have been tested under the most difficult circumstances and they are proven leaders. The president and I have full confidence in them to address the complex threats we face to help lead our troops and to keep our nation safe."
    },
    {
      "text": "As it is International Women's Day, I should also mention that General Van Ovost and Lieutenant General Richardson are but two of the many, many women who have defended our nation throughout our history. During the American Revolution, women rode horseback through enemy territory to transport sensitive military information. During the Civil War, women disguised themselves as men and fought for the Union Army. In World War II, women served as SPARs, as WACs, as WAVES and WASPs."
    },
    {
      "text": "And today, women military members are stationed around the world. I say this to remind us, while it has only been five years since all combat jobs have opened to women, women have been in the line of fire risking their lives to protect our nation long before that. Today, we know women make up 16% of our active duty military and 19% of our enlisted officers. We also know that women want to serve and that our military is stronger when they do."
    },
    {
      "text": "Look no further than General Van Ovost and Lieutenant Governor Richardson for proof. Recruiting more women to our military, adjusting policies to retain more women, enforcing policies to protect women, and ensure they are heard and advancing more women on fair and equal footing will without any question make our nation safer and that's the work ahead."
    }
  ]
}