{
  "speech_id": "072",
  "speaker": "Harris",
  "title": "VP Kamala Harris European Parliament Speech on International Women’s Day Transcript March 8",
  "date": "20210308",
  "url": "https://www.rev.com/blog/transcripts/vp-kamala-harris-european-parliament-speech-on-international-womens-day-transcript-march-8",
  "topics": "Economy, Healthcare, Social Justice, Climate, Foreign Policy, Government Policy",
  "num_segments": 8,
  "content": [
    {
      "text": "Today, we face crises on almost every front: a pandemic that has taken the lives of more than two and a half million people worldwide, a changing climate threatens the future of our earth, a rise in populism is working to undercut democracies everywhere. Neither the United States nor Europe is immune from these threats."
    },
    {
      "text": "Today, it is essential that we work together to advance those principles that strengthen democracies, accountability and transparency, the rule of law and human rights, and let us not overlook the opportunities right in front of us to do that. We know that the strength of our democracies and the strength of every nation on earth depends on the strength of all people. As half of the world's population, women drive major economic growth and major contributions to society."
    },
    {
      "text": "They are scientists who cure disease and the military members who defend our nations. They are entrepreneurs who create jobs and the educators who shape the next generation. And of course, women are government leaders, from this parliament's first elected president, Simone Veil, to all the women leaders who sit among you today. Today, the global crises we now face have made abundantly clear both the contributions of women and the challenges facing women."
    },
    {
      "text": "Simply put, our world does not yet work for women as it should. COVID-19 has threatened the health, the economic security, and the physical security of women everywhere. The pandemic has overloaded healthcare systems, making it even harder for women to access the care they need. At the same time, women comprise 70% of the global health workforce, putting them on the front lines and at risk of contracting the virus. Other women have been forced out of the workforce entirely."
    },
    {
      "text": "Women working in often overlooked sectors have been hit the hardest, especially those working in low wage jobs and those working in the informal economy. Last year, it was reported that, globally, nearly three in four domestic workers lost their jobs, and those who remain employed, well they're paid far too little. Meanwhile, quarantine measures have meant that women have shouldered an increased burden at home as they care for children day and night."
    },
    {
      "text": "Time in isolation has also increased the risk of gender-based violence, while interfering with services for survivors of domestic violence. I understand that last May, this parliament opened the Helmut Kohl building so that some of these survivors might have a safe place to sleep. I have spent much of my career protecting survivors of domestic violence and child abuse, and I applaud your generosity."
    },
    {
      "text": "As we endure the pandemic, the economic instability, the racial injustice, the threats to democracy, and the effects of climate change, the question before us is simple. How do we build a world that works for women? I believe we must ensure women's safety at home and in every community. We must ensure that women can access high quality healthcare and that those health needs particular to women are addressed."
    },
    {
      "text": "We must treat women with dignity at work and put in place the structures needed so that women can both care for their families and excel in the workforce. Finally, we must give women equal voice in decision-making, for this is essential to free and fair democracies. And this is not just an act of goodwill. This is a show of strength. If we build a world that works for women, our nations will all be safer, stronger, and more prosperous. This International Women's Day, let us be determined in this effort."
    }
  ]
}