{
  "speech_id": "073",
  "title": "VP Kamala Harris Speech National League of Cities Conference Transcript March 8",
  "date": "20210308",
  "url": "https://www.rev.com/blog/transcripts/vp-kamala-harris-speech-national-league-of-cities-conference-transcript-march-8",
  "topics": "Healthcare, Economy, Education",
  "num_segments": 18,
  "content": [
    {
      "text": "Thank you, council member Kathy Maness for that kind introduction and the spirit behind it. And to Mayor Clarence Anthony, the NLC board and staff members, local leaders, it is truly an honor to join with you today. And of course, as Kathy said, we gather at the start of an important week for our country. Yes, we are honoring the women of our country and the world, but this is also a week for our country that could mark a real turning point in our fight against COVID-19."
    },
    {
      "text": "Last weekend, as you know, the House of Representatives passed our American Rescue Plan. It is a plan that will provide immediate relief to America's cities, towns, and villages, and directly to the American people. This past weekend, the Senate advanced this landmark legislation and very soon, the President of the United States, Joe Biden, will sign the American Rescue Plan into law."
    },
    {
      "text": "So for a year now, we have faced this crisis of almost measurable proportions, impacting the health of our communities, the livelihood of our businesses and the education of our children. Through it all, local leaders, you have been in the thick of it. You are the ones who get called when there aren't enough vaccine doses to go around. You are the ones fighting to make sure first responders can keep their jobs. You are working with teachers and parents to get schools reopened safely."
    },
    {
      "text": "You are working with small businesses to keep their doors open and working at food distribution sites in what remains of your spare time. Being a local leader has always been a 24/7 job, and this year I know has tested the limits. And still you keep getting up every morning and working to make things better. So on behalf of myself and President Biden, who I think you'll all know both of us served as local leaders, we thank you. We thank you. We thank you."
    },
    {
      "text": "When the President and I were preparing to take office, we knew what you were up against. We knew we needed to be ready to go on day one, so we started working with you to put a plan in place to rescue our nation from this pandemic. I'm proud to report that we've made incredible progress. More than 80 million vaccines have now been administered. Last week, 18 million doses were sent so states, to pharmacies, and community health centers."
    },
    {
      "text": "Merck and Johnson & Johnson, competitors before now, are teaming up to speed up manufacturing, which means that we should have a full vaccine supply for adults by the end of May. And to get shots in arms more quickly, we've opened new vaccination centers in a number of places, in the place of my birth, Oakland, California, in Los Angeles, in Houston, in Dallas, in Arlington, Tampa, Orlando, Jacksonville, Brooklyn, Queens, and upstate New York."
    },
    {
      "text": "One opened in Philadelphia last week, others will open in Chicago and Greensboro this week, and another two are coming to Atlanta and Cleveland soon. So as you know, we've all been busy and we're doing this, all of this, as I've mentioned, as we advance our American Rescue Plan. This plan is big, and it is bold, and it will help us beat this virus and build back our economy."
    },
    {
      "text": "With this plan, we will scale up our vaccination program, get relief to the small businesses that fill your main streets, and get your schools safely reopened. The bill provides targeted support for as many as 19,000 cities, towns, and villages. And we know many of you are dealing with budget shortfalls as revenues are down and of course, expenses are up."
    },
    {
      "text": "As a result, vital services have been cut, and I know you didn't want to, and we've lost more than 1.3 million state and local government jobs in just the past year. In the aftermath of the great recession, these kinds of cuts put a significant drag on our economic recovery. Guys, we can't let that happen again. The American Rescue Plan will also get $1,400 checks in the pockets of people who need them most and a $3,000 tax credit per child."
    },
    {
      "text": "Think about it, this plan will actually lift one in three Black and Latino Americans who are living in poverty and lift them out of poverty. We will also lift half of America's children who are living in poverty out of poverty. I mean, just think about that, half of the children in our country who are living in poverty won't be. So the American Rescue Plan, for that and so many other reasons is, and we are happy to say, incredibly popular. The support for it is broad and it is bi-partisan."
    },
    {
      "text": "Three in four Americans support the bill. Democratic and Republican mayors and local leaders have endorsed it and of course, so has the National League of Cities. Thank you for that. Think about it, two mayors, just most recently, a Republican from Miami and a Democrat from St. Petersburg wrote an op-ed about why they support the plan. They said in the op-ed, \"Our people need help."
    },
    {
      "text": "And as the President would say, help is on the way.\" Today, the American Rescue Plan is very close to becoming the law of the land and now we need to help ensure that relief is distributed equitably. Equitably. That means we need to acknowledge, and so many of us do, we need to acknowledge the pandemic has made worse the fissures, and the flaws, and failures that already existed in our systems and in our structures."
    },
    {
      "text": "We've seen that race and place matter a lot in how well protected a person is from the virus or not. And race and place have played a role in access to services. So one way we're addressing this is with our COVID-19 Health Equity Task Force. This task force stemmed from a bill I introduced in the United States Senate, to have a dedicated group of experts who report on the disparities that exist in the allocation of resources."
    },
    {
      "text": "The task force is required to make recommendations on how to solve for those problems, and local leaders are vital. You are vital to the solution. So today we have a big announcement and we're actually making it right here with you because it will have a direct impact on the communities that you serve. Our administration will offer $250 million in grants for localities to partner with community organizations on health literacy."
    },
    {
      "text": "Our goal is to provide underserved communities with the information they need to stay safe and to get vaccinated. Remember, information and education of course, saves lives. When folks have the information and the education, they have the tools that equip them to take care of themselves and their family. We expect to fund 30 projects in urban communities and 43 projects in rural communities for two years."
    },
    {
      "text": "But I ask the friends here, please do work with us to put equity at the center of our collective response, to identify those individuals and communities who have been overlooked, and to connect them with the resources that are available and to connect with them in a way that we renew and in some cases, establish trust between community and those folks who are elected to serve those communities. Also, we've got a child tax credit coming that they can take advantage of, so please tell them about it."
    },
    {
      "text": "Tell them about the Paycheck Protection Program and the loans there for small businesses. Please tell your folks about how to get vaccinated at pharmacies and community health centers and mobile units. And please continue to tell everyone you know to wear a mask. This brings me to my final point, the American people will continue to look to you as much as they look to me or the President because of your tireless efforts, because they know they can rely on you."
    },
    {
      "text": "They will continue to look to you for answers, and for action, and for comfort, and for hope. I know it's not an easy job, but what you do, especially at this moment of crisis, couldn't be more important. So thank you again for all you do. I know it takes personal sacrifice and sleepless nights, but know that the President and I are working right alongside you. So may God bless you and may God bless America. Thank you all."
    }
  ]
}