{
  "speech_id": "074",
  "title": "President Biden and Vice President Harris Deliver Remarks on the Affordable Connectivity Program 5/09/22 Transcript",
  "date": "20220510",
  "url": "https://www.rev.com/blog/transcripts/president-biden-and-vice-president-harris-deliver-remarks-on-the-affordable-connectivity-program-5-09-22-transcript",
  "topics": "Technology, Education, Infrastructure, Government Policy",
  "num_segments": 9,
  "content": [
    {
      "text": "Good afternoon, everyone. Please have a seat. Good afternoon. President Joe Biden, members of the cabinet, members of Congress, internet service providers, and all of the advocates and organizers who are working every day to connect our communities, thank you all for your leadership. I will begin today with a quick story. Earlier this year I met a young woman named Julisa. Julisa is a high school senior from Pennsylvania. For years she did not have high speed internet at home."
    },
    {
      "text": "Her family, however, found ways to make due without. Then the pandemic hit and Julisa began attending school virtually. She told me she did the best she could. She completed homework assignments on her phone and relied on a spotty mobile hotspot to virtually attend class. But without reliable access to high speed internet Julisa began to fall behind. Her story is the story of so many people."
    },
    {
      "text": "Today, more than 30 million people in our country do not have access to high speed internet, either because they live in communities where high speed internet is not easily available or more often because they cannot afford the cost of a plan. These folks, they're our seniors who have to take their telemedicine visits in the local library without the privacy that they want and are due. These are parents who cannot afford to work remotely, and small business owners who cannot sell their products online."
    },
    {
      "text": "These are students like Julisa, who are being held back from achieving their incredible and God-given potential. In the 21st century access to the internet is essential for success. Every person in our nation, no matter how much they earn, should be able to afford high speed internet and a high speed internet plan. So that is why we are all here together today."
    },
    {
      "text": "Through this program, if a member of your household receives SNAP benefits, Medicaid, free or reduced price school lunch, or a number of other programs, or if your household makes below a certain income, then you are eligible to receive a discount on your monthly internet bill of $30 a month or $75 a month if you live on tribal lands. Altogether nearly 40% of American households are eligible for this important program."
    },
    {
      "text": "And so far we have helped more than 11 and a half million households lower their monthly bills and have access to affordable high speed internet. Households like Julisa's. In may of 2020 her family signed up for high speed internet through the ACP, and because of this initiative Julisa could attend class and do her homework without worrying about her internet connection."
    },
    {
      "text": "And she told me the ACP single handedly saved her junior year, and this fall, she will be the first in her family to attend college at her top choice school. Indeed. So the point, of course, is that when we connect people with high speed internet, we connect them with opportunity, the opportunity to get an education, to train for a new career, to build a business, to keep in touch with loved ones who are far away. In short, the opportunity to live healthier, happier, and more prosperous lives."
    },
    {
      "text": "This is what so much of our work as an administration comes down to. Fighting to make sure every person, no matter who they are or where they start, has the opportunity to succeed and thrive. Today we take another step forward in that fight. Earlier this year, our administration called on internet service providers to take action to help folks get internetted and connected, in part by offering more affordable high speed internet plans to their customers."
    },
    {
      "text": "As the president will speak in a moment, the providers joining us today have answered that call. Before you hear from them, it is my great pleasure to introduce a woman who has felt the impact of this program firsthand. A mother who knows the difference that access to high speed internet can make for the young people of our nation. Please welcome Alicia Jones."
    }
  ]
}