{
  "speech_id": "075",
  "title": "Kamala Harris AAPI Unity Summit Speech Transcript May 19",
  "date": "20210519",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-aapi-unity-summit-speech-transcript-may-19",
  "topics": "Social Justice, Economy, Government Policy",
  "num_segments": 14,
  "content": [
    {
      "text": "All right. Thank you. Thank you for everything you do. And to all the leaders who are part of this convening this evening, I thank you each and every one of you. Needless to say, there are people who we may never meet and people who may never know your name who are benefiting because of your work, your hard work and your advocacy and your strength and your courage and your commitment. So with that, I say, good evening. It is an honor to be with everyone this evening."
    },
    {
      "text": "And I want to begin of course, by thanking our chairman Shekar and Natalie Reyes and Stephanie Brown James for your leadership. The work of the AAPI Victory Alliance is so important, and it is the work of mobilizing our AAPI community, of strengthening the community and strengthening our democracy for all Americans. And this work could not be more important. So thank you all. As we emerge from the pandemic, I believe that we are at the start of a new era."
    },
    {
      "text": "I believe that we have a unique opportunity now to shape our nation's future, to transform how we live, how we work and how we vote for the better. First, we have the opportunity to shape how we live and what I mean by that is how we live together, how we live together as one nation built by many, how we respect one another, and how we see one another. So early on in the pandemic, 1100 anti-Asian hate incidents had been reported."
    },
    {
      "text": "Over a year later, just about a year later, we are now up to more than 6,600 and nearly two and three were reported by women. And I will tell you as the previous attorney general of California and I published hate crime reports, those numbers are always under reported, so the numbers I just shared with you are not an accurate reflection necessarily of the number of hate crimes that have actually occurred."
    },
    {
      "text": "In March, President Joe Biden and I sat down with Asian American leaders in Atlanta, Georgia days after the shootings, tragic shootings that killed eight people, six of whom we all know were of Asian descent, seven who were women. And I spoke then about how Asian Americans have the right to be recognized as American, not as the other, not as them, but as us."
    },
    {
      "text": "In America, I do believe leave a harm against any one of us is a harm against all of us, and we should all then recognize that interconnection between each of us. And that is why thanks to leaders like my dear friend, Senator Mazie Hirono and the great Grace Mang, a Congresswoman from New York, Congress passed the COVID-19 Hate Crimes Act. And that is why the President will soon sign this historic bill into law. Second, we have the opportunity to shape how we work."
    },
    {
      "text": "And I'm talking about putting Americans to work in good union jobs. The AAPI community knows the power of unions building on the tradition of the Filipino farm workers who organized in the 1960s to the fact that as of today, we know at least 10% of AAPI workers are represented by unions."
    },
    {
      "text": "And we are working of course, to increase that number because it is about making sure that all workers have a voice in a way that we ensure they are paid for the value of their work, and they work in a place that gives them safety and protection. I'm also talking about removing the barriers that make it harder for people to work. And that means lowering the cost of childcare and strengthening our care infrastructure for those with aging relatives."
    },
    {
      "text": "We were all raised to take care of our elders, to understand how much they deserve to have our respect and dignity, and so that is a priority for us because everyone who wants to work should have the support they need to support their family members, including their elders and do what they need to do to work. Finally, we have the opportunity to shape how we vote. We have the opportunity to make voting easier, not more difficult, to lift up more voices, not fewer."
    },
    {
      "text": "And we must start by fighting against attacks on voting rights and it is happening right before us in so many instances in such a blatant way and in an unapologetic way, so we must fight against those attacks. Since the start of 2021, more than 3,360 bills to restrict the right to vote have been introduced in nearly every state in the United States of America."
    },
    {
      "text": "Many of these bills specifically target vote by mail and let's be clear about this, specifically target vote by mail while 64% of Asian-Americans vote by mail. In fact, in Georgia, in the state of Georgia in the runoff election that just happened, which by the way changed the balance of the United States Senate, so that now I'm the tie breaker, well, nearly 34% of Asian-Americans voted by mail compared to 24% of voters on average. So we must see these efforts for what they are. Let's be clear-eyed."
    },
    {
      "text": "They are an attempt to suppress the right to vote. And while we must be vigilant in defending the voting rights that currently exist, we must also do that and work to expand the right of all Americans to vote, and that includes urging Congress to pass the John Lewis Voting Rights Advancement Act and urging the Senate to pass the For the People Act and to send both to the President's desk for signature."
    },
    {
      "text": "And I want to be clear, as far as I'm concerned, voting rights is not a democratic right or a Republican right. It is an American right. So let me end today where I began with where I see us in terms of this new era that I believe we are in. I know this past year has been marked by pain, so much pain for so many, including and in particular members of the AAPI community when we saw the targeting, when we've seen the hate, when we've seen the viciousness of it all. And we all see that."
    },
    {
      "text": "And as a member of this community, I share in that outrage and grief. And I believe we have an opportunity now to turn that pain into action, to turn that pain that righteous anger, because of the injustice of it, we have an opportunity to turn that into power, into power. The work to transform our nation's future. And it is what I call American aspiration. It is the ability to see what can be unburdened by what has been. It is the determination not only to dream, but to do."
    }
  ]
}