{
  "speech_id": "076",
  "title": "Biden and Harris Deliver Remarks for National Small Business Week Transcript",
  "date": "20230502",
  "url": "https://www.rev.com/blog/transcripts/biden-and-harris-deliver-remarks-for-national-small-business-week-transcript",
  "topics": "Economy, Government Policy",
  "num_segments": 9,
  "content": [
    {
      "text": "Good afternoon everyone. Please have a seat. Good afternoon. Well, happy Small Business Week to everyone. And congratulations to all of you. It is a great honor to be with these extraordinary Americans who are our incredible small business leaders. And, of course, it is great to be with our administrator, Isabelle Guzman. And I thank you for your work and a special thank you to our president, Joe Biden. Our president has long been a leader on this and so many other issues, but he's quite passionate about this one."
    },
    {
      "text": "And I will tell you, working with him and having the honor of doing that, no matter what room he is in, when the cameras are on or when they are off, President Biden is always fighting for America's small business owners and entrepreneurs. And so we all thank him, of course, for his leadership in that regard. () Small business owners are the backbone of America's economy. You are."
    },
    {
      "text": "Through your creativity, tenacity and determination, you help create prosperity and opportunity for millions of people in our country. Our small business owners are business leaders and our small business owners are community leaders and civic leaders. You train young people and hire locally. You support the local softball team. You are role models and mentors. And I'll tell you, I've seen it my whole life. () Growing up, my mother worked long hours and long days, and weekends from time to time."
    },
    {
      "text": "And when she did, my sister Maya and I would go a couple doors over to Ms. Shelton's house. So Ms. Shelton ran a nursery school, and we actually lived in the apartment above the nursery school, and Ms. Shelton was our second mother. She was a small business owner and I would not be here today without her. Because you see, Mrs. Shelton was a fixture in our community. She gave support and advice to the young parents in the neighborhood and folks who are going through challenges just as so many of you do."
    },
    {
      "text": "() And as District Attorney of San Francisco, in my career, as Attorney General California and United States Senator, and now as Vice President, I have worked with and met with thousands of small business owners. Folks like you who are here, who fight every day to build a better future for the people you love, for the community you call home, and for our country."
    },
    {
      "text": "() You power the ambition and aspirations of our nation and that is why we are fighting every day to make sure you have the resources and the support that you need. For example, we know there are so many small businesses owners who hire employees but want to hire more because your business is growing. Small business owners who want to stock the shelves and make sure you have enough in terms of the supply you need, to do what you need to do in your community."
    },
    {
      "text": "Small business owners who need more capital because you want to design a new product or build a new store, ... Store. But who cannot because you don't have access to capital. And so building on the work that I did as a United States senator, our administration is investing billions of dollars in community banks. Which are the institutions that help provide capital and financial support to small business owners. In particular, those in overlooked and underserved communities, including our rural communities."
    },
    {
      "text": "() What's more? Last year we built an historic public-private partnership to help address this issue. We partnered with consumer banks, investment firms, technology companies, and philanthropies to combine the expertise and experience of the private sector with the reach and capacity that can only be provided by the government. As a result, we have secured tens of billions of dollars in private sector investment for small businesses and communities across America. And we are just getting started."
    },
    {
      "text": "So with your support, President Biden and I will continue to fight to make sure every small business owner in our nation and every aspiring small business owner has the opportunity to not only survive, but thrive. And with that, please join me to welcome to the microphone, a leader who exemplifies the excellence of all the small business owners who are here today, Jill Scarborough."
    }
  ]
}