{
  "speech_id": "078",
  "speaker": "Harris",
  "title": "Kamala Harris U.S. Naval Academy Commencement Speech Transcript May 28",
  "date": "20210528",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-u-s-naval-academy-commencement-speech-transcript-may-28",
  "topics": "Climate, Foreign Policy, Technology",
  "num_segments": 20,
  "content": [
    {
      "text": "Good morning. Good morning. Speaker 1: () Good morning. Acting Secretary Thomas Harker, General David Berger, Admiral Mike Gilday, looking out at these midshipmen, I know we are all filled with pride. Vice Admiral Sean Buck, Captain TR Buchanan, faculty and staff, thank you for educating such a fine crew. Alumni, thank you for the support you have shown over these years to this great institution."
    },
    {
      "text": "And to my military aid, Lieutenant Colonel Frank Machniak, who graduated in 2004, I'm very proud to have you with me here today. Family and friends of these graduates, thank you for the sacrifices you have already made and will make. And I also want to acknowledge Kim and John Johnson. Your son was taken far too soon and I promise you that he will not be forgotten. And finally, to the class of 2021, congratulations. Congratulations. And look how far you've come. So you endured  PT and PRONO exams."
    },
    {
      "text": "You excelled on athletic fields and in academic exercises. You enjoyed the fair at Dillows. I know. Karaoke at Harvest. You guys rolled up your sleeves and you got vaccinated and you made it to this day. You made it to this day. And this day, this day that is not only a commencement, this day that is a commissioning. And in a few minutes, you will take an oath."
    },
    {
      "text": "And it's actually the same oath I took as Vice President, an oath to support our Constitution and defend it against all enemies, an oath that has its roots in the founding of our nation. And no matter what changes in our world, the charge in this oath is constant. Remember that as you walk out into the world, because the world you all are walking into is rapidly changing. In fact, we are at a significant turning point. Just look at the last several months and you know what I'm talking about."
    },
    {
      "text": "And look at several moments in our nation's history for perspective. Think about it. There was the world before the stock market crashed in 1929, and the world after, the world before the attack on Pearl Harbor in 1941, and the world after, the world before the Civil Rights Act in 1964, and the world after, the world before the Berlin Wall fell in 1989, and the world after. At some of these critical moments, our nation was compelled to take a hard look at both our priorities and our preparedness."
    },
    {
      "text": "And another turning point was September 11th, 20 years ago this year, when airplanes hit the twin towers and our Pentagon, when Flight 93 crashed in Pennsylvania. That day shaped your entire life and it shaped our entire nation. It tested our systems, our structures, our very standing in the world. Well, midshipmen, we are now entering the next era, a new age, a new epoch with its own tests, with its own challenges, and with its own opportunities."
    },
    {
      "text": "The global pandemic you see, of course, has accelerated what was happening before and it has accelerated our world into a new era. It has forever impacted our world. It has for ever influenced our perspective. And if we weren't clear before, we know now our world is interconnected, our world is interdependent, and our world is fragile. Just think, a deadly pandemic can spread throughout the globe in just a matter of months, a gang of hackers can disrupt the fuel supply of a whole seaboard."
    },
    {
      "text": "One country's carbon emissions can threaten the sustainability of the whole earth. This, midshipmen, is the era we are in and it is unlike any era that came before. So the challenge now, the challenge before us now is how to mount a modern defense to these modern threats. So let me share with you, for example, a personal experience. A few years ago when I was in the United States Senate, I visited the USS Scranton. It was outside of San Diego, California."
    },
    {
      "text": "And at the time, I was also a member of the Senate Intelligence Committee. So when I was aboard the vessel, I asked the officers, I said, \"Hey, tell me, what does it take to protect such a valuable asset against cyber attacks?\" And they told me, \"You know, it's pretty simple, equipment and experts.\" Well, the way I see it, midshipmen, you, you, you are those experts on the issue of cybersecurity."
    },
    {
      "text": "Foreign adversaries have their sights set on our military technology, our intellectual property, our elections, our critical infrastructure. The ransomware attack by criminal hackers earlier this month, well, that was a warning shot. In fact, there have been many warning shots. So we must defend our nation against these threats."
    },
    {
      "text": "And at the same time, we must make advances in things that you've been learning, things like quantum computing and artificial intelligence and robotics, and things that will put our nation at a strategic advantage, and you will be the ones to do it. You will be the ones to do it because the United States military is the best, the bravest, and the most brilliant."
    },
    {
      "text": "And just think, from walkie talkies to the internet, to satellite navigation, the United States military has been on the forefront of research, development and technological advancement. That is a point of American pride. And as I look out at all of you, I know you will build on that leadership. And then of course there is climate change, which is a very real threat to our national security. And I look at you and I know you are among the experts who will navigate and mitigate this threat."
    },
    {
      "text": "You are ocean engineers who will help navigate ships through thinning ice. You are mechanical engineers who will help reinforce sinking bases. You are electrical engineers who will soon help convert solar and wind energy into power, convert solar and wind energy into combat power. And just ask any Marine today, would she rather carry 20 pounds of batteries or a rolled up solar panel, and I am positive she will tell you a solar panel, and so would he."
    },
    {
      "text": "The American people are depending on you, the best, the bravest, the most brilliant. We saw this during COVID-19 when Americans watched how members of our military helped vaccinate our nation, because you know biological threats like pandemics and infectious diseases are yet another threat in this era. And you are confronting this threat. Our military helped develop the technology that made the vaccine possible. Naval researchers also figured out how to use 3D knitting machines to make masks."
    },
    {
      "text": "Naval labs monitored the spread of the disease. And the Marine Corps and the Navy are leading on making the connection between the pandemic and medical readiness of our fighting forces for the future. Class of 2021, you are prepared for all of this. You are prepared for any threat and you are prepared for this new era. And it is not only because of the knowledge and the skills you gained here or those you will continue to learn, but it's because of something more. It's because of who each of you is."
    },
    {
      "text": "It is because of who collectively you are. So as I conclude today, that's what I want to talk about. I want to talk about you. As Vice President, I've come to know the United States Navy quite well. Every day, in fact, I'm surrounded by sailors and Marines and your tradition and your history. And I mean that literally. So I often travel on Marine Two. In fact, that's how I arrived today. My residence is on the grounds of the United States Naval Observatory."
    },
    {
      "text": "My west wing office features a desk built by [inaudible :55] from timbers of the USS Constitution. My ceremonial office was once occupied by the Secretary of the Navy, and displayed there, I have placed the shoulder boards of your brigade commander, Midshipman Sydney Barber. And so here's what I know. Midshipmen, you are tireless. You are ambitious. You are a fierce fighting force. You are idealists in the truest sense. You are the embodiment of American aspiration."
    },
    {
      "text": "So hold on to that, because in your career, you may witness some of the worst of humanity, but promise that you will never forget the best of who we are, that you will never forget the ideals you stand for, duty, honor, loyalty. Fight for those ideals and fight for our democracy. And remember, our Constitution is not only something to defend, it is a guide. It is a guide for your service. It begins with three simple words, We the People, not I, we."
    },
    {
      "text": "Our nation was designed to be a team sport and we are in this together. So finally, I'll just share with you on my way to the stadium this morning, I stopped by the cemetery to pay my respects to my dear former colleague, a great and courageous American, Senator John McCain. Yes. So most people don't know he wanted to be buried next to his best friend who he met on the yard, Admiral Chuck Larson. That is the ultimate example of what I mean, in it together."
    },
    {
      "text": "So midshipmen, throughout our history, officers in the United States Navy, officers in the United States Marine have risked everything to defend our freedoms. Today, you will swear to do the same. You are the next links in the chain. And so, midshipmen, when you stand to take the oath, I want you to know that as we embark on this new era, President Joe Biden and I, our entire nation have great faith in you and we are proud of you, so very, very proud. Congratulations again."
    }
  ]
}