{
  "speech_id": "080",
  "title": "Kamala Harris Speech Transcript Washington Conference on the Americas May 4",
  "date": "20210504",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-speech-transcript-washington-conference-on-the-americas-may-4",
  "topics": "Foreign Policy, Immigration, Climate, Social Justice, Economy",
  "num_segments": 20,
  "content": [
    {
      "text": "Good morning. Good morning. It is truly an honor to be with you today. Thank you, Andrés Gluski, Susan Segal, Aaron Farnsworth for your leadership. The membership of the Council of the Americas includes so many leaders who are truly committed to strengthening economies and democracies throughout the Western Hemisphere. I'm very pleased to join you today. Last week, President Joe Biden and I reached the 100th day of our administration."
    },
    {
      "text": "In that time, we have let the world know, and the president has been very clear about this, America is back. We have rejoined the Paris Agreement, we are ending our nation's longest war, we are rebuilding our alliances and engaging partners all over the world, and we are revitalizing our relationships throughout the Western Hemisphere from the southern most parts of South America to the northern most parts of Canada and everywhere in between."
    },
    {
      "text": "The Western Hemisphere is our home, and because it is our home, because the people within it, our neighbors, it is imperative that we promote democracy and good governance, security and prosperity within the region. It is also important that we build relationships throughout the hemisphere that are based on dignity and diplomacy, relationships that are both candid and collaborative. The strength of the United States of America depends on the strength of all of the Western Hemisphere."
    },
    {
      "text": "In so many ways, our fates are intertwined. That is especially true of Latin America, one of our fastest growing trade partners, to be sure our relationship with Latin America is bigger than trade and our relationship is incredibly complex and at times has been incredibly complicated. Today, I want to make clear that our administration firmly believes in the potential of the region and in the power of the people of the region. Latin Americans are shaping their own future. They are writing their story."
    },
    {
      "text": "They hold the pen. As I see it, our role is to read those words, take them in, and help however we can as Latin America writes its own next chapter. Put another way, the United States is committed to supporting the vision of the people in the region in their needs for relief, in their hope for opportunity, in their calls for justice. Eight years ago, President Joe Biden addressed this conference. Then vice president, he led our nation's diplomatic efforts within the Northern Triangle and with Mexico."
    },
    {
      "text": "Recently, he asked me to take the lead. This is a priority for our nation and a role that I take very seriously. We are all well aware of the immediate situation. The citizens of El Salvador, Guatemala, Honduras are leaving their homes at alarming rates, but there's a fundamental truth behind that headline. People in the region do not want to leave their homes."
    },
    {
      "text": "I'm thinking about people whose homes have been washed away by hurricanes, people who are parents who have sons who have been threatened by drug cartels, people who have daughters who have been targeted by human traffickers, people who do not have enough to eat, people who are out of work, people who have lost hope. That's why they leave home and come to the United States. They are suffering. They are in pain. Many are experiencing unimaginable anguish. We want to help. Our administration wants to help."
    },
    {
      "text": "We want to pick back up the kind of work President Joe Biden started when he was vice president. We want to help people find hope at home, and so we are focused on addressing both the acute factors and the root causes of migration. I believe this is an important distinction. We must focus on both. First, the acute factors, the catastrophes that are causing people to leave right now; the hurricanes, the pandemic, the drought, and extreme food insecurity. Then there are the long standing issues, the root causes."
    },
    {
      "text": "I'm thinking of corruption, violence and poverty, the lack of economic opportunity, the lack of climate adaptation and climate resilience, the lack of good governance. Just this weekend, we learned that the Salvadorian parliament moved to undermine its nation's highest court. An independent judiciary is critical to a healthy democracy and a strong economy. On this front, on every front, we must respond."
    },
    {
      "text": "There is much work that needs to be done to combat violence in the Northern Triangle, violence against Afro-descendants, violence against indigenous people, violence against LGBTQ people, violence against young people, violence against women. I've spent much of my career defending survivors of sexual assault and domestic violence. I have fought for the equality and the safety of every group I just named. I believe, as I know all of you do, that we must stand up for the basic human rights of all people."
    },
    {
      "text": "When those rights are violated, I will say it again, we must respond. In El Salvador, in the face of violence, we must focus on high crime areas and give young people alternatives to gang recruitment. In Honduras, in the wake of hurricanes, we must deliver food, shelter, water, and sanitation to the people. In Guatemala, as farmers endure continuous droughts, we must work with them to plant drought-resistant crops. We must also help them and help women farmers increase their harvests."
    },
    {
      "text": "This work makes a difference. However, no matter how much effort we put in on curbing violence, on providing disaster relief, on tackling food insecurity, on any of it, we will not make significant progress if corruption in the region persists. If corruption persists, history has told us it will be one step forward and two steps back."
    },
    {
      "text": "We know corruption causes government institutions to collapse from within, preventing people from getting their children educated, from getting a business started, from getting a fair trial. In the Northern Triangle, we also know that corruption prevents us from creating the conditions on the ground to best attract investment. Around the world, we know that corruption inhibits shared prosperity. In fact, the global cost of corruption is as much as 5% of the world's GDP. 5%."
    },
    {
      "text": "The work from combating corruption to combating climate change will not be easy, and it is not new, and it could not be more important, and it will take all of us, all of us. The United States cannot do it alone. With all of us gathered here today, I'm very hopeful about what we can accomplish together. Our administration is implementing a comprehensive strategy with governments and international institutions, the private sector, foundations, and community organizations."
    },
    {
      "text": "The idea here is that our work will be coordinated and that every sector will have a role to play. First, regional governments. Governments in the region can take on corruption, lift up their communities, and provide safety and security for their citizens. For instance, last week, I had a bilateral meeting with the Guatemalan president and we agreed to strengthen cooperation to shut down human traffickers and smugglers. In just a few days, I will meet virtually with the president of Mexico."
    },
    {
      "text": "In a month from now, I will visit both countries. Second, there is a role for governments outside of the region and international institutions. The United States ambassador to the United Nations is working within the UN to support their humanitarian response plan. I've also spoken with world leaders from Canada, Finland, Ireland, Japan, about partnering with us to help the Northern Triangle. For our part, the United States has announced that we will send an additional $310 million to the region."
    },
    {
      "text": "Departments and agencies across our federal government are joining in this effort. The United States Department of Commerce is planning a virtual trade mission. Our Agricultural Department is increasing food assistance. USAID has deployed a Disaster Assistance Response Team. As I told our cabinet secretaries, we must be ambitious and deliberate. We must also be proactive, not just in the Northern Triangle, but across Latin America. Third, we must think beyond government."
    },
    {
      "text": "I've spoken with foundation leaders who have been sending support to the region for a long time and are now prepared to do more. I've also been engaging with a number of businesses in the United States and business leaders in the United States about their interest in investing in the region and the barriers that may stand in their way. Private sector investments can create jobs and speed up progress."
    },
    {
      "text": "Meanwhile, community organizations can help us implement a place-based approach, targeting those communities that have been hardest hit. Community organizations will also help us to restore hope. Last Tuesday, I had a virtual meeting with a group of longstanding community leaders in Guatemala. They talked about the work they have been doing to feed people, to house people, to find people jobs, all while taking on relentless corruption."
    },
    {
      "text": "It is hard and difficult work that they do, and they are 100% committed to it, and they've committed their lives to it. They are committed to building a better life for all of those people they serve. When I met with those leaders, I was reminded not only of the region's problems, but also of its potential; its potential to recover, its potential to rebuild, its potential to write its next chapter."
    }
  ]
}