{
  "speech_id": "081",
  "title": "Joe Biden & Kamala Harris COVID-19 Press Conference After Meeting with Governors Transcript",
  "date": "20201119",
  "url": "https://www.rev.com/blog/transcripts/joe-biden-kamala-harris-covid-19-press-conference-after-meeting-with-governors-transcript",
  "topics": "Healthcare, Economy, Social Justice, Government Policy",
  "num_segments": 4,
  "content": [
    {
      "text": "Good afternoon. President Elect Biden and I just met with a bipartisan group of Democratic and Republican governors. We talked about what we need to do to make free testing available for everyone, to make a free vaccine available for everyone, and to get this pandemic under control. Governors are elected by their States to take action in moments of crisis. They're the ones who go to the places and talk to the people who are hardest hit."
    },
    {
      "text": "And during this pandemic, they have been called on to make very difficult decisions about the health and safety of the people they represent, about opening schools and about opening our economy responsibly. I have served in both state and local government, so I understand the critical role our governors play, and they will have partners in the White House starting on January 20th. Because as Governor Herbert said in our meeting, when the states are successful, the country is successful."
    },
    {
      "text": "So our message to our governors and to all of our nation's state and local leaders is simple. President Elect Biden and I will make sure you have the resources and support you need to save lives and help get our economy back on track. And we will also make sure that our federal state local and tribal authorities are working closely together so we can tackle these challenges as effectively as possible. Because when it comes to this pandemic and the economic recovery, we are not Democrats or Republicans."
    },
    {
      "text": "And so there was consensus among the governors, bipartisan consensus, that our federal strategy should reflect those concerns in a way that we support the states with the resources they'll need to get to the folks who have been often overlooked or ignored. And the President Elect, I think, has made it very clear that it's one of our highest priorities to support that. As you may know, in the Senate, I actually led what we called Racial Disparities Task Force."
    }
  ]
}