{
  "speech_id": "081",
  "title": "Kamala Harris Press Conference After Paris Peace Forum Transcript November 12",
  "date": "20211112",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-press-conference-after-paris-peace-forum-transcript-november-12",
  "topics": "Foreign Policy, Healthcare, Climate, Technology, Veterans Affairs",
  "num_segments": 59,
  "content": [
    {
      "text": "This trip, I believe signals in a very clear way, the enduring, the longstanding and the future Alliance and commitment between people of the United States in France and our governments. I believe that this trip also reaffirms the commitment of the United States to working with our worldwide. As many of you are aware, this week and this visit included many conversations with many foreign leaders."
    },
    {
      "text": "I believe there are at least 30 heads of state who have attended the various meetings that we have been having, and decisions have not only been a bilateral conversation between the president of France and myself, but meetings and discussions that we've been having with leaders around the globe."
    },
    {
      "text": "I said many times, many of you in the American press have heard me say it that I believe we are at the beginning of a new era, as highlighted by the pandemic to be sure, but also marked by the increasing awareness, see COP26, of the climate crisis and the immanency of that and the urgency of this moment, technology, what it has done in terms of creating opportunities, but also creating real concerns about security. We are at the beginning of a new era."
    },
    {
      "text": "In fact, this is something that President Macron and I talked about extensively. And in then this moment, for nations who are partners and allies, we must together work together to see where we are, where we are headed, where we are going and our vision for where we should be, but also see it as a moment, yes, to together address the challenges and to work on the opportunities that are presented by this moment. So that was, in many ways, the theme of this visit."
    },
    {
      "text": "It was to also discuss, and in particular with President Macron and our friends in and allies in France, what we must do collectively with our other partners and allies to address and to focus on what should be the norms and the rules of the 21st century. To that end, we had a number of conversations, including, again, with other world leaders, but in particular, with President Macron, I talked about a number of issues and I'll outline several of them."
    },
    {
      "text": "The issue of global health, of course one of the most pressing challenges that all nations are facing. As you know, the first visit that we made upon landing essentially in Paris, was to go to the Institute Pasteur, of course, I also have a personal sense of connection to that place. My mother did research there."
    },
    {
      "text": "In fact, when we were at the Pasteur Institute, we will recall that it was in 1961 that mRNA was developed, which of course was not only the basis for the work that we talked about in terms of the advances in breast cancer, but the basis for the vaccine that is now saving lives around the globe."
    },
    {
      "text": "We talked about the pandemic in the context of global health, in the context of our need to prepare for the next pandemic and what our two nations have a moral obligation and responsibility to do in terms of not only addressing the public health needs of our own citizens, but participating with our friends around the globe, and in particular, those that are most vulnerable and most in need."
    },
    {
      "text": "You'll recall yesterday, one of the panels world leaders talked specifically about the disparities and inequities in terms of vaccine distribution around the world. That was a priority for our discussions while we were here. The issue of space. While I of course chair the Space Council for the United States, but when we look at the opportunities that are presented by space exploration, they are vast."
    },
    {
      "text": "President Macron and I talked specifically about the partnership in the ongoing partnership that the United States and France have had as it relates to emerging technologies and how they connect to economic security and to national security. So we had an in depth conversation about our intention to grow the relationship that we have as it relates to space."
    },
    {
      "text": "And again, that relationship is not only convening the experts and the most talented of our respective nations to engage in ongoing innovation, but also, and critically important, to work together as allies in establishing universal norms around what will be the behaviors in space and how they will be interpreted by all nations. In many ways, when we think about space exploration, it is the next frontier and we are the leaders in this pursuit."
    },
    {
      "text": "And what we do now without any doubt, incrementally or expansively, will have a profound impact on where this issue ends up in the years and decades to come. We talked about regional security. Again, the alliance between France and the United States is long standing on that issue. As we celebrated Armistice Day, Veterans Day, as we went to the American cemetery here in Paris, we saw symbols of the enduring and long standing relationship that we have had on that issue."
    },
    {
      "text": "So we did discuss our partnership as it relates to defense. We did discuss the fact that after World War II, we created a trans-Atlantic Alliance based on our mutual understanding about the interconnection and interdependence between the United States, France and our allies on the issue of security defense. We talked about the Indo-Pacific."
    },
    {
      "text": "As you know, in my last trip, foreign trip, went to Vietnam and Singapore to reestablish the commitment and the enduring commitment that the United States has as a member of the Indo-Pacific to our friends and our partners in that region. One of the most important issues that we have discussed as a current issue in that regard is the challenge that all nations are facing in regard to supply chains. That was a discussion we had here as well."
    },
    {
      "text": "And the discussion was essentially this, one, it is indisputable that all nations have suffered because of the pandemic, predominantly, on the issue of supply chains. Two, that the global demand will not be met, cannot be met by any one nation. So it requires then, if we are to meet the challenge of supply chain issues, coordination, collaboration, and partnership."
    },
    {
      "text": "So that was part of the discussion we had as it relates to the Indo-Pacific, but also as it relates to a general perspective on an issue that is challenging, and I will speak for the American public, for families every day when folks are trying to think about how they're going to get products they need or auto manufacturers concerned about getting critical components. And when families are worried about out being able to make sure Santa Claus gets whatever Santa Claus should get to the children by Christmas."
    },
    {
      "text": "We talked about what we will do as it relates to the Sahel, which is a specific region on the continent of Africa. We have a mutual concern there that relates to the ongoing challenges that the countries and the Sahel are facing. Among the many priorities that we share is a concern about what we need to do to address potential violence and ongoing violence. And to that end, we renewed, if there was any doubt, which there was not, our mutual commitment to work with each other on counter terrorism."
    },
    {
      "text": "As you know, at the Paris Peace Forum yesterday, we addressed the growing issue of inequality, again, something we have been discussing for months, which is that this pandemic in many ways has highlighted, has magnified the longstanding pre-pandemic failures and fractures and fissures in our systems. So we talked about what we can do together to address these inequities and the inequality that has existed since the beginning of time around the world."
    },
    {
      "text": "I'm particularly excited about the convening and the number of nations that came together to have this conversation and to express a commitment to work more closely with each other, understanding, again, the interdependence and interconnection that we have. So we talked about inequality and inequity in a number of ways. As you know, I presented what I believe should be an approach to the issue, which is to not simply accept that it has always been, but instead to challenge ourselves to do something about it."
    },
    {
      "text": "And the method by which we can do something about it is to ask why is it, and then I went through a list. Why is it that a very significant number of women around the world are subjected to sexual and domestic violence? Why is it that we are still seeing children around the globe who are hungry?"
    },
    {
      "text": "Why is it that we see that there are certain nations who have the resources that have caused, among many things, them to be some of the greatest emitters of pollution in the world, and others who are responsible for a negligible amount of emissions are taking the greatest brunt?"
    },
    {
      "text": "So we have before us again, in the midst of great challenges, an opportunity when we come together during a week like this, nations around the world, to speak truth, to challenge each other and to dedicate ourselves, certainly those of us who consider ourselves to be- ... dedicate ourselves. Certainly those of us who consider ourselves to be partners and allies to actually address these issues together, understanding the mutual commitment, but the mutual investment."
    },
    {
      "text": "We talked extensively, both in our bilateral, but with others and again yesterday on a stage, about what we as nations must do who have similar values, whose nations were founded on similar principles, to apply those principles and norms to how we will engage with each other and interpret each other's actions as it relates to our use of technology. And of course, cybersecurity being the most obvious point there, addressing what we have seen in the United States and around the world."
    },
    {
      "text": "The hackers that have compromised systems, ransomware, not to mention the daily abuse of individual's privacy and manipulation and monetization of other people's data and personal information. So these are some of the conversations that we had on technology. As you know, we also, as the United States, express that we will partner in the Paris Call for Trust and Security in Cyberspace. We talked about democratic elections. It's a challenge for all of us on the former topic, which is technology."
    },
    {
      "text": "So we have talked about what we must do together again as partners to address this issue, both in terms of yes, norms and standards, but also in terms of accountability, including a very important point, which I believe and I'm pleased to see that gradually partners and allies are all agreeing should be a norm, which is that there should be attribution when it occurs. That was once a debatable point among nations. But we are saying that there is a broader consensus that there must be attribution."
    },
    {
      "text": "We must call it out, to use a colloquial, when we see it. Then we must do something about it. That is the point about accountability. I would say to the American people that the work that the president and I and our administration has been doing over these last many, many months is yes, reestablishing relationships, strengthening relationships around the globe, but it is also directly connected to what will benefit the American people in their everyday lives."
    },
    {
      "text": "When I think about this trip and I think about one of the greatest priorities of President Biden and myself in our administration, which is the American worker, I look at the conversations that we are having through that lens and therefore the importance and significance of establishing these relationships and these agreements. When you think about issues such as trade, when we think about supply chains, when we think about resilience, all of these issues impact the American worker."
    },
    {
      "text": "By the way, as part of the discussions and the agreements that we had during the bilateral with President Macron, I agreed and we agreed on behalf of the United States to join the space observatory to again look at the potential for satellite technology in space and how that can directly relate to our partnership on combating climate change, including issues like predicting weather patterns, addressing issues like drought, which directly affect the farmers of America and farmers around the world."
    },
    {
      "text": "What was said yesterday about the importance of nations coming together on norms and standards and policies on this issue is critical because, as was highlighted, perhaps making a lot of folks uncomfortable, but as the reality of the pathology of this issue is that behavior is happening down the street here, can it impact children in their homes throughout America? And so we must have these difficult conversations."
    },
    {
      "text": "But based on the issues that are impacting people right now, in this moment, in this new era, understanding again that nations are interconnected and interdependent on how we approach these issues and what we deem to be our responsibility for addressing them. So in conclusion, and then I'm happy to take questions, I want to just talk briefly about the American Cemetery. My husband and I visited it as one of our first stops and in observation obviously of Armistice and Veterans Day."
    },
    {
      "text": "If there is any question about the why or the what in terms of our relationship as the United States with France, that is one visual and one concrete example of the endurance and the mutual commitment and interdependence between the United States and France. When we were there, we saw the graves commemorating the lives of Americans who lost their life here, fighting for the ideals and the values that our two countries share and hold dear."
    },
    {
      "text": "We saw there brave, brave individuals who were laid to rest, including someone from the place of my birth, Oakland, California, Inez Crittenden, who was a woman who decided she would serve her country and move to France to engage in the resistance and to support American troops and allies."
    },
    {
      "text": "So when I think about this relationship, I think about it certainly through the lens of history, but I think we all share, and certainly the conversations that President Macron and I have had, have emphasized that we must always remember that history, but let us also be grounded in what we must do today in preparation for tomorrow. So with that, I'm happy to take any questions. Simone, are you- Thank you. I will tell you that was not the purpose of this trip and we didn't discuss it."
    },
    {
      "text": "What we did discuss is the issues that are challenging us and the issues that are the basis for this relationship and the strength and the endurance of this relationship. And so, I've gone through the list of those issues and there were more. We talked about, for example, our mutual interest in the Western Hemisphere and issues that range from, \"What are the current challenges?\" to what have been relationships that one could argue should be strengthened and some might even say, have been neglected."
    },
    {
      "text": "We talked extensively about our mutual interest and, in many ways, a longstanding focus of France on the continent of Africa and how obviously what happens in Africa can impact our nations, both from a security perspective and an economic perspective, but also a moral perspective. We talked about what we have is also a perspective on alliances and the strength of alliances and the importance of paying attention to those relationships and understanding the strength of them, but also the fragility of them."
    },
    {
      "text": "As it relates to- And as it relates to me as Vice President, I think that there is no question that I am here as a representative of my country, and my presence here is reflective of the priorities that the United States has as it relates to France. Right. Thank you. Well, let's start with this, prices have gone up, and families and individuals are dealing with the realities that bread costs more, that gas costs more. And we have to understand what that means."
    },
    {
      "text": "That's about the cost of living going up, that's about having to stress and stretch limited resources, that's about a source of stress for families that is not only economic, but is on a daily level something that is a heavy weight to carry. So it is something that we take very seriously, very seriously. And we know from the history of this issue in the United States, that when you see these prices go up, it has a direct impact on the quality of life for all people in our country."
    },
    {
      "text": "So it's a big issue and we take it seriously, and it is a priority therefore. So we have addressed it in a number of ways, one of the issues that we know is related to this is the supply chain issue that we just discussed. And so, on a domestic level, in terms of domestic policy, one of the approaches we have taken is to work with labor unions and to work with municipalities in opening backup, and extending the hours of our ports. There are actually three I have in mind, Los Angeles, Long Beach and Savannah."
    },
    {
      "text": "I mean, in fact, part of the Infrastructure Bill benefit is most recently what we will do to assist Savannah in broadening their ability to be an active port. And we have seen a reduction in the container ships off of the Long Beach and LA ports because of what we have done, which is to extend the hours to now 24 hours a day, seven days a week. But there is also a point that is important to make on the Build Back Better framework. One, it is designed to make it less expensive for working people to live."
    },
    {
      "text": "It was specifically designed to bring down the cost of childcare and increase accessibility and availability, designed to bring down the cost of elder care, and make it available to all those working families that need that support and need that help. And Build Back Better is not going to cost anything we're paying for it."
    },
    {
      "text": "So, when we can get Build Back Better passed, and we are optimistic that we will, the American people will see costs actually reduced around some of the most essential services that they need to take care of their basic responsibilities, including issues like childcare and elder care, and also preschool. And that's an important point to mention also."
    },
    {
      "text": "Universal pre-K, when we're able to do that, three and four years old, getting education at no cost, what that is going to do in terms of not only supporting working families who otherwise can't afford to put their kids in a private situation, and otherwise don't have it available, that's going to have a huge impact on lowering the costs for families. So, that is a big part of our agenda, and I think it's important to also stress that it's not going to cost anything for the American taxpayer."
    },
    {
      "text": "I think there's been robust dialogue and discussion about the elections that just took place. And as we focus on the needs of the American people, we are fighting for their needs, which is why we were able to pass Bipartisan Infrastructure Bill, where Republicans, not just one or two, came together with Democrats, understanding that it is important that we who are engaged in electoral politics deliver on behalf of the people. And we have accomplished that."
    },
    {
      "text": "Some would say it was historic in that we've been talking for quite some time through many administrations about Infrastructure Week and it finally happened. So moving forward, the next step is to pass our Build Back Better agenda, which again is going to be about delivering for the American people. What they want is that we're not sitting around talking about politics, that we're talking about, instead, the policies that are going to impact them and improve their lives."
    },
    {
      "text": "And that's where we're putting our attention. Well, we have, as you know, been very careful to guide public policy where it is our role to guide it based on what the scientists and medical professionals tell us. And we are also leaving it, as you know, to local communities in large part to make those decisions."
    },
    {
      "text": "I think the most important thing at this moment for us in the United States to focus on is that we now have the ability for children to get the vaccination, the shot, we have at our disposal the ability to actually engage in smart public health conduct and protocols, and we have free, safe vaccines available for everyone. And our biggest challenge right now is to urge everyone to engage in saving their life and the life of their family members and their communities by getting vaccinated."
    },
    {
      "text": "But that's really, and it has been, it's no secret, one of our biggest challenges, and we will continue to focus on that. So, on the inflation piece, we, as I'd said earlier, fully appreciate the significance of things costing more. It's a big deal. It's a big deal. And so, we are doing what we can, making it probably one of our highest priorities."
    },
    {
      "text": "I talk to the president about it often, one of our highest priorities, we need to bring cost down for the American people, and in particular, for working people and working families. And again, I'll go back to my previous point, that is why we have been pushing so hard since the beginning for Build Back Better, because it is absolutely and almost uniquely designed to do just that, to make it easier for people to live."
    },
    {
      "text": "And for most Americans, making it easier for them to live means bringing the cost of living down, especially for essential services. On the piece about paid family leave. Yes, it's frustrating. It's something I've been advocating for for years, as has the president. And it was in our initial proposal. And in terms of what we believe, we'll actually address, again, a topic of conversation, the topic of conversation on the main stage yesterday, inequities, the inequality of systems and structures."
    },
    {
      "text": "We know that this is an issue that disproportionately affects women and working women. We know that in the United States, and I know around the world, we have seen working women because of the pandemic leave the workforce, at the rate in the United States, the most recent number I saw, somewhere around two million women have left the workforce."
    },
    {
      "text": "And let's be clear about this, an issue that impacts working women, not only directly impacts the economy of their household, it impacts the economy of our whole society. When you lift up the economic status of women, you necessarily lift up the economic status of families and all of society benefits. So yes, I'm frustrated. And it is, I think, a shame that we are not yet a leader on this. We have work to do."
    },
    {
      "text": "Leader on this, we have work to do, and that is why the president and I are committed to doing this work. It's important, and it matters. And again, I'll go back to my previous point. There are those of us who have been fighting for this for a long time, and there are many more who perhaps kind of heard about it, but really saw it during the pandemic. I mean, most recently, I had the TV on, but I was in a briefing, I think."
    },
    {
      "text": "So I was doing something else, so I didn't hear, but it was an image of somebody doing a Zoom, and their one child came in, and then the toddler came in after that, and then somebody came in and grabbed the two kids. And then yesterday, we saw a different example of that, but yeah. It's a big issue. You too. Jeremy Diamond, Okay, sure. Jeremy Diamond, Thank you. I'll take your last point first, which is I'm not going to comment on any active trials for obvious reasons."
    },
    {
      "text": "I don't want it in any way influence or distract from what are the facts and the evidence in that case. Jeremy Diamond, But on the... Yeah, I will. On the broader point, we have still a lot of work that we can do to improve the integrity of our criminal justice system."
    },
    {
      "text": "And as you know, I've worked on that for many years, and that includes ensuring that protections are in place so that anyone that is accused of a crime and charged with a crime has a jury of their peers, and we want to put in place all of the safeguards that are available to do that."
    },
    {
      "text": "For example, over the years, there has been talk about understanding that jurors, if they are a working person, if they work two or three jobs, unlikely they can sit for hours on end and potentially weeks and weeks on end, and not be at their job. See earlier point, not get paid leave, and they just can't afford it which means that we will, in those cases, have a jury that is probably not a jury of peers."
    },
    {
      "text": "There is work that we've always had to do, and we actually have embedded in the jury selection procedure specific objections that, on behalf of a client, a lawyer can make when it becomes clear that there is a systematic and racially based exclusion of potential jurors. So we always have to have protections in place in our criminal justice system as a whole, including in our jury selection system. Yes. Yeah."
    },
    {
      "text": "And on the point about strategic defense, as I said earlier, the United States and France have a longstanding relationship that is about support and alignment, and that will continue. And that will continue. Speaker 1: ()\nThank you. Let's take one question. Mm-hmm (affirmative). Yeah. On the last point, the United States and the president has been clear about this."
    },
    {
      "text": "We are looking to re-enter, and we are looking forward to the talks that we anticipate and hope will be productive to that end, and we are aligned with our allies in that regard. On the issue of Belarus and what is happening at the border with Poland, we are very concerned about that and closely paying attention to it, and the Yevtushenko regime, I believe, is engaged in very troubling activity."
    }
  ]
}