{
  "speech_id": "082",
  "title": "Joe Biden & Kamala Harris Election Day Eve Rally Speech Transcript November 2",
  "date": "20201102",
  "url": "https://www.rev.com/blog/transcripts/joe-biden-kamala-harris-election-day-eve-rally-speech-transcript-november-2",
  "topics": "Economy, Healthcare, Social Justice",
  "num_segments": 25,
  "content": [
    {
      "text": "Are you ready? Joe's here. Jill's here. Doug's here. You are here. We are here. And we are here to bring this election home, But we got one more day. That is it. One more day. And I'll tell you, Joe and I are just so grateful, so grateful for your support; for your prayers; for your love; for your time volunteering, making calls; for your trust in us and for your vote. And as we head into tomorrow, I know we are empowered. We are optimistic about our future. We know the strength of unity."
    },
    {
      "text": "We know the strength of America. You know, when Joe asked me to join this ticket, saying yes was an easy decision. He and I, we come from different backgrounds, but we were raised with the same values: hard work, honesty, decency, a belief that we all have a responsibility to look out for one another. And those are the values I've seen as I've traveled across our country over the past 84 days, the values we share as Americans. Across our country, you can feel that something is happening."
    },
    {
      "text": "In big cities and small towns, wearing masks and socially distancing, I have seen people lining the streets and gathering on corners to show their support. They're bringing the children, holding up signs, wearing their colors and strolling to the polls. And waving the red, white, and blue. The energy out there is real, and it is inspiring. In this battle for the very soul of our nation, we have seen what can be, unburdened by what has been."
    },
    {
      "text": "We have seen who we are and a willingness to fight for the country we love. And that is why I know that tomorrow, we are going to elect Joe Biden, the next President of the United States of America. So while we're on the subject, tell me how many of you have already voted. Honk if you voted. And if you haven't voted, go to iwillvote.com, and find out when and where you can vote tomorrow, because there is still almost 24 hours that we have got to get this done."
    },
    {
      "text": "And honk if you have been sending texts and making calls to get out the vote. Because we all know from the time the polls open tomorrow morning until they close, every minute counts. So, we cannot let up because it ain't over until it's over, and everything is at stake."
    },
    {
      "text": "Our health, our economy, our children's futures, a woman's right to make decisions about her own body, a criminal justice system that treats all people with dignity and equally under the law, a Supreme Court that advances the legacy of Justice Ruth Bader Ginsburg, that lives up to the phrase above its entrance, \"Equal justice under law.\" The kind of country we want to be. That's what's at stake. It is all on the line."
    },
    {
      "text": "This is the most consequential election of our lifetimes, and the decision we make will, without any question, last for generations. And I'll tell you, as I travel around, one of the biggest issues on everyone's mind is the pandemic that is ravaging our country. And remember, back in January, Donald Trump knew just how bad the coronavirus was, that it was deadly and airborne. But what did he do with that information? He looks straight into the cameras at the American people and lied about it. He covered it up."
    },
    {
      "text": "Now, can you imagine what you would have done if you had known on January 28th, what he knew? What you might have done? What your family might've done to prepare? Can you imagine how our businesses, how our schools might have been able to prepare? How we as a country might have been able to prepare? But Donald Trump doesn't think about what's best for America. He only thinks about what is best for himself."
    },
    {
      "text": "And as a result, we have lost 230000 lives to COVID, so many people forced to die alone because of the nature of this virus. 230000 Americans. The last time we experienced loss like this was World War II. In addition, we're looking at over 9 million people who have contracted the virus, and we know it's hitting communities of color the hardest. Latinos are contracting COVID at three times the rate of others. Black folks are dying at twice the rate of others."
    },
    {
      "text": "And let's be clear, we are also in the worst economic crisis we have faced since the Great Depression, because Donald Trump failed to contain this virus. He failed to lead. 23 million people are receiving unemployment. One in five mothers with a child under the age of 12 is describing her children as being hungry in America. In one in six households, folks are behind on their rent and concerned they may not be able to pay rent. One in four small businesses have closed."
    },
    {
      "text": "And yet, nine months into this pandemic, this president still doesn't have a plan to contain it. We have witnessed the greatest failure of a presidential administration in America's history. On top of it all, President Trump is in court right now, trying to end the Affordable Care Act and take health coverage away from over 20 million Americans. He's trying to end protections for the over 100 million Americans with preexisting conditions, conditions like asthma, diabetes, high blood pressure or cancer."
    },
    {
      "text": "Honk if you know somebody, raise your hand if you know somebody with diabetes or high blood pressure or asthma or breast cancer. Because this fight includes a fight for them. America, we cannot afford four more years of Donald Trump. And the first thing Joe and I will do when we are in the white house is get this virus under control. We will listen to the scientists and public health experts. We will provide free testing and treatment, and when it is available, a safe vaccine for all."
    },
    {
      "text": "But we will ask the super wealthy and biggest corporations to pay their fair share, and we will invest those tax dollars to rebuild our nation's infrastructure, to tackle the climate crisis and create millions of good paying union jobs, make childcare more affordable and invest in our nation's schools and in our nation's teachers. We will build on Obamacare and expand access to health care to tens of millions of Americans, including expanding mental health care."
    },
    {
      "text": "Because we understand the body doesn't just start from the neck down. It includes the neck up, and it deserves the health that all people need. And we will lower prescription drug costs, and protect and expand Medicare and Social Security. And we will work to root out the systemic racism that still exists in our criminal justice system. And we will confront, not condone, white supremacy, and fight for economic justice, no matter your zip code or your race."
    },
    {
      "text": "And Pennsylvania, we will begin the work of healing and repairing and uniting our nation, Democrats and Republicans and Independents, and people of all races and all backgrounds. Because we know that's how we've always overcome our greatest challenges, together. And Joe gets that. Joe understands that. You see, Joe is a leader who understands what the American people are going through. He sees us and he understands suffering because he has experienced so much of it himself."
    },
    {
      "text": "Joe Biden is a leader of both strength and empathy, toughness and humility. He understands that the measure of a person's strength is not based on who you put down. It's measured based on who you lift up. And he knows that no matter where we come from or where we live, no matter your race, gender, background or faith, no matter how we identify or who we love, no matter the language your grandmother speaks, what we have in common is so much stronger than what divides us."
    },
    {
      "text": "And that is the kind of leader America needs right now, and that is why, Pennsylvania, we must win this election. So remember this, your vote is your voice and your voice is your power. Don't let anyone ever take your power from you. Now is the time to stand up. Now is the time to speak out, and now is the time to vote, and vote like our lives depend on it because they do. Our democracy is always going to be as strong. America, our democracy is always going to be as strong as our willingness to fight for it."
    },
    {
      "text": "And in this election, let's vote like our democracy depends on it. Vote like justice, equality and opportunity, decency, character and dignity are on the ballot because they are. And one day, one day, our children and our grandchildren and others, they will look us in the eye, each one of us, and they will ask us, \"What did you do at that moment?\" And I want to be able to say, \"We did everything we could to fight for our country and their future.\" So, let's do that."
    },
    {
      "text": "Let's vote, and vote with conviction and confidence and hope. And let's elect Joe Biden, the next President of the United States. Thank you. May God bless you, and may God bless America. Speaker 1: () ( singing) Speaker 2: () (singing) What's going on, Pittsburgh? Hey. Good evening, everyone. My name's John Duffy. I'm fourth generation union strong here in Pittsburgh. I'm a business agent at Laborers' Local 1058, where I've been a proud member for 11 years."
    },
    {
      "text": "Four years ago, guys, President Trump promised Western PA he would create jobs, but today there are 300,000 fewer jobs in the state than when Barack Obama and Joe Biden left office. He campaigned in Western Pennsylvania in 2016, promising major infrastructure build, infrastructure made with American steel right here in Pittsburgh, but he never even really tried to deliver."
    },
    {
      "text": "Instead, he spent his time giving tax breaks to Wall Street and the super wealthy, while undermining unions and leaving working families behind. From the highest office in the world, he has fanned the flames of racial tension, putting the lives of so many people that looked like me in danger. We cannot go on like this. We cannot stand for a president who thinks it's fine to keep workers down, so long as the numbers on the stock market keep going up."
    },
    {
      "text": "We cannot keep waiting to hear what he will say next to deepen the racial division that is in this country. We need to stand up and elect the only candidate in this race who shares the values of working people and will empower us to succeed. That's Joe Biden. Joe understands the struggles that working communities face because Joe is one of us. He's from Pennsylvania. Scranton's not that far away. He grew up in a working class family."
    },
    {
      "text": "The values that Joe learned in Scranton, hard work, toughness, empathy, are the same values that he carried throughout his life as a public servant and they're the same values that he's going to take with him to the White House. As president, Joe's going to help communities recover from the coronavirus and then put working people in Western PA and across this country at the center of the effort to build back a better economy."
    },
    {
      "text": "He's going to create millions of good paying jobs and his- He's going to create millions of good-paying jobs. And as president, he will encourage unionization and collective bargaining because he knows that workers in unions, not Wall Street, built this country. Joe is going to work to ensure that all people, regardless of their race, who they love, or what they do for a living, are treated with the equal amount of dignity and respect."
    },
    {
      "text": "We are now a matter of hours away, guys, from the end of this election, and the work that we do tomorrow will determine whether we put a champion for the working class people in office or we continue to be pushed around by President Trump. See, to me, guys, the choice is easy. So tomorrow let's get a plan, let's go out, and let's vote. And let's vote for Joe Biden. Pittsburgh, help me in welcoming the next president of the United States, Joe Biden. Speaker 3: () (singing)"
    }
  ]
}