{
  "speech_id": "083",
  "title": "Kamala Harris Campaign Event Speech Transcript Pennsylvania November 2",
  "date": "20201102",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-campaign-event-speech-transcript-pennsylvania-november-2",
  "topics": "Healthcare, Government Policy",
  "num_segments": 24,
  "content": [
    {
      "text": "Hi. Hi. Hi, Pittston. Hi, guys. Hi. We're going to get this done, aren't we? Oh, it's so good to be with everyone and be back. And my dear friend, Bob Casey, and the Casey family, and there they are. And [Mammo :25], thank you for that introduction. And it is good to be in the house of labor. It's so good to be with you guys. I was talking to Joe, we're very excited about our day in Pennsylvania. Joe is going to be here. Jill's going to be here. Doug and I are here."
    },
    {
      "text": "Well, Doug and I were together this morning, and then we parted to go our separate ways within the state. And then, we're going to all end up, Joe and Jill will be in Pittsburgh tonight, and Doug and I are going to be in Philly tonight. And it's just so good to be here. You guys have been laying the ground for, dare I say, years and certainly months, weeks, and days. And here we are, can you imagine? The day before the election that is going to decide the future of our country for generations. For generations."
    },
    {
      "text": "And I mean, I don't need to tell you guys what's at stake. We know what's at stake. And I mean, we're all here because we know that we're better, so much better, than the guy who's currently in the White House. And on this eve of the election, I just actually want to talk about Joe. I'm not going to talk about the other guy. I don't feel like talking about him right now. I just don't. I'm going to talk about Joe. So let's talk about Joe and the Joe we know, right?"
    },
    {
      "text": "I mean, listen, when we think about the challenges that we're facing as a country, and Joe talks about this all the time, he talks in particular about the four crises that are front and center and have converged. There's obviously the pandemic. Now, let's think about this. It is a public health crisis of a proportion that we have never seen. I say it's a mass casualty event that probably is equal or greater to what we experienced in World War II. People are suffering."
    },
    {
      "text": "Over 225,000 people have died in just the last several months, and so many without their family, because of the nature of this, to just hold their hand in their last days. And for any of us who have had that awful experience, to not be with your family member to tell them you love them in those last moments, it's awful. Over 9 million people have contracted the virus. Many doctors are saying they're going to have long-term consequences, lung scarring, things like that."
    },
    {
      "text": "And here's the thing about Joe in a moment like this, first of all, Joe, without having had the benefit of the inside information, like you know who, and we know what you know who knew because Bob Woodward told us, Joe, back in March, because he had an experience with Ebola, because Joe has been a leader and a dedicated public servant his entire career, because Joe is a student of issues and history, Joe, back in March, told us what we needed to do about this pandemic."
    },
    {
      "text": "And he's not even in elected office when he said it. Joe knew the importance, and you all know because you know his story, Pennsylvania knows this story more than most, Joe has seen suffering. Joe has spent far too much time in a hospital with the people he loves."
    },
    {
      "text": "So Joe is somebody who borne out of awful sacrifice and commitment, together with President Obama, created one of the most significant public health policies, dare I say, public policies we've seen, some could argue since Social Security, when they got passed the Affordable Care Act that brought health care to over 20 million people that didn't have it."
    },
    {
      "text": "Joe understands the significance and responsibility of our government in one of its core functions, which is to concern itself with the public health and wellbeing of the American people. And that's why he and President Obama pushed for the Affordable Care Act. And what is Joe committed to doing? Going forward, he's going to expand the Affordable Care Act, build on its success, expand on it, bring down premium costs, bring down drug prices, prescription drug prices."
    },
    {
      "text": "Joe knows when we're talking about healthcare, look, the body doesn't just start from the neck down, it includes the neck up. That's called mental health care. And Joe is deeply committed to doing that work because he knows that it is just as simple as what should be necessary if we value the point that access to healthcare should be a right and not just a privilege of those who can afford it."
    },
    {
      "text": "Joe knows that access to healthcare is a matter of respecting the dignity of people and wanting that people don't suffer, wanting that people are not in pain. When you break it down, this is so much bigger than a political issue or an ideological issue. It really is a moral issue. And that's why Joe cares about it. You look at the economic crisis that we're in right now. Joe has always been a fighter for working people his entire career."
    },
    {
      "text": "Joe and I, one of the things I love about being on this ticket with him, when we have time together and we're sitting down talking and maybe our family members are with us, and he has a ton of stories from his uncle and his father, and he will tell them. And I've got my sayings from my mother, and so we just kind of, \"Well, my mother said this.\" \"Well, my dad said that.\" We go back and forth. But you know Joe's background. Joe cares about working people. He comes from working people."
    },
    {
      "text": "He learned early in his life the dignity of hard work and the ethic of hard work. So Joe knows that we need to honor labor, honor organized labor, honor collective bargaining. Honor the fact that a hard day's work should come with the benefit of paid sick leave, paid family leave. Joe knows those things. I love being on this ticket with Joe because he probably, and I believe, God willing, we win, we will probably have the most pro-labor administration we've seen in a long time."
    },
    {
      "text": "So on the issue of the economy, whenever Joe's asked about the economy, his measure of the economy is to ask not about the stock market and rich people. Joe asks, \"Well, how are working people doing? How are working families doing?\" Which is why we're committed to making sure that taxes don't get raised on anyone making less than $400,000 a year. We're committed to saying working families should not have to pay more than 7% of their income in childcare."
    },
    {
      "text": "We're committed to saying that if a student comes from a family that makes less than $125,000, they will go to a four-year public college for free. That's how Joe thinks about the economy. Joe knows that, first of all, that tax break that they gave the top 1% and the biggest corporations in America is just wrong and needs to be undone. And we will undo it."
    },
    {
      "text": "But we also know that the money needs to go to an investment in the people, in working people, and investment in infrastructure, and really following through on a commitment to build up our roads and our bridges, really following through on a commitment, understanding that an investment in infrastructure is an investment in the American workforce, understanding you invest in infrastructure, it's also going to be about a partnership with the building trades, the carpenters, the plumbers, the electricians, understanding they have some of the best, best apprenticeship programs in the world."
    },
    {
      "text": "And when we talk about building up the skills of America's workforce, that's how you do it. Joe understands. Remember, Joe was responsible for saving the auto industry. Joe understands, listen, we're not going to make a false choice or take a false choice on what we need to do to save the climate with a climate crisis, but we see an opportunity here to actually grow the economy and build jobs."
    },
    {
      "text": "And so Joe has made a commitment, we will invest in America's auto industry so we are the number one manufacturer of electric vehicles. Because one of the things that you and I know about Joe is in a moment of crisis, and he has faced so many, Joe always sees a moment of opportunity. At his core, he is an optimist because he knows when you face a crisis head on, and you work hard, you can actually come through it and maybe even come through it better."
    },
    {
      "text": "So these are the things I think about when I think about Joe, and when I think about what's at stake in this election... And everything is at stake. Everything is at stake. We could go through all the policies. We know that. But what's at stake also is what we need to do to recapture who we really are as Americans. We know that the real measure of strength of any human being is not based on who you beat down, it's based on who you lift up."
    },
    {
      "text": "And that's how Joe thinks about us, that's how he thinks about our country, and that's how he thinks about what a real leader looks like. And we need that right now. We are so much better than what we've had to endure these last four years. So there's a lot at stake, and we want to make sure that everybody we know votes, okay?"
    },
    {
      "text": "Because I think you all know, and that's why we're all here and keep coming back, because we care about Pennsylvania and because Pennsylvania's going to determine the outcome of this election. Right? And I love seeing our young leaders here. So we need to do our part. We need to do our part, right? Because this election truly is, as Joe says, about a battle for the soul of our nation. This is what this is. And so, here's the thing, I think that, again, we know what's at stake. We know why we should vote."
    },
    {
      "text": "We know the many people who fought for our right to vote. We know why we should vote. We know that there are a lot of folks around the country, including you know who, who have been trying to openly suppress the right to vote, to intimidate, to make it difficult, to make it confusing. And in fact, reporters will often ask me, they'll say, \"Well, what do you think's going to happen?"
    },
    {
      "text": "The day after the election, what do you think's going to happen?\" I said, \"Look, there's no question that over the last four years, our democracy has taken a beating. There's no question.\" If you think of it as a house, yeah, some of the shingles have fallen off, but the house is still standing. The house is still standing."
    },
    {
      "text": "And one of the reasons the house is still standing is because I do believe, Pittston, I do believe that when we, be it in Pittston, when it be we were in North Carolina yesterday, we were in Georgia yesterday, I was in Florida and Texas the day before, wherever you are, one of the things that we know about who we are as Americans is that this democracy that we hold dear and cherish will always be as strong as our willingness to fight for it. And we are prepared to do just that."
    }
  ]
}