{
  "speech_id": "085",
  "title": "Kamala Harris Election Day Remarks Transcript Detroit, Michigan",
  "date": "20201103",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-election-day-remarks-transcript-detroit-michigan",
  "topics": "Economy, Government Policy",
  "num_segments": 26,
  "content": [
    {
      "text": "That's right. Today is the day we reelect Gary Peters to the United States Senate. Today is the day we always thank Debbie [Stabenow :12] for being the great leader she is. Today is the day that we honor Brenda Lawrence, every day. I'm going to talk to you just for a minute about Gary Peters. I was elected to the United States Senate actually four years ago today. It was a bittersweet day that day, as we all remember. Or at least it was for me."
    },
    {
      "text": "And I got to the United States Senate and I'm only the second black woman in the history of the United States elected. In the entire history of the United States. I'm currently the only black woman in the United States Senate. So I get there, and it's a big place, the United States Capital, our nation's capital. It's a big place. And I'm walking through the halls and then there's this big area where all the Senators meet. And everybody has their own desk, and they all sit there and they're all very important."
    },
    {
      "text": "And I sat at my desk and guess who the person was over to my right, my seatmate? Gary Peters. Gary Peters, who from day one was like I'm Gary, how are you doing? And showed me the ropes. Every day was just so full of advice and friendship and support. And talking to me. He said I want to talk to you always about Michigan. I want to talk to you about jobs in Michigan. I want to talk to you about the auto industry. This is who Gary is."
    },
    {
      "text": "When we sit in these rooms when there's no cameras or there are cameras, Gary is always fighting for Michigan. And it's going to be a tight race guys. It's going to be a tight race. So please, please do everything you can and talk to everybody that you know, and let's get Gary back in the United States Senate. And let's elect Joe Biden the next president of the United States. Listen, listen. Here's the thing. I'm at the point now where I'm just like I'm done talking about the guy currently in the White House."
    },
    {
      "text": "Because you know why. We don't need to do that. Let's talk about the opportunity that is in front of us right now, which is to elect Joe Biden. We're in the middle of at least four crises. Joe talks about them all the time, right? We're in the middle of a public health pandemic that has killed over 225,000 people in our country. People who sadly, so many, had to die, live their last days on earth by themselves because of the nature of this pandemic. They couldn't be with family members to hold their hands."
    },
    {
      "text": "I've been through that process with someone. And if any of you have, to not be able to be with your loved one in those final days, to look at the fact that we're in a pandemic that has infected nine million people, who thank God have lived, but God only knows with what kind of long term health consequences."
    },
    {
      "text": "And we have in our hands an option to elect a president in Joe Biden who understands, sadly more than most, what it means to go through being in a hospital with somebody, losing someone you love, understanding the dignity of life, the dignity of love and the importance of caring for all human beings."
    },
    {
      "text": "We have in our hands and in our power the choice of electing a president who in the midst of a mass casualty event of a proportion similar to World War II who will lead with a sense of compassion and care in Joe Biden. Somebody who says look, yes, President Obama and I pushed through the Affordable Care Act that brought healthcare to over 20 million people. Let's build on that, not take it away. Joe Biden says we need to continue protecting people with preexisting conditions."
    },
    {
      "text": "Clap or honk if you know somebody who has diabetes, high blood pressure or a breast cancer survivor. And taking care of COVID patients every day. And so Joe understands that. And he says we got to extend it. We have to bring down the cost of drug prices, bring down the cost of premiums. We should bring eligibility for Medicare down to age 60. Joe says I understand that when we're talking about healthcare, the body doesn't just start from the neck down. It includes the neck up. And that's called mental health care."
    },
    {
      "text": "When we're looking at in America, over 30 million people filed for unemployment in just the last several months, when we're looking at folks standing and parked in food lines, one in five mothers describing their children under the age of 12 as being hungry, so many people, I think the number is like one in six who are describing not being able to pay rent last month or concerned they can't pay it next month. And Joe understands this."
    },
    {
      "text": "Joe understands that you don't deal with America's economy by doing what these other guys did, which was pass bill that benefits the top 1% at the biggest corporations in America. When Joe is asked how is the economy doing, you know what Joe says? He says well, tell me how are working people doing? How are working families doing? That's why Joe says we're not passing any taxes on anybody making less than $400,000 a year. Joe says we're going to bring down middle class taxes."
    },
    {
      "text": "Joe says we're going to pass legislation and put in place rules and laws that say that working families shouldn't pay more than 7% of their income in childcare. That we're going to have a tax credit of $15,000 for first time home buyers, understanding how that can help with down payments and closing costs to buy a home. Because Joe cares about building up the middle class. He understands the way to do that is you fight for and protect good union, good paying jobs. And it's okay to be in the house of labor."
    },
    {
      "text": "We have a choice in front of us, and the power is in our hands. Think about it. The long, overdue reckoning on racial injustice in America. And Joe, being a student of American history, has the courage to speak the phrase Black Lives Matter. Joe understands. You know, it may be difficult to think about or speak up or hear, but we have to confront the truth of things. We need to deal with racial disparities. Yes, in our criminal justice system."
    },
    {
      "text": "And do that by a number of things, including decriminalize marijuana and expunge the records of people who have been convicted of marijuana. Let's get rid of cash bail because people are sitting in jail for days, weeks, months just because they can't afford to get out. That's an economic issue as much as it is a criminal justice issue. Joe understands these things. He understands that on COVID, African Americans and Latinos are three times as likely to contract it and twice as likely to die from it."
    },
    {
      "text": "And we need to address that. We need to address black maternal mortality. Brenda Lawrence has been working on that. When black women are three and four times more likely to die in connection with childbirth. Joe has the courage to speak up. There are clear choices before us. And so today is Election Day in America. Today is a day that many of us have been waiting for four years. Who would've known we were this patient? And we are this committed. And we know, we know what is within our power right now."
    },
    {
      "text": "You know, I've been traveling all over the country. I mean, I can't even tell you guys. I've been in, where was I yesterday? Georgia and Florida and North Carolina and all over, Ohio, Pennsylvania, which is where I was yesterday. All over the country. And you know, here's the thing I just want to say. Because this is a group of leaders. You wouldn't be standing in this parking lot if you weren't. So you all have been asked what I have been asked, I'm sure at least a couple of times."
    },
    {
      "text": "Which is folks saying why should I vote? And I believe there are three reasons that people should vote. One is we have to deal with the fact that we must honor the ancestors. Let's honor the ancestors. We lost a colleague, the four of us, the great Congressman John Lewis, a great American hero who shed his blood on the Edmund Pettus Bridge for the right for us to vote. Let's honor the ancestors."
    },
    {
      "text": "Let's honor the fact that we just celebrated the 100th anniversary of the 19th Amendment, which gave women the right to vote. All those women dressed in that white, just marching and shouting and saying we will not be sidelined. We will not be deterred. And then also, we always have to speak truth that it wasn't until 1965 that black women had the right to vote. We've got to deal with that too. Number one, honor the ancestors. Reason number two, everything is at stake. Everything is at stake."
    },
    {
      "text": "Everything we have talked about. The future of our public schools. Joe and I know, look, we've got to deal with our Title I schools, the schools that are in the lowest income communities but have the greatest needs and the babies in those communities have the highest capacity for [crosstalk :33] resources to support them. So we will triple Title I funding. Joe and I said we need to pay people equal pay for equal work."
    },
    {
      "text": "Joe and I say we need to deal with the fact that this COVID in many ways highlighted all the disparities that long existed and we need to have a society in which all workers are paid sick leave and family leave. And I could go on and on. Everything is at stake, including the future of our democracy. Reason number three to vote. Traveling around this country, I'm going to tell you, all over. You guys have probably been watching and hearing about it."
    },
    {
      "text": "The kinds of attempts that are being made to make it difficult for folks to vote, to make it confusing. I was in Texas. In Texas, you probably heard about what they're doing, right? And I'm said to say it's Harris County, which is where Houston is. First of all, they said that they'd only have drop boxes one per county in Texas. So in Harris County, there are four million people and one drop box."
    },
    {
      "text": "And you probably saw on the news this morning, now they're trying to have just one drive by station for the whole county. In other places, you know they got folks saying well, if you're going to fill a mail in ballot, you've got to fill out the ballot, then put it one envelope. Then you got to seal that envelope, then put it in the other envelope, and then be sure you sign that, and in some places have a third person sign it. They're missing with the Post Office. I mean, the Post Office."
    },
    {
      "text": "The nicest people work for the Post Office. They're messing with the Post Office. So you got to ask, why are so many powerful people going through such an effort to make it so difficult and confusing for us to vote? And I think we know the answer. It is because they know our power. They know our power. They know when we vote, things change. [inaudible :48]. So let us not let anybody ever take our power from us. Let us not be silenced. Let us not be sidelined. We will not be sidelined in this election."
    },
    {
      "text": "So there are a lot of reasons to get everybody out to the polls. The polls close at what time today? 8:00. So let's make sure everyone we know votes. Let's keep texting. Let's keep calling folks, knocking on the doors of neighbors and your family members. We've got all day to get this done. It's okay if you're annoying people. They'll get over it. They'll thank you later. They'll all come back to you. But right now, we got to stay on top of everybody. Because here's the thing, and this is my final point."
    },
    {
      "text": "This moment will pass. And years from now our children and our grandchildren will look in our eyes, each one of us, and they will ask where were you at that moment? And what we want to be able to tell them is so much more than just how we felt at this moment. What we will tell them is what we did. We will tell them we were hanging out in the parking lot. We were organizing, that we were mobilizing, that we texted and we called and we knocked on doors."
    },
    {
      "text": "We will tell them we were hanging out with Gary Peters and Debbie Stabenow. We were hanging out with that incredible Brenda. We were doing everything. And you know what else we will tell them when they ask? We will tell them that we elected Joe Biden the next President of the United States. Thank you all."
    }
  ]
}