{
  "speech_id": "086",
  "title": "Harris Rally in Las Vegas, Nevada",
  "date": "20241001",
  "url": "https://www.rev.com/blog/transcripts/harris-rally-in-las-vegas-nevada",
  "topics": "Climate",
  "num_segments": 16,
  "content": [
    {
      "text": "Hey, Las Vegas. Good evening, Nevada. Good evening, good evening, good evening. Thank you. Thank you, everyone. Thank you. Thank you. And can we please hear for Captain Quintero? Oh, thank you, thank you, everyone. Oh, it is so wonderful to be back in Nevada. Thank you, all. Thank you. And happy Hispanic Heritage Month to everyone. Thank you. Thank you, all. It's good to be back and I want to thank everyone for all that you do."
    },
    {
      "text": "I know we have some extraordinary elected leaders here and I want to thank them for their incredible work and friendship. It is good to be with all the leaders who are here, including Representative Susie Lee, who is here, Steven Horsford, Dina Titus, the great General Ford, Senator Catherine Cortez Masto, Senator Jacky Rosen, who we're going to send back to the United States Senate. Thank you, everyone and all the local leaders here. There are so many leaders here. It is good to be back with you."
    },
    {
      "text": "() Thank you, thank you, thank you. And wait a minute, we also tonight have here some of the Vegas Raiders, who won their game tonight. Congratulations. Oh, congratulations. You came right from the game. Congratulations. Give them a big applause, right? Well done, well done. So in all seriousness, everyone, before I begin, I want to say a few words about Hurricane Helene, and please have a seat if you're able."
    },
    {
      "text": "I want to talk about Hurricane Helene for a moment, and I know that everyone here sends their thoughts and prayers for the folks who have been so devastated by that hurricane and the ensuing events in Florida, in Georgia, the Carolinas and other impacted states. And we know that so many have been impacted, some have died. But I want to thank everyone for doing everything you can to think about them, send them your thoughts, send them your prayers. I want to thank the first responders who have done so much."
    },
    {
      "text": "We will win. We will win. And here's why. And here's why. And here's why. Because we here know that this election is about two very different visions for our nation. And the contrast, I think was quite clear in our debate. Did y'all see the debate? And in two days, I know we will cheer on Coach Walz when he debates JD Vance. Yeah. () But listen, also, their debate should not be the last word. I'm trying to debate Donald Trump again, and I think he should debate again."
    },
    {
      "text": "The American people have a right to hear us discuss the issues. And as you say here in Las Vegas, I'm all in. I'm all in. Even if my opponent is ready to fold. So there you go. () But you will remember in our first debate I talked about issues like bringing down the cost of living, investing in small businesses, protecting reproductive freedom and keeping our nation secure."
    },
    {
      "text": "() But from Donald Trump, well it was the same old, tired playbook, same old, tired playbook, with no plan on how he would address the needs of the American people. Well folks, it's time to turn the page. Time to turn the page. () America is ready to chart a new way forward, ready for a new and optimistic generation of leadership, which is why Democrats, Republicans, and Independents are supporting our campaign because we know we need a president who works for all the American people. Enough of the division."
    },
    {
      "text": "Enough of the hate. We are all in this together. And you all know from my entire career, I've only had one client, the people, the people. () From being a young courtroom prosecutor in Oakland, I stood up for women and children against predators. As Attorney General of California, I took on the big banks and delivered $20 billion for middle-class families who faced foreclosure. I stood up for veterans and students being scammed by for-profit colleges, for workers who are being cheated out of their wages."
    },
    {
      "text": "And I pledge to you as president, I will fight for all Americans and together we will build a brighter future for our nation. We will build a future that includes thinking about our economy in a way that it is about lifting everyone up. We will build what I call an opportunity economy so that every American has an opportunity to own a home, to build wealth, to start a business. () And let me tell you, I love our small businesses, of which I've met so many right here in Vegas."
    },
    {
      "text": "Growing up, our mother worked very long hours. And so my sister Maya and I would go over two doors down to Ms. Shelton's house. We called her our second mother. And Ms. Shelton was a small business owner. So I know since I was a young child who our small businesses are, who our small business owners are. Small businesses are the backbone of America's economy. I know that. I know that. And Latina small business owners are the fastest growing segment of our economy."
    },
    {
      "text": "() So my plan is about tapping into that ambition, those aspirations, those dreams, those incredible ideas, that strong work ethic that people have. Also understanding not everybody gets handed $4 million on a silver platter and files for bankruptcy six times. () So my plan is about saying we've got to help entrepreneurs, startups out. And I will give a $50,000 tax deduction to help entrepreneurs start their small businesses. Because right now that tax deduction is $5,000."
    },
    {
      "text": "Can't nobody start a small business in 2024. So we are going to make it something where it is doable to lift folks up. We also need to build more housing in America. () My mother saved up for years till I was a teenager when she was able to buy our first home. And right now a serious housing shortage is part of what is driving up cost."
    },
    {
      "text": "So we will cut the red tape and work with the private sector to build 3 million new homes and provide first-time home buyers with $25,000 down payment assistance so you can just get your foot in the door. You'll do the rest. () And we must lower the cost of living because while our economy is doing well by many measures, prices for everyday things like groceries are still too high. You know it and I know it. So I have a plan that includes lowering costs on everything from healthcare to groceries, That's right."
    },
    {
      "text": "That's right. And I do believe, I do believe that one of the highest forms of patriotism that we could show is to then fight for the ideals of our country. That's what this is about. It is a fight to realize the promise of America. And I know the people of Nevada, you are battle born. You are battle born. Yes, you are. And we are all ready for the work ahead. 37 days. 37 days. And here in Nevada, every voter will receive a ballot in the mail, and in-person early voting starts October 19th."
    },
    {
      "text": "So now is the time to make your plan for how you are going to vote, and I'd ask you to start making your plan now for how you are going to vote. And if you choose to vote by mail, do not wait. Fill out your ballot, sign it, and send it back right away. And tell your neighbors, because folks, the election is here and we need to energize and organize and mobilize. () And remember, your vote is your voice. Your voice is your power. Don't ever let anybody take your power from you. Never. Never."
    },
    {
      "text": "Don't let anybody silence you ever. So Las Vegas, today I ask you, are you ready to make your voices heard? Do we believe in freedom? Do we believe in opportunity? Do we believe in the promise of America? And are we ready to fight for it? And when we fight, we win. God bless you and God bless the United States of America."
    }
  ]
}