{
  "speech_id": "088",
  "title": "Kamala Harris National Congress of American Indians Conference Speech Transcript",
  "date": "20211012",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-national-congress-of-american-indians-conference-speech-transcript",
  "topics": "Economy, Healthcare, Social Justice, Infrastructure, Climate, Government Policy, Veterans Affairs, Technology",
  "num_segments": 12,
  "content": [
    {
      "text": "Thank you Chairperson Aaron Payment, it is so good to see you. And good morning to everyone. Thank you, all of you, everyone, for your incredible leadership, the courage of your leadership, the tenacity of your leadership, and most importantly, for your commitment to build a strong nation to nation relationship with our administration. President Joe Biden and I believe that the bond between our nations is sacred and we take seriously our responsibility to one another."
    },
    {
      "text": "It is an honor, of course, to be with you this week as we celebrate Indigenous People's Day, as we speak truth about our nation's history. Since 1934, every October, the United States has recognized the voyage of the European explorers, who first landed on the shores of the Americas. But that is not the whole story. That has never been the whole story. Those explorers ushered in a wave of devastation for tribal nations, perpetrating violence, stealing land, and spreading disease."
    },
    {
      "text": "We must not shy away from this shameful past, and we must shed light on it and do everything we can to address the impact of the past on native communities today. Today, we know that native women and girls are missing and murdered at alarming rates. This is an epidemic and it must end. Today we also know, that Native American voters are being systematically denied access to the ballot box, which is why we must pass The Freedom to Vote Act, and the John Lewis Voting Rights Advancement Act."
    },
    {
      "text": "We also know that Native Americans serve at the highest levels of our nation's government, that Native Americans serve in our nation's military at the highest rates of any group. That Native Americans do the work that we know is essential to make our nation work. And still, Native Americans are more likely to live in poverty, to be unemployed and often struggle to get quality health care and to find affordable housing."
    },
    {
      "text": "This persistent inequity, this persistent injustice is not right, and the pandemic has only made it worse. I believe strongly that we right now have a chance to change things, to improve things, to be better for this generation and for the seven generations to come. Because I believe that we are at the beginning of a new era and a moment of incredible transformation. As we work to rebuild our economy, as we work to restore our democracy, we have the opportunity to build a better future together."
    },
    {
      "text": "At this very minute, our administration is working with Democrats and Republicans and Independents in Congress to pass the Infrastructure Investment and Jobs Act, and we are confident that we will get it done. This bill represents the largest infrastructure investment our nation has made since before World War II and presents, right now, an important opportunity to strengthen Indian country. It would set aside funding for tribal bridge projects and the Tribal Transportation Program."
    },
    {
      "text": "It would provide native communities with funding to build out brand new water infrastructure, and connect native communities with high speed internet. All while creating good union jobs, millions of good union jobs. And as native communities have led for generations upon generation on protecting our environment, I should also mention that this bill would also put millions of dollars toward making sure our communities are resilient in the face of climate change."
    },
    {
      "text": "At the same time, our administration is working to pass a budget that reflects the values of our nation, that invests in those communities that have long gone overlooked. Our Build Back Better, will have a significant impact on Indian country. As Native American families struggled to find affordable care in their area, our agenda would lower childcare and elder care costs."
    },
    {
      "text": "Our agenda would lower healthcare costs and housing costs, and it would cut taxes for families with children by extending the Child Tax Credit for years to come. Together, our American Rescue Plan and our Build Back Better agenda will have provided more than $31 billion for Native communities. Our Infrastructure and Jobs Act and our Build Back Better agenda represent the largest investment in Indian country in our history, more than a point of pride."
    },
    {
      "text": "This is a sign of our administration's respect for our nation to nation relationship. And to that point, I'm very proud to announce right here today that our administration is reopening our memorandum of agreement on the 477 Program. And I don't need to tell you this program gives tribes the power to make decisions about how best to integrate and deliver federal services within your nations."
    },
    {
      "text": "I know that this is an action that many of you have asked for, and I am optimistic that together, we will be able to renegotiate this agreement to support tribal sovereignty. So let me end with a quick story. Back in July, in my ceremonial office, Secretary Deb Haaland and I had a conversation with Native American leaders on our fight for voting rights and to protect the right to vote, which is of course another important aspect of the work we are doing together."
    },
    {
      "text": "At the end of our conversation, they presented me with a beautiful star quilt of red, white, and blue made by members of the Oglala Sioux Nation, they wrapped it around me and honored me with a blessing. It was a moment I will never forget it is a moment I will always cherish. And so as I leave you today, it is my prayer that as one family, we seize this moment in our shared history to bring about shared prosperity."
    }
  ]
}