{
  "speech_id": "089",
  "title": "Kamala Harris Joins Family Care Town Hall Transcript",
  "date": "20211014",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-joins-family-care-town-hall-transcript",
  "topics": "Economy, Healthcare, Social Justice, Government Policy",
  "num_segments": 38,
  "content": [
    {
      "text": "Thank you Aijen. It's so good to see you and always to work with you over these years. And especially now, when there's so much at stake in terms of our real ability to actually leap frog over where we've been and to really just take on these issues that we have known even before the pandemic represent the failures and the fissures and the fractures in our system."
    },
    {
      "text": "And I'm very excited about the potential that we have, the possibility with the collective hard work of all of the leaders here to really see this through and get it done. And I can't stress enough that this issue of care and caregiving and the care economy and care work, it impacts everyone. Regardless of the composition of your household, regardless of your age regardless of your gender, regardless of your profession, it impacts everyone."
    },
    {
      "text": "And so let's be clear everyone, whoever you are, should cares about this issue and should understand how it impacts our entire society and our country not to mention our world. So thank you Senator Tammy Duckworth, thank you for your long standing leadership and for being a champion in the United States Congress for caregivers and thxre work that you continue to do to be a great fighter."
    },
    {
      "text": "Well, it is wonderful to see everyone I see on the screen over there and gathered here are the incredible leaders who care for your parents, for your siblings, for your children, people who provide care for other people's families. And caregivers do it all from helping with finances and medication to preparing meals and providing transportation. Caregiving is hard work. It's hard work. It is work that requires emotional strength and can be emotionally taxing."
    },
    {
      "text": "It requires physical strength and it's physically demanding, and it requires a certain spirit of giving, and you all give so much. Not to mention how much time it requires, because there's so much about caregiving work that is not on a clock. You don't punch in and punch out, it really is a function of the needs of the people you are caring for."
    },
    {
      "text": "And folks have to understand that when we talk about then, the issue of how we pay people, their value and understand the nature of the work and the value of their work. And as a bottom line, I'll just say this. In our nation today, it is essential work and our nation runs on care, and therefore, our nation must invest in care. For working people and working women in particular care is a prerequisite to be able to get to work. It's a prerequisite. It's not a given, sadly, but it is absolutely necessary."
    },
    {
      "text": "Yet, we know that care is too often, too expensive and too difficult to find, which is why we talk about affordability and accessibility. Take childcare for instance, the average family in America has to spend 13% of their income on childcare, 13%. And that is assuming they can even find high quality childcare in their area, childcare can cost more than healthcare. It can't cost more than housing. And in many states it costs more than in-state college tuition. So these are some of the issues."
    },
    {
      "text": "These are some of the problems, what's the solution? Well, part of the solution is our Build Back Agenda, which will cut the cost of childcare by more than half for most families in our country. And it will also extend the Child Tax Credit, which as we know, will lift almost half of America's children out of poverty. And it will expand paid leave, and it will improve options for seniors and people with disabilities so that they don't need to leave their home or leave their community to get the care they need."
    },
    {
      "text": "And on that point, this is essentially about allowing people the dignity with which they deserve and want to live. So the President and I are determined to get our agenda passed, and I'll tell you the president and I share personal experiences of having done a lot of what is necessary to care for family members who were sick and in need of assistance and help, and it's very personal to us."
    },
    {
      "text": "We understand what these professionals do every day, and we understand it in a way that, for us, not only personally, we feel very strong and deep sense of commitment to seeing this through, with some insight about what this issue really means to real people every day. And so our agenda is about what we need to do to give people everywhere, a meaningful opportunity to both work and care for their families. For far too long investments in care have dropped to the bottom of the priority list."
    },
    {
      "text": "But I'm going to be blunt here, that is because most people who rely on care are women and most people who supply care are also women. So it is time to make care a top priority, it is time to honor the value of care for children, for seniors, and for people with disabilities. It is time to make corporations pay their fair share and pass our agenda. Because, care cannot wait. So, as I said, this is personal for me on every level, both on how I benefited from it and what I know is required to give it."
    },
    {
      "text": "Every weekday, for example, when I was growing up and on many weekends, my mother went to work long hours in the lab. You see, my mother was a breast cancer researcher, and she had two goals in her life. To raise her two daughters and end breast cancer. And so she worked long day, she worked weekends. And when she did, my sister and I would walk two doors down to the home of Mrs. Regina Shelton. Mrs. Shelton ran a childcare center and she became a second mother to us."
    },
    {
      "text": "For my mother, I remember this so well, when something good happened at her lab and in her work, my mother would bring flowers home to Mrs. Shelton. Because she understood that but for Ms. Shelton, she would not have been able to do the work that she did. She would not have been able to fulfill the ambitions she had for herself and for her daughters, everyone deserves that kind of support. And everyone deserves the kind of respect that I to this day and my mother had for Mrs. Shelton. That is the work ahead."
    },
    {
      "text": "So thank you again for being here and I look forward to our conversation and now I will turn it over to Senator Tammy Duckworth. Thank you. Tori, first of all, thank you for being a part of this, and for your voice and the courage of your voice to tell your story, because your story represents the life of so many people in our country. And I will say this: The child tax credit, we feel very strongly that it should endure, that it should continue. We know that it works."
    },
    {
      "text": "And this is probably one of the things, I'll speak for myself, that I'm most proud of that our administration has been able to accomplish, which is the thought that we will lift almost half of America's children out of poverty. The generational impact of that is profound. And so we have to continue it, because we know it makes sense, which is... Just give parents that extra bit that allows you to take care of essential needs for your family."
    },
    {
      "text": "And that includes food, it includes rent, it includes the cost of childcare. So under the American Rescue Plan, we got it so that it's $3,000 for a child over six, and $3,600 for children under the age of six. And it is the first time that the money will go to families on a monthly basis. That is one of the important things about what we were able to accomplish. And basically, because the bottom line is obvious, your bills are on a monthly basis. You can't wait till the end of the year to pay the rent."
    },
    {
      "text": "And so that's part of the design of what we've done with the child tax credit. And the bottom line is at the current state of affairs, is it's too expensive and too hard to find childcare, and we need to make it easier. And so there's a supply and demand issue at play here as well, which is the more that we can actually give parents resources to pay for childcare..."
    },
    {
      "text": "It is our intention also in working with Ai-jen and so many other leaders to also demand that our childcare providers are paid more, but it shouldn't be more expensive for the parent to pay childcare workers their value. And so that, in essence, is what we're fighting for. Let's make it less expensive, let's make it more accessible for working parents, and let's pay people their value based on the work that they provide for a community and society."
    },
    {
      "text": "So it is our intention to keep fighting for it, also to lower the expense of childcare so that no family middle or low-income pays more than 7% of their income in childcare. Nicole, unmute yourself, or wave. Let's see you. Where are you? Where's Nicole? There's Nicole, right there. There she is. Okay, good. That's great. So everybody probably knows that HCBS is the Medicaid home and community based services program."
    },
    {
      "text": "And at the heart of it, the point is, and this is why Build Back Better is going to put more resources into that, is that we should allow people with disabilities to fully participate in society. That should be the goal, our collective goal. And then a question becomes, well, how do you reach that goal? Well, part of it is families need support and literally financial support to do things like home upgrades, right? To have personal aids so that folks can receive the support they need."
    },
    {
      "text": "And it ranges on the scale of support and care, right? Sometimes it's a little bit of one, sometimes it's more of the other. But families need help doing that. And it should be our collective interest in supporting that approach because it's just simply the right thing to do. And so, again, I want to thank you all for your courage to tell your story. It's great to see all three of you. I know you are a multi-generational family and there's so much that is great about that."
    },
    {
      "text": "It is wonderful to have, but it does require a lot of work, especially for the generation that's in the middle of those multi-generations. And so we appreciate all that you all are doing. And thank you. And we're going to keep fighting for you. We got to build back better. Thank you. Speaker 2: () Thank vice president. Thank you. Speaker 1: () That's right. We got to build back better. And I don't know about all of you, but I'm feeling energized and inspired. Next up."
    },
    {
      "text": "We're going to hear from [Nelia Calda :20], who is a home care worker in Scottsdale, Arizona and owns her own home care agency. Welcome, Nelia. Thank you. Nelia, well, first let me just give you a little background on my perspective. One, I spent a day with a home healthcare worker, a member of SEIU by the name of Wendy [Cogh :19] years ago. I spent the whole day with her. The work she did during those long hours of that day was extraordinary."
    },
    {
      "text": "Taking care of an elderly woman who required everything that everyone requires. So Wendy was responsible for, and did it in a loving way, for food preparation, for helping the person she was caring for to actually get to the table where she would need to eat, changing her clothes, cleaning the bed from time to time, assisting the elderly lady with the going to the bathroom, taking her on walks to uplift her spirit and talking about the beauty of the day and let's look and see this and that."
    },
    {
      "text": "It was extraordinary work. And then sometimes not knowing when the elderly woman would have fits where she needed support, she needed some emergency or unscheduled kind of assistance around her healthcare. Wendy Cogh did all this work in the course of one day. And I mentioned that to also highlight a point that you made about the training that is required to do this work. We'd all like to think we can do it. I took care of my mother when she, as it turned out, was dying from cancer."
    },
    {
      "text": "And I was fortunate enough to be in a job at the time where I could leave whenever I wanted. But that's a rare situation that any working person can do that. But I do know from personal experience, again, you're not on a schedule in terms of the work day. It's whatever the person you're caring for needs. And the skills that you have to do the work you do as a professional are extraordinary. And that is a function of training."
    },
    {
      "text": "And it is also a special gift that you give another human being, who is often, in the case of professionals who do this work, you're caring for people that are total strangers to you, and you treat them like family. So we feel very strongly that we should be doing a much better job. The average salary for a home healthcare worker is $11 and 50 cents an hour. For anybody, I'll just help you with the math."
    },
    {
      "text": "Anybody who's listening, that is $16,000 a year for some of the most noble of work that any one human being could do on behalf of another person. So part of the community based services program under Medicaid that we are also fighting for in Build Back Better would increase money to states to increase wages for our nation's home healthcare workers. Again, understanding the training, the skill and the devotion with which you do your job. Thank you."
    },
    {
      "text": "So here's some statistics, which I think many of us know, 80% of private sector workers do not have paid leave, 80%. So this is a big issue, especially when, to the point that the Senator made and you've made Stephanie, that at some point in everyone's life, you will need to take time off from work to handle an emergency, to care for a sick relative, to have some time after giving birth to another human being to actually rest and take care of that newborn child."
    },
    {
      "text": "Let's talk about it in the context then of the fact that there is a big issue in our country, which is we are not taking care of workers who need time off to care for themselves or people in their families, and it's just not right. Again, Build Back Better is going to address that in many ways. If we pass Build Back Better in terms of your small business, and congratulations on starting a small business."
    },
    {
      "text": "We also want to make sure that small businesses can better compete for workers because we know that where you see paid family leave, it's usually with the bigger companies who can afford it, but smaller businesses can't. But we want our small businesses to be competitive, to do well. Our small businesses in the United States, the last numbers I saw almost half of the American workforce works for a small business or owns a small business. Let's even the playing field, right?"
    },
    {
      "text": "Both for the sake of supporting hardworking people, supporting our small businesses, and supporting our families. And that really, at the heart of it, is part of the essence of what we are fighting for with the Build Back Better initiative. So thank you for telling your story. How's your son doing? Yeah, the teen years are- ... they are just extraordinary in many ways. You haven't got there yet, Tammy. I'm just telling you. But thank you for sharing your story. Right, exactly. Thank you."
    },
    {
      "text": "Speaker 1: () Thank you so much, Madam Vice President. Former First Lady, Rosalynn Carter, once said there are only four kinds of people, people who are caregivers or will be caregivers and people who need care or will need care. We've heard four different care stories today and we've seen how substantive government support could change our lives. These are all of our stories. And together, they tell a shared story about how urgent and important this support is to millions of us across the country."
    },
    {
      "text": "Care unites us all. As we've heard from Senator Duckworth and Vice President Harris, the Build Back Better Agenda will provide that support to Americans everywhere. Speaker 1: () It's a once in a generation opportunity to lift up our families, to help us work, and to secure our future. It's truly historic."
    },
    {
      "text": "So thank you so much to our engaged audience for joining us today, and thank you to Joan, to Tori, to Stephanie and Nicole and your whole family for sharing your experiences as care workers and as family caregivers and people who need this assistance. Thank you to all the caregivers out there watching for all that you do. I hope today was a reminder that you are not alone."
    },
    {
      "text": "Finally, thank you to Senator Duckworth and Vice President Harris for your leadership, for taking the time to hear these stories and share your own. For championing real solutions, finally, and for helping us understand how the Build Back Better Agenda can address some of the most pressing issues we face every single day. Speaker 1: () Each of us has a role to play in making sure that we have the care infrastructure we need to thrive."
    },
    {
      "text": "Call your Senators, call them today, tell them you support Build Back Better with investments in childcare, paid leave, and home care. Together, let's make sure all Americans get the support we need because care can't wait. [Ishin :45], thank you so very much. Again, I want to thank everyone. All that you were doing really is extraordinary work. The Care Can't Wait coalition, thank you to everyone for your activism, for your energy, for your optimism, for your fight. This is not going to be easy to get this done."
    },
    {
      "text": "If it were easy, it would've been done, but we know this is good stuff, this is important work, and it will benefit so many people who deserve to be seen and heard. I want to thank everyone for being a part of this and for the coalition. Senator Tammy Duckworth, thank you. I've seen you in the Halls of Congress. I've seen how you fight and how your voice resonates and is truly a voice of leadership on this and so many other issues. So thank you for joining this and being such a big part of the you. Thank you."
    }
  ]
}