{
  "speech_id": "092",
  "title": "Kamala Harris Campaign Speech Transcript Jacksonville, FL October 19",
  "date": "20201019",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-campaign-speech-transcript-jacksonville-fl-october-19",
  "topics": "Healthcare, Government Policy",
  "num_segments": 20,
  "content": [
    {
      "text": "Hello everybody. Oh, it's wonderful to be in Jacksonville. [inaudible :26] Ms. Riley, you are amazing. Thank you for sharing the stage and for all of your leadership and all your work. Congressman Lawson, he is a force. Let me tell you something. Thank you for sending him to DC because I've seen him in rooms when the cameras are on, I've seen him in rooms when the cameras are off, he is always fighting, always fighting for Florida. So can we please hear it for Congressman Lawson? All right. Who voted today?"
    },
    {
      "text": "There we go. I came to Florida today to help kick off early voting. And I came to thank you, everybody here, for all that you are doing. Let me tell you something. The voters of Florida, you guys are going to determine the outcome of this election. I'm sure of it. You will determine the outcome of this election."
    },
    {
      "text": "The votes that you are going to cast, the votes that you have cast, the folks that you get to go vote between today, and let's remind everybody to vote early between today and Sunday, November 1st are going to have an impact on people you may never meet. People who may never know your name, but because you here in Florida voted in your numbers, voted with your voice and the power of your voice, you will very likely determine the outcome of this election."
    },
    {
      "text": "And so I am here on behalf of Joe Biden and myself to say thank you. To say thank you. And look, I don't have to tell everybody here. There is so much at stake in this election. There is so much at stake. Who watched the debate? Well, we've actually had two, I guess, huh? And we've had two debates, but I really meant that town hall. Did you all see Joe Biden in that town hall? Wasn't he spectacular? In this election, folks have got two choices."
    },
    {
      "text": "On the one hand, you have Joe Biden, who is dedicated to building on the success that he and President Barack Obama created with the Affordable Care Act, which brought healthcare at over 20 million people, and initiative that was born out of an understanding and belief that the access to healthcare should be a right and not just a privilege of those who can afford it. The Affordable Care Act, which said it's not right."
    },
    {
      "text": "It just ain't right when people who have preexisting conditions like diabetes, high blood pressure, breast cancer, that they'd be denied coverage because an insurance company says, \"Oh, we don't cover if you have a preexisting condition.\" And they got rid of that ban and they said, \"No longer can you deny people access to healthcare if they have a preexisting condition.\" Joe Biden has been fighting for working people his entire life."
    },
    {
      "text": "And on the other hand, you have Donald Trump who right now with his boy Bill Barr is in the United States Supreme Court trying to sue against the Affordable Care Act. And if they are successful, they will get rid of coverage that came to over 20 million people. They will lose, and lose the protections for all of the people who need coverage if they have preexisting conditions. This is what they're up to. And it is shameful. And it is shameful. There is a clear contrast here."
    },
    {
      "text": "On the one hand, you have Joe Biden, who is saying, \"We're going to have middle-class tax cuts.\" Taxes will not be raised on anyone making less than $400,000 a year. On the other hand, you have Donald Trump who passed a tax bill benefiting the top 1% in the biggest corporations of America. And Florida, you know that right now people are hurting. People are suffering. In Florida right now, one in eight Floridians is describing members of their household as being hungry."
    },
    {
      "text": "We're in the midst of a hunger crisis in America. In Florida, right now, one in five Floridians is describing themselves being unable to pay their rent in September. But yet this man, Donald Trump, would like you to believe everything is okay because, you see, his measure of the success of the economy is based on the stock market. Our measure is based on how working people are doing. And how are you doing? So we got a lot of work to do."
    },
    {
      "text": "We got a lot of work to do when we think about the fact that we're all wearing masks. The only reason I'm not wearing one at the moment is because I'm this far away from everybody. Why are we wearing masks? Because we're in the midst of a pandemic. Well, let's remember the history, the recent history on this. Thanks to Bob Woodward, we know Donald Trump was informed in January, January 28th of the nature of this pandemic."
    },
    {
      "text": "He was informed that it was lethal in proportion, it would kill five times as many people as the flu. He was informed it could hurt children. He was informed that it was contagious and air bound. And what did he do? He stood at rallies and he stood before the American people and he didn't tell you what he knew."
    },
    {
      "text": "Imagine folks, if you knew on January 28th what he knew on January 28th, and what you might've done or been able to do to protect your family, to protect your children, knowing that it is inevitable that maybe there might have to be some time that people have to stay home from work. And perhaps you could have planned for that. But instead, he held onto that information. He covered it up."
    },
    {
      "text": "And then he told the people, us, we the people, well, you're on one side of his ledger, if you don't wear a mask, you're on another side of his ledger if he wears a mask. What's that about? And see, this is the difference between a Donald Trump and a Joe Biden, because Joe Biden stands for the people, with the people. He knows that this election will be conducted by the people. And so that's what's ahead of us."
    },
    {
      "text": "What is ahead of us is to fight, is to fight knowing that we don't want a president of the United States who spends full time trying to sow hate and division between us. That's not who we are. We know that in the beauty of the diversity of who we are, the vast majority of us have so much more in common than what separates us. And we're here right now, standing in the rain because we know we are better than this."
    },
    {
      "text": "And we know that the strength of our democracy is in the strength of the people and that the people are prepared to fight for their country based on our love of our country. We will fight for our country. And that's what this election is about. Here in Florida, with the exception of some of the great members of Congress and some of the mayors and all the folks, I also know you got some other folks who were elected in Florida."
    },
    {
      "text": "I'm not going to mention any names, but here's the thing, all over this country, people are trying, including this president, to suggest to you that you can't trust our election system. They're trying to confuse folks about voting. They're trying to suggest that there is somehow, there is something that lacks integrity about our system, because you see, they're trying to confuse folks about your power to vote. They're trying to confuse folks about how to vote, but we're smarter than that."
    },
    {
      "text": "And we know the power that we have when we vote. And here's the point that I want to make. Sometimes not only do we have to sit back and know that we've got to vote to honor all of the ancestors who fought for our right to vote. People like the late great John Lewis. We know that we need to vote to honor. We just honored the hundredth anniversary of the 19th Amendment, all those suffragettes who fought for the right for women to vote."
    },
    {
      "text": "We also fight for all of those who understood black women didn't get to vote until 1965. We honor the ancestors, but we also do as we know this, and this is what I want to ask you and then I'm going to close my comments because I want you to get out of the rain. I'm going to leave you with this. We have to ask, and please get back in your cars, get in your cars. I'll talk louder. Here's the thing. When all these people all over the country, all these powerful people trying to put roadblocks in, right?"
    },
    {
      "text": "They've been picking up the drop boxes, right, so people find it hard to find where the drop box is to early vote. They've been trying to suppress the vote. They've been purging the voter rules. And you have to sit back and ask why are these powerful people trying to make it so difficult for us to vote? And here is the answer: Because they know our power. They know when we vote, we win. They know when we vote that we vote for justice, we vote for fairness. They know we know what's on the ballot in 2020."
    },
    {
      "text": "Justice is on the ballot in 2020. Economic justice is on the ballot in 2020. Criminal justice reform is on the ballot in 2020. Reproductive justice is on the ballot in 2020. Climate justice is on the ballot in 2020. We know what we have at stake and we know our power and that's why we will vote every day until election day and get this thing done. Thank you."
    }
  ]
}