{
  "speech_id": "094",
  "title": "Kamala Harris Milwaukee Virtual Rally Transcript October 20",
  "date": "20201020",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-milwaukee-virtual-rally-transcript-october-20",
  "topics": "Economy, Healthcare, Climate, Social Justice, Government Policy",
  "num_segments": 23,
  "content": [
    {
      "text": "Oh, that's so great. I did. I blew it out. Oh Tammy, that's beautiful. I virtually received that. And I thank you. I thank you. That's so thoughtful of you. And while we have all the friends, I just want to thank you all for sending Senator Tammy Baldwin to the United States Senate. We have worked closely together on a number of issues. She is constantly fighting for the people of Milwaukee. I can't say this often enough."
    },
    {
      "text": "The people, I mean the entire state of Wisconsin, we sit in meetings, in the caucus meetings with our colleagues, and Tammy is always standing up. No cameras in the room, or whether cameras in the room or not, always standing up for the people of Wisconsin, always standing up for working people, always standing up for families. And really is a conscience of the United States Senate. So thank you for sending her there. Tammy, thank you for your friendship and for the birthday greetings."
    },
    {
      "text": "Congresswoman Gwen Moore, you are a force. You are a force. We serve together in many ways, including in the congressional black caucus. You are always, both Tammy and you, every visit I pay to Wisconsin, you are there. And beforehand, you brief me so that I will make sure that when I am in Wisconsin, I am in tune with the issues and aware of the needs of the people of the state. And so I thank you, Gwen Moore, for your leadership and friendship. County Executive David Crowley, thank you for all that you do."
    },
    {
      "text": "Mayor Tom Barrett, it's great to see you. And Lieutenant Governor Mandela Barnes, I want to thank you. The last time I was physically in Wisconsin, we were there together. You convened a group of leaders, community leaders, small business leaders, black entrepreneurs. It was very insightful. It was a wonderful visit. And I want to thank you for your leadership and your friendship. So, thank you to everybody. It's great to be with you. So we are 14 days away from this election. And today is the first day of- ..."
    },
    {
      "text": "and today is the first day of early voting in Wisconsin. My first day. That was my little indulgence. But I actually started the day being in Milwaukee, virtually. I did a number of radio interviews and I was so excited to hear... I was speaking with various Milwaukee leaders, and I was so excited to hear about how at the very first hour of early voting this morning, people were lined up. I just want to say, thank you for that, because what a great beginning."
    },
    {
      "text": "Now, we got to see it through, but what a great beginning. I think it speaks, first of all, to the leadership of the people I've just mentioned, and all of the community leaders, the faith-based leaders, so many folks who have reminded everybody and reminded their family members and their friends and their neighbors about what is at stake in this election. As Joe Biden always says, the thing that is at stake, reigning overall of it, is the soul of America. But let's look at where we are."
    },
    {
      "text": "We're in the midst of a pandemic, which has, at this point, taken the lives of over 220,000 Americans in just the last several months. We're looking at the fact that over eight million people who have contracted this virus, thank God that they are living, but with untold, still untold, longterm health consequences, including what classification they are now going to be in, which is to have a preexisting condition."
    },
    {
      "text": "We're looking at the fact that because of this public health pandemic, we're in the midst of a recession that is being compared to the Great Depression. People in Wisconsin, in Milwaukee, I know, and all across our country are driving into food lines, parked for hours, hoping that by the time they get to the end of the line, food is still there. Nationally, we're looking at one in five mothers describing her children, under the age of 12, as being hungry."
    },
    {
      "text": "We're not talking enough about the fact that we're dealing with a hunger crisis on top of it all. People in Milwaukee being unable to, or finding it very difficult, in very large percentages, to pay the rent, September's rent, October's rent. So all of this in terms of the economic impact. And then we're looking at these crises that are as a result of the COVID and then we are also dealing with the long overdue reckoning in America in terms of America's history and existence of racial injustice."
    },
    {
      "text": "And we're looking at the crisis of climate, and what that is doing, and what it has been doing around our country, from the West, from where I come, with the fires that have been raging all across the Western states, to the storms that have been hitting the Gulf coast, to what has been happening in the Midwest in terms of farmers and floods, and losing a season of crops. So these are the things that have been happening in our country."
    },
    {
      "text": "In addition, we're looking at the issue of the United States Supreme Court and what is happening in terms of COVID. And then in the midst of that, we're dealing with a push by members of the United States Congress to ram through a Supreme Court nominee, and to do that for political purposes. Meanwhile, sitting on their desk is a bill that would bring relief to the American people. It's been sitting on Mitch McConnell's desk for over 150 days and moving nowhere in the United States Senate."
    },
    {
      "text": "So all of this, in addition to what we know, has been the President, Donald Trump, trying to get rid of the Affordable Care Act in the United States Supreme Court, because he's had this weird obsession with trying to get rid of whatever Barack Obama and Joe Biden created. And in so doing, if they are successful, would not only get rid of the Affordable Care Act, which brought healthcare to over 20 million people."
    },
    {
      "text": "That means over 20 million people will lose their coverage, but they would also, as a result of getting rid of the Affordable Care Act, get rid of the protections that it created for people with pre-existing conditions. People like diabetes, high blood pressure, heart disease. In Wisconsin, 2.4 million residents have pre-existing conditions. So this is what we're looking at. And frankly, I think that it is more than fair to say that Donald Trump has exhibited a reckless disregard for human life."
    },
    {
      "text": "There's just no denying that. And again, when we're looking at the numbers who have been on unemployment, the numbers who have been impacted by COVID, the numbers who have been impacted by the existence of all that has happened in terms of the death and the coverup in our country. So where I am now is that we need to look at where we are in terms of Joe's vision because clearly, Donald Trump..."
    },
    {
      "text": "They knew what was going on, they knew that it could hurt people, they've had the information since January, they covered it up. They gave people no indication of how serious it was. They didn't give families enough time to make decisions about how they would live their lives, how they would protect their families, and this is where we are. So what we have to do is we got to elect Joe Biden. We have to elect Joe Biden."
    },
    {
      "text": "Tammy talked about it, that Joe has a plan, and we have a plan, and part of it is starting with containing COVID. The thing about Joe is that he has a deep understanding of how our government works. He has an understanding of what it means to manage a crisis. He dealt with these crises in the past, whether it be the great recession when he pushed through the Recovery Act or what he did to work on containing Ebola. Joe has talked about a plan for COVID since March."
    },
    {
      "text": "It's a plan that is about saving lives and saving the economy. Joe and I believe, and this is a very big difference between us and Donald Trump. We believe that you can measure the health and the wellbeing of the economy, not based on how rich people are doing, but based on how working people are doing. Ours is going to be economic policy that is about supporting and holding up working people. We will not increase taxes for anybody making under $400,000 a year."
    },
    {
      "text": "But what we will do is we will eliminate the Trump tax cut for the wealthy, the top 1% of the biggest corporations. We will invest in people who need help with healthcare, and better schools, and childcare. We will protect social security and Medicare. These are the things that we will do because we understand if we want to build up America's economy, we have to build up working people. The bottom line is also, doing it in a way that unites the American people, that brings us together."
    },
    {
      "text": "Joe and I are particularly proud of a broad coalition that we have built. One of the broadest coalitions that we've seen in a presidential race. Democrats, of course, but also Republicans and independents, and people of every race and every background coming together around an umbrella of understanding that we are better than this as a nation and that we are all in this together. So that's the spirit with which we are in this campaign and the work that we are doing over the next 14 days."
    },
    {
      "text": "It is about building back up better. It is about unifying our country. It is about speaking to our higher purpose and ideals, and doing the work that is necessary to remind everyone, to remind everyone that they're not alone. We're all in this together and we're going to get through this together. So 14 days to go. Again, early voting starts today, Wisconsin, you're the key. Milwaukee, we need you. You can register. When you vote, it's important to know that you will just need a photo ID and proof of residence."
    },
    {
      "text": "Proof of residence could include your driver's license, or your state ID, or utility bills, but it is important that you vote early. Please make a plan to vote. Vote early. Urge others to vote early. I know you've heard it before, but go to the website, I will vote.com\\wi, and make sure that your vote is counted and that your voice through your vote is heard."
    },
    {
      "text": "Because listen, even though some people are trying to confuse folks about the election and the process of voting, some people are trying to suggest that your vote won't matter. No, what they understand is that when you vote, you have power. They understand the power of your vote that's why they're trying to discourage you, but let's not let anyone ever take our power from us. We won't do that. We vote to honor the ancestors, which includes folks like the great late John Lewis."
    },
    {
      "text": "We vote to honor the ancestors like those suffragettes 100 years ago this year, who passed and helped pass the 19th amendment. We vote because we know what's at stake from healthcare to the economy, to the standing of our nation and the unity of our nation. And we vote because we know our power and we vote because we know when we vote, things change and we win. Thank you, Milwaukee. Thank you."
    }
  ]
}