{
  "speech_id": "095",
  "title": "Kamala Harris ‘Get Out the Vote’ Event Speech Transcript October 21",
  "date": "20201021",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-get-out-the-vote-event-speech-transcript-october-21",
  "topics": "Education, Social Justice, Government Policy",
  "num_segments": 26,
  "content": [
    {
      "text": "Can we hear it for Alison? I love our young leaders. I love our young leaders. Alison is a junior, we were talking about, she's studying interdisciplinary studies and we were talking about, it's a challenging time for everyone and for our students, our daughter is a senior in college. And so it really, pardon my expression, sucks. But Alison, you're amazing, and I'm so happy to share the stage with you. Thank you again. Let's hear it for our young leaders. Yay. Hi Asheville, how is everybody? Hi."
    },
    {
      "text": "It's so good to be with you guys. Mayor, I want to thank you just for all that, we were supposed to be here last week and it was so important that we came and so we recreated the schedule to be with you, but I want to thank the Mayor in front of everybody for the work that you've been doing, both as a leader here in Asheville, but in North Carolina and also in the support that you've given for Joe Biden and myself. So thank you. If we can hear it from Mayor Manheimer."
    },
    {
      "text": "And the Chancellor who is here and who gave me such a wonderful and warm welcome, thank you for all that you do in just nurturing and growing the minds of our incredible future and current leaders. Thank you. If we can just hear it for the Chancellor. Thank you. And to the members of the North Carolina General Assembly, I want to thank you all for your leadership and what you're doing. We have the Chief of the Eastern band of Cherokee Indians, Richard Sneed. I want to thank him."
    },
    {
      "text": "I'm going to thank the Buncombe County commissioners and city council, the Buncombe County Sheriff, Quentin Miller, and all of you. Thank you. So much to talk about, and I'm just going to move this there so I can see you guys. 13 days to go. 13 days to go, and we can not spare a minute, sister and brothers. We cannot spare a minute in terms of everything that I know everyone here, and around our country, is prepared to do as Joe Biden says, to fight for the soul of our nation. And that's really what's going on."
    },
    {
      "text": "It's about fighting for the soul of our nation. It's about knowing we deserve more and we are better than this. And there's so much that happened even before COVID struck, but in many ways, I've thought of this pandemic as being an accelerator in that it has highlighted what was wrong before and it has made it worse. And so let's think about it in the context of what has been going on in terms of public health, especially during this virus."
    },
    {
      "text": "And we can't overlook the fact that on January 28th, Donald Trump and Mike Pence were informed about the nature of COVID-19, this virus. They were informed five times more likely to kill people than the flu. Informed it could harm children. Informed it is airborne. Can you imagine what the families of Asheville, what the families of North Carolina could have done with that information on that date to prepare? Be it to stock up on toilet paper, or to plan?"
    },
    {
      "text": "Because we know that the vast majority of Americans don't have more than a thousand dollars in savings, and what folks might've done to prepare, knowing that it's predictable that they may not be able to go to work for a while? And sadly, we still have so many workers in America who don't have paid sick leave and paid family leave. But he didn't tell us. They sat on that information. They covered it up."
    },
    {
      "text": "And instead, the President of the United States, the Commander-in-Chief, whose first responsibility should be to keep the American people safe, sat on this information and suggested to the American people you're on one side of his ledger if you don't wear a mask, and on the other side of his ledger if you do, and now we're looking at a situation where over 220,000 Americans have lost their lives in just the last several months."
    },
    {
      "text": "Many of whom have families, and they could not even see them, and hold their hands, and touch them in their last days on this Earth. We now have a situation where over 8 million people have contracted this virus, having untold long-term health consequences, including what doctors are telling us, lung scarring, things of that nature. And in the midst of all of this, the public health crisis, you've got Donald Trump and his boy Bill Barr, in the United States Supreme Court. This is stranger than fiction."
    },
    {
      "text": "Have you ever heard that expression, fact is stranger than fiction? We're living it, we're living it, sister. And so what are we seeing? Right now in the midst of a public health pandemic, Donald Trump and Bill Barr are in the United States Supreme court, trying to get rid of the Affordable Care Act that President Obama and Vice President Biden made happen, that brought health care to over 20 million Americans. And if they are successful, it is estimated at least 23 million Americans will lose their coverage."
    },
    {
      "text": "There's this weird thing, I think, actually about a couple, but the thing about Donald Trump, this weird thing, he's got this weird obsession with wanting to get rid of whatever President Obama and Vice President Biden created. It's just this weird obsession. So the other thing is that if he's successful in getting rid of the Affordable Care Act, remember, it put in place protections for people with pre-existing conditions."
    },
    {
      "text": "If you know anybody who has diabetes, asthma, high blood pressure, breast cancer, and now we're talking about 8 million people who have a pre-existing condition called COVID, and they're trying to get rid of it. That alone is reason to know that he is incapable of being a President who will protect the well-being and health of the American people. And that's why he's got to go. We're looking at a situation, again, this pandemic has been an accelerator."
    },
    {
      "text": "We're looking at a situation where over 30 million Americans had to apply for unemployment insurance, many of whom, again, did not have paid sick leave, did not have paid family leave, and they're trying to push through a Supreme Court nominee in what I call an illegitimate process. Because by the way, we're not talking about election season. We're not talking about election year."
    },
    {
      "text": "We're talking about an election that is taking place right now where over 20 million Americans have voted and the election will be over in 13 days, and the majority of the American people are saying, \"Let the American people decide who will be their President, and then that is the person who should decide who fill a lifetime appointment to the highest court in our land.\" But yet, they're trying to push through this nomination."
    },
    {
      "text": "I serve, as Alison told you, on the Judiciary Committee, I will say publicly, I will oppose her confirmation for a number of reasons that include the illegitimacy of the process, that include the right of women to make decisions about their own body and their own reproductive healthcare, that include the need to maintain the Affordable Care Act. But they're pushing this thing through."
    },
    {
      "text": "Now, while there is a bill sitting on a desk that's been sitting there for 150 days called the HEROES Act that would bring relief to all of these people who are suffering right now, who are in food lines for hours. The one in five mothers in America who is describing her children under the age of 12 as being hungry, who needed expansion of what we're fighting for in that bill. SNAP benefits. You know what that is? We used to call it food stamps. It's what people need when they're hungry."
    },
    {
      "text": "Because on the one hand you have Joe Biden, who was one of the creators, and one of the reasons that we have the Affordable Care Act, who will make a commitment, has made a commitment to you, North Carolina and the American public, that he will expand coverage, that he will expand healthcare, bring down the cost of premiums, bring down the cost of prescription drugs, lower Medicare eligibility to age 60."
    },
    {
      "text": "He is saying, I will expand healthcare, understanding for too long we've been pretending healthcare is about a body that starts from the neck down, but we need to also deal with healthcare from the neck up. That's called mental health care. On the other hand, you have Donald Trump was trying to sue to get rid of it. On the one hand, you have Joe Biden, who says you want to talk about how we measure the success of the economy?"
    },
    {
      "text": "Well, we measure the success of the economy based on the health and wellbeing of working families in America. On the other hand, you have Donald Trump who passed a tax bill benefiting the top 1% and the biggest corporations of America, which will lead to a $2 trillion deficit. Joe Biden is saying, I'm not going to raise taxes on anybody who makes less than $400,000 a year."
    },
    {
      "text": "On the one hand, you have a Joe Biden who says, we've got to deal with supporting the public schools of America, and we will triple Title I funding for those schools that are in the highest needs communities with the lowest tax base, because the children of those communities have a God given capacity to be nurtured and to thrive, but we need to give them the resources. On the other hand, you have a Donald Trump who put Betsy Devos in office."
    },
    {
      "text": "On the one hand, you have a Donald Trump who has been rejecting science from day one, rejecting science on the issue of this climate crisis which is threatening our very existence, rejecting science on the issue of this virus, and on the other hand you have a Joe Biden who embraces science, who will be a leader who says that the public health experts must guide the policy decisions we make on all of these issues that literally threaten the health and wellbeing of the American people."
    },
    {
      "text": "So there are very clear choices here. And the bottom line is I do believe the outcome of this race will in very many ways, be decided by you, North Carolina. It will be. And in that way, the choices and the decisions you are making will impact people around the country. In that way, what you are doing to vote and vote early, is going to impact people that you may never meet, and people who may never know your name, but whose life will forever be changed because of what you are doing."
    },
    {
      "text": "And this issue before us of who will be the next President of the United States, has everything to do with fixing the problems, but it also has to do with restoring in our country what we know to be our highest ideals around unity, around bringing folks together, around rejecting these notions of fear and hate and division, of doing what we know we have had the capacity and have the capacity to do, to regain our standing in a way we can feel good about the future of our children and our nation."
    },
    {
      "text": "All of this is at stake right now, and Joe and I are actually particularly proud. I was doing some interviews earlier. We're proud of the fact that ours is a campaign that has probably built one of the broadest coalitions of any campaign in recent history. We've got the support of Democrats, and Republicans, and Independents. People of all walks of life, all races."
    },
    {
      "text": "We know that to strengthen our country, to take back the soul of our country, it's about all of us, and all of us being a part of where we go, and where we need to go, and where we can go. So I want to thank you, Asheville, for all that you are doing. 13 days to go. We don't want to look back in 14 days and have any regrets. And I guess my last point is this: this moment will pass. And years from now, our children, our grandchildren, others, they're going to look at us."
    },
    {
      "text": "We will tell them we were hanging out in this parking lot in Asheville with the mayor and all of these incredible friends and neighbors, and we will tell them how we organized, how we made sure that people know what's at stake, how we reminded people that none of us is alone, we're all in this together. And we will tell them about what we did to fight for the soul of our nation. Thank you all. Thank you."
    }
  ]
}