{
  "speech_id": "097",
  "speaker": "Harris",
  "title": "Kamala Harris Campaign Speech Transcript Atlanta, Georgia October 23",
  "date": "20201023",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-campaign-speech-transcript-atlanta-georgia-october-23",
  "topics": "Healthcare, Social Justice, Government Policy",
  "num_segments": 37,
  "content": [
    {
      "text": "What's up Atlanta. What's up Atlanta. I'm so happy to be back in ATL. Hey everybody. Can we hear it for Rick Hart? Where is he? Where did he go? What's up Rick? He was so good. He's so good. He's the head of the Georgia... There you are. You just tore it up. Rick is the head of the Georgia Students for Biden, the co-chair. And I'll tell you one of the things that I love about Joe Biden, and he says it often."
    },
    {
      "text": "He understands his long life of service and dedication to public service, but he is always uplifting those who are the emerging leaders, and Rick Hart is one of them. So can we give it up for Rick, because that's what it's all about. That's what it's all about. It's about everybody taking on their role of leadership, knowing that we have so much at stake in this election. There is so much at stake. And so I came back to Atlanta. I love Atlanta. Last time I was here, it was before the pandemic."
    },
    {
      "text": "I spoke on the stage here at Morehouse in March of last year. And come into [inaudible :47] especially if you are black and hold elected office in America, coming to Atlanta is like coming back to the womb. It really is. It is. Because Atlanta represents so much about who we are as America. Atlanta represents the hopes and the dreams and the fight to make real the promise of America. Atlanta is a place that has produced leaders who have been national leaders and international leaders."
    },
    {
      "text": "Who have always understood that hope will fuel the fight. Faith will be what grounds us in knowing what is possible. But then you got to just organize the folks, and bring people together, and recognize that nothing we have ever achieved as a nation by way of progress, came without a fight. And so that's what we have in front of us. We have for the next 11 days Georgia, a fight for the soul of our nation. This is a fight that we are engaged in, because we believe in the ideals of our country."
    },
    {
      "text": "We believe in our democracy. We know that America's democracy will always be as strong as we the people are in our willingness to fight for those ideals. And so that's where we are today. In a fight for the ideals, in a fight for the dignity, in a fight for justice and equal justice under law. And let's look at what is at stake. So we're dealing with a pandemic, and we're dealing with partly because of that, four crises that are occurring at one time in our nation."
    },
    {
      "text": "We're looking at because of the pandemic, a public health crisis. Where we have seen over 220,000 Americans lose their lives in just the last several months. Many of whom tragically in their last days on earth, couldn't even be with their family, with people they love, because of the nature of this pandemic. We're looking at over eight and a half million folks who have contracted the virus, thankfully have lived, but are looking at untold long-term consequences."
    },
    {
      "text": "Doctors are talking about things like lung scarring. And in the midst of this public health pandemic, we have a Donald Trump who thanks to Bob Woodward, we know knew back on January 28th, he knew the deal about COVID. He had been informed that it can kill people, that it is five times as likely to kill as the flu. He knew it was airborne. He knew it could harm children. And he sat on that information and he did not tell the American people."
    },
    {
      "text": "Can you imagine what you might've done had you known what he knew on January 28th? How folks might've prepared? How folks might've said, \"I got to buy some extra toilet paper,\" at the very least. But also how the fact is that even in Donald Trump's America before the pandemic, folks were working two and three jobs to try and pay the bills and pay the rent. Joe Biden I believe in our America, nobody should have to work more than one job to pay their bills and pay their rent and put food on the table."
    },
    {
      "text": "And he sat on this information. And then had the gall, had the nerve to say it was a hoax, to muzzle the public health experts. To suggest that he keeps a ledger, and you're on one side of his ledger if you don't wear a mask, you're on another side of his ledger if you wear a mask. And now look where we are. Now look where we are. And he's in the United States Supreme court where his boy Bill Barr, trying to sue to get rid of the Affordable Care Act. And let's step back for a moment and think about this."
    },
    {
      "text": "This man from the time he was... Even before he was running for office when he questioned the legitimacy of the birthplace of the first black president of the United States, has been so weirdly obsessed with trying to get rid of whatever Barack Obama created. Think about that. We don't need presidents who have weird obsessions. What is that about? So he is in court right now trying to get rid of the Affordable Care Act, which brought health coverage to over 20 million Americans."
    },
    {
      "text": "Covered people with pre-existing conditions. You know anybody who has diabetes, high blood pressure, breast cancer, lupus. And he wants to get rid of the thing that brought care and dignity to tens of millions of Americans. This is one of the reasons Donald Trump got to go. Got to go. We are in the middle of all these crises, the economic crisis. Over 30 million people in just the last several months had to file for unemployment."
    },
    {
      "text": "We are looking at families that are getting up at the crack of dawn, to drive to sit in their car in a food line for hours. Praying that they can get to the end of the line before the food runs out. One in five mothers in America is describing her children under the age of 12 as being hungry. We're in the midst of a hunger crisis in America. And you see again, on the one hand you have Joe Biden who says... Let me tell you how I measure the economy and how well it is doing."
    },
    {
      "text": "I measure the greatnesses of the economy based on how working people are doing. How are working people doing? When working people and working families are doing well, then the economy is doing well. Which is why Joe Biden and I are saying, \"One, taxes will not be raised on anyone making less than $400,000 a year.\" We are saying that we know one of the greatest ways that we achieve access to economic health and intergenerational prosperity is home ownership."
    },
    {
      "text": "So we will have a $15,000 tax credit for first time home buyers, to help you with down payments and closing costs to buy a home. We understand working families need childcare, but nobody should have to pay more than 7% of their income in childcare. That is our commitment. Because we know the economy is doing well when working people are doing well. On the other hand you have Donald Trump. Who measures how well the economy is doing based on the stock market."
    },
    {
      "text": "Who measures how well the economy is doing based on how rich people are doing. Who as one of his first orders of business, passed a tax bill benefiting the top 1% and the biggest corporations of America. I will tell you, Joe Biden and I will make it one of our highest priorities to get rid of that tax bill, and do what we know needs to be done to invest that money in working families. Public health crisis and economic crisis is being compared to the great depression."
    },
    {
      "text": "A long overdue reckoning on racial injustice in America. So on one hand you have Joe Biden, who has the knowledge and the courage enough to use the term and speak those words, black lives matter. On the other hand you have Donald Trump, who refuses and will never say, \"Black lives matter.\" And then have the gall to stand on that debate stage at the last debate in front of 70 million Americans, and would not condemn white supremacists. And people have asked me, they say, \"Well, Senator Harris..."
    },
    {
      "text": "\" By the way senator is not on my birth certificate. It's Kamala. And they say, \"Well, do you think... Are you saying? Do you think he's a racist?\" Yes, yes. Because you see, it's not like it's some random one off. We've seen that pattern going back to him questioning the legitimacy of Barack Obama, going back to Charlottesville. When people were peacefully protesting racial injustice in America, a woman was killed."
    },
    {
      "text": "And on the other side, you had a bunch of neo-Nazis wearing swastikas, carrying Tiki torches, slurring, throwing out anti-Semitic and racist slurs, and Donald Trump said, \"Well, there are fine people on both sides.\" A president of the United States who referred to Mexicans as rapists and criminals. A president of the United States who made as one of his first policy initiatives, a ban on Muslims entering our country."
    },
    {
      "text": "And then stood on that stage and would not condemn known white supremacist, and then double down and said, \"Well, they should stand back and stand by.\" This is not reflective of who we believe we are as a nation. We need a president who acknowledges systemic racism, who acknowledges the history of America, and uses that bully pulpit and that microphone, in a way that speaks truth with an intention to address the inequities and bring our country together. And that is Joe Biden. Four crises."
    },
    {
      "text": "Public health, economic, a grappling and a need to deal with racial injustice, and a climate crisis. So I come from California. I was born in Oakland, California. And we have some.... You know. Okay. The West Coast has been burning because of those wildfires. California, Oregon, Washington, the Gulf States have been battered by these storms. People in the Midwest, farmers have lost whole season of crops because of the floods. So Joe Biden says, \"We need to embrace science. We need to deal with it."
    },
    {
      "text": "This is something that is hurting people. It is something that we can address in a way we also create jobs by investing in infrastructure, investing in building renewable energy. That's going to be about jobs. Joe Biden knows the seriousness of environmental justice issues. He knows that of all of the areas where people live in America with poor air quality, 70% of the people in those areas are people of color. Joe Biden knows what's going on at Flint."
    },
    {
      "text": "Joe Biden says, \"We need to address this and we need to pay attention to science.\" On the other hand you have Donald Trump, who recently when he was asked about the wildfires in California... And the reporter said something like, \"Well, so the scientists are basically saying these fires, what's happening, the scientists are saying, 'there's a connection between this drastic changes in the climate and these wildfires.' You know what the president of the United States said in response?"
    },
    {
      "text": "\"Science doesn't know.\" What! Science doesn't know the president of the United States. And what we see is a through line, right, on that issue and the first issue. An inability to embrace fact. An inability to embrace experts. An inability to embrace intelligence. An inability to be competent. An inability to do the job of Commander in Chief of the United States, whose first responsibility is to concern themselves with the health and safety of the American people. And that's why we going to like Joe Biden."
    },
    {
      "text": "There is so much at stake. Now, you all know... And Atlanta helped me when I ran for Senate, and I am now the only black woman in the United States Senate. Only the second in America's history to be elected to the United States Senate. And I'm going to tell you because I've been there now for almost four years. The Senate is so important on all these issues. We need to take back the white house, there's no question about that. We also need to take back the Senate. We need to take back the Senate."
    },
    {
      "text": "It's the senators that will make decisions about advise and consent on who sits in the United States Supreme Court, right? One of the reasons I became a lawyer is because I was inspired by Thurgood Marshall and Charles Hamilton Houston and Constance Baker Motley, right? They are the ones who fought for Brown v. Board of Education. They are the ones who have fought for civil rights. Who sits in the United States Supreme Court has everything to do with our fight for equality."
    },
    {
      "text": "Well, it's going to be the president who nominates somebody, but it's the Senate who advise and consent will make the decision about whether it goes through. And right now we're seeing that battle in full relief, with this illegitimate process they've engaged in to try and fill the seat of the great Ruth Bader Ginsburg, while people are voting in an election."
    },
    {
      "text": "The majority of American people say, \"Let us decide who will be our president, and then let that person decide who fills that seat?\" The United States Senate. The United States Senate is where there will be a decision on whether we put on the floor a bill that my brother Cory Booker from New Jersey and I wrote, called the George Floyd Justice and Policing Act."
    },
    {
      "text": "A bill that says like Joe Biden and I say, \"We should ban chokeholds and carotid holds,\" because George Floyd would be alive today if that were the case. A bill that says, \"Let's have a national registry of police officers who break the law,\" because that is the right thing to do. And we can't have folks just get fired one place and then they'll get hired somewhere else."
    },
    {
      "text": "It says, \"We need to have a national standard for excessive use of force.\" Because it's not right that in some places when there is excessive use of force the question asked is, \"Was it reasonable?\" When we all know you couldn't reason a way just about anything. And the more fair and just question to ask is, \"Was it necessary?\" We need to change the standard. Those kinds of decisions, yes they get made from the White House, and we will make them. It also gets made in the Senate."
    },
    {
      "text": "And so that brings me to Raphael Warnock and Jon Ossoff. And Georgia you got to send them to the United States Senate. Send them to the United States Senate. Let them represent Georgia on all these issues. It is critically important. And you know those Senate seats, those are six year terms. Think about your plans for your life and for your children's life, over the course of the next six years. There's a lot that can get done, either for good or for not. These Senate seats are so important."
    },
    {
      "text": "So I'm here, Atlanta, Georgia, to ask you to do what I know you already know how to do so well. Which is to organize. Which is to talk to folks about what's at stake. Which is to remind people on the issue of voting. That we've got so many reasons. One has to do with again, Atlanta, it has to do with John Lewis. It has to do with those men and women who shed blood on that Edmund Pettus Bridge and so many other places, for our right to vote. And so voting is about honoring those ancestors."
    },
    {
      "text": "Honoring what they fought for and what they sacrificed for our right to vote. Voting is because there is so much at stake. Everything that we discussed. Everything that affects our lives. And voting also is because we're not going to let anyone mess with our right to vote. Because here's how I think about that. Step back and think about... And I've been spending a lot of time all over. I've been to Florida this week. I was in North Carolina this week. I'll be in Ohio tomorrow. But think about it from this perspective."
    },
    {
      "text": "Ever since and even before they gutted the Voting Rights Act in 2013, a whole lot of really powerful people including in this state, because otherwise we would be talking about Governor Stacey. A whole lot of powerful people for quite some time, have been trying to suppress our vote. Have been trying to purge the voter rolls. Have been trying to confuse us about the process, to make it difficult. \"Oh, you can fill out your ballot and then put it in one envelope."
    },
    {
      "text": "But then you need to put it in another envelope and make sure that's signed.\" Trying to confuse us, trying to make it difficult. Messing with the post office. Can you imagine? The post office. Like the postman, the postwoman. They're messing with the post office. And we have to at some point sit back and think, \"Why are they trying to make it so difficult and confusing for us to vote?\" And I think the answer is because they know our power. They know our power. They know when we vote, things change."
    },
    {
      "text": "They know when we vote, we win. And so I'm here to say Atlanta, let's not let anybody take our power from us. We know the power of our voice. We know at election time the power of our voice is expressed through our vote. We're not going to let anybody take us out this game. We are present. We are powerful. We are active. And we know what's at stake and we honor our ancestors every day. And so my last point is this, this moment will pass."
    },
    {
      "text": "And years from now, our children, our grandchildren and others, they will look in our eyes each one of us, and they will ask us, \"Where were you at that time?\" And the thing we're going to be able to tell them, is so much more than just how we felt. What we will tell them is what we did. We will tell them, \"There was this one particular afternoon we were hanging out at Morehouse in the parking lot... \" We will tell them we organized, that we talked to our neighbors and our friends and our relatives."
    },
    {
      "text": "We will tell them we helped people get to the polls. We will tell them a mandatory Saturday which is tomorrow, that we made sure everyone we know, got to their County office to vote. We will tell them we stood up and we fought for our country, and we fought for the ideas because we love our country and we know our power. Thank you Atlanta."
    }
  ]
}