{
  "speech_id": "099",
  "speaker": "Harris",
  "title": "Kamala Harris Campaign Speech Transcript Las Vegas, NV October 27",
  "date": "20201027",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-campaign-speech-transcript-las-vegas-nv-october-27",
  "topics": "Healthcare, Economy, Government Policy",
  "num_segments": 40,
  "content": [
    {
      "text": "What's up, Nevada? Steven Horsford, Jacky Rosen, Catherine Cortez Masto. What's up Nevada? It's so good to be back. It is so good to be back. You are going to decide who's going to be the next president of the United States. You will decide. A path to the White House runs right through this field. And we're going to get this done. We're going to get this done. Seven days to go. Seven days before the end of this election. And you all have been doing your thing. I'm telling you. I was talking to Jacky backstage."
    },
    {
      "text": "I mean, you've been organizing, you've been registering people to vote before now. You've been reminding people about early voting, which is over on Friday, October 30th. You've been telling people about what's at stake. You all have been, as you always are leaders and fighters for the best of who we can be as a country. And I am just here to thank you. I am here to thank you, Nevada. And there's so much at stake. There's so much at stake. Just think about it."
    },
    {
      "text": "We're right now in the midst of four crises happening all at once, right? Two caused by the pandemic, a public health crisis and an economic crisis. And I don't need to tell Nevada how hard folks have been to hit. A public health crisis where over 225,000 Americans have died in just the last several months, many without the benefit of having family and loved ones next to them for their last moments on earth because of the nature of this."
    },
    {
      "text": "Over eight and a half million people have contracted COVID with untold long-term health consequences. Doctors are talking about things like lung scarring, things like that, right? And here's the thing. Thanks to a fellow by the name of Bob Woodward, we know that Donald Trump knew about this on January 28th. He knew. He knew it was five times more deadly than the flu. He knew it could impact people of every generation, including young people. He knew it was airborne."
    },
    {
      "text": "And yet he held onto that information and covered it up. He told the American people it was a hoax. The Commander in Chief of the United States has as their first responsibility to concern themselves with the health and safety of the American people and he failed and therefore has forfeit his right to reelection. And we are here to vote and make sure everyone does. That's right. But let's just think about this."
    },
    {
      "text": "So, this pandemic has hurt so many people and we have a president of the United States who suggested that you're on one side of his ledger if you wear a mask and on another side of his ledger, if you don't. We have a president of United States when the last debate with Joe, did you see that? Joe just did his thing. Joe did his thing. And the president had the nerve to say, \"We're rounding the corner.\" Meanwhile, here in Nevada, one in seven families is describing members of their household as being hungry."
    },
    {
      "text": "Here in Nevada, one in seven households is describing a difficulty paying the rent if they were able to pay it at all last month. One in four small businesses is out of business and he said, \"We're rounding the corner.\" Come on, man. Come on, man. That's a Joe Biden term. Come on, man."
    },
    {
      "text": "A public health crisis and in the midst of this pandemic, on the one hand, you have Joe Biden, who is saying, \"We will expand the Affordable Care Act,\" which he and president Obama created, which brought health care to over 20 million people. Joe Biden is saying, \"We will continue to protect people with preexisting conditions.\" How many of us know somebody who has diabetes, high blood pressure, breast cancer, lupus?"
    },
    {
      "text": "And Joe Biden is saying, \"You will continue to be protected.\" Joe Biden is saying that, \"We know we also need to bring down Medicare eligibility to age 60.\" Joe Biden is saying, \"Let's bring down prescription drug costs. Let's lower premiums.\" Joe Biden knows that when we're talking about healthcare, the body doesn't just start from the neck up. We also need to address health care from the neck up and not just the neck down. That's called mental health care."
    },
    {
      "text": "On the one hand you have Joe Biden and the voters have a clear contrast. Because on the other hand, you have Donald Trump who right now with his boy, Bill Barr is in the United States Supreme court, trying to sue to get rid of the Affordable Care Act. And it's an interesting thing that we have all observed. Ever since Donald Trump started running for office, have you noticed how he has this weird obsession with getting rid of anything Barack Obama created? We don't need presidents with weird obsessions, do we?"
    },
    {
      "text": "No, we don't want that. He's trying to get rid of a policy that if he is successful will cause over 20 million people to lose their coverage in the midst of a pandemic, in the midst of a pandemic that has now classified an additional eight and a half million Americans with a preexisting condition called COVID. If there is no other reason to elect him out of office, that is one. We are in the middle of crises because of the pandemic, an economic crisis that people are comparing to the Great Depression."
    },
    {
      "text": "Again, we look at the numbers here in Nevada. I was with the UNITE HERE workers earlier today. We look at all SCIU brothers and sisters, right? We look at all the working people who are struggling. We are in a moment where it has highlighted in many ways, this virus, in my opinion, it has been an accelerator meaning people who were doing badly before are doing even worse."
    },
    {
      "text": "It has now highlighted the fact that we have to get to an America where everyone has paid sick leave, paid family leave, paid to do their work, but also to have the benefits that any working person should have when we recognize the dignity of the work. But an economic crisis of proportions we have not seen. Again, a clear contrast because on the one hand you have Joe Biden who when asked about, \"Well, how's the economy doing?"
    },
    {
      "text": "How do you measure how well the economy is doing?\" Joe asks, \"Well, tell me how working people are doing? How are working families doing?\" Joe Biden says that we're not going to raise taxes on anyone making less than $400,000. And we are going to create a middle-class tax cut. And we're going to make sure working families don't pay more than 7% of their income and childcare."
    },
    {
      "text": "And we will make sure that first time home buyers have a $15,000 tax credit for down payment and closing costs, knowing that it's the best way working people can have intergenerational wealth. On the other hand, you have Donald Trump, who when you ask him how's the economy doing, he wants to know what how's the stock market doing. He cares about how rich people are doing. One of his first initiatives was to pass a tax code benefiting the top 1% and the biggest corporations of America. There's a clear contrast."
    },
    {
      "text": "Because in a Biden-Harris administration, we're about to get rid of that and invest that money in working people, invest that money in building infrastructure, invest that money in what we know needs to happen to support the folks who have built the middle class of America. There's a clear the contrast in this election, a public health crisis, an economic crisis, a long overdue reckoning on racial injustice in America. And on the one hand, you have a Joe Biden who is a student of American history."
    },
    {
      "text": "He is a truth-teller and he has the courage to speak the phrase, black lives matter. Joe Biden has the courage to speak the truth that there are racial disparities that spanned our health care system to our economy, to our educational systems and we must speak truth, no matter how uncomfortable it may be to hear so that we can fight not only free quality, but for equity. Joe understands that. He understands we need to have a criminal justice system that is true to that concept of equal justice under law."
    },
    {
      "text": "And it needs to be reformed to the point that we get rid of mandatory minimums, that we decriminalize marijuana, that we expunge the records of those who have been convicted for marijuana offenses, that we shut down private prisons, that we get rid of cash bail, because it is not only a criminal justice issue, it is an economic justice issue. Joe understands that. He understands on the issue of policing."
    },
    {
      "text": "We got to speak truth about it, and there needs to be consequence and accountability when anyone breaks the law, including a police officer. And so Joe says, \"We will ensure that there will be a ban on choke holds and carotid holds because George Floyd would be alive today if that were the case. Joe says we will have a national registry on police officers who break the law so they can't get fired in one place and then pick up and move to another place to get hired. Joe understands this things."
    },
    {
      "text": "On the other hand, you have a Donald Trump who remember at the debate before last was given an opportunity in front of 70 million Americans to condemn white supremacists, but refused to do that and then doubled down and said, \"Stand back and stand by.\" And it wasn't like, this was just a one off. Remember this is the guy who started running for office questioning the legitimacy of the first black president of the United States."
    },
    {
      "text": "This is someone who on the issue of Charlottesville, where there were peaceful protestors, protesting racial injustice in America, and a young woman was killed that day. And on the other side, there were a group of neo-Nazis wearing swastikas, carrying tiki torches, spewing, racial epithets, antisemitic epithets. And then what did Donald Trump say? \"There were fine people on each side.\" This is a president of the United States who called Mexicans rapists and criminals."
    },
    {
      "text": "And one of his first acts after he got elected was to institute a Muslim ban. There's a clear choice for America right now because you see Joe understands that we are better than this. Joe understands that it is enough. We've had enough with supposedly leaders trying to sow hate and division among us, trying to turn Americans against each other. Joe understands that the real measure of any one strength is measured not based on who you beat down, it's measured based on who you lift up."
    },
    {
      "text": "There's a real choice in this election. And we're dealing with a climate crisis and I don't need to tell Nevada, look, the West is burning. We know that. The West is burning these wildfires, I have gone to the site of the wildfires, I have met with the families who were evacuated, who lost everything they had. I have met with firefighters who were fighting fires while their own homes were burning. My brother-in-law's a firefighter."
    },
    {
      "text": "I have seen, we have seen the destruction based on an extreme change in our climate. The Gulf Coast states battered by those storms. Midwestern states where farmers have lost a whole season of crops because of the floods. Joe Biden understands you need to deal with science. You need to understand this is representing an existential threat to who we are as a species."
    },
    {
      "text": "Joe Biden understands we need to deal with this with a sense of urgency because the clock is ticking on this, and also understands therefore, we need timelines, net zero emissions by 2050, we need timelines understanding with a sense of urgency we can deal with the crisis and also see the opportunity to create jobs and invest in infrastructure that is about renewable energy and good paying jobs and good paying union jobs."
    },
    {
      "text": "On the other hand, you have a Donald Trump who you all might've seen this [inaudible :21] I kid you not. So he's asked about the wildfires in California, Jacky, he's asked about the wildfires in California and Steven and the question came in kind of like, so the scientists are telling us about the extreme conditions and contributing to the wildfires and human behaviors are also contributing to the damage to our environment."
    },
    {
      "text": "And the president of the United States, the president of the United States responds with, \"Science doesn't know.\" Now what is that? He's the president of the United States. Well guess what, Mr. Trump science does know and you don't. There is so much at stake in this election. And again, I'm here to thank you guys. Because look, I'm traveling around the country. I've been spending time all over in Florida, in North Carolina, was in Ohio and Michigan and here's the thing... Georgia. I was in Georgia."
    },
    {
      "text": "The thing that you guys know is that all over our country, there are people trying to mess with the vote. Even the president of United States, as far as I'm concerned at that first debate stood on that debate stage and openly encouraged suppression of the vote. Right? And so when we think about this election, we know we have to be organized. We know we have to be motivated. We know we have to spread the word because there are so many reasons for us to vote."
    },
    {
      "text": "Now normally we always, we think of one or two, but I actually think of three reasons why everybody should vote. One is let's honor the ancestors. Let's honor the ancestors. We lost the great Congressman John Lewis this year, who was an extraordinary, extraordinary human being. John Lewis was a modern day hero. He shed blood on that Edmund Pettus Bridge for the right, for the right, for black people in America to vote. And John Lewis was a civil rights fighter."
    },
    {
      "text": "He knew an extension of that fight was his fight for marriage equality. He knew an extension of that fight was his fight for immigrants. He understood that. So let's honor the ancestors, let's honor the ancestors when this year we celebrated the 100th anniversary of the 19th Amendment. All those suffragettes in their white marching and shouting. Let's honor the ancestors on that. All of us remember history and facts, black women couldn't vote until 1965, but let's honor the ancestors. That's a reason to vote."
    },
    {
      "text": "Another reason to vote, everything is at stake. Everything is at stake. You can go down the list, everything we talked about, including is there going to be a president who cares about public education for our children and understands Betsy Devos is not the right way to go? A president cares about America's standing in the world, understanding the difference between our allies and adversaries. Everything is at stake, and that is a reason to vote. And then the third reason to vote, I believe it's this."
    },
    {
      "text": "And when they took the teeth out of the Voting Rights Act and our ability to enforce accountability on states that had a history of discrimination, they took away that ability and almost immediately thereafter, as many as two dozen States started putting in place laws that were designed to suppress the vote, purging voter roles, making it difficult for people to vote, targeting African-Americans Latinos, students, our native brothers and sisters."
    },
    {
      "text": "And so much so that in North Carolina, the Court of Appeals said about the North Carolina law, that it was written with quote \"surgical precision to prevent black folks in North Carolina from voting.\" And we've seen it happen throughout this election, right? Where people are trying to make it difficult. You see, in like Texas, they were collecting the drop boxes. You see all over the country what they've been doing, right?"
    },
    {
      "text": "Making people stand in line, shutting down some of the polling places, trying to confuse people. Even the president of the United States openly encouraging a suppression of the vote. Messing with the post office. I mean the post office. Like the best people in the world work for the post office? Messing with the post office?"
    },
    {
      "text": "So on this point then I think it's important to sit back and ask why are so many powerful people trying to make it difficult and trying to confuse us about the integrity of the election system and our right to vote? Why are they doing that? And I think they know the answer and we certainly do. They know we've got the power. They know we've got the power. They know when we vote things change. They know when we vote, we win."
    },
    {
      "text": "So let us not let anybody ever take our power from us and at election time, the power of our voice is our vote. And so we, Nevada will do everything that is necessary to remind our neighbors and our family members and our friends and our coworkers, you've got the power and don't let anyone take your power from you. The power is with the people. People, these journalists will ask, \"Well, what do you think is going to happen the day after the election?\" All that's been going around, right? And here's what I say."
    },
    {
      "text": "And here's what I believe. America's democracy is as strong as our willingness to fight for it. We are prepared to fight for our democracy and the integrity of our democracy. And we will not let anyone make us feel weak or insignificant because we know the power is with the people. And so that's what all this is pretty much about. And over these next seven days, let's continue to own our power."
    },
    {
      "text": "Let's continue to run behind each other of our power because we have to deal with the reality that we've also been in a situation where you and I got to stand six feet apart and wear a mask. Can't really see anybody's face. People have been having to stay at home, not really see each other. And people are feeling alone and isolated. You got to deal with that. And so we're going to have to make the special effort to not let it circumstances of this moment disempower anybody."
    },
    {
      "text": "Let's let this moment be the moment that we rise to remind people of the strength of ourselves in each other. And my final point is this, this moment will pass, and years from now, our children, our grandchildren, others, they're going to look in our eyes, each one of us, they're going to look in our eyes and they will ask us, \"Where were you? Where were you at that moment?\" And what we're going to be able to tell them is so much more than just how we felt. We are going to tell them what we did."
    },
    {
      "text": "We are going to tell them we were hanging out on this particular afternoon in this field with Jacky Rosen and Steven Horsford and Kamala was on this stage, walking back and forth. We're not tell them that we organized, that we emailed, that we called, that we texted everybody we know multiple times and we were okay if they got sick of us because we knew they'd come back around. We will tell them that we stood up and we fought for this country we love."
    }
  ]
}