{
  "speech_id": "100",
  "title": "Kamala Harris Campaign Speech Transcript Reno, NV October 27",
  "date": "20201027",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-campaign-speech-transcript-reno-nv-october-27",
  "topics": "Economy, Healthcare, Social Justice",
  "num_segments": 42,
  "content": [
    {
      "text": "Hi, guys. Hey, Reno. Hi, everybody. Oh, it's so good to see you. Wasn't Dominique amazing? Can we hear for Dominique? It's so good to be back in Reno. I am so happy to see you guys, and what a beautiful day and look, I never knew there were blue pumpkins. This is fantastic. First, I just want to thank Patricia Ackerman, who of course is running for Congress in Nevada too. Let's make sure we take care of that. And then of course Wendy Jauregui-Jackins, the candidate for State Senator in Nevada. Dr."
    },
    {
      "text": "Angie Taylor, Washoe County school district. And then Dominique. Okay. I'm just going to come over here. It's so good to see you guys. It's so good to be back in Reno and thank you all for coming out this afternoon. Everybody's got a busy life, and these are tough days, and thank you all for the time, and for the energy, and for your commitment to fighting for our democracy."
    },
    {
      "text": "I've been doing it a lot of interviews, as you can imagine, and people say, \"Well, what do you think is going to happen the day after the election?\" You've heard all that talk. And I said, look, here's what I truly believe. Yeah, we've taken a battering. There's no question about it over these last three and a half years. If you think about our democracy as kind of a house, yeah, the shingles have fallen off a little bit, but the house is still standing. The house is still standing."
    },
    {
      "text": "And I'll tell you why, because I do believe that our democracy will always be as strong as our willingness and preparedness fight for it. And fight we will, because look at what I'm looking at, and there are a bunch of folks over there, because we had to socially distance. So we got friends over there too. People are turning out."
    },
    {
      "text": "I've been going all over the country and these last like 10 days or so in particular, visiting with folks who were in early voting, and here in Nevada, early voting until Friday, October 30th. So let's make sure everyone votes and vote early, just get it done, get it in. And I'm telling you guys, people are standing in line and the enthusiasm and the energy, and it's because they know what you know, which is this is our country and we love our country and we're prepared to fight for it. So that's where we are."
    },
    {
      "text": "And look, I mean, there's so much at stake in this election, I don't have to tell you guys that. We are in the midst of at least four crises that are happening all at the same time. We're a crisis that is caused by this pandemic, which has created a mass casualty event like we have not seen since World War II, where we are looking at over 225,000 Americans who just in the last several months have died."
    },
    {
      "text": "Many of whom were without a loved one next to them because of the nature of this, many of whom the family was hoping at least they could FaceTime, or see each other virtually for their last days on earth. People are mourning. Over eight and a half million people have contracted this virus, with unknown long-term consequences, including lung scarring, things of that nature."
    },
    {
      "text": "And the thing is, is that Donald Trump and Mike Pence, thanks to Bob Woodward, we know, knew back on January 28th that it is lethal, five times as deadly as the flu, that it could harm young people, that it is airborne, and they sat on that information and then had the gall, the President of the United States, the Commander-in-Chief, whose first order of business should always be to protect the health and safety of the American people, sat on that information and called it a hoax."
    },
    {
      "text": "Can you guys imagine if you had known, if parents had known, if small business owners had known, if teachers had known what the President knew on January 28th, what you might've done to prepare? Because let's not forget, even before this pandemic folks were hurting. Even before this pandemic, folks were working two and three jobs to try and get through the month and pay the bills and in the America Joe Biden and I believe in, people should only have to work one job to pay the rent and put food on the table."
    },
    {
      "text": "People were hurting already. The average American family was struggling to have maybe a thousand dollars in savings. Can you imagine what folks might've done to prepare, not to mention buy toilet paper? And they sat on this information, and now in the midst of a public health pandemic, Donald Trump and his boy Bill Barr are in the United States Supreme Court, I voted no on that vote last night for confirmation, by the way."
    },
    {
      "text": "They're in court right now suing to get rid of the Affordable Care Act that brought health care to over 20 million Americans, that said people with pre-existing conditions should not be denied access to coverage. People who have diabetes, high blood pressure, breast cancer, lupus. Do you know over 1 million Nevadans have preexisting conditions? And they're in court right now trying to get rid of the Affordable Care Act. And it is a statement about who this person is, this President."
    },
    {
      "text": "Who in the midst of the kind of suffering we are seeing, has and is continuing with this very weird obsession he has had since he ran for President, to undo whatever Barack Obama created. It's a weird obsession, by the way. We don't need a President with weird obsessions. Let's just move beyond that, that thing too."
    },
    {
      "text": "We're in the midst of a public health crisis, we are in the midst of an economic crisis being compared to the Great Depression, where over 30 million Americans, in just the last several months, had to file for unemployment. Here in Nevada, one in seven families is describing their household as being hungry. We're in the midst of a hunger crisis in America. People aren't talking enough about that. In fact, I saw numbers that one in five mothers is describing her children under the age of 12 as being hungry."
    },
    {
      "text": "In Nevada, we are looking at one in seven households who are finding it difficult, they don't have the ability to pay rent. In Nevada, one in four small businesses has gone out of business, and it's important to know that of the American workforce, almost half of the American workforce either runs a small business or works for a small business. The economic devastation is profound."
    },
    {
      "text": "And then when you listen to Donald Trump, even in the last debate, he's talking about, \"We're rounding the corner.\" What is he saying? Rounding the corner. When people are struggling to keep a roof over their head, but here's the difference again, and the clear difference on all these issues. So on public health, Joe Biden is saying, let's expand the Affordable Care Act that Barack Obama and I brought into being. Let's bring down Medicare eligibility to age 60."
    },
    {
      "text": "Let's recognize that we need to bring down the cost of premiums and drug prices. Let's recognize that when we're talking about healthcare, the body doesn't just start from the neck down. It also requires health care from the neck up calling mental health care, and let's expand that. And on the other hand, you have Donald Trump trying to get rid of the Affordable Care Act. On the economy. Joe Biden says, you want to ask me about how the economy is doing, tell me how working people are doing."
    },
    {
      "text": "Tell me how working families are doing. Joe Biden says, we're not going to increase taxes on anyone making less than $400,000 a year and we're going to make sure that working families don't pay more than 7% of their income in childcare. And yes, we are going to raise the minimum wage, but we also know that's the minimum, and we need to invest in what we can do in terms of innovation, and building infrastructure, and investing in good union paying jobs to build up the middle class in America."
    },
    {
      "text": "And on the other hand, you have Donald Trump, who when asked, \"How's the economy doing?\" He asks, \"Well, how's the stock market doing? How are rich people doing?\" He passes, as one of his first orders of business, a tax bill benefiting the top 1% and the biggest corporations in America."
    },
    {
      "text": "Well, let me tell you something, Joe Biden and I are about to get rid of that, and invest that money in working people in America, put that money into building up their skills, put that money into supporting small businesses, so they can reopen and rehire. We're in the midst of a long overdue reckoning on the issue of racial injustice in America. And on the one hand, you have Joe Biden, who knows, and has learned, and studied America's history, and has therefore the courage to say black lives matter."
    },
    {
      "text": "A term Donald Trump will never use. Will never use. Joe Biden says, let's deal with racial disparities. Let's recognize that African-Americans and Latinos in our country are three times as likely to contract COVID, and twice as likely to die from it. Let us deal with the racial wealth gap where we know that black families own one 10th of the wealth of other families. Let's deal with the racial disparities in our healthcare system."
    },
    {
      "text": "Understanding black women are three to four times likely to die in connection with childbirth than other women. That's how Joe Biden thinks. Joe Biden says, we're going to reform these systems, including the criminal justice system and in so doing, we will decriminalize marijuana and expunge the records of people who have been convicted for marijuana offenses."
    },
    {
      "text": "And for that reason, we will one, ban choke holes and carotid holds, because George Floyd would be alive today, and we will require accountability around creating a national system of tracking those that have broken the law so they can't get fired in one place and get hired in another. On the other hand, you have Donald Trump."
    },
    {
      "text": "Who, remember at the last debate, the one before this most recent one, refused to condemn a white supremacist group and then doubled down and said, \"Stand back and stand by.\" That on the heels of way back when, because there's a pattern, of on the issue of Charlottesville, where Americans were peacefully protesting racial injustice, a young woman was killed at that."
    },
    {
      "text": "And on the other side, there were Neo Nazis wearing swastikas, carrying tiki torches, and he had the gall to say, \"Fine people on both sides.\" Has called Mexicans rapists and criminals. One of his first orders of business, a Muslim ban. And you see, this on this list, a very clear contrast is another of those issues before the American people."
    },
    {
      "text": "And on this issue before the American people is our ability to fight for a Joe Biden who understands that regardless of where you live, your race, your gender, your age, or the language your grandmother speaks, that we have so much more in common than what separates us, and it is time to end a supposed leader who is spending full time trying to sow hate and division among us."
    },
    {
      "text": "We want a unifier, and that' And Joe says, look, I also see the opportunity in the moment to save our planet, which is also will allow us, if we're serious about it, to invest in infrastructure, invest in renewable energies, invest in the research and development that will allow us to save our planet, to save water, to save clean air and clean water. Joe sees that this is about building up the economy and jobs as much as anything."
    },
    {
      "text": "On the other hand, you have Donald Trump who, okay, so he gets asked by some journalist about the wildfires, and the journalist asked him something like, \"So the scientists are telling us these extreme weather conditions are causing this to happen. What do you have to say about that?\" The President of the United States of America, who is also the Commander-in-Chief of the United States of America responds to that question by saying, \"Science doesn't know.\" Mr. President, science knows."
    },
    {
      "text": "Science knows, and we know, and we know it is time that we deal with these issues and stop playing into the special interests that you've been courting since you came in office. So these are some of the issues that are before us right now, and there are clear choices. There are clear choices. And we have within our power, the ability to determine the future course of our country, we have it within our power. And you know, this brings me to the point in Nevada and why I will keep coming back."
    },
    {
      "text": "And Joe has, you guys know, it's why you're here. Nevada is going to help determine the outcome of this election. You are, you are, you are. And in that way, your vote is going to have an impact on people around the country, people you'll never meet, people who may never know your name, but because you guys are so, so powerful in your leadership and engagement, you're going to make the difference."
    },
    {
      "text": "And like I said, I've been traveling around the country, and one of the things that has become very clear to me is sometimes people say, \"Okay, well, is my vote matter? Why should I vote?\" And I think there's three reasons. One is to honor the ancestors. This year we lost the great John Lewis who shed his blood on the Edmund Pettus Bridge for the right for black Americans to vote, shed his blood. And the thing I loved about John Lewis, who I knew, and he was just an incredible, incredible friend."
    },
    {
      "text": "John always kept showing up there. On the subject of John Lewis, he was one of the first to show up and say, \"Marriage equality is a core civil rights issue.\" He was one of the first to say, \"We need to deal with immigration and create a pathway and stop demonizing immigrants in America.\" John Lewis. So he, and so many others, shed that blood. We should honor that sacrifice. This year, we celebrated the 100th anniversary of the 19th Amendment."
    },
    {
      "text": "All those bad-ass suffragettes, oh, there's children here, but it's okay. Mom said, it's okay. All those suffragettes who marched, who couldn't hear no, who fought for our right to vote. And let's not remember because we must be true to history and the facts of it all, however, that black women were not able to vote until 1965. So let's remember that, but honoring the ancestors, it's an important reason to vote. Two, everything that's at stake. And we went through the list, and there's so much more."
    },
    {
      "text": "That vote last night, I voted against her for a number of reasons. One, because it has been an illegitimate process from the beginning. To push through and cram through a nomination of someone while the American people are voting, like literally we're not even talking about election season or election year, tens of millions of people have voted."
    },
    {
      "text": "I think that the last number I saw was over 50 million people had voted when the confirmation went down last night, And the majority, by the way, of the American people are saying, \"Let us choose who will be the next President of the United States and let that person choose who will fill a lifetime seat on the highest court in our land, that was previously occupied by the great Ruth Bader Ginsburg.\" And there's so much at stake. Ruth Bader Ginsburg, we always should speak her name. What she did."
    },
    {
      "text": "I think of her as there was an inverse relationship between her size and her force. What she did for equality and women, and now there's someone on the court who many of us opposed also, because we know she has a track record, which makes clear, she wants to get rid of the Affordable Care Act."
    },
    {
      "text": "Now, keep in mind guys, in so doing, if they're successful in getting rid of the Affordable Care Act, among the other things we talked about, over 20 million people access to health care, people with preexisting conditions being protected. You know what else will be at stake? Free birth control, free mammograms, free cancer screenings. All of that is at stake, not to mention a woman's right to make a decision about her own body. There's so much at stake. So we honor the ancestors."
    },
    {
      "text": "We know what is at stake, and the here would be the third reason I think it's important for us to remember the importance of voting. And it has to do with this: back in 2013, the United States Supreme Court gutted the Voting Rights Act in a case called Shelby V Holder. And they basically took the teeth out of it."
    },
    {
      "text": "And so what ended up happening is almost immediately thereafter, about two dozen states started putting in place laws that were designed to suppress the vote of African-Americans, people of color, students, indigenous folks, and so much so that in North Carolina, when the Court of Appeal reviewed what they did, said that that legislature had designed the law with \"surgical precision\" to make it difficult for black voters in North Carolina to vote."
    },
    {
      "text": "So my point here is this: I think it's important to ask a question, which is why are so many powerful people trying to make it difficult for us to vote? Why are they trying to confuse us about voting? Why are they trying to suggest that we can't trust the system? Why are they messing with the Post Office? My God, they're messing with the post office. And one last ask, why are they going through such an effort? And here's what I believe the answer is: they know our power. They know our power."
    },
    {
      "text": "They know when we vote, things change. They know when we vote, we win. And so let's not ever let anyone take our power from us. It is our power to stand in those lines as long as necessary, we will bring our friends with us and have a good old time, but we know our power and we are prepared to exercise the power of our voice that comes with election time through our vote, because we know what is at stake, and we know the shoulders we stand upon that came generations before us, that would expect nothing less."
    },
    {
      "text": "And so my last point is this: years from now, because this moment will have passed, and years from now, our children, our grandchildren and others, they will look at us, they will look in our eyes, each one of us, and they will ask us, \"Where were you at that moment?\" And what we're going to be able to tell them is so much more than just how we felt. We are going to tell them what we did."
    },
    {
      "text": "We're going to tell them we texted, and we called, and we emailed everyone we knew repeatedly until they got sick of us, but we know they would come back to us eventually, but we did whatever was necessary to remind people of what is at stake, to remind them of their power, and to remind them that ours is a country worth fighting for, because we love this country. And so that's what we are going to do Reno. And thank you. Thank you. Thank you. Thank you. Thank you. Thank you."
    }
  ]
}