{
  "speech_id": "101",
  "speaker": "Harris",
  "title": "Kamala Harris Campaign Speech Transcript Tucson, AZ October 28",
  "date": "20201028",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-campaign-speech-transcript-tuscon-az-october-28",
  "topics": "Healthcare",
  "num_segments": 38,
  "content": [
    {
      "text": "Hey everybody. Can we please hear it for Mayor Romero? What an incredible leader. She's a sign of strength and passion, and she represents who we are as a nation. Mayor Romero, thank you for everything you are and everything you do. It's so good to be back in Arizona. You guys are going to make the difference. You will elect the next president and vice president of the United States. You will do that. I want to thank Pima Community College for hosting us."
    },
    {
      "text": "Chancellor Lee Lambert, Demion Clinco, the students, Congressmen Raúl Grijalva. There you are. Congresswoman Ann Kirkpatrick and the great Gabby Giffords and Mark Kelly. Let's get this done Tucson. And so here's the thing, first of all, in the spirit of the late great John McCain, I was thinking, let's start with a little straight talk. Now, there has been some talk about my values. Well, let me just tell you Tucson, I am a proud patriotic American. I love my country. And our values reflect the values of America."
    },
    {
      "text": "Our values tell us we have witnessed the worst, the biggest disaster of any presidential administration in the history of this country. Our values tell us that. Our values tell us that we should not be in a moment where over 225,000 people have died in our country. Over eight and a half million people have contracted a virus. When we got the information, we have known how serious this is. Listen, there is so much at stake in this election."
    },
    {
      "text": "And I'm just going to start by talking about a few of the things that we know. We as a nation are in the middle of four crises happening at once. We're in the midst of a pandemic, a public health pandemic that, like I said, has caused over 225,000 Americans to die. People who many of whom died without any family members being able to be with them, to hold their hand, to look in their eyes because of the nature of this virus."
    },
    {
      "text": "Over eight and a half million Americans who now have a preexisting condition and untold longterm health consequences because of this virus. And the tragedy of it is this, it didn't have to be this bad. It literally did not have to be this bad. Thanks to a fellow by the name of Bob Woodward, we know that on January 28th, Donald Trump was informed about the seriousness of this pandemic. He was told it will kill people. He was told it is five times more deadly than the flu."
    },
    {
      "text": "He was told it would hurt people of every age. He was told it was airborne. And he sat on that information. He did not tell you. Can you imagine, as a parent, as a small business owner, as a working person, if on January 28th you would have known what the president had known, what you might've been able to do to plan, to prepare. Knowing that even before this pandemic, it's too many Americans working two and three jobs to pay the rent and put food on the table."
    },
    {
      "text": "Knowing that even before this pandemic, most Americans didn't have more than $1000 life savings, what people might've been able to do to prepare. What you might've been able to do to prepare your children for the fact they may not be able to go back to school. What you might've been able to do if you run a small business to put in place provisions for the fact that you might be out of business for months. What you might've been able to do to buy some extra toilet paper."
    },
    {
      "text": "The American people were lied to by the president of the United States. And let's be clear about something, the president of the United States is also the commander in chief, who has then as his highest responsibility to concern himself with the health and safety of the American people. And on that count, Donald Trump failed. He failed us. He failed the American people. And here's the thing, Tucson you know this, there is a very clear choice in this election on this matter."
    },
    {
      "text": "Because you see, on the one hand you have a Joe Biden who is saying that we know access to healthcare should be a right and not just a privilege of those who can afford it. Joe Biden, who together with President Obama was responsible for creating the Affordable Care Act that brought health care to over 20 million people who didn't have it. Who said, \"We will protect people with pre-existing conditions. Honk if you know anybody with diabetes."
    },
    {
      "text": "Honk if you know anybody with high blood pressure.\" Honk if you know anyone with breast cancer. Joe said, \"We will protect you. And the people you love.\" Joe says, \"If we win, we're going to get in there and expand coverage. We're going to bring down eligibility age from Medicare to age 60."
    },
    {
      "text": "We're going to reduce the cost of prescription drugs and premiums.\" Joe says that we understand when we're talking about healthcare, you got to know the body doesn't just start from the neck down it also requires healthcare from the neck up. So on the one hand you have Joe Biden, the choice before voters in six days."
    },
    {
      "text": "On the other hand, you have Donald Trump who together with his boy, Bill BARR are in the United States Supreme Court right now suing to get rid of the Affordable Care Act in the midst of a pandemic that has killed hundreds of thousands of people over just the last several months. If they have their way, over 20 million people will lose coverage and the benefits for people with pre-existing conditions will be over."
    },
    {
      "text": "Let's understand part of what the Affordable Care Act did is it said for women, free mammograms, for all people, free health screenings for cancer, and they want to get rid of that. There's a very clear choice in this election, not to mention what they did to just ram through a Supreme Court justice because of their agenda to get rid of the Affordable Care Act. I voted no. It was an illegitimate process. And here's the thing about where Donald Trump has been on the Affordable Care Act."
    },
    {
      "text": "I just have to say Raúl, we've been witnessing the same thing. From the time Donald Trump was running for office through the time he's been in office, he's had this weird obsession with trying to get rid of whatever Barack Obama and Joe Biden created. Have you all noticed that? Well, we don't need presidents with weird obsessions. I think it's time for that end. Do you agree? We're in the midst of an economic crisis that is being compared to the Great Depression."
    },
    {
      "text": "Here in Arizona, one in 10 households are describing their family members as being hungry. We're in the midst of a hunger crisis in America. People aren't covering that enough. I've seen numbers, one in five mothers is describing her children under the age of 12 as being hungry. Here in Arizona, one in seven households is having a difficult time paying rent or were unable to pay rent last month. Here in Arizona, one in four businesses has gone out of business."
    },
    {
      "text": "And on the one hand, you have Joe Biden who says, \"You want to talk to me about how the economy is doing, well, then you need to tell me how are working people doing? How are working families doing?\" Joe Biden who says, \"You want to deal with the economy, then one, we will not raise taxes on anyone making less than $400,000 a year. We will also cut taxes for middle-class working people. We will make sure that no working family pays more than 7% of their income in childcare."
    },
    {
      "text": "Donald Trump, when asked about how's the economy doing, Donald Trump asked, \"Well, how's the stock market doing?\" Donald Trump asked, \"How are rich people doing?\" Donald Trump as his first order of business passed a tax bill benefiting the top 1% and the biggest corporations of America creating a $2 trillion deficit for all of us. Well, let me tell you something, when Joe and I are elected, we're about to get rid of that and invest that money in you, the American people."
    },
    {
      "text": "We will put that money in an infrastructure plan that is about the creation of millions of jobs. We will put that money into an investment in renewable energy and what we know that will do that will not only save our planet, but create jobs. We will put that money to relieve student loan debt for any kid who is coming from a family who makes less than $125,000 and ensure they go to a four year college for free. That's what Joe and I will do."
    },
    {
      "text": "We're in the midst of a crisis, which is the long overdue reckoning on racial injustice in America. On that note, Joe Biden knows Americans' history. He knows our history as a country and he has the courage to speak truth about it. Joe Biden has the ability to say black lives matter. Donald Trump will never speak those words. Joe Biden knows that we need to look at racial disparities in America."
    },
    {
      "text": "Joe Biden says, \"Pay attention to this and understand a real leader will address the truth and speak the truth in a way that is about promoting equality and equity.\" On the other hand, you have a Donald Trump who was on that debate stage at the first debate and refused to condemn white supremacists. And then doubled down saying, \"Stand back and stand by.\" Donald Trump who has shown a pattern from the first days he was running and questioned the legitimacy of America's first black president."
    },
    {
      "text": "Donald Trump, who when peaceful protesters were protesting racial injustice in Charlottesville where a young woman was killed. And on the other side, there were neo-Nazis wearing swastikas and carrying Tiki torches, spewing anti-Semitic and racial slurs. Donald Trump said, \"There are fine people on each side.\" He came into office talking about Mexicans as rapists and criminals. His first order of business was to pass a Muslim ban."
    },
    {
      "text": "There is a real choice in this election because you see Joe Biden and I understand America deserves so much more. We want a leader who is not about trying to sow hate and division. We know that the real strength of any human being is not based on who you beat down, it is based on who you lift up. And that's the kind of leader Joe is. The crises we are facing, and I don't have to tell Arizona, this includes a climate crisis. The West Coast has been burning. These wildfires. I've gone back."
    },
    {
      "text": "As you know, I'm from California. I've gone back. I have visited with families that have been evacuated, with firefighters who are fighting fires while their own homes are burning. My brother-in-law's a firefighter. I have seen the damage and destruction in our Gulf Coast states because of the storms that have wiped out entire communities. In the Midwest, farmers have lost whole seasons of crops because of the floods. Joe Biden says, \"Let's deal with this. Let's face fact. Let's embrace science."
    },
    {
      "text": "Let us do it with a sense of urgency and also understand we need to set time limits. Net zero emissions by 2050. We need to set goals that include in investment in renewable energies.\" And guess what that's about jobs, millions of jobs. On the other hand, you've got a Donald Trump who when asked about the wildfires, there was a reporter who asked him something like, scientists are telling us, science is telling us that there's a connection between these extreme weather conditions and those wildfires."
    },
    {
      "text": "Will you address that? And the president of the United States in his utter eloquence says, \"Science doesn't know.\" The president of the United States referred to sciences as a person. We need a president who embraces fact and speaks the truth to the American people and deals with what is one of the greatest threats to us as a species. So these are the threats and these are the crises that we are dealing with right now. These are just some of them."
    },
    {
      "text": "And it brings me to happening right now across America, a process that will end in six days and that's this election. And what we know is that everything, everything is in each of our hands, in terms of the power we possess through our vote and our action to determine who will be the next president of the United States. And people ask, they say, \"Well, does it matter if I vote? Why should I vote?\" And I'll tell you Tucson, I mentioned three things in response to that question."
    },
    {
      "text": "One, it's important to vote to honor the ancestors. All those people who fought, who marched for our right to vote. We just, this year, lost the great John Lewis, a great American who shed his blood on the Edmund Pettus Bridge together with so many others. John Lewis, who was such a fighter for civil rights, he understood the ongoing fight for civil rights."
    },
    {
      "text": "Not only did he shed blood fighting for African-Americans to vote in the South and around our country, it was John Lewis who was always at the front of the line saying, \"And the civil rights fight is a fight for marriage equality. The civil rights fight is a fight for immigrant rights. The civil rights fight is for equity and fairness.\" So it's about honoring the ancestors. Those who sacrificed so much."
    },
    {
      "text": "It's honoring the ancestors, knowing that we, this year, celebrated the passage of the 19th Amendment which gave women the right to vote. Right? And honoring those suffragettes who in their white were marching and fighting and saying, \"We will not be deterred. We will not be silenced.\" So honoring the ancestors. Reason number two, everything is at stake. Everything is at stake. You go down the list, everything that impacts you and your family and your neighborhood and your community and our country."
    },
    {
      "text": "From healthcare to if we're going to support working families and working people, understanding that it is that kind of approach that has built the middle class of America and made us strong when we've been strong. Everything is at stake. Whether we are going to have a country that embraces the fact that we are a nation built in large part by immigrants and we must create a pathway to citizenship and honor America's promise to our dreamers and renew DACA. Everything is at stake."
    },
    {
      "text": "Whether we're going to embrace science and deal with this change in climate. Whether we care about our standing in the world and whether we understand that the commander in chief of the United States of America should never take the word of a foreign dictator over the word of the American intelligence community. Everything is at stake. So we vote to honor the ancestors. We vote because we know everything is at stake, so much is at stake."
    },
    {
      "text": "And then here's the third reason, I think, that it is important for folks to vote. And it is this. So I've been traveling all over. I've been in Florida and Michigan and Ohio and Georgia and North Carolina. I was in Nevada yesterday. I'm here in Arizona today. I'm going to head to Texas. Been all over. And here's the thing. We have a long history of powerful folks trying to make it difficult for other folks to vote."
    },
    {
      "text": "And then in 2013, of course, the Supreme Court gutted the Voting Rights Act and right after that, there were a couple of dozen states that put in place laws that made it difficult. Laws that were purging the voter rolls. And we have people in powerful positions now, including the president of United States at that first debate who took the stage in front of 70 million Americans and openly encouraged suppression of the vote. People who are trying to make it confusing."
    },
    {
      "text": "You got to fill out this envelope and put it in that envelope. Places where you got to have then a perfect stranger signed or somebody else sign your envelope. Places in our country that are pulling away drop boxes to make it difficult or shutting down polling sites. And we have to ask, why are so many powerful people trying to make it difficult for us to vote? Why are they trying to confuse us? Why is the president messing with the post office? And here's the answer, because they know our power."
    },
    {
      "text": "They know our power. They know when we vote, things change. They know when we vote, we win. And so let's not ever let anyone take our power from us. Ours is the power to use our voices. And at election time, that means our vote. And let's not let anyone take it from us. Because here's the thing, our democracy is always going to be as strong as our willingness to fight for it. And so that is what we will do. And that means every one of us voting, talking to our friends, letting them know what's at stake."
    },
    {
      "text": "And then Tucson, my final point is this, this moment will pass. This moment will pass. And years from now, our children, our grandchildren, others, they will ask us, \"Where were you at that moment?\" They'll look at us in our eyes, where were you at that moment? They'll ask us. And what we will tell them is so much more than just how we felt. What we are going to tell them is what we did. What we did. We are going to tell them how we were hanging out this one afternoon at Pima Community College."
    },
    {
      "text": "We are going to tell them that we organized folks, that we let our neighbors and our friends and our coworkers and our family know what's at stake. We reminded them of the sacrifices of the ancestors. We told them about their power. We said, \"Yes. We have been in a pandemic where there's a bit of isolation going on, but you are not alone.\" We reminded them, you are not alone. You reminded them, don't let anyone ever make you feel small. Know your power. That is what we will tell them we did."
    },
    {
      "text": "We will tell them, we knew we were a community. We knew that the strength of our nation is based on our unity. We will tell them, we fought knowing that we all, regardless of where we live, our race, our gender, our age, the language our grandmother speaks. We will tell them that we knew we have so much more in common than what separates us and we would not let anyone divide us as a nation. We would not let anyone break our confidence and our strength and our humanity and our commitment to our democracy."
    }
  ]
}