{
  "speech_id": "102",
  "title": "Kamala Harris Campaign Event Speech Transcript Houston, TX October 30",
  "date": "20201030",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-campaign-event-speech-transcript-houston-tx-october-30",
  "topics": "Economy, Social Justice, Government Policy",
  "num_segments": 46,
  "content": [
    {
      "text": "I got to tell you one last thing before I give up the microphone. Somebody asked me if their vote counted. If your vote didn't count, they wouldn't be working so damn hard to suppress it. They know your vote counts. Do not let them silence us. We are more powerful than the powerful few that are trying to maintain power, trying to profit, trying to exploit. We're more powerful than them because there's more of us than there are of them, and when we stand together, there is nothing we can't do. So stand with me."
    },
    {
      "text": "Stand with Senator Harris and future President Biden, because we're asking you for a job. And in return, if you hire us for these jobs, we're going to turn right back around and build back our economy and bring jobs to your community. And we'll work together to heal this nation. Thank you so much. Y'all stay safe, and please don't let up. Let's maintain this momentum. Let's kick some serious tail, and we are going to have so much to celebrate on November 4th, y'all. Thank you so much. [inaudible :16] Harris County."
    },
    {
      "text": "Oh, oh, it's so good to be back in Houston. It's so good to be back in Harris County. Oh, it's so good. There's so many long, long-standing friends, so many long-standing friends who are here and I cannot thank you for what you are doing to hold it down, to hold it up and to elect Joe Biden the next president of the United States. And that's what we're about to do. And that's what you are about to do. And I'm here in Texas, been here all day today to thank you."
    },
    {
      "text": "To thank you, Houston, for all that you have been doing over these months, over these weeks, over these days. Today, of course, is the last day of early voting. And now we are four days away from the election that is going to change the course of our history. And we can't do it without you. We cannot do it without you. And of course, there is so much at stake, but before I continue, I want to thank Tina Knowles for that incredible introduction. Tina, you are amazing. You are amazing."
    },
    {
      "text": "You always have the courage to step up and speak out and lead, and I cannot thank you enough for that. So, here we are. And within our power and in our hands, through our voice, that will be reflected in our vote, we have the ability to make a statement about who we are as a country knowing we are better than what we've been seeing and that we who love our country are willing to fight for it and fight for its ideals. That's what's before us. And you know, we've been going through a lot."
    },
    {
      "text": "There are at least four crises that are impacting us right now as a country, all converging at the same time. We are in the midst of a public health crisis, a pandemic brought about by this virus, COVID-19, where we are looking at a public health crisis to the point that over 220,000 people lost their lives in just the last several months, many of whom tragically couldn't even be with relatives and friends holding their hand, speaking to them in person in their last hours on earth."
    },
    {
      "text": "Nine million people who have been infected by this virus, who are going to have by most doctors' accounts long term health conditions that include potentially things like lung scarring. This is Houston, one of the greatest mass casualty events we have ever experienced in our country, probably only at the same proportion as World War II. And we have witnessed the greatest failure of any presidential administration in the history of the United States. And, here's the thing about this."
    },
    {
      "text": "Thanks to a fellow by the name of Bob Woodward, we know that back on January 28th, Donald Trump was informed about what this is and what it would be. He was informed that it is a deadly virus five times more deadly than the flu. He was informed that it would hurt people of every age. He was informed that it was airborne. And what did he do with that information? He sat on it, he covered it up. He did not share it with the American people."
    },
    {
      "text": "And can you imagine what you might have done as a parent, as a teacher, as a small business owner, if you had known on January 28th what he knew on January 28th, what you might've done to prepare, what you might've done to limit the harm? You know, because even before this pandemic, let's all be clear. On this issue, we know that folks weren't doing so well before. We know that before this pandemic, far too many Americans had to work two and three jobs to pay the rent and put food on the table."
    },
    {
      "text": "And by the way, in Joe Biden's America, you should never have to work more than one job to pay the rent and put food on the table. And even before this pandemic, we knew that far too many American families had less than a thousand dollars in savings. What they might've done to prepare, what teachers might've done to prepare their students so many of our children in this country are now missing substantial and critical phases of their education."
    },
    {
      "text": "What folks might've done to prepare to frankly to buy a couple of extra rolls of toilet paper? But, we didn't have the information. He covered it up. He called it a hoax. He said you're on one side of his ledger if you wear a mask, you're on the other side of his ledger if you don't."
    },
    {
      "text": "And on top of all of this, in the midst of a public health pandemic, the president of the United States with his boy, Bill Barr are in the United States Supreme Court suing to get rid of Obamacare, the Affordable Care Act brought to us by President Obama and Vice President Biden, that brought healthcare to over 20 million people who didn't have it and covered people with pre-existing conditions. Raise your hand if you know somebody with diabetes. Raise your hand if you love someone with high blood pressure."
    },
    {
      "text": "Raise your hand if your relative has lupus. Raise your hand if you know somebody who has breast cancer and is surviving. Raise your hand if you know somebody who got COVID. And the man's in court trying to get rid of the protection for people with pre-existing conditions here in Texas, 10 million people have preexisting conditions. So, there is a real choice in this election, on this point. Because you see, on the other hand, you have Joe Biden, who is saying we need to expand Obamacare."
    },
    {
      "text": "We need to expand the protections for folks with pre-existing conditions. We need to bring down the cost of prescription drugs. We will lower the cost of premiums. We will bring down the age of Medicare eligibility to 60. We understand that when you're talking about healthcare, let's be clear. The body doesn't just start from the neck down. It also includes the neck up and we need to deal with mental health care in America. Joe understands these issues. There's a clear choice in this election."
    },
    {
      "text": "We are dealing with an economic crisis, of a proportion that parallels the Great Depression. Over 30 million people in the last several months had to file for unemployment. One in five mothers is describing her children under the age of 12 as being hungry in America. We are in the midst of a hunger crisis. People aren't talking enough about that. Here in Texas, 1 in 10 households is describing members of their family as having been hungry. One in six households is describing an inability to pay the rent."
    },
    {
      "text": "Here in Texas, one in four small businesses is describing having to shut down with concerns they will never be able to reopen. And then on the one hand, you have a Joe Biden who says on the issue of the economy, if you want to know about how I think the economy is doing, then tell me how working people are doing, how are working families doing. Joe Biden says let's get $150 billion in low interest loans and access to capital to our small businesses with an emphasis on minority owned businesses."
    },
    {
      "text": "Joe Biden says we will not raise taxes on anyone that makes less than $400,000 a year and we will cut middle class taxes. Joe Biden says you're a first time homeowner, you will get a home, first time home buyer, you will get a $15,000 tax credit with downpayment and closing cost because we know home ownership is one of the greatest ways that any American family accumulates wealth."
    },
    {
      "text": "Joe Biden says if you are a student that wants to go to college coming from a family that makes less than $125,000 a year, you will go to a four year public college for free including an HBCU and a private HBCU. On the other hand, you have Donald Trump who when asked about the economy asks, well, how are rich people doing? How is the stock market doing?"
    },
    {
      "text": "To the point that one of his first and in his mind signature initiatives was to create a tax cut for the top 1% and the biggest corporations in America, which is going to cause us to have to deal with the $2 trillion deficit. Well, I'm going to tell you something. If we win this election, Joe Biden and I are about to get rid of that tax cut and invest that money in working families. We're about to put that money into an investment in infrastructure so we can build back up our roads and bridges."
    },
    {
      "text": "We're about to say that no family, working families should pay more than 7% of your income and childcare. We are about to say and put in place a commitment to support working families knowing that if you want to talk about growing back up America's economy invest in workers, invest in families and all of us will benefit. We are in the midst of many crises. We are in the midst of a long overdue reckoning on racial injustice in America."
    },
    {
      "text": "And on the one hand, you have Joe Biden who being a student of America's history has the courage to speak the phrase black lives matter. George Floyd's family is here tonight. George Floyd's life mattered, those eight minutes and 46 seconds. So, Joe has the ability to understand that there is a long overdue reckoning taking place. Joe Biden says we need to deal with this."
    },
    {
      "text": "We need to deal with racial disparities in terms of the healthcare system, knowing that African-Americans and Latinos are three times as likely to contract COVID and twice as likely to die from it. Knowing that black women are three to four times more likely to die in connection with childbirth than other people. Knowing that our native American brothers and sisters had the highest rate of diabetes of any population in our country. Joe Biden says we need to deal with these issues."
    },
    {
      "text": "We need to reform the criminal justice system, decriminalize marijuana and expunge the records of the people who have been convicted. We need to shut down private prisons. We need to end cash bail because, by the way, it is an economic justice issue as much as it is a criminal justice issue. Joe Biden says we've got to reform policing to the point that we all agree everyone should face accountability and consequences if they break the law."
    },
    {
      "text": "And so Joe says we will have a system that bans chokeholds and carotid holds because George Floyd might be alive today if that were the case. We will have a national registry of police officers who break the law. Why? Because it's not right that somebody can get fired one place for doing the wrong thing and move somewhere else and get hired. Joe has the courage to speak truth about this."
    },
    {
      "text": "On the other hand, you have Donald Trump who stood on a stage in front of 70 million American people at a debate- In front of 70 million American people at a debate and refuse to condemn white supremacists and then double down and said, \"Stand back and standby.\" And here's the thing, Houston, it's a pattern. Let's not forget, he came to fame as a candidate for president by questioning the legitimacy of America's first black president."
    },
    {
      "text": "Let's not forget that at Charlottesville, where there were peaceful protestors, protesting racial injustice in America, where a young woman died. And on the other side, there were neo-Nazis wearing swastikas, carrying Tiki torches, spewing racist and antisemitic slurs. And when the President of the United States was asked about it, he said, \"There were fine people on both sides.\" A president who called Mexicans rapists and criminals."
    },
    {
      "text": "A president who came into office and as one of his first orders of business put in place a Muslim ban. We are better than this. We are better than this, and we deserve better than this. We need a president who reflects who we really are. A president who understands within the beautiful diversity of who we are, wherever you live, whatever your race, whatever language a grandmother speaks."
    },
    {
      "text": "That we need a president who sees that we all have so much more in common than what separates us and ends this continuous thing that's about trying to sow hate and division. We need a Joe Biden who wants to come in and unify us as a nation. And then when we look at the crises, there is the crisis of this climate crisis, right. Now, Texas knows what I'm talking about. Y'all know I come from California. The West has been burning from California with these wildfires to Oregon, to Washington, Colorado."
    },
    {
      "text": "I've met with families who've been evacuated because their homes have burned to the ground. I've met with firefighters who are fighting fires while their own home is burning. In fact, my brother-in-law's a firefighter. You look at what's happening, the neighbors to Texas and the Gulf States. We are now on the fifth named storm this year, hitting the Gulf States. You know why you name a storm, cause it's really bad. So now this one is Zeta. With all due respect to my Zeta sisters. There you go. But it's a crisis."
    },
    {
      "text": "What is we're dealing with in the Midwest? The storms have caused flooding to the point that farmers have lost a whole season of crops. And so Joe understands this, and Joe says, \"Hey, we need to embrace the science.\" Let's deal with this, let's deal with the fact it literally represents an existential threat to who we are as a species. Joe knows that if you deal with this in terms of investment in renewable energies and investment in the technologies that are about solar and wind power."
    },
    {
      "text": "Texas is one of the leaders. That you also invest in jobs, millions of jobs, good paying jobs. Jobs that will be the function of the training programs, from the building trades, from the carpenters and the electricians. Joe knows that. Joe has the courage to say the clock is ticking on this and we need to approach this with a sense of urgency. Joe knows that this is also an environmental justice issue, which is a civil rights issue, which is a human rights issue."
    },
    {
      "text": "When you look at the fact that of all areas in our country with poor air quality, 70% of the occupants in those areas are people of color. Joe knows. And we've met with the folks in Flint. Joe understands the seriousness of this crisis. On the other hand, you have Donald Trump. Who, when interviewed by a journalist about what was going on with the wildfires in California."
    },
    {
      "text": "So the journalist asked him something like, \"You know, these wildfires are raging and the scientists are saying this thing and that thing about just the human behaviors are contributing to these extreme weather conditions. What do you have to say?\" The President of the United States, who is also the Commander in Chief, responds to the question by saying, \"Science doesn't know.\" He's the president of the United States. Well, science does know Mr."
    },
    {
      "text": "President and science knows so much that the leading science publication has in the worst job for President of the United States. So there you go. And these are just a few of the challenges that we are facing as a nation. And that brings me to this moment, which is the last day here in Texas for early voting. And now getting prepared for in four days, the election on Tuesday, November 3rd."
    },
    {
      "text": "And you know, people have been asking me like they ask all of us, because I'm sure they've been asking you cause you are leaders among this. And so the people probably come up to you and saying, \"Well, why should I vote? Why should I vote?\" I think there are three reasons that people should vote. One is to honor the ancestors. Let's honor the ancestors. This year we lost the great John Lewis, who is now among the ancestors."
    },
    {
      "text": "Who, while a hero on this earth, shed blood on that Edmund Pettus bridge for our right to vote. Let's honor the ancestors. Let's honor the fact that we just celebrated the 100th anniversary of the 19th amendment. And all those suffragettes in their white just marching, marching, and shouting for a woman's right to vote. And then, you know, let's always be accurate about history, black women couldn't vote until 1965. But it's time, and we can now. I heard that. So let's honor the ancestors, reason one to vote."
    },
    {
      "text": "Reason number two, everything is at stake. Everything. You can go down the list we just discussed. You can talk about our public schools. Joe and I are going to triple Title 1 funding, understanding that our children are in these schools with incredible God given talent, but they need the resources to achieve their talent. We are going to put $70 billion into HBCUs because as a proud graduate of an HBCU, I know what they do to contribute to national and international leadership. You know. So much is at stake."
    },
    {
      "text": "It is at stake that right now there are 545 children, who because of the United States government, don't know where their parents are. Because of a child separation policy at the border, which is a human rights offense that was committed by the United States government. What is at stake is creating a pathway to citizenship. Renewing a promise to our Dreamers by renewing DACA protections. Everything is at stake, so that's reason number two to vote. Reason number three. I've been traveling all over the country."
    },
    {
      "text": "I've been in North Carolina and Georgia and Florida. In fact, I'm going to Florida when I leave here. Ohio, you name it. All over our country, and especially after 2013 when the Supreme Court gutted Shelby V Holder, gutted the voting rights act. We've seen States, at least two dozen States, put in place policies and laws that have been designed to suppress the vote in North Carolina."
    },
    {
      "text": "In fact, the court that reviewed their law said it was written with quote \"Surgical precision,\" to make it difficult for black people in North Carolina to vote. Around our country we have seen policies and laws that have been designed to make it hard for folks to vote. You know, here in Texas where they pulled up the drop boxes, and so in Harris County with 11 million people there is one drop box. Are you kidding me in?"
    },
    {
      "text": "In States where if people vote by mail, well you got to fill out the thing, the ballot, and then put it in one envelope, then you got to be sure to put it in the second envelope. And then be sure you sign that envelop or get somebody to sign it for you. The president of the United States on the debate stage, who openly solicited voter suppression. Not to mention they're messing with the post office. I mean the post office. Rodney, Alice, where are you? The post office. The nicest people work for the post office."
    },
    {
      "text": "They're messing with the post office. And so all of this has to lead us to ask the question, why are so many powerful people trying to make it so difficult and confusing for us to vote? And I think we know the answer. The answer is because they know our power. They know our power. They know our power to stand up and exercise our voice through our vote. They know that we know that when we vote things change. They know when we vote we win. So let's not let anyone, not this election or ever, take our power from us."
    },
    {
      "text": "Let's not let anyone make us feel a concern or anxiety about whether we matter. Let's not give anybody that power over us to ever make us question whether we matter. Whether we count. We have the power, we were born with it. They didn't give it to us, it wasn't granted to us. It is ours. So we know what we have to do."
    },
    {
      "text": "We have to get everybody out in four days on November 3rd, that Tuesday, and make sure that especially during this pandemic when people are feeling alone and we've got a social isolate and people are wearing a mask so you can't really see their full face. And you're just feeling like, I don't know, feeling kind of alone. Let's remind people they are not alone, and we are all in this together. And then my final point is this. This moment will pass. This moment will pass."
    },
    {
      "text": "And years from now our children, our grandchildren, others, they will look at us. They will look in our eyes, each one of us, and they will ask us, \"Where were you at that moment in time?\" And what I know we will be able to tell them is so much more than just how we felt at this moment. We will tell them what we did. We will tell them we were hanging out this one Friday evening in Houston with Kamala and all these incredible elected officials. We will tell them we were bopping a little to Common."
    },
    {
      "text": "We will tell them Tina Knowles graced us with her presence. We will tell them that we were organizing folks, that we were telling them what was at stake. We were reminding them of the sacrifice of our ancestors. We will tell them that we called and we texted and we emailed everybody multiple times till they got sick of us, but they got over it. We will tell them we elected Joe Biden the President of United States. Thank you Houston. Thank you."
    }
  ]
}