{
  "speech_id": "103",
  "title": "Kamala Harris Campaign Speech Transcript McAllen, Texas October 30",
  "date": "20201030",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-campaign-speech-transcript-mcallen-texas-october-30",
  "topics": "Economy, Healthcare, Social Justice, Climate",
  "num_segments": 42,
  "content": [
    {
      "text": "... Working two jobs yet receiving no healthcare because private insurance system makes it so we are dependent on the generosity of our employers. How many of those jobs are minimum wage? How many people are earning seven dollars and 25 cents, and despite working full-time cannot afford the cost of living? Joe Biden and Senator Harris know that we need a $15 minimum wage, we need good paying jobs, and we need to create a strong workforce in renewable energy."
    },
    {
      "text": "Now, Senator Kamala Harris is here today and she needs no introduction. But I have to say she is a trailblazer. She has broken countless barriers, and was the first African-American and first woman elected as district attorney in San Francisco and attorney general of California. Then when she went on to be the first woman of color to represent California in the United States Senate."
    },
    {
      "text": "In a town hall for the Democratic primary, Senator Harris said that her mother told her, \"Kamala, you may be the first to do many things, but you need to make sure that you are not the last.\" I have no doubt in my mind that she will be the first woman of color vice president of the United States, and she will pave the way for women to be elected, not only to the vice presidency, but to the highest office in the land."
    },
    {
      "text": "You will soon hear from Kamala Harris, and it is my pleasure to be speaking to y'all and thank you (silence). Texas Democrats get excited for our next vice president, Senator Kamala Harris. [Foreign language :36] Kamala Harris (singing). What's up Rio Grande? It's so good to be with you. It's good to be in the Valley. I am so excited to be here. You are going to make the difference. This election is about you. I am so excited to be here. I want to thank the University of Texas, Rio Grande Valley."
    },
    {
      "text": "President Guy Bailey, Vice President Veronica Gonzales, my dear friend Secretary Julian Castro, Congressman Joaquin Castro, Beto O'Rourke, Henry Cuellar, Vicente Gonzalez, M J Hegar, and Clarissa. I'm so happy to see you, I'm so happy to see you. We're going to do this, we're going to do this, we're going to do this. Because we are fighting for the country we love, and we know we are better than this. There's so much at stake in this election, and today is the last day of early voting in Texas."
    },
    {
      "text": "The last day of early voting in Texas, and then the election is four days away to elect a new president of the United States, and his name is Joe Biden. That's what we're going to do. We know everything is at stake. Right now in our country we're going through four crises, which have hit us all at the same time. We're looking at a public health crisis, this pandemic. Over 220,000 people in just the last several months have lost their lives."
    },
    {
      "text": "Many without family members nearby to hold their hand because of the nature of this. Over almost nine million people who have been afflicted with this virus, who are going to have unknown long-term health consequences. Doctors are talking about lung scarring and things of that nature. People are suffering. Meanwhile, you have the president of the United States who took to a stage and said, \"We're rounding the corner.\" Are you kidding me?"
    },
    {
      "text": "Meanwhile, we have a president of the United States who thanks to Bob Woodward we know knew in January about how serious this is. He knew in January, January 28th, that it was five times more deadly than the flu. He knew on January 28th that it could hurt people of every age. He knew then that it was airborne, and he covered up that information, and he did not tell the American people."
    },
    {
      "text": "Moreover, he had the gall to call it a hoax, to suggest that there are two kinds of people on his ledger, the kind that wear masks and the kind that don't. In a public health crisis- In a public health crisis, with one of the most highly contagious airborne viruses we've ever seen, and can you imagine Rio Grande, what you would have done on January 28th if you had known what the president had known?"
    },
    {
      "text": "What you as a frontline worker, what you as a parent, what you as a teacher, what you as a small business owner, would have done if you had known on January 28th? Because here's the deal. Even before the pandemic, the situation in our country was such that people had to work two and three jobs to pay the rent and put food on the table. And by the way, in Joe Biden's America nobody should have to have more than one job to put food on the table and pay the rent."
    },
    {
      "text": "But imagine what you would've done when we know most American families don't even have $1,000 in life savings, and what people might've done to save up a little bit, knowing that they may not be able to go to work because still, in our country, people go to work without paid sick leave and paid family leave, something Joe Biden and I are going to end, making sure all workers are respected for the dignity of their work, including paid sick leave and paid family leave."
    },
    {
      "text": "Imagine what people would've done knowing our children might miss critical stages, critical amounts of education time. And what people might have done to prepare for that. Not to mention what people might've done to prepare to buy a couple of extra rolls of toilet paper. If we had known what he knew on January 28th."
    },
    {
      "text": "And in the midst of this public health pandemic, where hundreds of thousands of people have died, where nine million people have contracted the virus, Donald Trump and his boy, Bill Barr, are in the United States Supreme Court suing to get rid of the Affordable Care Act that brought health care to over 20 million people, including protecting people with preexisting conditions. Honk if you know anybody who has diabetes. Honk if you know anybody who has high blood pressure. Lupus. Breast cancer."
    },
    {
      "text": "And you see, Barack Obama, together with Vice President Biden, created the Affordable Care Act knowing people with preexisting conditions, including the 10 million Texans who have preexisting conditions, should be protected. But Donald Trump's in court right now trying to get rid of that. And part of the issue that I see, let's remember this, from the time the guy was running for office until now, Donald Trump has had this weird obsession with trying to get rid of whatever Barack Obama and Joe Biden created."
    },
    {
      "text": "Joe Biden, who was saying, \"We will expand health coverage, we will bring down the cost of premiums, we wil bring down the cost of prescription drugs, we will lower Medicare eligibility to age 60, we know that health care means understanding the body doesn't just start from the neck down, it includes the neck up, and that's called mental health care.\" There are clear choices in this election. And on the other hand, you have the current president who's trying to get rid of coverage for over 20 million people."
    },
    {
      "text": "The crises we are dealing with. The crisis from this pandemic that is this economic crisis. Where over 30 million Americans, in just the last several months, had to file for unemployment insurance. Where here in Texas, we're looking at one in ten families that has described their household as being hungry. Where here in Texas, one in six households is finding it difficult, if not impossible, to pay rent."
    },
    {
      "text": "Where here in Texas, one in four small businesses is out of business, and fear they will never be able to reopen. There's a clear choice in this election. Because you see, on the one hand, you have Joe Biden. And when you ask Joe Biden, \"How's the economy doing?\" Joe Biden says, \"Well tell me how working people are doing."
    },
    {
      "text": "Tell me how working families are doing.\" Joe Biden says, \"You want to measure the economy, then let's measure the greatness of the economy based on getting folks paid sick leave, paid family leave. Let's deal with the economy by making sure no working family pays more than 7% of their income in childcare. Let's deal with the economy and not raise taxes for anyone who makes less than $400,000, and bring down taxes for middle class families.\" He says, \"You want to talk about the economy?"
    },
    {
      "text": "Well one of the best ways to grow the economy and any family's economic well-being is home ownership. So we'll have a tax credit, a $15,000 for every new home buyer for down payments and closing costs.\" That's how Joe Biden thinks about the economy. On the other hand you have Donald Trump, who when asked about the economy, asks about the stock market. Asks about how rich people are doing. As one of his first orders of business, passed a tax bill benefiting the top 1%, and the biggest corporations of America."
    },
    {
      "text": "Well Rio Grande, I promise you this, as a first order of business, Joe Biden and I area about to work to get rid of that tax cut. And invest that money in working families. Invest that money on building back up our infrastructure, which means the creation of millions of jobs, building back up our infrastructure around roads, and bridges, and renewable energy."
    },
    {
      "text": "Investing in working people, and small businesses, with a focus on 150 billion dollars in low interest loans and access to capital for minority owned businesses. That's how we will deal with this. That's how we will invest our resources. There are clear contrasts, and a clear choice in this race. Let's deal with the long overdue reckoning on racial injustice in America. So, on the one hand, you have Joe Biden, who is a student of American history, and has the courage to say black lives matter."
    },
    {
      "text": "Joe Biden, who says, \"Any real leader m- Joe Biden who says any real leader must speak truth, no matter how difficult it may be to hear. Any real leader must acknowledge the racial disparities that exist in America and deal with them, deal with what we need to handle in our public healthcare system when African-Americans and Latinos are three times likely to contract COVID and twice as likely to die from it. Deal with it when we know Latinos have some of the highest rates of diabetes of any population."
    },
    {
      "text": "Highest rates of high blood pressure of any population and we need to deal with that. Let's deal with the disparities in terms of our public education system and put resources into Title One schools, knowing that is where our children who have such God given capacity, deserve to have the resources, to allow them to grow and develop and that is why we will triple Title One funding."
    },
    {
      "text": "Getting rid of mandatory minimums, decriminalizing marijuana, expunging the records of people who have been convicted of marijuana, shutting down private prisons, eliminating cash bail because that is an economic justice issue as much as it is a criminal justice issue. And on the other hand, you have Donald Trump, who at the first debate, you guys remember this. At the first debate, refused to condemn white supremacists and then doubled down by saying stand back and stand by."
    },
    {
      "text": "And remember this wasn't a one-off. We've seen a pattern. Let's go back to the fact that he ran, trying to suggest that the first black president of the United States was not a legitimate president of the United States. Let's remember on the issue of Charlottesville, where people were peacefully, protesting racial injustice."
    },
    {
      "text": "A young woman was killed and on the other side, there were Neo Nazis wearing swastikas, carrying Tiki torches, hurling racial epithets, anti-Semitic epithets and the president of the United States said, there are fine people on each side. The president of the United States who called Mexicans rapists and criminals. The president of the United States, who has his first order of business put in place a Muslim ban. We deserve better than this and Joe Biden in his heart, knows who we really are as America."
    },
    {
      "text": "Joe Biden in his heart, knows that regardless of where you live, your race, your gender, your age, the language your grandmother speaks, Joe Biden knows that the vast majority of us have so much more in common than what separates us and it is time that we reject hate and division and unify as a country. There are clear choices. Let's deal with an issue Texas knows well. The issue of the climate crisis. Speaker 1: () Kamala. Kamala. So Texas knows, we're dealing with a climate crisis as a world."
    },
    {
      "text": "We're looking on the West Coast, you know where I'm from, we're looking at wildfires from California to Washington, over to Colorado. Whole communities of people being burned out of their homes. I've met people who've been evacuated from their homes, never to be able to return. I've met with firefighters who were fighting fires while their own homes were burning. My brother-in- law's a firefighter. We look at the Gulf States, neighbors to Texas. There've been five named storms this year alone."
    },
    {
      "text": "They name a storm because it's that bad; five. The most recent one being Zeta. We're looking at what's been happening in the Midwest; farmers losing a whole season of crops because of the floods. Joe Biden says, we need to embrace science. We need to speak truth. We need to deal with this with timelines and a sense of urgency because we need to be able to breathe clean air and drink clean water, and see the connection between human behaviors and the crisis we are facing."
    },
    {
      "text": "Joe knows this is not only about what we need to do for our environment, the opportunity in the moment is we can also create jobs. We can invest in infrastructure, in renewable energies, in solar and wind, and that will be millions of jobs. Joe also knows this is an environmental justice issue. When you're looking at the fact that in all of the areas in the country that have poor air quality, 70% of the people who live in those places are people of color."
    },
    {
      "text": "Joe knows that and he understands how we can build back better in a way that we deal with the science. We build up an infrastructure where we'll create millions of jobs and we do it in a way that is about equitable outcomes and we build back better. On the other hand, you have Donald Trump. Okay. So here's the thing."
    },
    {
      "text": "On the issue of the wildfire, as he was interviewed and the journalist said something like, these wildfires are happening in California and the scientists are saying that there's a connection between the extreme weather and the fires. And the president of the United States, the commander-in-chief, responded, science doesn't know. Can you imagine? And so science is a person."
    },
    {
      "text": "Literally rejecting the notion that we have so much evidence that is undisputed about what is upon us and the opportunity we have at the moment. So Rio Grande, I say all this to say, there's a lot that we need to deal with and these are many of the issues that are at play in this election and Texas has been turning it out. You guys have been turning it out and you have been turning it out. You have been standing in line. You've been organizing. You are making a huge difference. And so here's the thing on voting."
    },
    {
      "text": "You know, I think there are three reasons that people need to vote. You know, when people ask, why should I vote? Why is it important? There are three reasons. I think. One, it's important to vote. One, it's important to vote to honor the ancestors. Honor, the ancestors, all those people who came before us who fought for our right to vote."
    },
    {
      "text": "People like John Lewis, the Congressman who passed away this year, who said, \"Let's get in good trouble.\" John Lewis, who shed his blood on the Edmund Pettus Bridge for our right to vote. John Lewis, who knew this was a matter of civil rights and dignity. John Lewis, who understood that it was also a matter of civil rights and dignity to fight for same-sex marriage. John Lewis, who also knew it was a matter of civil rights and dignity to fight for protections for DREAMers and for a pathway for citizenship."
    },
    {
      "text": "So, it's important to vote to honor the ancestors. This year, we celebrated the 19th amendment which allowed women to vote. We celebrated the 100th anniversary of the 19th amendment. All those suffragettes who, a hundred years ago, marched and fought for our right to vote. Now, it's important to remember history, because it wasn't until 1965 that black women could vote, so we still have work to do, but it is time to vote to honor the ancestors, that's reason number one. Reason number two, everything is at stake."
    },
    {
      "text": "Everything is at stake. When this administration has orphaned 545 children because of a policy that has been about separating children from their parents at the border, everything is at stake. When we are looking at the fact that 200,000 of our frontline workers have been DREAMers who were promised DACA protection, everything is at stake. Everything is at stake when we need to create a pathway towards citizenship. Everything is at stake when we talk about equal pay for equal work for women."
    },
    {
      "text": "Everything is at stake. So, that's reason number two. And then, here's reason number three. So, I've been traveling the country, and I'll tell you, just like here in Texas, there are powerful people around our country that have been making it really difficult for people to vote. They've been passing laws. In North Carolina, they passed a law that the court that reviewed the law said it was written with surgical precision to prevent black people in North Carolina from voting."
    },
    {
      "text": "We have seen this around the country where laws have been put in place to make it difficult for people of color, for students, for our Native American brothers and sisters to vote, laws like here in Texas, where they're taking the drop boxes, where in other places where they're shutting down polling sites, where they're requiring people to fill out two different envelopes if their mail-in ballot is going to count."
    },
    {
      "text": "The president who took the debate stage, and in front of 70 million Americans, openly solicited a suppression of the vote. So, we have to ask why are so many powerful people trying to make it so difficult and confusing for us to vote? Why are they, for example, messing with the post office. I mean, the post office, the nicest people work for the post office. Why are they doing this? And, I believe it is because they know our power."
    },
    {
      "text": "They know our power and we know our power, and we will not let anyone take our power from us. And, that is the reason, that is the reason that we are all here today, to celebrate each other and to fight for this country we love. And so, my last point is this, this moment, this moment will pass. It will pass."
    },
    {
      "text": "And one day in the future, our children, our grandchildren, others, they will look in our eyes, each one of us, they're going to look in our eyes and they will ask us, \"Where were you at that moment?\" And what we are going to tell them, as we were hanging out at UT Rio Grande Valley this Friday afternoon, on the last day of early voting, we will tell them we organized. We will tell them we brought people to vote. We will tell them we told them about what is at stake."
    }
  ]
}