{
  "speech_id": "105",
  "speaker": "Harris",
  "title": "Vice President Kamala Harris: The 2023 60 Minutes Interview Transcript",
  "date": "20231030",
  "url": "https://www.rev.com/blog/transcripts/vice-president-kamala-harris-the-2023-60-minutes-interview-transcript",
  "topics": "Foreign Policy, Gun Control, Climate, Education",
  "num_segments": 9,
  "content": [
    {
      "text": "We have absolutely no intention, nor do we have any plans to send combat troops into Israel or Gaza. Speaker 1 A terrorist organization, Hamas, slaughtered hundreds of young people at a concert. By most estimates, at least 1400 Israelis are dead. Israel, without any question, has a right to defend itself. That being said, it is very important that there be no conflation between Hamas and the Palestinians."
    },
    {
      "text": "The Palestinians deserve equal measures of safety and security, self-determination and dignity, and we have been very clear that the rules of war must be adhered to, and that there be humanitarian aid that flows. Speaker 1 Don't. Speaker 1 Exactly. One word. Pretty straightforward. Speaker 1 I do. Speaker 1 I do. And I take that responsibility quite seriously. Speaker 1 Multiple times a day, quite often, unless he or I are traveling."
    },
    {
      "text": "Speaker 1 We are as committed to Ukraine as we've always been, to authorize additional aid to defend itself against Russia's unprovoked aggression That is not going to waver. Speaker 1 Not for us. No. It does not put them on a back burner at all. Speaker 1 How dare they attack our fundamental rights? How dare they attack our freedom? Speaker 1 Our nation is being torn apart by gun violence. Speaker 1 Welcome onboard. Speaker 1 Welcome onboard."
    },
    {
      "text": "Speaker 1 Because you voted, Joe Biden is president of the United States, and I am vice president of being, because you voted. Speaker 1 If you poll how young people feel about the climate and the warming of our planet, it polls as one of their top concerns. When we talk about what we are doing with student loan debt, polls very high. The challenge that we have as an administration is we got to let people know who brung it to them. That's our challenge."
    },
    {
      "text": "But it is not that The work we are doing is not very, very popular with a lot of people. Speaker 1 We've done some of the most significant gun safety laws in 30 years, but we still need an assault weapons ban. It doesn't have to be this way. There was assault weapons ban at one time. It expired. Let's renew it. Speaker 1 It's no secret that we have a broken immigration system. Short term, we need a safe, orderly, and humane border policy. And long term, we need to invest in the root causes of migration."
    },
    {
      "text": "But the bottom line, Congress needs to act. Come on, participate in the solution instead of political gamesmanship. Speaker 1 So help me God. Speaker 1 No doubt. No doubt. My mother, she would say, \"Kamala, you may be the first to do many things. Make sure you're not the last.\" And among the responsibilities that I carry and maybe impose on myself, that is one of them. () So this was- Speaker 1 I brought in this bust of Thurgood Marshall, and I always have him over my right shoulder in the drawer here."
    },
    {
      "text": "Speaker 1 Al Gore, Quayle, Cheney, Harry Truman. Speaker 1 Well, first of all, I'm not going to engage in that hypothetical because Joe Biden is very much alive and running for reelection. So there we are. Speaker 1 I hear from a lot of different people, a lot of different things. But let me just tell you, I'm focused on the job. I truly am. Our democracy is on the line, Bill. And I frankly, in my head, do not have time for parlor games when we have a president who is running for reelection. That's it. () Joe Biden."
    },
    {
      "text": "Speaker 1 We came into office during the height of a pandemic, record unemployment. And because of our economic policies, we now are reducing inflation. We have created over 14 million new jobs. We've created over 800,000 new manufacturing jobs. Wages are up. And so we've seen great progress. Speaker 1 I've lost count. Speaker 1 Well, I'm not a political pundit, so I am not going to speak to that."
    },
    {
      "text": "But what I will say is this, when the American people are able to take a close look at election time on their options, I think the choice is going to be clear. Bill, we're going to win. Let me just tell you that. We're going to win. And I'm not saying it's going to be easy, but we will win. Speaker 1 I have no doubt, but I also have no doubt it's going to be a lot of work and everyone's going to have to participate. This is a democracy. Speaker 1 I look at it more as let's keep getting out there."
    }
  ]
}