{
  "speech_id": "110",
  "title": "Kamala Harris: The 2024 60 Minutes Interview",
  "date": "20241008",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-the-2024-60-minutes-interview",
  "topics": "Foreign Policy, Economy, Government Policy",
  "num_segments": 14,
  "content": [
    {
      "text": "Well, let's start with October 7. 1,200 people were massacred. 250 hostages were taken, including Americans. Women were brutally raped and as I said then, I maintain Israel has a right to defend itself, we would and how it does so matters. Far too many innocent Palestinians have been killed. This war has to end. The work that we do diplomatically with the leadership of Israel is an ongoing pursuit around making clear our principles."
    },
    {
      "text": "We are not going to stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end. I think with all due respect, the better question is do we have an important alliance between the American people and the Israeli people? And the answer to that question is yes, and- We now have historic low unemployment in America among all groups of people."
    },
    {
      "text": "We now have an economy that is thriving by all macroeconomic measures and to your point, prices are still too high and I know that and we need to deal with it, which is why part of my plan, you mentioned groceries, part of my plan is what we must do to bring down the price of groceries. Yes, I do. Yes. Correct. Okay, so the other economists that have reviewed my plan versus my opponent and determined that my economic plan would strengthen America's economy, his would weaken it."
    },
    {
      "text": "My plan, Bill, if you don't mind, my plan is about saying that when you invest in small businesses, you invest in the middle class and you strengthen America's economy. Small businesses are part of the backbone of America's economy. One of the, I'm going to make sure that the richest among us who can afford it pay their fair share in taxes. It is not right that teachers and nurses and firefighters are paying a higher tax rate than billionaires and the biggest corporations, and I plan on making that fair."
    },
    {
      "text": "But the real world includes- When you talk quietly with a lot of folks in Congress, they know exactly what I'm talking about because their constituents know exactly what I'm talking about. Their constituents are those firefighters and teachers and nurses. Their constituents are middle-class hard-working folks. I disagree with you. There are plenty of leaders in Congress who understand and know that the Trump tax cuts blew up our federal deficit."
    },
    {
      "text": "None of us, and certainly I cannot afford to be myopic in terms of how I think about strengthening America's economy. Let me tell you something, I am a devout public servant, you know that. I'm also a capitalist and I know the limitations of government. It's an election, Bill. And I take it seriously that I have to earn everyone's vote. This is an election for President of the United States."
    },
    {
      "text": "No one should be able to take for granted that they can just declare themselves a candidate and automatically receive support. You have to earn it. And that's what I intend to do. Okay. In the last four years, I have been vice president of United States and I have been traveling our country and I have been listening to folks and seeking what is possible in terms of common ground. I believe in building consensus."
    },
    {
      "text": "We are a diverse people geographically, regionally, in terms of where we are in our backgrounds and what the American people do want is that we have leaders who can build consensus, where we can figure out compromise and understand it's not a bad thing as long as you don't compromise your values to find common sense solutions. And that has been my approach. The first bill we proposed to Congress was to fix our broken immigration system. Knowing that if you want to actually fix it, we need Congress to act."
    },
    {
      "text": "It was not taken up. Fast-forward to a moment when a bipartisan group of members of the United States Senate, including one of the most conservative members of the United States Senate got together, came up with a board of security bill. Well, guess what happened? Donald Trump got word that this bill was afoot and could be passed and he wants to run on a problem instead of fixing a problem so he told his buddies in Congress, \"Kill the bill, don't let it move forward.\" Correct, correct."
    },
    {
      "text": "It's a long-standing problem and solutions are at hand, and from day one, literally we have been offering solutions. I think the policies that we have been proposing are about fixing a problem, not promoting a problem. And the numbers today, because of what we have done, we have cut the flow of illegal immigration by half. We have cut the flow of fentanyl by half. But we need Congress to be able to act to actually fix the problem."
    },
    {
      "text": "I am glad you're pointing these comments out that he has made, that have resulted in a response by most reasonable people to say it's just wrong. It's just wrong. I believe that the people of America want a leader who's not trying to divide us and demean. I believe that the American people recognize that the true measure of the strength of a leader is not based on who you beat down, it's based on who you lift up. How are you doing? You well? That'd be great. I thank you all."
    },
    {
      "text": "There will be no success in ending that war without Ukraine and the UN Charter participating in what that success looks like. Not bilaterally without Ukraine, no. Ukraine must have a say in the future of Ukraine. Those are all issues that we will deal with if and when it arrives at that point. Right now, we are supporting Ukraine's ability to defend itself against Russia's unprovoked aggression. Donald Trump, if he were president, Putin would be sitting in Kiev right now."
    },
    {
      "text": "He talks about, \"Oh, he can end it on day one.\" You know what that is? It's about surrender. That was not the first time I've talked about it. That's not the first time I've talked about it. I have a Glock and I've had it for quite some time and I mean, look, Bill, my background is in law enforcement, and so there you go. Yes, of course, I have. At a shooting range, yes, of course I have."
    },
    {
      "text": "If he is not going to give your viewers the ability to have a meaningful, thoughtful conversation, question and answer with you, then watch his rallies. You're going to hear conversations that are about himself and all of his personal grievances. And what you will not hear is anything about you, the listener. You will not hear about how he's going to try to bring the country together, find common ground, and Bill, that is why I believe in my soul and heart, the American people are ready to turn the page."
    }
  ]
}