{
  "speech_id": "113",
  "title": "Kamala Harris Interview “The View” Transcript: Haitian Migrants, Abortion, Afghanistan",
  "date": "20210924",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-interview-the-view-transcript-haitian-migrants-abortion-afghanistan",
  "topics": "Healthcare, Immigration, Foreign Policy, Social Justice",
  "num_segments": 13,
  "content": [
    {
      "text": "Well, thank you Joy, and to everyone. And listen, Sonny and Anna are strong women and I know they're fine, but it really also does speak to the fact that they're vaccinated and vaccines really make all the difference because otherwise we would be concerned about hospitalization and worse. I mean, look, here's how I feel about it. People got to be responsible."
    },
    {
      "text": "I've been watching like many of you with heartache, the videos of people who are in an ICU bed who did not get vaccinated pleading with their family members please get vaccinated. When I think of it in the context of any one of us who have had the awful experience of holding the hand of a loved one who is in an ICU bed or is near death, like don't put your families through that. The vaccine is free. It is safe. And it will save your life. So folks just need to get vaccinated."
    },
    {
      "text": "Speaker 3: () Madam Vice President, we've discussing those disturbing images of US border patrol agents on horseback inhumanely corralling Haitians at the Texas border. And you've been tasked with immigration. How do you explain this? Well, first of all, I've been very clear about the images that you and I both saw of those law enforcement officials on horses. I was outraged by it. It was horrible and deeply troubling."
    },
    {
      "text": "There's been now an investigation that has been conducted, which I fully support, and there needs to be consequences and accountability. Human beings should not be treated that way. And as we all know, it also evoked images of some of the worst moments of our history, where that kind of behavior has been used against the indigenous people of our country, has been used against African-Americans during times of slavery."
    },
    {
      "text": "So I'm glad to know that that Allie Meyer, who is the Secretary of the Department of Homeland Security is taking it very seriously. Speaker 3: () So will the Biden Administration halt all deportations of Haitians at the Texas border and allow Haitians to apply for asylum? So, first of all, let me say this. When we look at what has happened to that country, just in the last 10 years, not even going back further, and there's been a series of events that have been catastrophic, but even just in the last 10 years."
    },
    {
      "text": "In 2010, the earthquake there killed hundreds of thousands of people and many of the Haitian immigrants that we are seeing in the diaspora around the world, including those who have come to our border fled during that crisis. On top of that, we've seen hurricane after hurricane flooding. And so I feel very strongly. The president feels very strongly, we've got to do more. There's no question. The United States is a member of the Western hemisphere. Haiti is our neighbor in that regard."
    },
    {
      "text": "And so, we have to do more in terms of supporting the Haitians who are returning to the island, returning to Haiti. We've got to do more without any question to support Haiti in terms of its need to get back up and to recover. And I failed to mention that in terms of the natural disasters, there's been absolute heartache and loss, and they just had a president who was assassinated."
    },
    {
      "text": "So you're also talking about a government that is in the process of disarray many would say, but certainly in the process of rebuilding. The United States has to help. And we have to do more and our administration feels strongly about that. But that is why also starting with our administration, we gave TPS, temporary protected status to Haitian migrants, 55,000. And then more recently, we extended temporary protective status to over 100,000 Haitian migrants for that very reason, that they need support."
    },
    {
      "text": "They need protection, including reunification with those who have family members in the United States who are American citizens and doing that through the legal process that was intended to benefit people who are fleeing harm and reunify them with their families. Speaker 3: () Vice president, well some agree we should not stay in a forever war in Afghanistan, others like myself thought we should keep a small number of troops there, given the risks of terrorism and human rights violations in the region."
    },
    {
      "text": "President Biden declared the evacuation from Afghanistan an \"extraordinary success,\" but there was chaos at the airport, a terror attack that killed 13 US soldiers, American allies left behind, and a drone strike that killed innocent civilians. How did so much go so wrong so fast? And how was this not anticipated? Well, first of all, I think the president has been clear and I think the American public agreed that it was time to end that 20 year war."
    },
    {
      "text": "And there is also no question that we all mourn and honor the sacrifice and the service of those 13 service men and women who had enlisted to protect our nation and our principals, and paid the ultimate price for that. But we also have to agree, listen, part of my responsibility as vice-president as I read what's called the PDB everyday, the presidential daily brief."
    },
    {
      "text": "I often every morning sit in the Oval Office with the president, receiving classified briefings from our intelligence community about hotspots around the world and threats to our national security. The United States has an obligation and we as leaders have an obligation to appreciate that we are a global leader. We have interest around the world. And we have to stay focused on those interests, wherever they take place. Thank you, Joy. I'm very excited about it."
    },
    {
      "text": "And I know this is something Whoopi cares about as well, which is we are announcing today $1.2 billion going to over 3 million school children in America to get them access and affordability for broadband. What we know during the pandemic is our kids lost valuable homework time and school time. So we want to make sure all kids have the opportunity to succeed. Well, we are going to stand together unified and fight for women's constitutional rights to make decisions about their own bodies. Full stop. Thank you."
    }
  ]
}