{
  "speech_id": "118",
  "title": "Harris Interview on MSNBC",
  "date": "20240930",
  "url": "https://www.rev.com/blog/transcripts/harris-interview-on-msnbc",
  "topics": "Economy, Social Justice, Government Policy",
  "num_segments": 35,
  "content": [
    {
      "text": "Well, if you are hardworking, if you have the dreams and the ambitions and the aspirations of what I believe you do, you're in my plan. I have to tell you I really love and am so energized by what I know to be the spirit and character of the American people. We have ambition. We have aspirations. We have dreams. We can see what's possible. We have an incredible work ethic. () But not everyone has the access to the opportunities that allow them to achieve those things."
    },
    {
      "text": "But we don't lack for those things, but not everyone gets handed stuff on a silver platter. So my vision for the economy, I call it an opportunity economy, is about making sure that all Americans, wherever they start, wherever they are, have the ability to actually achieve those dreams and those ambitions, which include for middle-class families, just being able to know that their hard work allows them to get ahead."
    },
    {
      "text": "() I think we can't, and we shouldn't aspire to, have an economy that just allows people to get by. People want to do more than just get by. They want to get ahead. I come from the middle class. Look, my mother raised my sister and me. She worked hard. She saved up. By the time I was a teenager, she was able to buy our first home. Home ownership for too many people in our country now is elusive. Gone is the day of everyone thinking they could actually live the American dream."
    },
    {
      "text": "() So part of my vision for the economy is let's deal with some of the everyday challenges that people face and address them with common-sense solutions such as affordable housing. Well, here's what I know in terms of the facts. Donald Trump left us with the worst economy since the Great Depression when you look at, for example, the employment numbers. Even before the pandemic, he lost manufacturing jobs, by most people's estimates, at least 200,000. He lost manufacturing plants."
    },
    {
      "text": "() He has an agenda that would include making it more difficult for workers to earn overtime, an agenda that would include cutting off access to small business loans for small businesses, an agenda that includes tariffs to the point that the average working person will spend 20% more on everyday necessities and an estimated $4,000 more a year on those everyday necessities, to the point that top economists in our country, from Nobel laureates to people at Moody's and Goldman Sachs have compared my plan with his and said my plan would grow the economy."
    },
    {
      "text": "His would shrink the economy. () Some of them have actually assessed that his plan would increase inflation and invite a recession by the middle of next year. So the facts remain that Donald Trump has a history of taking care of very rich people. I'm not mad at anybody for being rich, but they should pay their fair share. But tax cuts for the billionaires in the top corporations in our country and then not really paying much attention to middle-class families."
    },
    {
      "text": "() My perspective on the economy is when you grow the middle class, America's economy is stronger, and there's empirical evidence to prove my point correct. So first of all, when it relates to anybody making less than $400,000 a year, your taxes will not go up. Your taxes will not go up."
    },
    {
      "text": "In fact, under my plan, taxes for 100 million Americans will actually be cut, including $6,000 a year for young couples for the first year of their child's life in a a tax credit essentially by expansion of the child tax credit. And why is that? Because during the first year of a young couple, of a person's child's life, they're going to need help buying a crib, buying a car seat, and we all benefit when they're actually able to do what they naturally want to do to take care of their child."
    },
    {
      "text": "But we're going to have to raise corporate taxes, and we're going to have to make sure that the biggest corporations and billionaires pay their fair share. That's just it. It's about paying their fair share. I am not mad at anyone for achieving success, but everyone should pay their fair share. It is not right that the teachers and the firefighters that I meet every day across our country are paying a higher tax than the richest people in our country. Well, listen, I work with a lot of CEOs."
    },
    {
      "text": "I have spent a lot of time with CEOs, and I'm going to tell you that the business leaders who are actually part of the engine of America's economy agree that people should pay their fair share. They also agree that when we look at a plan such as mine that is about investing in the middle class, investing in new industries, investing in bringing down costs, invest in entrepreneurs like small businesses, that the overall economy is stronger and everyone benefits."
    },
    {
      "text": "() Part of my plan for the economy is investing in new industries in a way that we have active partnership with the private sector. I've worked with the private sector my entire career, even as vice president, working with some of the biggest banks and biggest tech companies to increase by billions of dollars, the money going into community banks to increase access to capital for small businesses. () Why do those biggest corporations and CEOs do that?"
    },
    {
      "text": "Because they know those kinds of investments, like in our small businesses, in startups, in entrepreneurs, actually strengthens America's economy overall and everyone benefits. So this is not about bilking anybody, but it is certainly about saying, let's make sure that we create opportunities for everyone to grow wealth. () I believe that it is not sufficient and it should not be our goal to just make sure everyone is working. That should be the baseline. That should be a given."
    },
    {
      "text": "Let's create an economy where people have the ability to buy a home, to start a business, to take a nice vacation from time to time. You're absolutely right. So you're absolutely right. Across our country, people rightly are concerned about the cost of housing. So it's home ownership, to your point. We need more supply. That is without any question part of the solution, creating more supply, under my plan, includes creating tax incentives to work with the private sector and home builders."
    },
    {
      "text": "Part of my goal and the plan would be to create three million new housing units for rent and for ownership by the end of my first term. () It includes also what we must do to cut red tape. You're absolutely right. It takes far too long, and there's too much bureaucracy associated with home building. I say that as a devout public servant."
    },
    {
      "text": "I know that we have to reduce the red tape and speed up what we need to do around building, and that is going to require working from the federal level with state and local governments. () It's going to be different in different places depending on the needs of that community, the needs of that local government, that municipality, but working in consultation and coordination and also around incentives that we can create."
    },
    {
      "text": "() For example, some of the work is going to be through what we do in terms of giving benefits and assistance to state and local governments around transit dollars and looking holistically at the connection between that and housing and looking holistically at the incentives we in the federal government can create for local and state governments to actually engage in planning in a holistic manner that includes prioritizing affordable housing for working people. That's right."
    },
    {
      "text": "It's most important that we maintain America's ability to have American manufacturing of steel by American workers for a number of reasons, which includes, again, back to the point of growing our economy and how I think about the economy overall, investing in new industries. There is not a new industry that I can imagine that is not going to require manufacturing of steel as a fundamental part of what it accomplishes."
    },
    {
      "text": "() Having American workers in an American company manufacturing that steel for those new industries is going to be critically important not only in terms of our economy, but also in the context of national security. Most people now realize, if we didn't before the pandemic and the strain on supply chains and an over-reliance on foreign manufacturing, that we have to be intentional about US-based manufacturing and of the products that we have to prioritize."
    },
    {
      "text": "Steel is one of them, and that's always going to be my priority. Yes. Well, let me go back to our just previous conversation. I'm very proud to have the endorsement of the steel workers in almost every other major union in America because I stand by workers and I stand by the importance of being able to join a union and to understand the benefit and the value of unions. I understand the importance of investing in new industries and working actively with the private sector to grow our economy."
    },
    {
      "text": "Well, here's the thing, back to your point about previous election cycles. Donald Trump made a whole lot of promises that he did not meet, and one would argue broke. Look at Lordstown. He said he was going to- Yeah, don't sell your homes. And what happened? It shut down. Outsourcing under Donald Trump, his policies that are about putting tens to hundreds of percent tariffs. Yes. Yes."
    },
    {
      "text": "So part of the challenge, and I don't disagree that it's a challenge, got to earn the vote of everybody, is reminding people of fact, regardless of what somebody says in a small rally somewhere. I think that's really important, and that's part of what I'm doing in this campaign is to remind people, just like here in Pittsburgh, of the reality of who has stood with union labor, who stands for American manufacturing, who stands for American jobs."
    },
    {
      "text": "It would be a sales tax on the American people, and the independent economists have already measured this by ... The sales tax of doing a 20% tariffs on all imports that he has described would be a 20% sales tax, in essence, on basic necessities for the average American worker, average American family, totaling almost $4,000 a year. That is no small matter."
    },
    {
      "text": "() Here in Pittsburgh when I'm talking to a group of folks who work here, who live here, and when they hear it might be $4,000 more a year for them, look, people can't afford that. Well, part of it is you don't just throw around the idea of just tariffs across the board, and that's part of the problem with Donald Trump."
    },
    {
      "text": "Frankly, and I say this in all sincerity, he's just not very serious about how he thinks about some of these issues, and one must be serious and have a plan and a real plan that's not just about some talking point ending in an exclamation at a political rally, but actually putting the thought into what will be the return on the investment and what will be the economic impact on everyday people."
    },
    {
      "text": "Then you're creating the ability of that working person to build intergenerational wealth, doing the work of a $6,000 child tax credit, doing the work of a $50,000 tax deduction for first-time small businesses, startups, because right now- It's a real plan because right now, and again, it's about paying attention to the detail and being serious about it. I'm serious about my enthusiasm for small businesses and my belief in what they will do as part of America's economic engine."
    },
    {
      "text": "So- So looking at the fact that right now the tax deduction is $5,000. Nobody in this year of our Lord 2024 can start a small business with $5,000, very few can, so extending it to $50,000 tax deduction for startups to generate the innovation and the ambition of the ideas that are present and among us but need the fuel to be able to actually achieve the goal. Yeah, I agree with you."
    },
    {
      "text": "So just to be very frank, I am never going to apologize for going after companies and corporations that take advantage of the desperation of the American people, and as attorney general, I saw this happen. In the midst of an emergency, whether it be an extreme weather event or even the pandemic we saw it where those few companies, not the majority, not most, but those few companies that would take advantage of the desperation of people and jack up prices. Yeah, I'm going to go after them."
    },
    {
      "text": "Yes, I'm going to go after them. () That is part of a much more comprehensive plan on what we can do to bring down the cost of living, including housing, including the everyday needs of the American people. Well, first of all, we do have a broken immigration system, and it needs to be fixed."
    },
    {
      "text": "If we take a step back, months ago, some of the most conservative members of the United States Congress came together with others, proposed a border security bill that would have put 1,500 new border agents on the border to help those hardworking border agents who are there right now working around the clock, would have put more money into stemming the flow of fentanyl, which is killing Americans around our country and devastating communities, would have put more resources into our ability to prosecute transnational criminal organizations, which in my career I've prosecuted."
    },
    {
      "text": "() Donald Trump got word of the bill, realized it was going to fix a problem he wanted to run on, and told them to kill the bill, don't put it up for a vote. He killed a bill that would have actually been a solution because he wants to run on a problem instead of fixing a problem. That's part of what needs to be addressed. My pledge is that when elected president, if the American people will have me, I will bring that bill back, and I will sign it into law."
    },
    {
      "text": "() We need a comprehensive plan that includes what we need to do to fortify not only our border, but deal with the fact that we also need to create pathways for people to earn citizenship. There is no little job. There is no such thing as a little job. On a sesame-seed bun? I have. But it was not a small job. I did the fries. I mean I- But to your point, if you don't mind- ..."
    },
    {
      "text": "before you get to the big job, part of the reason I even talk about having worked at McDonald's is because there are people who work at McDonald's in our country who are trying to raise a ... I worked there as a student. I was a kid ... who work there trying to raise families and pay rent on that. I think part of the difference between me and my opponent includes our perspective on the needs of the American people and what our responsibility then is to meet those needs. Yeah."
    },
    {
      "text": "Probably the biggest gut decision I've made most recently is to choose my running mate. There were lots of good, incredible candidates, and ultimately, that came down to a gut decision. Okay. Donald Trump is also the person who said women should be punished for exercising a decision that they rightly should be able to make about their own body and their future."
    },
    {
      "text": "So I think we would all agree that, as a result of that perspective that he has about women, he also then chose three members of the United States Supreme Court who did as he intended, undid the protections of Roe v. Wade, and now in state after state, you see laws being passed that do punish women, laws that, I mean most recently, a heartbreaking story resulted in a young woman dying, a mother of a six-year-old, heart-wrenching stories, and that's for the listener, much less their family."
    },
    {
      "text": "() So look, I think the thing about Donald Trump is that I don't think the women of American need him to say he's going to protect them. The women of America need him to trust them. Yes. Yes. I'm not perfect, but I will tell you, I'm always going to put the needs of the people first. Thank you. Thank you."
    }
  ]
}