{
  "speech_id": "120",
  "speaker": "Harris",
  "title": "Kamala Harris Opening Speech Transcript: U.S. – Mexico High Level Economic Dialogue",
  "date": "20210909",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-opening-speech-transcript-u-s-mexico-high-level-economic-dialogue",
  "topics": "Economy, Foreign Policy, Immigration, Climate, Infrastructure",
  "num_segments": 10,
  "content": [
    {
      "text": "Good morning. Speaker 1: () Good morning, buenos dias. Welcome, and thank you so, so much for joining us this morning. It is exciting for us to be here to kick off our inaugural high-level economic dialogue, and thank you for traveling to be here in person for this important meeting. I'd like to begin by turning it over to our vice president, Vice President Kamala Harris, who recently has been to Mexico, had a very productive trip, and we're just thrilled that you could join us this morning."
    },
    {
      "text": "Thank you, Madam Secretary. It is an honor to welcome our guests, our friends, our partners. It is good to see you again, Foreign Secretary Ebrard, Secretary of the Economy Clouthier, Ambassador Moctezuma. Thank you all for being here. We are very excited about this next stage of the relationship and the partnership between the United States and Mexico."
    },
    {
      "text": "This meeting and this convening of leaders of the United States with the leaders of Mexico is a follow-up to the extensive conversations I was pleased to have with President Lopez Obrador in Mexico City, and it is a follow-through in terms of the commitment that we have had for a long time, and that we will only strengthen through the dialogue today and what comes out of this dialogue in terms of the plans going forward. So we welcome you, we warmly welcome you."
    },
    {
      "text": "I want to thank those members of our administration who worked to put that agreement into action, including our co-chairs Secretary of State Antony Blinken, Secretary of Commerce Gina Raimondo, and Ambassador Katherine Tai. I also would like to welcome Secretary Alejandro Mayorkas, Administrator Samantha Power, and our new ambassador to Mexico and a longstanding leader in the United States, Ken Salazar."
    },
    {
      "text": "This dialogue was last convened in 2016, and so much has happened, so much has changed, so many challenges have been presented, and yes, also opportunities in the intervening years. Since then, a global pandemic has undermined the stability of our global economy, supply chains have been disrupted, and threats from climate change to cyber attacks have threatened our security, both in terms of our national security and our economic security."
    },
    {
      "text": "We know that our world is also more interconnected and more interdependent than ever before. Again, highlighting the importance of the partnership and the relationship between the United States and Mexico. Mexico is our closest neighbor, Canada as well, and a strategic partner, and one of our most important economic relationships. Mexico's economic stability is in the interest of the United States. We talked about this in Mexico City."
    },
    {
      "text": "18 states in the United States count Mexico as their top one or second, first or second export destination. $1 billion crosses our shared border every day in goods. All of that making clear that this high-level economic dialogue is an opportunity to deepen our ties and advance our collective goals. Together, we will strengthen supply chain resilience."
    },
    {
      "text": "Together, we will modernize our hemisphere's infrastructure through the plan the president has outlined in partnership and cooperation with our friends, Build Back Better World. We will together create an environment to attract investment and business growth, and at the same time, keep an eye on what we must do to root out corruption. We will invest in an inclusive and green development capacity, and we will create jobs for the people of Southern Mexico and Central America."
    },
    {
      "text": "And President Lopez Obrador and I and the secretary had extensive conversations about our mutual commitment to addressing the root causes of migration. And together, doing all of this work, we will ensure that women and children benefit from this growth and prosperity. Following this dialogue, I am confident that our nations will continue to work together, that our companies will continue to create jobs together, and that our people will enjoy greater prosperity and a greater quality of life."
    },
    {
      "text": "Together, the United States and Mexico will set an example for what is possible in the Western hemisphere. So with that, again, I welcome you on behalf of the president and all of us, and I will now pass the mic to secretary Ebrard. Again, it's good to see you again. Thank you. Thank you. And again, on behalf of President Biden and all of us, welcome."
    }
  ]
}