{
  "speech_id": "121",
  "speaker": "Harris",
  "title": "Kamala Harris Campaign Speech Transcript for Gavin Newsom in California Recall Election",
  "date": "20210908",
  "url": "https://www.rev.com/blog/transcripts/kamala-harris-campaign-speech-transcript-for-gavin-newsom-in-california-recall-election",
  "topics": "Social Justice, Government Policy",
  "num_segments": 16,
  "content": [
    {
      "text": "It's good to be home. It's good to be home. I was flying in, landed in Oakland, flying over the Bay, Bay Area. It's good to be home. So I landed just a short time ago and I'm here for one purpose. I came home for one purpose. I always want to come home. But it was really important to me to come home today, to stand and speak in support of my dear friend, my longstanding friend, a great California leader, a great American leader, Governor Gavin Newsom. I'm about to talk about Gavin in front of his face."
    },
    {
      "text": "But, Gavin, you were just... I was watching you backstage and you mentioned Texas. I just wanted... just one thing about Texas. When I was leaving this morning, I was watching the morning news. This was early, I left DC. And they had this clip of the governor of Texas. And the words that he spoke were the words that were to arrogantly dismiss concerns about rape survivors."
    },
    {
      "text": "And to speak those words that were empty words, that were false words, that were fueled with not only arrogance but bravado, that is not who we want in our leaders. We want in our leaders, someone like Gavin Newsom, who always speaks the truth on behalf of all the people, in a way that is about uplifting, that is about helping to understand the plight of working people, to understand the dignity of all people. That's who Gavin is. And, guys, I've known him a long time."
    },
    {
      "text": "One of the things I know about Gavin Newsom, he never hears, \"No, it's not possible. It can't be done.\" Gavin doesn't hear that. I've witnessed that. I was elected DA when he was elected mayor of San Francisco. And I heard [inaudible :43] talk about this, right? The marriages, that Valentine's weekend in 2004."
    },
    {
      "text": "Gavin, couldn't hear, didn't hear, \"It can't be done.\" He had the courage, as he has had his entire career, to believe in and know what is possible and ability to see what can be, unburdened by what has been. The kind of leadership this daughter and we as California, and daughter of California wants. We want our leaders in California to have a vision of what is possible, to see opportunity of a moment, to inspire and uplift all people. That's what the people of California have always wanted."
    },
    {
      "text": "That's why the Republicans' recall will fail. It is so good to be in the house of labor. It is so good to be in the house of labor. Let me tell you something, I am clear, I know Gavin is clear, it is the men and women of labor, the working people of our unions, the working people of California, who are going to show what kind of leadership they want and are going to walk their talk and make sure that this political game of this recall is defeated. Let's look at what Gavin has accomplished."
    },
    {
      "text": "He and I were talking backstage. He came in office after Jerry. And he came in with so much, in terms of what he was giving our state. And then things out of our control, any of our control, started to happen, but Gavin rose to the moment. Let's be clear, on the issue of COVID, in this state, with the largest population of any state in the country... I've been traveling around the world. Larger than many countries. Gavin stepped up to the moment."
    },
    {
      "text": "Over 22 million Californians have been vaccinated, because of the programs that he led and put in place. Because he was not afraid, he didn't say, \"This problem is too big for me.\" He didn't say, \"My state is too big for me.\" No. He led with courage. I want us to remember those early days. Let's remember the course of it. We were all scared. We didn't know what was happening. But we needed leaders to have courage, to take a stand and make decisions."
    },
    {
      "text": "If a decision is coming to a governor in a state of tens of thousands of employees, it's because nobody else could make the decision, except the governor. It's because it took one person, who is Gavin Newsom, to make hard decisions in a moment of crisis that was unpredictable and he led. He led in saying, \"I understand the plight of working people."
    },
    {
      "text": "So I'm going to make sure that in the state of California, we have workers comp for people who caught COVID on the job because there is no reason that working people should have to lose their benefits in a moment of personal crisis like that.\" Gavin Newsom said, \"We're going to have paid family leave.\" Because as Jennifer said, Gavin has always understood that if you want to lift up America, you've got to lift up working people, understand that unions are going to be a big part of that and women are going to be a very big part of that."
    },
    {
      "text": "This is the kind of leader we have had in Gavin Newsom. You have to understand that this recall campaign is about California and it's about a whole lot more. They're thinking that if they can get this done in California, they can go around the country and do this."
    },
    {
      "text": "You got to understand what's happening right now, what's happening in Texas, what's happening in Georgia, what's happening around our country, with these policies that are about attacking women's rights, reproductive rights, voting rights, workers' rights. They think if they can win in California, they can do this anywhere. Well, we will show them, you're not going to get this done, not here, never. So this election, guys, it's not a one-off. We need everyone to vote no. I voted no."
    },
    {
      "text": "Doug, my husband, the first second gentlemen, voted no on his ballot and we mailed it in. We got to get this done. We've got six days. It's a week from yesterday, so next Tuesday, the 14th. But let's understand, we're not only going to be doing the work of putting Gavin Newsom in exactly where we want him to be, which is as governor of California, to lead as he's been leading. But we are also, in this election, making a statement about who we are as a nation."
    },
    {
      "text": "Because understand, if having a governor who is for workers' rights and labor unions weren't a problem for them, they wouldn't be trying to recall him. They wouldn't be trying to recall him, but for the fact that he has always stood for reproductive rights. They wouldn't be trying to recall him, except they know he stands for our dreamers and our farm workers. They wouldn't be trying to recall him, except that he says that access to healthcare is right and not a privilege of just those who can afford it."
    },
    {
      "text": "These are the issues that are at play. They wouldn't be trying to recall him, except that they know he is a national leader on one of the greatest threats to our democracy right now, which is these blatant attacks on voting rights. This is what's going on right now. This is what's going on right now. This is why they are putting so many resources and time into trying to take out Gavin Newsom. It is because of his vision. It is because of the agenda. It is because of who he fights for."
    },
    {
      "text": "And so we are here to say today, \"We fight for Gavin Newsom. We fight for our country. We fight for the values we hold dear. We fight for working people. We fight for organized labor. We fight for dreamers. We fight for women. We fight for voting rights.\" And we stand as Democrats, saying, \"We are proud to do all of that and more.\" That's what we stand for. California, let us send a message to the world that these are the things we stand for, these are the things we fight for."
    }
  ]
}