{
  "speech_id": "004",
  "speaker": "Trump",
  "title": "Transcript: Donald Trump Meets with Recovered COVID-19 Patients",
  "date": "20200414",
  "url": "https://www.rev.com/blog/transcripts/transcript-donald-trump-meets-with-recovered-covid-19-patients",
  "topics": "Healthcare, Government Policy",
  "num_segments": 44,
  "content": [
    {
      "text": "... different stories to tell. I thought what I do is I'd go around the room. It's an honor to have them at the White House and they're very brave. Some were right at the edge. They thought it was over. It's a rough plague. I call it the plague. I call it the scourge. I call it whatever you want to call it. It's rough. It's bad. A woman that I've really found fascinating, she's from a state that's a great state and a city that's been hit very hard. Really very, very hard. Detroit. Highly respected."
    },
    {
      "text": "She's a political person. She doesn't happen to be a Republican, and that's okay. When things aren't going good and you get a little help from a Republican, we'll take that too. But your story was just a fantastic story. We're going to go around the room. Each of you. This man was an NFL football player for 10 years, a friend of Tom Brady, and he was hit hard. Speaker 1: () Yes, sir. You weren't so strong when you got hit by that, that little- Speaker 1: () No, I didn't feel strong at all at that point."
    },
    {
      "text": "You were saying you didn't feel too powerful. So if we could, we'll go around the room and if we could start with you, Representative, and congratulations. It's an incredible story. Thank you. Rep. You were so incredible as a Representative, both in terms of how you got better and what you went through. Your husband sounds like a great gentleman. He went down there and he took care of things, right? Rep. He took care of things. That means he loves you. Because some husbands would say, \"Eh, let's not bother.\" Rep."
    },
    {
      "text": "He will do whatever he has to do. Right? Rep. That was late in the evening you did that, right? We had the drug store stocked with the medicine. That's fantastic. What don't you say what got you to go late in the night to the drug store? Oh, I see. So the doctor did a good job? Rep. Is he a doctor from a hospital or a local doctor? Rep. That's fantastic. Rep. No kidding. Rep. How are they doing? How are they doing. Rep. So they took the hydroxy then? Rep. That's right. Rep."
    },
    {
      "text": "Well, I hear that the governor has gone all out for it from being totally opposed to it. Now she's all out for it. So that's what I'm hearing. So that's a good thing. I think it's a good thing. Rep. You might have said when you started that walk or run, what the hell do I have to lose? Right? You know my expression. What do I have to lose? She was in bad shape and I understand. Congratulations. It's an incredible story, and I like Democrats."
    },
    {
      "text": "I especially like this Democrat though for just the reason you have a beautiful presence and you're a beautiful couple. Thank you for coming. I have a feeling she's going to go very much up. She's a good representative right now, but I have a feeling politically. Do you have any further political ambitions do you think? Rep. I don't know. I may have to cross party lines. I may have to work with her across party lines. Thank you very much. Rep. Great honor to have you both. Rep. Please, tell us your story."
    },
    {
      "text": "When nobody would take the Diamond Princess. No other country would take it. Nobody wanted it. They call it a ghost ship. Not good. So we took it. How many people died ultimately on the ship? Oh, you did have a precondition? [inaudible :53]. So you were together, no six foot thing, no nothing. You were together and you didn't catch it. Wow. A study on you? You think maybe you had it before, there's an immunity without knowing it? So you didn't see it at all? Wow, that's fantastic. [inaudible :38]."
    },
    {
      "text": "It's amazing to be together like that and not catch it. How did they do? Did you feel comfortable? Did you cover your head or something? That was on a plane? Then you had the bus. So that was no pleasure either. These people had it. It's amazing man that you [crosstalk :51]. Do you think it brought you together closer? I could see it. It brings you together. Does that make any sense? You were very sick at one point. Right? How bad was that shortness of breath? Was it noticeable? Really? How about you?"
    },
    {
      "text": "You had shortness of breath too I read, right? Rep. So how bad was the shortness? Rep. No, Lyme disease is a big deal. Rep. Do you think you still have Lyme disease? Rep. Can you get rid of it? Rep. Lyme disease is a thing that people don't talk about. It is a brutal. Rep. If you have a certain type of blood, you have no chance. Rep. So you actually had a hard time breathing? Rep. Do you think, in retrospect, you were better staying home? Rep. Because those hospitals, they can be crowded. Rep."
    },
    {
      "text": "So you thought you were going to die? Rep. Well, I'm not going to speak for her, but I don't see her voting for sleepy Joe Biden. I don't know. I'm not going to ask her that question. But if she votes for sleepy Joe, I'd be surprised, okay? Anyway, incredible story. Such a great story. Thank you. But your wife, I think we're going to-- Speaker 3: () You're unbelievable. We're going to keep your wife around, right? We'll keep her around [crosstalk :12] Speaker 3: () She is unbelievable. What's in the veins, right?"
    },
    {
      "text": "Speaker 3: () She is unbelievable. That's fantastic. Great, great stories. Thank you both very much. Please, go ahead. Right. That's good. Do you know where you caught it? How bad were you? So, compared ... You said you've had the flu a number of times. How did you compare this to the flu? So, a bigger, better, much worse event for you? When was it? When was it? When did you find out officially that you had it? Okay, so what were the words? Did that make them treat you better or worse?"
    },
    {
      "text": "Or did they treat you like you had the COVID? Did you ever think you were going to die? So if it had gotten worse, you would have been in deep trouble. Did you have a problem with your breathing? What was it showing? The meter? So you looked okay, but you still felt a shortness of breath? So when did you get better? That's a long time, isn't it? That lasts a long time. But you got better quickly. Rep. After the medication. Rep. It's amazing we can't get people to officially ..."
    },
    {
      "text": "You know, if somebody else endorsed that medication, it would be great. Rep. Yeah. No, if ... By the way, we have tremendous endorsements, but if it was somebody else other than President Trump that put it forward ... if some other person put it forward, they'd say, \"Oh, let's go with it.\" What do you have to lose? They've been taking it for 40 years for malaria, which, by the way, it's an unbelievable malaria pill. Unbelievable lupus pill. Unbelievable. In fact, the problem we had is people with lupus-- Rep. Huh?"
    },
    {
      "text": "Rep. And with ... I heard Lyme disease, too. Rep. No, it's very powerful. But ... it's incredible, because there's so many stories like yours. It's not just ... I actually haven't heard a bad story, you want to know the truth. You know, normally you'd hear some good ones, some bad ones, and you'd still give it a shot. I haven't heard a bad story. So it's pretty amazing, actually, but that's okay. The word is out. The people get it. These people don't get it ... the media ... but the people get it."
    },
    {
      "text": "Anyway, well that's a great story. So you're feeling good now? You're going to go conquer the world as a young handsome guy? Huh? How old are you? That's great. You have a great life ahead of you. Congratulations. Great job. So? I've seen this man. Is this your doctor? The doctor you know? [crosstalk :59] look like a very wealthy couple. Do you agree? I think they're loaded. They've got their own doctor deal going. But that's okay. [crosstalk :06] What do you do? Good. Good. Your wife showed much worse, had a much harder time?"
    },
    {
      "text": "How bad did you get? Mrs. And that's scary, right? Mrs. So you almost felt you were better, and then it came back? Mrs. How long did it take altogether? Mrs. Over a month? Mrs. That's incredible. How are you now? Mrs. Would you say 100%? Mrs. Stay away from me, please. Stay away. Keep her away. How did they all do? How did they all do? It seems to be very important. A lot of people, when they recover, they want to donate blood because, you know, your blood is very good for this, right? Including every study we have, it's good."
    },
    {
      "text": "The only question is, is it for one year, or is it for a lifetime? Could be the measles and things, where it's for a lifetime, they say, but it's going to be interesting. We just don't know because it hasn't been here long enough. It could be for a lifetime. Well that's great. So you donated blood? That's good. That's good. That's fantastic. Yeah. Congratulations. And you'll be 100% soon, I would imagine. Mrs. Well that's a great story. Thank you very much, both. That's great. It's great that it worked out so well."
    },
    {
      "text": "Has anybody ... You're okay. You are as good as ... Do you feel you're as good as you were before this happened? Speaker 5: () Yes. So that's good. And I think you do, right? I think you're better. Rep. So that's good, and I think you do, right? I think you're better. Rep. She's a hot political property now. Rep. I'm a little surprised they can't do something with your Lyme disease, Lyme disease is really- Rep."
    },
    {
      "text": "Yeah, no, but I mean I could even have you see the doctor over here because White House doctor, ask the White House doctor, seriously because Lyme disease can be very, very bad, but it also can be- Rep. Yeah, it also can be ... Is it legal for me to allow her to use the White House doctor? You know what? If it's not I will suffer the repercussions. I don't care. The Democrats might not like that. Rep. People don't know about Lyme disease. It's a very bad, very bad thing. Rep."
    },
    {
      "text": "But it is something over a period of time you can treat generally. It also can kill you. Lyme disease, again, if you have a certain type blood, you get a lung disease. It's over, which literally over, I think type O, type O. Blood is not too good. If you have type O blood stay out of the woods, right? Rep. You got it at home? Rep. But usually it's from a deer tick. Right? Rep. So where did the tick come from? Rep. So it comes somehow, right? Rep. It's like when I hit a ball into the rough in golf, you know what I say?"
    },
    {
      "text": "Enjoy yourself. I'm not going in there. Yeah, Lyme disease is pretty tough, right? Rep. It's a bad one. I'd like you to see our doctor before you leave. Okay? Rep. All right. I'm going to just say, because sometimes they do have a very, very powerful antibiotic and let's see if we can help you out. Okay. So this man, as you can possibly tell by looking, was a great athlete and a great football player. And I didn't know Mark, but he said ... Tom Brady says hello to you."
    },
    {
      "text": "Tom Brady is a friend of mine and a great guy and just signed a nice new big contract, right? With a team that's supposed to have a lot of potential Tampa Bay. I figured he picked a team ... I'm sure he only picked a team with a lot of potential and it's going to be ... How do you think Tom Brady's going to do? So Mark spent 10 years in the NFL and I guess you played with Tom Brady at Michigan, right? Could you see at Michigan ... Because he was picked a little bit late, right?"
    },
    {
      "text": "Could you see the greatness in Tom Brady at Michigan or not necessarily? Yeah. That's hard to say, but you thought he was really a great player in college. Right? So you had a guy, Drew Henson, right? Was first string. Right? Good memories. I have a good memory. They're always testing my memory. Nobody has a better memory than Trump unless I don't want to remember certain things, which happens a lot too."
    },
    {
      "text": "But you had a quarterback, Drew Henson, who was actually the starter, and he signed with the Yankees because he wanted to play baseball. The problem is he couldn't hit the curve ball, right? Couldn't hit a major league curve ball. But he was a great football player. But he got hurt. Tom Brady took over, the team became much better, right? That's been Tom Brady's thing, right? Both Drew's and a Drew. Right? They had a Drew in the Patriots. That's what happened, and that's exactly what happened."
    },
    {
      "text": "Well, let's say hello to Tom when you see him, okay? He's a great guy. So you're a big strong guy. 10 years in the NFL. What position did you play? Tight end. Okay. Wow, you're a big guy for tight end. That's very good. Were you a good catcher? You could hold it pretty well? Were you a blocker more or less or a receiver? More of a blocker. That's great. And how big are you? What are you, 6'6? That's good. You look fantastic. So tell us, so you're a big powerful guy and this little bug knocked the hell out of you, right?"
    },
    {
      "text": "I appreciate you being here, Mark, and the American people are watching this and I'm finding it fascinating from football players to state reps to all of the things you people do, from a rich couple that wants to go skiing, say what the hell, you going to sue the ski place? Don't bother. But no, it's so fascinating to say all different people, different types, different jobs, different everything, all different parts of the country. So tell us what happened, Mark."
    },
    {
      "text": "But that's the only thing, because you must go back and torture yourself with- Why so long [inaudible :]? [inaudible :10]. A very good guy. Right? Gregarious, I guess they call it. He wants people, he wants people. That's good. Go ahead. So you took the hydroxy? And that made a big difference? You were pretty bad for a while. So you had the Azithromycin and the zinc too? Yeah, yeah. Sure. She never got it? [crosstalk :41] you're driving together. She never got it. Maybe she's tougher than you, Mark, do you ever think?"
    },
    {
      "text": "That's pretty amazing. So the end result is you think you're as good as new, right? Oh really? [crosstalk :02] in your lungs. It was there? Once it gets too far advanced stuff, that's when [crosstalk :10]. That's where the Z-Pak comes in, I think. That's what- Why did you take the hydroxy? What did you do then? You saw it on television? And they had it. And they had it. We've stocked up the hospitals, we've got 29 million doses. We stocked up a lot of ... I think almost all of the hospitals. That's good."
    },
    {
      "text": "So you saw it somewhere, and you said you'll take anything, right? That's great. That's great. Speaker 7: () Yeah. So, between him and Dr. Lance Bernadette, so I run some small businesses, having those and thanks to all of them as well. Right? So, 46 employees and all that. In order to do that, in order for me to do that and to be away, you have to have good people. And thank goodness I did. Well, I want to thank you. That's great."
    },
    {
      "text": "That's really a great story to see somebody like you just not cold by the invisible enemy. Right? That was tougher than any football play you ever played. Right? Speaker 7: () That's absolutely true. And you played against some tough ones. I know you did. Speaker 7: () Yeah. There were some battles that weren't so good for me, but I always kept fighting. Yeah. You did a great job. Great job. Anybody can't be in the NFL for ten years. That's a big tribute. That's not easy. You know how hard that is, right?"
    },
    {
      "text": "Speaker 7: () Yeah. It's a grind. Everybody always, every year the new ones come along and you just stayed there. Ten years is a long time in the NFL. That's a great tribute to you as a fighter. I want to thank everybody. This has been incredible. I thought this would be a five minute meeting, but I found each one of your stories so interesting. And hopefully the media can play some of these stories because they're just... we're going through something the likes of which, I guess, we've never seen."
    },
    {
      "text": "Maybe you go back to 1917, 1918. That was the big plague. That was a big one. And anywhere from, Mike, I guess, 75 to 100 million people died. It started here. It started in a certain location. I don't want to say because I love that location so I'm not going to say it. But it started in this country and actually got brought to Europe. And Europe is where it did its... thousands of people died here, large numbers. But, in Europe, tens of millions of people died."
    },
    {
      "text": "So, we gave them no favor when whoever it is went over to Europe. Right? No favor. But not since then have we seen anything like this. And we're winning our battle. We're winning our war. We're going to be announcing some very good things in the near future. The American public has been great, far greater than anybody would have thought. They had minimum numbers of 100,000 and I think we're going to beat that. 100,000 deaths, can you believe that? That was a minimum?"
    },
    {
      "text": "And, if we didn't practice what we practiced, and if we did it a different way, because we had a maximum of 2.2 million people, who knows even if that's right. But the way I look at it, if you cut it in half and cut it in half again, it's five or 600,000. That's what we lost in the Civil War. That's not acceptable. So, we couldn't have done it, to bull through, as we call it, to bull through it. Just like treat it like a flu, if we did that. So, we made the right moves. Now we have to get our country open again."
    },
    {
      "text": "You all know that. But this was great. I thought... I was talking to Mike. I said, come on, this will take five minutes. And it's taken a lot longer than five minutes. And that's because I found it so interesting. And really great. Mike, do you have something to say? I think so. And I think we're making a lot of progress on vaccines. We're making a lot of progress on maybe a cure, meaning a pill. Because I think right now I'd like to have that more than the vaccine."
    },
    {
      "text": "The vaccine takes a little longer because they have to test it for a period of a year or more. And so, it's something we're going to come with. And I really think we're making, therapeutically, we're making tremendous, I think, tremendous progress, tremendous progress. And we're going to see whether or not, Mark, whether or not what you did and whether or not what Karen did, whether or not that's a big part of the answer. But I think it could be a part of the answer. Let's see, as one alternative."
    },
    {
      "text": "But we're going to have numerous alternatives. There's another one just came, the Gilead drug, remdesivir, just came out. Speaker 8: () Okay. And it didn't come out. It's a highly sophisticated, very, very sophisticated treatment that seems to show good promise also. Well, I want to thank you all. Jeff, could I ask you a question? You're a great reporter and a nice man. Look at you with that mask. That's good. You look very good. You actually much better I think. But what do I know?"
    },
    {
      "text": "Am I allowed to take Karen over to see the White House doctors here? We can help her out a little bit with Lyme disease, because Lyme disease is a problem. And there are some answers. What do you think? Are you guys going to report me for being a horrible human being for doing something illegal, that I did something illegal? And impeachable. You think they'll impeach me because I tried to help her out with her Lyme disease? You think maybe? Because I'd like to do that. What do you think? Should I do it?"
    },
    {
      "text": "They never like to take chances, but I do. So, we'll take a chance on it. Okay? Thank you very much. We're going to have a news conference a little bit later. We're going to announce the groups of people that are going to be talking to us. We've made a lot of progress today. You see what's happening with our bump, our big bump in the road. And our big bump is a lot less than a lot of people thought it would be because of the American people. They've been incredible. So, I just want to thank everybody."
    },
    {
      "text": "We'll have a news conference in a little while. We're going to announce the people that we'll be talking to. And I'm going to be making a decision pretty quickly. And it's being done in conjunction with governors. We have tremendous support from governors. And what I do is going to be done in conjunction with governors. But we'll be doing that in a little while, especially in terms of the people. We have a lot of great people in this country that know the different fields. And we have..."
    },
    {
      "text": "a lot of skill is going to have to be used to get our country back to where it was. And we want to do it quickly, whether it's restaurants, or whether it's airplane business, or whether it's a lot of other things. We have a lot of businesses. And we have the best people in every profession, including medical and including political. We have a political group too, a lot of great politicians. So, well some are great, some aren't so great, but I put them on anyway. We want to have a sampling of everybody."
    },
    {
      "text": "So, we have a lot of talent. I want to thank you all you. You folks are fantastic. And just get better. Get your job finished up. Okay? You're there to be 100%. You look great. And thank you very much, Karen. You and your husband are going to come with me and I'm going to have you sent over to the White House doctor. They have really great doctors. They just wait for me. You know they say... they're there for me, and for Mike too, I think. Speaker 8: () That's good. Are they there for you too?"
    },
    {
      "text": "And, if anything should happen... it was very interesting. I was with somebody not so long ago and he fainted. And he had a bad... something happened to him. And it was at a certain location. And, within like a minute and a half, there were seven doctors standing over. They had oxygen. I said, I've never seen anything like it. So, they are prepared and they are great. And we're going to take you over and maybe we can find something for you. Okay? Speaker 8: () That sounds great. We'll knock out two of them."
    },
    {
      "text": "Speaker 8: () Yeah. That's great. We'll knock out two of them. Thank you all very much. We'll see in a little while. Thank you. [crosstalk :20]. Thank you. Speaker 11: () Thank you. Thank you. Speaker 12: () Thank you. Thank you. God bless. Speaker 12: () Thank you. Speaker 9: () You're welcome."
    }
  ]
}