{
  "speech_id": "007",
  "speaker": "Trump",
  "title": "Donald Trump Speech Transcript Supporting American Truckers",
  "date": "20200416",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-speech-american-truckers-transcript",
  "topics": "Economy, Healthcare, Infrastructure",
  "num_segments": 22,
  "content": [
    {
      "text": "They are beautiful trucks. That's the real deal. You wouldn't switch jobs with anybody, would you? Speaker 1: () Yes, sir. You wouldn't. I know the truckers, they wouldn't switch with anybody. It's what they love, right? Speaker 2: () [crosstalk :19]. That's why they're good at it. These are the best too. Well, thank you all for being here as we celebrate some of the heroes of our nation's great struggle against the Coronavirus, our brave, bold and incredible truckers."
    },
    {
      "text": "And look at that equipment, they're the best made in great companies also, in companies that have really helped us a lot. We appreciate that. At a time of widespread shutdowns, truck drivers form the lifeblood of our economy and the absolute lifeblood. For days and sometimes weeks on end, truck drivers leave their homes and deliver supplies that American families need and count on during this national crisis and at all other times, they're always there."
    },
    {
      "text": "Their routes connect every farm, hospital, manufacturer, business and community in the country. In the war against the virus, American truckers are the foot soldiers who are really carrying us to victory, and they are. They've done an incredible job. We've had no problems. It's been just great, and we want to thank you very much, it's really great. We have a little special award too."
    },
    {
      "text": "To every trucker listening over the radio or behind the wheel, I know I speak for the 330 million plus Americans, that we say, \"Thank God for truckers.\" That'll be our theme, thank God for truckers. On this special occasion when we honor the truck drivers of America, I'm grateful to be joined by Secretary of Transportation, Elaine Chao, who is doing a fantastic job, and the CEO of the American Trucking Association, Chris Spear. Secretary Chao, please say a few words. Thank you. Thank you, Elaine."
    },
    {
      "text": "You can move that if you'd like. Thank you very much. That's just beautiful. Thank you very much, Elaine. From the moment the invisible enemy landed on our shores, America's 3.5 million truckers have never wavered at all and they've never ever let us down. When we supply our country, we supply it through truckers and supply chains."
    },
    {
      "text": "We're stretched thin to hospitals and cities and states, they needed massive convoys of supplies that truckers kept on going day and night, didn't make any difference to them, they had to get the job done. With us today is, Charlton Paul, a driver with UPS Freight from New York and a leader in the Teamsters Local 707, I know the Teamsters well. I've had many a concrete truck in New York delivering to my buildings as I was building them. Charlton, I want to just thank you for the great job you've done."
    },
    {
      "text": "I have a little special award for each of you. And please come up tell us about your experience, please. Thank you very much. Thank you [inaudible :25]. And we have this for you. This is beautiful. Come on over here [inaudible :28]. This is for you. [inaudible :]. And thank you very much, Charlton. Appreciate it. Great job. We're also joined by, Dylan Madigan, a driver for DHL Express, who's been delivering personal protective equipment to hard hit areas of New Jersey. Dylan, please, say a few words. Thank you."
    },
    {
      "text": "It's been my honor. [inaudible :17] just stay right there [inaudible :19]. We've got this for you, all right? Thank you, Dylan. [crosstalk :30]. Thank you very much. Truckers move over 70% of all freight in the United States, over 10 million tons every single year, truckers keep our economy running. And now in this time of national need, they're saving lives."
    },
    {
      "text": "Here is a very fine gentleman, Steven Richardson, a member of the American Trucking Association from the great state of Tennessee, we love Tennessee, who drives for Big G Express. Steven, please come up and say a few words, please. [inaudible :13]. Thank you very much, great honor. And rich, very rich. That's true. That's true. Here you go. This is for you, Steven. [inaudible :17]. Thank you very much, Steven."
    },
    {
      "text": "In recent weeks, the American people have shown these devoted American workers the love and support like never before. Good Samaritans have set up food services near our highways so truckers can get meals well. Restaurants are closed, it's incredible thing to watch. Fast food restaurants have opened drive through lanes for semi-trucks and truckers and some others that help us out."
    },
    {
      "text": "People have stood in overpasses and on top of highways waving flags and cheering while they drive by and billboards are rising above the roads all over the place, I'm seeing them all over. It says, thank you truckers. I see them all the time. Joining us is an owner, operator, who drives for FedEx Ground, named, Tina Peterson. Tina is an incredible person, an incredible talent, they say. A great driver."
    },
    {
      "text": "She completes an amazing 10 round trip halls with her husband from Saint Paul, Minnesota, to Dallas, Texas, every month. They're a tandem, they drive together. Tina, please come up and say a few words, please. Oh, that's good. Thank you very much. Come forward over here. Do you ever see hello to Fred Smith at all? Do you ever see him? You see him, actually? He's a great guy. Thank you very much. Thank you. Thank you, Tina. Very good."
    },
    {
      "text": "My administration is devoting every ounce of our energy and every fiber in our bodies, to give a tremendous... Really, create a border, create something very powerful against this virus, this horrible virus, to heal the sick, restore the full force of the US economy and do all of the things that we're doing."
    },
    {
      "text": "And by the way, for the media, we have a very important press conference today at six o'clock, we're going to be talking about guidelines that have been very carefully done, we're speaking at three o'clock to the governors and we'll be informing them, and I think there'll be very happy with what we're doing. They want to win this war. We're going to win it. We're going to win it very big and hopefully very soon."
    },
    {
      "text": "No matter what we do, there have been so many lives lost, but the people here have helped us so much and I just... I am so honored to be with them. That's why in recent weeks, we've done everything in our power, that we have to keep our truckers safe, fueled, fed and on the road. And we're also working... I think they'll be happy to know, because they know the roads better than anybody, we're working very strongly on an infrastructure package."
    },
    {
      "text": "And if we could get some Democrats support, we're going to have a tremendous... You're going to have nice roads again, nice beautiful roads again, a $2 trillion, potentially, a $2 trillion package. We eased regulation so that the truckers could be free to drive more hours and to transport emergency relief supplies, including masks and gloves and gowns and groceries."
    },
    {
      "text": "We worked with states to lift burdensome restrictions and ensure that all states' rest areas remain open to support these hardworking men and women on the road. And we also declared that our talented workers at private truck stops are essential employees. They are indeed. I don't know if you know that. Did you know we call you all essential? Very few people called, essential. I don't know if they call me, essential, I'm not sure about that. But you're essential, that I can tell you."
    },
    {
      "text": "But all truck drivers can continue to have warm meals and hot showers, access to mechanics and a place to park at night. We postponed the REAL ID deadline and made sure commercial licenses, learner's permits and medical certificates will not expire while DMVs remain closed, that's a big deal. And because nearly 90% of operators in the trucking industry have fewer than 10 trucks, our paycheck protection program which is a tremendous success... In fact, it is now depleted."
    },
    {
      "text": "$350 billion is now depleted, and we're going for another 250 billion. They want it. They have to have it. This is for companies to give and to make sure that they won't be letting people go, keep the companies together and keep the workers and keep the people that really run those companies, keep them well taken care of. But we're protecting the jobs and wages of countless truckers employed by small businesses."
    },
    {
      "text": "Truckers are playing a critical role in vanquishing the virus and they will be just as important as we work to get our economic engines roaring, which is happening very quickly, you watch. But once we get going, the truckers are going to be working so hard, you're not going to be able to take a day of rest in between, maybe a couple of hours. But they work hard, they work long, nobody works harder, actually. I know a lot about trucking. I know a lot about truckers. And I know plenty of truckers, great people."
    },
    {
      "text": "With the same spirit of faith and grit and abiding patriotism that defines everything they do, we know our truckers will never let us down under any circumstances. They will never let us down. They're always there. They always have been. They always will be. They're very exceptional people. So I say, \"God bless our great truckers. God bless every worker who is serving our nation in this time of need. God bless all who are sick. And God bless America."
    },
    {
      "text": "And thank you for being here.\" And Elaine Chao, I just want to say that we've worked together long and hard, and you have done an incredible job as our Secretary of Transportation. And I have an extra key. I'm going to let the truckers decide, should I give one to Elaine Chao or not? Speaker 3: () [crosstalk :28]. What do you think? Yes? I think so. I think we're going to- Where is Chris? Where is Chris Spear? Come here, Chris. That's big power. Come here, Chris. Come here, Elaine, do that. Come."
    }
  ]
}