{
  "speech_id": "011",
  "title": "Donald Trump Addresses NRA Meeting in Indianapolis Transcript",
  "date": "20230417",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-addresses-nra-meeting-in-indianapolis-transcript",
  "topics": "Gun Control",
  "num_segments": 47,
  "content": [
    {
      "text": "Well, thank you very much and- Well, thank you very much and I'm thrilled to be back with the hardworking, God-fearing, card-carrying patriots of the NRA. Thank you very much, everybody. As a candidate in 2016, I promised you that I would save your Second Amendment from absolute oblation, that's where it was going, and as your president, that's exactly what I did. We saved our Second Amendment and we're going to save it for a long time to come."
    },
    {
      "text": "It's under siege, but we're going to save it for a long time to come. Forever, as far as I'm concerned, forever, and thank you very much. I was proud to be the most pro-gun, pro-Second Amendment president you've ever had in the White House, I think that's been acknowledged, and with your support in 2024, I will be your loyal friend and fearless champion once again as the 47th president of the United States."
    },
    {
      "text": "We have to remember in 2016, we won, we won the first time, and we did better the second time, got a lot more votes. A lot of bad things happened, though, didn't they, huh? A lot of bad things happened. () I want to thank Wayne LaPierre and Charles Cotton for their leadership, as well as all of the people that work with them, the NRA members who make up this incredible organization. It's really a tremendous force for freedom, that's what it is, and I'm very proud to be here."
    },
    {
      "text": "Thanks as well to Congressman Jim Jordan and his incredible wife, Polly. Where is Jim? He's around here someplace. Where's Jim? Also, with them came along Isaac. Do you know Isaac is a wrestler, four-time All-American? If anybody's into sports, even a little bit, four-time All-American's good. Jim was a great wrestler, a lot of people don't know that. His daughter-in-law, Brooke, she's about to have a baby."
    },
    {
      "text": "I said, \"When is the baby coming?\" She said, \"It could be today or tomorrow.\" I said, \"What are you doing here?\" But he's a spectacular congressman, politician, and person, and so I just want to thank Jim and the whole family, and Polly, thank you very much for being here. () Somebody that I believe is going to be and a friend of Jim, and it's going to be your next senator from the great state of Indiana, which I love so much, Jim Banks. Where's Jim Banks? Jim Banks? Jim. Hi, Jim."
    },
    {
      "text": "He's so popular now, he's unopposed. We like it that way, don't we? Thank you very much, Jim. You're doing fantastically well. Indiana Lieutenant Governor Suzanne Crouch, thank you very much. Thank you very much. Suzanne, where is Suzanne? Suzanne, thank you very much. Also, Attorney General Todd Rokita. Todd, where is Todd? He's someplace here, I saw him. It's a big crowd, Todd, that's a big crowd. Thank you very much. Great job, Todd, doing a great job."
    },
    {
      "text": "For seven years, all of us here today have been engaged in an epic struggle against the corrupt forces and communist maniacs, and they're all over the place, that are absolutely trying to destroy our country. They want to take away your guns while throwing open the jailhouse doors and releasing bloodthirsty criminals into your communities. They want to abolish your borders and impoverish your families while spending your money on endless and very, very stupid foreign wars."
    },
    {
      "text": "() They want to demonize patriots and persecute Christians while pushing the transgender cult on your children, children who turn 25 and they say, \"Who did this to me? Who did this to me? How did you let this happen?\" They want to weaponize and interfere with our elections through the use of the DOJ, the FBI, and local attorney generals and district attorneys. That's happening to me, but we're doing very well, thank you. It's actually called election interference, that's all they want to do."
    },
    {
      "text": "I'll tell you what, if I weren't running, which isn't going to happen, or if I was doing badly in the polls, and we're not going to let that happen either, we're killing them in the polls, are you seeing the numbers? They wouldn't be doing anything. They'd be after somebody else. They wouldn't be talking. But we're going to show you some of the polls in a little while, you're going to be amazed. We really made a lot of progress over the last month."
    },
    {
      "text": "() We put it into high gear, like we did for four years when this country had no problems, and then COVID came in and we got it back. When you think about it, it was amazing. We actually left it with a stock market that was higher than just pre-COVID coming in. It was an amazing job that we did. We built it twice, but there was nothing like it. There was nothing like it."
    },
    {
      "text": "Even right to try, I hope nobody needs it, right to try, where you can use this advanced medical treatments that won't be approved for five or six years by the FDA, but we got them to move a lot faster, I will tell you, on everything, but won't be approved by the FDA for years, and we've saved thousands and thousands of lives with right to try. But we did a lot, we did a lot. () 2024 is the year that we will defeat these nation-wrecking globalists, Marxists, RINOs, and tyrants once and for all."
    },
    {
      "text": "The RINOs are in there. In many ways, the RINOs are worse because you don't know where they're coming from. You say, \"Oh, that's a RINO, we don't like that one.\" At least with the Democrats, you know where they're coming from and that's not a good place, is it? If you put me back in the White House, their reign is over and America will be a free nation once again."
    },
    {
      "text": "I promise you this, with me at 1600 Pennsylvania Avenue, no one will lay a finger on your firearms, just as took place for four years when I was your president, I will uphold those glorious words, \"Shall not be infringed.\" Do you know those words? I think you know those words. You know those words? () Every pledge I made to you as a candidate in 2016, I fulfilled as your president. I appointed nearly 300 federal judges to fill the bench with pro- Constitution warriors who interpret the law as written."
    },
    {
      "text": "We have great judges, a lot of great justices, almost 300, a record. I faced down vile attacks from the radical left to confirm three great Supreme Court justices, you know who they are, Neil Gorsuch, Brett Kavanaugh, Amy Coney Barrett, all outstanding people. They don't help me much, I've got to tell you that, they vote against me too much, but one of those little things in life, right? But they are outstanding people and great scholars, brilliant, and they've done a very good job."
    },
    {
      "text": "I always say, \"Except for me, they've done a very good job.\" Standing before you like, \"Show your tax returns,\" that wasn't supposed to happen, right? \"Show you tax returns,\" I thought that wasn't supposed to happen. By the way, I showed them, and you know what happened? Nothing. They said, \"This guy made a lot of money.\" Standing before you at the NRA Leadership Forum in 2019, I revoked America's signature from the globalist United Nations Arms Trade Treaty, which was a disaster."
    },
    {
      "text": "I never surrendered to the globalist left. I always put our term America First, very simple, America First. I canceled Barack Hussein Obama's corrupt use of Social Security data to deny Americans their gun rights without due process of law. You know that very well in this auditorium, I fought Obama's unconstitutional effort to ban 3D-printed guns."
    },
    {
      "text": "I stood up for our hunters, fishers, and sportsmen like no other president has ever done before, opening up millions acres of federal land and rolling back Obama's assaults on hunting, fishing, trapping, and on ammunition itself. When the radical left Democrats tried to use COVID to shut down gun sales during the China virus pandemic, I proudly designated gun and ammunition retailers as critical infrastructure. Do you remember that? Little things like that."
    },
    {
      "text": "It saved all of them, a lot of them are in the room with us today. () My administration also petitioned the Supreme Court to overturn New York City's unconstitutional, so many unconstitutional things are taking place in these Democrat-run cities, but it was an unconstitutional ban on transporting handguns outside of the home, and in a landmark case last June, the court affirmed that the right to self-defense does not end when you step outside the front door of your house."
    },
    {
      "text": "We did all of this and we did so much more working now and going to finish everything that we started. We finished a lot it already in the four years, but we have things to do and we have things to finish and we're going to get that done. We're going to have a big, big, successful election coming up. We're going to take back that beautiful, gorgeous White House. () In year one of my new term, I will stop Joe Biden's war on lawful gun owners. It's a war, what they're doing is crazy, so many things are crazy."
    },
    {
      "text": "Let's say no borders, high taxes, everything they do. I made a speech recently and I used this term, and I didn't even know we were using it, but I used it, \"Every day is like April Fool's Day.\" We want no borders. No, no, no, you've got to have borders. That it was like getting into the Wharton School of Finance or getting into Harvard or getting into a great college. That was a great thing. And they endorsed me very early and it was a great honor. We did a great job."
    },
    {
      "text": "And they better endorse me again, or they're going to have some explaining to do. They'll have some explaining to today. No, I do believe we're in pretty good shape, but when you see the polls in a little while, you can understand that we're in pretty good shape. () I've never seen such spirit as there is right now."
    },
    {
      "text": "And part of that, sadly, is because they are doing such a horrible job of running our country, which is really destroying our country, and I think it makes us even more popular to be honest with you. They're doing such a horrible job. What they're doing is destroying our great country. I want to congratulate you for fighting it so bravely, all of the things that have been happening to you. The racist in reverse, ran for office on the promise, \" I will get Trump.\" You ever see the commercial? \"I will get Trump."
    },
    {
      "text": "I'm going to get him.\" Didn't know anything about me, she's running for office. I said, \"Who is that maniac?\" But I'm watching her campaign and a lot of people in the race and get a few people that vote, very few people actually it takes to get in. But she proclaimed, \"I look forward to going into the Office of Attorney General every single day suing him and then going home, being very happy.\" I said, \"Oh gee, I hope she gets in."
    },
    {
      "text": "I hope she wins.\" But she announced, \"What is fueling my soul right now is Trump, getting Trump.\" And she knows nothing about me. () So it's not an investigation, you're going through the same thing, it's a persecution. Just like her attacks on the NRA and just like the witch hunts against us by the Manhattan DA, the Marxist DA in Atlanta, and the guy I have watching, this guy's central casting, the guy from Washington special prosecutor. They say special counsel, I call it a prosecutor, it's much better."
    },
    {
      "text": "They're looking at the boxes hoax. Biden has 1,850 boxes that are unaccounted for. He had many boxes in Chinatown, classified information, many boxes. They got them out of there, but they got caught. It's called obstruction. And they sent them up to Boston and they sit up in Boston and then it was revealed that he got millions of dollars from the Chinese. He got millions of dollars. But he has boxes in Chinatown, boxes all over the place. They don't care about that, they only care about Trump."
    },
    {
      "text": "() But they're trying to arrest their political opposition, it's really very much like the old Soviet Union. They called Soviet style with elections and with the interference. They're interfering with the election, that's what they're doing. It's going to be hard for them to get away with the kind of corruption they did when they had COVID because COVID made a lot of things bad for a lot of people, but they cheated and going to be hard."
    },
    {
      "text": "So now I really believe they're going the prosecutorial way, that's the route. Where they use prosecutors to... () Don't forget if you're a... With me, it's sort of interesting because my numbers have gone way up, you explain this to me. My numbers have gone way up. But other people, because you know me, the truth is the American public knows me well and they know that's my deal, but they don't know a lot of people running for office."
    },
    {
      "text": "So if you have a young good Republican running for office gets a subpoena and then they leak it out to the papers, it's impossible for this guy to win a race. But the good news is we've gone way up. So we've done something that I don't believe has ever done before, and we're going to stay there and we're going to go even higher if we can. I'm not sure you can go higher, but we're going to go even higher if you can because we have to save our country."
    },
    {
      "text": "They're not coming after me, they're coming after you and I'm just sort of in the way. I'm in of these people. () And as everybody knows, it's all because we're leading so big in the polls, not only against Republicans, but also against Joe Biden. And if you take a look this week's morning consult poll I led the field by 33 points with Trump 56 DeSanctis 23, Pence 5. I hope you gave Pence a good warm approval because he is a nice man, if you want to really know the truth. He is, he's a good man."
    },
    {
      "text": "And I heard it was very rough. It's a big news story. You've made news today. I don't know what you did, but you made news today with the introduction you gave. Nikki Haley, that's another, that's a beauty, she's at 4 and Abbott's at 1. I don't think Abbott's going to run, Governor of Texas. In a two-way poll of Florida last week it was Trump 47 and DeSanctis 32%. And there was another poll in Florida where Trump was at 80 and DeSanctis was at 50, and that's a Florida poll."
    },
    {
      "text": "In Texas it's Trump, 52% DeSanctis 20, Pence 5, Haley 4. () The only way we can lose is if we go prevent defense. Do you agree? Do you know what that means? In football where they're holding the team to no score and then they go prevent the last two minutes and they lose the game. We will never go prevent. But you can take a look on the screen and you'll see some of these things posted and they're really big polls. Massachusetts were leading by I think like 45, almost 50 points."
    },
    {
      "text": "In New Hampshire we're leading by a lot. In Iowa the farmers can never vote for me. I got China to pay the farmers $28 billion for the damage that they caused. I said, \"You got to pay.\" And so you see some of these, I just thought you'd put them up. Remember in the old days, I used to always announce polls only if they were good, I wouldn't announce them if they weren't good. If I had a bad one, I would. But when they were good I used to drive the opposition crazy."
    },
    {
      "text": "() But we're leading Biden now by a lot, 7 points, 9 points and a 10 point, but seven points in the last Rasmussen poll. And I am the one that they don't want to run against, that's why they're coming after me like this. If they wanted me to run, they'd say, \"Oh no. He is the most perfect human being we've ever seen.\" Instead, they put these monsters in there, they put these radical left crazy people in. They're the party of disinformation, remember that. What they say, you can usually go the opposite."
    },
    {
      "text": "They say, \"Oh yeah, we want to run against Trump.\" In the meantime, they got 5,000 prosecutors after my ass. \"We want to run against him so bad, we're going to run against him. That's the guy we want Trump. By the way, please take him out of politics. Please get him out as fast as you can.\" Nah, they're the party of disinformation or misinformation, nobody knows the difference but they're pretty close. () It's no wonder that the far left crazies are engaging in election interference on a historic scale."
    },
    {
      "text": "Nobody outside of this country, nobody has ever seen anything like what's happening now with the prosecutors, these Marxist prosecutors, who release rapists and murderers while persecuting conservatives. On day one of my new administration I will direct the DOJ with a very strong leader, not like Barr, not like Bill Barr. What a disaster he was. He was a rhino. He was afraid of being impeached. \"Please, I don't want to be impeached.\" So how do you not get impeached? Don't do anything. You don't do anything."
    },
    {
      "text": "Remember they were going to impeach him and then all of a sudden he actually said, no, he didn't see any wrongdoing in the election. My young son, very young, saw a lot of wrongdoing in the election every. Did anybody in this room can they say they didn't see any wrong? That was the worst horror show, I think one of the greatest criminal acts ever, the election of 2020. But we will turn that around and it'll be even bigger. You know what? It'll be even bigger. If you think about it, it'll be even bigger."
    },
    {
      "text": "Be much bigger than having one. We'll be able to do things we could have never done because they have shown so bad. In other words, they want to show us. Well, they showed us. We have no energy. We have massive crime. Our military doesn't work. Nobody respects us in the whole world. I mean, there's not a leader that respects our leader. We will show them through this horrible four years that we're going through. The problem is we can't take any more of it because we're not going to have a country left."
    },
    {
      "text": "But we will show them that we can do things and we'll be able to do things on crime and other elements of society we'll be able to do things that you probably wouldn't have been able to do if you just carried it forward. So I think it's actually much bigger, this could be much bigger than if we went the more traditional route. () I will direct the DOJ to investigate every radical DA and attorney general and American for their illegal race in reverse based enforcement of the law."
    },
    {
      "text": "I will then appoint a team of warrior US attorneys, and I know know some great ones including from this area, who will be the polar opposite of the DeSoro's district attorneys. These guys, I mean, what they're thinking? Who can believe... I mean, they're not stupid people. They're not stupid people. There's two things. They're either stupid or they hate our country, and I don't think they're stupid because anybody that can cheat so well in election, they're not stupid."
    },
    {
      "text": "That means they hate our country and I believe they hate our country. They will be the 100 most ferocious crime fighters in American history and I will task them with demolishing every gang, street crew and criminal network they can find piece by piece until public safety is fully restored, and that means in Democrat run cities. () And at the top of the list is Washington DC itself, which is absolutely plagued by numbers and crime that nobody's ever seen before."
    },
    {
      "text": "We've never seen anything like what's happening in Washington DC. Can you imagine these foreign leaders coming over from countries and they're looking at this filth and squalor and crime in our capitol? And I think we have to take it over. We have to take over management of our capitol because the people that are running, including the mayor who did nothing about January 6th, he was the one, \"No, we don't need anybody. We don't need any help.\" Along with crazy Nancy Pelosi, they did nothing."
    },
    {
      "text": "They did absolutely nothing. They were supposed to. They're in charge of it. But all of our Democrat run cities are being absolutely ruined and destroyed. As we sit here and talk, they're being ruined. I will order the ATF to stop bullying gun store owners and wanting to shut them down for paperwork errors and instead go after drug dealers, human traffickers and criminal cartels, which is what they should be going after."
    },
    {
      "text": "() Under Biden other countries are emptying out their prisons insane asylums and mental institutions and sending them right here to the USA. Can you imagine? Prisons and mental are being emptied out? I read a story not long ago where a man who takes care of a large segment of people in a mental institution in a South American country, a doctor, sounded like a great man actually, he said he no longer has anything to do. He used to work 24 hour days."
    },
    {
      "text": "He said, \"All of our patients have been released into the United States of America.\" And this is what we have. This is what we've allowed to happen. And we can't allow this to happen because we will not have a country any longer. We can't allow it to happen. () Under my leadership, we will quickly restore the most secure border in US history."
    },
    {
      "text": "We had the strongest border in history, and now we have, I think, the worst border in the history of the world because no country, even a Third World country, would allow what's happening right now to us to happen to them. The first reconciliation Bill I signed for a massive increase in border patrol. These Border Patrol and Brandon Judd and all of his people, they're incredible, the job they do. Tom Homan as a man that knows it, you see him on television, I call him central casting."
    },
    {
      "text": "But these two guys and all of the people that work with him, they're so good. They want to do their job. It's going to be a colossal increase in the number of ICE and Border Patrol, deportation offices following the Eisenhower model. I don't know if you know Dwight Eisenhower was very tough on the subject. We will use all necessary state, local, federal, and military resources to carry out the largest domestic deportation operation in American history."
    },
    {
      "text": "And I will ask every state and federal agency to identify every known or suspected gang member in America. And every one of them that is here legally we will pick them up and we will send them back to the country from which they came as we restore safety to our streets."
    }
  ]
}