{
  "speech_id": "017",
  "title": "Donald Trump Mike Pence Earth Day Speech Transcript",
  "date": "20200422",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-mike-pence-earth-day-speech-transcript",
  "topics": "Healthcare, Government Policy, Climate",
  "num_segments": 12,
  "content": [
    {
      "text": "... and the upcoming Arbor Day and that's going to be... Tell me David. That's right. Friday. Thank you. As more than 180 nations around the world battle the vicious coronavirus, we continue to mourn the precious souls who have been lost, so sadly lost, and so unnecessarily lost. It should have been stopped and it should've been stopped right where it started, and everyone knows where it started. But in this time of trial, the beauty of springtime fills us with the peace and the hope of renewal."
    },
    {
      "text": "We're pleased to be joined by our great Vice President, Mike Pence. Please Mike, stand up. You have done such a great job on getting us open again. We're opening again, Mike. It's starting to move. A lot of states are in great shape and they're starting to move it along. And very importantly, Karen Pence has been so fantastic and done such a great job representing the country. Thank you, Karen. Beautiful job. Also here are Secretaries David Bernhardt, Sonny Perdue, Administrator Wheeler, Andrew Wheeler. Thank you."
    },
    {
      "text": "And Leader, Kevin McCarthy, and what a job he's done and good vote the other day, yesterday. That was good. But previous to that. And when are you voting on the- Thursday? Good. Is that a guarantee or... There's no guarantee. There's never a guarantee when you're dealing with people. Right? But anyway, but it's in good shape, right? Yeah. Thank you Kevin, very much. On this special occasion we are renewing our strong national commitment on conserving the wonders of God's creation."
    },
    {
      "text": "One of the most important ways we uphold this tradition is by protecting our priceless national parks and our public lands. To support our rollout war against the virus, many of the places that we have here we're temporary closing, but we will have them open quickly. As we said, we're starting to open our country again."
    },
    {
      "text": "Thanks to our significant progress against the invisible enemy, I'm pleased to announce that in line with my administration's guidelines for opening up America again, we will begin to reopen our national parks and public lands for the American people to enjoy. What does that tell us about that, David? Right. Roll out. Good. When will they start? That's great. Okay. That's going to be very exciting. That's going to be very exciting. You have a lot of land to open up to, don't you have."
    },
    {
      "text": "People are going to be very happy. On this Earth Day, we celebrate that America leads the world in environmental stewardship, which is so, so true. I see it. I see the love and devotion that so many people like David, like you give, and that we continue to have among the cleanest air in the cleanest water anywhere on the planet Earth."
    },
    {
      "text": "We're also honoring our country's heritage of conservation, including through the supportive 1 trillion trees and that's the 1 trillion tree initiative, which is a very big deal we'll be planting over a period of time 1 trillion trees. That's a lot of trees. Kevin, how do we do that? Do you have any ideas? That's great. That's great. That's going to be exciting."
    },
    {
      "text": "As a sign of our dedication in a few moments, the First Lady and I will plant a maple tree right here on the South Lawn of the White House wherever the tree is. Where is this tree now? That's a beautiful straight trunk. That's a triple A tree. That's great. As our nation grows stronger and greater in the months and years to come and we will. We will be bigger, better, stronger than ever before. You watch what's happening. You see it happening already."
    },
    {
      "text": "There's such spirit with the concept of the state starting to open. Such incredible spirit. This tree will grow also. It will stand tall and beautiful and the future generations will be looking at it and they'll say, \"I wonder who planted that tree.\" They will say it was Kevin and David and Mike and Karen and a whole group of people. We really appreciate it. But they'll be a admiring this tree and there'll be admiring nine more trees. We're planting 10 beautiful specimen trees. They're specimens, all specimens."
    },
    {
      "text": "People may think that's an exaggeration or that's a Trump term. Actually they're sold as specimens. They cost more money but they are better. I buy a lot of them. Now I'd like to invite the Vice President up and Karen to say a few words please. Thank you. Thank you very much. Kevin, would you come up and say a few words? Why don't you stay right there, Mike? Perfect. Thank you, Kevin. It was beautiful. Thank you. He gave a lot of facts that a lot of people didn't know, including me. I thought that..."
    },
    {
      "text": "I just spoke with our great First Lady and she said, \"You know, it'd be wonderful for Karen Pence to say a few words.\" People have no idea the incredible job Karen Pence does representing this nation. Everybody loves her. She's special in every way. Karen, I'd like to have you say a few words please. She didn't know this, but I'd like [inaudible :59]. That was very nice. Thank you, Karen. That's great. That's beautiful. Mike, let's go over and do it. We ready? Mike, stay right here. Come on, get over here."
    },
    {
      "text": "Karen, you grab that shovel. Come on. You grab it together. Are you ready? Let's go. Yeah, we'll do one [inaudible :22] and then we'll let everyone. [crosstalk :32]. Ready? You grab one. We'll do it. Okay. That's good. That's good. Thank [inaudible :53]. Sonny? David? Kevin, come on up here. We have plenty of dirt left. Come on. Come up, fellas. This is [inaudible :05]. Yeah. [crosstalk :07]. [crosstalk :12]. Ready? There you go. Okay. Thank you all. Thank you all. Let's go. Thank you very much everybody. Thank you. Thank you very much."
    }
  ]
}