{
  "speech_id": "023",
  "speaker": "Trump",
  "title": "Donald Trump Coronavirus Press Conference Transcript April 27",
  "date": "20200427",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-coronavirus-press-conference-transcript-april-27",
  "topics": "Healthcare, Economy, Government Policy",
  "num_segments": 55,
  "content": [
    {
      "text": "Thank you very much. Thank you. Today I'd like to provide you with an update in our war against the coronavirus. Thanks to our comprehensive strategy and extraordinary devotion to our citizens. We've had such tremendous support all over. We continue to see encouraging signs of progress. Cases in New York area, New Orleans, Detroit, Boston, and Houston are declining. Denver, Seattle, Philadelphia, Washington DC, Atlanta, Nashville, Indianapolis, and St Louis are all stable and declining."
    },
    {
      "text": "All parts of the country are either in good shape, getting better, in all cases, getting better, and we're seeing very little that we're going to look at as a superseding hotspot. Things are moving along really a horrible situation that we've been confronted with, but they're moving along. As we express our gratitude for these hard-fought gains however, we continue to mourn with thousands of families across the country whose loved ones have been stolen from us by the invisible enemy."
    },
    {
      "text": "We grieve by their side as one family, this great American family, and we do grieve. We also stand in solidarity with the thousands of Americans who are ill and waging a brave fight against the virus. We're doing everything in our power to heal the sick and to gradually reopen our nation and to safely get our people back to work. They want to get back to work and they want to get back to work soon."
    },
    {
      "text": "There's a hunger for getting our country back and it's happening and it's happening faster than people would think. Ensuring the health of our economy is vital to ensuring the health of our nation. These goals work in tandem. They work side by side. It's clear that our aggressive strategy to slow the spread has been working and is saving countless lives. For those who are infected. We've taken unprecedented action to ensure they have the highest level of care anywhere in the world."
    },
    {
      "text": "Some of our greatest executives, some of the greatest anywhere in the world, and distributed over 10,000 ventilators and we now have in a very short period of time, many have been delivered and hundreds of thousands are being built and frankly, every governor has more ventilators right now than they know what to do with."
    },
    {
      "text": "They're actually shipping them to different locations and we're shipping some to our allies and others throughout the world because we have ventilators like the job that they've done and getting this very complex piece of equipment built is actually incredible. You don't hear about ventilators anymore except in a positive way. We've launched the most ambitious testing effort, likewise on earth."
    },
    {
      "text": "The United States has now conducted more than 5.4 million tests, nearly double the number tested in any other country more than twice as much as any other country. Think of that. Moments ago, I came from a meeting with some of our nation's largest retailers, including Walmart, Walgreens, CVS, Rite Aid, and Kroger."
    },
    {
      "text": "We're a joined by the leaders of those great companies and we also have with us the leaders from the world's top medical diagnostics companies and suppliers, Thermo Fisher, LabCorp Quest, [US Carlton :] and the American Clinical Laboratory Association. These are great companies. These private sector leaders along with others such as Roche, Abbott, Becton Dickinson, Hologic and Cepheid have been exceptional partners in an unprecedented drive to expand the state's capabilities and our country's capabilities."
    },
    {
      "text": "The job they've done has been incredible. The testing that's been developed and being developed right now has been truly an amazing thing. I want to thank Abbott Laboratories for the job they've done. I want to thank Roche and in particular those two have really stepped forward Abbott with a five minute test that people can take and in five minutes they know what the answer is. I'd like to ask if I could, the executives of these great companies and they have really helped us a lot over the last 45-day period."
    },
    {
      "text": "We're talking about a 45-day period when many of us met and since then what Walmart and the others have done has been nothing short of amazing. I just want to ask them to come forward and say a few words about their company plus they're going to make a big contribution to our country. Please come forward please. Thank you. Come on up. Thanks. Thanks very much. Thank you very much. Thank you gentlemen. Please go ahead. Thank you very much. Great job. Thank you. Thank you very much. Great job. Thank you very much. Great job."
    },
    {
      "text": "Thank you. Great job. Thank you very much. Thank you very much. Thank you. Thank you. Great job. Thank you. Very few understood that we have tremendous capacity. Then one week ago we provided each governor with a list of names, addresses, and phone numbers of the labs where they could find additional testing capacity in their state. Within 48 hours, the number of tests performed across the country began to absolutely skyrocket."
    },
    {
      "text": "On Saturday alone, more than 200,000 test results were reported, which is a gigantic number, bigger than any country, anywhere in the world for a much longer period of time. A number that is an increase earlier in the month when we tested roughly less than 100,000 a day so we much more than doubled it and that will be doubling again very shortly."
    },
    {
      "text": "We are continuing to rapidly expand our capacity and confident that we have enough testing to begin reopening and the reopening process we want to get our country open and the testing is not going to be a problem at all. In fact, it's going to be one of the great assets that we have. Today were releasing additional guidance on testing to inform the States as they develop their plans for a phased and very safe reopening."
    },
    {
      "text": "Our blueprint describes how States should unlock their full capacity, expand the number of testing platforms, establish monitoring systems to detect local outbreaks and conduct contact tracing. We have it all other countries that calling to find out what are we doing and how do you do it and we're helping them with dealing with a lot of countries, helping them on testing just like we did on the ventilators."
    },
    {
      "text": "I directed our Medicare program to make it easier for seniors to get the testing that they need and the pharmacies... as you know, we are allowing pharmacies now to do testing and we have other testing locations that we're going to be allowing also. But having pharmacies get involved in testing is a very big deal. We're also asking governors to do the same in their Medicaid program, so they are going to be able and authorized to do the same in Medicaid. So it's a big, that's a big deal."
    },
    {
      "text": "So we're deploying the full power and strength of the federal government to help States, cities to help local government get this horrible plague over with and over with fast. There is tremendous energy in our country right now. There's energy like people haven't seen in a long time, a spirit that they have not seen. And we're doing very well, very well considering what happened to us and considering if you look at what happened to others, this is something that the world has not seen for a long, long time."
    },
    {
      "text": "You can probably go back to 1917 where it was a terrible period of time. You all know what happened in 1917 that's over 100 years ago. With that, I'd like to introduce if I might, Dr Birx, if you could come up and then Edmond you'll come up and between the two of you, you'll explain the entire process and how much progress we've made and where we're going. Thank you very much. Dr. Very good. Thank you. Admiral please. Great job."
    },
    {
      "text": "Okay, so with that we're here to answer some questions and Mike is up here also, so we'll answer. Steve, please go ahead. We want them to do it. We recommend that they do it as quickly as possible, but safely. We want everyone to be safe. And I think you're seeing that, you're seeing a lot of governors get out and they want to open it up. Many are thinking about their school system, not a long way to go in the school system right now for this season, for this year."
    },
    {
      "text": "But, I think you'll see a lot of schools open up, even if it's for a very short period of time. I think it would be a good thing. Because as you see, in terms of what this vicious virus goes after, young people seem to do very well. Young people seem to do very well. So I know that there are some governors that aren't necessarily ready to open up their states, but they may be ready to open up their school systems. We'll see. But that's their choice. But the word is safety. Okay? Rapid. But safety. Yeah. Please."
    },
    {
      "text": "Go ahead, please. Well, I think it's a very unfair question. Because you have many great professionals, some of them you have great respect for. And you have many people on the other party, you mentioned Alex Azar, but you have many people in the other party that have said the same thing and with even more confidence. So a lot of people didn't get that right. I was very fortunate, whether it was through luck or whatever, that we closed the border. We put a ban on China other than our citizens coming in."
    },
    {
      "text": "We had our citizens, you can't keep out American citizens. You know, \"Gee, you can't come back into your country,\" that's a little tough to do. But we put a ban on China, that was very fortunate. But I could tell you that Nancy Pelosi was dancing in the streets in Chinatown. She wanted to go, \"Let's go out and party.\" That was late into February, so you don't mention that, but you could mention that. Go ahead. Any other? Please, go ahead. Go ahead. Yeah please, stand up. You should have no complaints. Please."
    },
    {
      "text": "Well, I can only say what we're doing. We're reporting very accurately. If you look at other countries, other countries are not. I mean, you can look at China, you can look at numerous countries where I don't think those are right numbers. I can only say what we're doing. It's very important to us to do very accurate reporting and that's what we're doing. John, go ahead please. Thank you, please John? Well, I just came out and I hadn't heard. I heard there was a glitch. We'll find out whether or not that's so."
    },
    {
      "text": "Certainly it did work out very well for the original amount of money. This is the second amount and I'll find out about that. We're relying on the banks to go out and do an accurate job. Yeah, please. In the back. Well, I wouldn't mind doing that. I don't know what the legal status of something like that. I would like to do that, as far as I'm concerned. I'm not involved in that process, but I would certainly like to have it listed."
    },
    {
      "text": "I'd have to find out if there's a legal problem, but if there isn't I would do it gladly. Please. Well, Charlie, there are a lot of ways you can hold them accountable. We're doing very serious investigations, as you probably know. We are not happy with China, we are not happy with that whole situation. Because we believe it could have been stopped at the source, it could have been stopped quickly and it wouldn't have spread all over the world. We think that should have happened."
    },
    {
      "text": "So, we'll let you know at the appropriate time. But we are doing serious investigations. Well, we've already discussed that and especially having to do with supplies, and others. If you look prior to this virus, the deficit was coming way down under my administration because I put massive tariffs on China. We took in tens of billions of dollars, gave some of it to the farmers who were unfairly targeted by China. Nobody's ever done that before. We never took in ten cents from China."
    },
    {
      "text": "Now all of a sudden, I think you know very well, we've taken in tens of billions of dollars. I helped the farmers by giving them, two years ago, $12 billion all coming from China. And we had plenty of leftover, too. And then the following year, 16 billion and this year we're also going to help our farmers. But nobody's ever done a thing like that because they were targeted unfairly by China. So we're doing a very strong investigation and we'll let you know what the result of that is."
    },
    {
      "text": "We should be able to get the answers, too. Go ahead, please. Speaker 5: () As you talk about potentially reopening up America again, as we see in the slides behind you, what data are you going to look at in the future to see if restrictions need to be reimposed? Yeah, we're looking very much, and reliant very much on the local areas, the governors. And that's been the way it has been for me, maybe not for everybody, but for me that's the way it's been at the beginning and from the beginning."
    },
    {
      "text": "The governors, some of them are doing an extraordinary job, not all of them, but some of them. And I think all of them, maybe, hasn't had a chance to do that. Some will be a little bit different. The areas are much different. Manhattan is much different than Montana. You have a lot of different circumstances. And obviously, if you look at the virus, it hits some areas, hasn't hit very much other areas not even at all. Almost not at all. But the entire country has been infected."
    },
    {
      "text": "West Virginia, as an example, I spoke to Jim Justice, the governor of West Virginia. And they were a long before anything hit, and they had numerous deaths even in West Virginia, and they were really the last one to be hit. So we're dealing with the governors. We had a really great call today, as I told you, very, very solid. These were not complaining people. These were people that... They had everything they needed, they had their ventilators, they have their testing."
    },
    {
      "text": "They see their testing is growing, they're growing their testing, we're helping them. We're getting them what they need. I'm sure some of you are on the line, even though you weren't supposed to be, and I think you know what the result of that call was. Please, go ahead. Speaker 6: () Following up on Charlie's question on making China, holding them responsible. Germany sent a bill to China for 130 billion Euros for the damages caused by the coronavirus. Would your administration look at doing the same?"
    },
    {
      "text": "Well, we can do something much easier than that. We have ways of doing things a lot easier than that. But Germany's looking at things and we're looking at things. And we're talking about a lot more money than Germany's talking about. Yeah. Please, go ahead. We haven't determined the final amount yet. It's very substantial. If you look at the world, I mean, this is worldwide damage. This is damage to the US, but this is damaged to the world. Yeah, please. Well, you'd have to ask Attorney General Barr."
    },
    {
      "text": "But I think he wants to see, like everybody, he wants to see people get back and wants to see people get back to work. He doesn't want people to be held up when there's no reason for doing it. In some cases, perhaps, it's too strict. He wants to make sure that people have their rights and they maintain their rights. Very importantly. So, a lot of people would agree with him. But you'd actually have to ask that question specifically, from a legal standpoint, to Attorney General Barr. It would depend on the state."
    },
    {
      "text": "It would depend on the circumstances of the state. But some states are perhaps a little early and some states are a little bit late. And the Attorney General... I read that and I saw that, and frankly, the Attorney General doesn't want to have rights taken away. Because, there are some people that aren't allowed to open up a store, they're going to lose their livelihood. And by the way, that causes death, also. Between all of the things that happen, and this has been a big study."
    },
    {
      "text": "The fact that people aren't allowed to have their freedom causes a tremendous amount of problems, including death. So that's what he's talking about. Please, in the back. Speaker 7: () ... now and in other states. Governor Larry Hogan specifically said they've seen a spike in people using disinfectant after your comments last week. I know you said they were sarcastic, but do you take- I can't imagine why, I can't imagine why. Yeah. Speaker 7: () ...take any responsibility if someone where to die?"
    },
    {
      "text": "No, I can't imagine, I can't imagine that. Yeah, go ahead please. Speaker 8: () ...President. Dr. Anthony Fauci says that we need to increase testing by double it, at least. And so does the Rockefeller Foundation. When are we going to be doubling testing? It doesn't really matter what they say there, and we just left him. We just had a meeting. Because we're going to have much more than double it, very soon."
    },
    {
      "text": "Now there are big believers in testing and then there are some governors that don't feel as strongly about it at all. You understand that, they feel much differently about it. But we're going with maximum testing because it's something we're very capable of doing. But we'll be much more than doubled. You know, Mike, I'd like you to answer that. We're going to be much higher than doubled on testing very shortly. Mike, please. Go ahead, John."
    },
    {
      "text": "I think it's very important to know, and this you can get from any other country I think if they're being honest, not only do we have the most testing in the world by far, but we have by far the best testing. OAN please. Go ahead. Speaker 9: () Mr. President, thank you. As I'd like to switch gears and talk about general Flynn. There are reports circulating now that he may well be fully exonerated this week. If that were the case, is there any reason why you would not bring him back into the administration?"
    },
    {
      "text": "I will only say this. I think that general Flynn is a wonderful man, he had a wonderful career, and it was a disgrace what happened to general Flynn. Let's see what happens now. But what happened to general Flynn should never happen again in our country. What happened to other people should never happen again in our country. What happened to your president of the United States should never again be allowed to happen. Go ahead please. Speaker 10: () Mr. President, thank you."
    },
    {
      "text": "Today, one of your top economic advisors, Kevin Hassett, he said that the US is likely to experience a 20 to 30% decline in the GDP in the second quarter, the worst since the great depression. Do you agree with that assessment? I don't know, but I can tell you the third and the fourth quarter in particular are going to be, I think, spectacular. We were talking about it with the executives. I think we're going to have a phenomenal third quarter. Nobody except one country can be held accountable for what happened."
    },
    {
      "text": "Nobody's blaming anybody here. We're looking at a group of people that should have stopped it at the source. But so what happens in second happens in second. What we are doing is I think we're going to have, you're going to see a big rise in the third, but you're going to see an incredible fourth quarter and you're going to have an incredible next year. I think you're going to have a recovery. Look. I built, they were just telling me inside and it's fact, I built the greatest economy."
    },
    {
      "text": "With the help of 325 million people, I built the greatest economy in the history of the world. And one day because of something that should have never been allowed to happen, we had to close our country, we had to close our economy. I built it. We had the best employment numbers and the best unemployment numbers for Hispanic American, for African American, for Asian American, for everybody, best stock market numbers."
    },
    {
      "text": "And by the way, the stock market was up very substantially today and people are seeing a lot of good things. A lot of very smart people investing in the stock market right now. It's at 24,000, approximately 24,000. And if you would have said with the tragedy that this country had to endure and go through, with all of the death and the people that died and were so badly hurt by what happened. And you can only say God bless them. But if you would have said that our country would be in the position we're now."
    },
    {
      "text": "We're ready to move forward. We'll never forget loved ones. We'll never forget these great people that sacrifice for a reason of incompetence or something else other than incompetence, what happened at a point where they could have protected the whole world. Not just us, the whole world. But we had the greatest economy ever in the history of our world. And I had to turn it off in order to get to a point where we are today. And now we're making a comeback."
    },
    {
      "text": "And I think we're going to have economically, from an economic standpoint, next year an unbelievable year. And I think that you're going to see a fantastic fourth quarter and the third quarter, we'll start to build. But the second quarter, obviously you're going to have GDP lack of growth. I'm looking at the head of Walmart. What a job Walmart's done in going through something. They were doing yeoman's work, including getting us millions of really very, very protective outfits."
    },
    {
      "text": "And the job that Doug and Walmart did was incredible. Millions of outfits. And those are high quality. I've seen them. Those are high quality. That's what we need. So people have stepped up to the plate. I think we're going to have a really good. I think it's going to start building. I think it's going to build fast. I think it will be a tremendous, tremendous comeback. And so I say, I built the greatest economy."
    },
    {
      "text": "With all of the people that helped me and all of the people in this country, we built the greatest economy the world has ever seen. And we're going to do it again. And it's not going to be that long. Okay. Yes, please go ahead. Speaker 11: () Mr. President, opening up the country, how long will you keep up the travel restrictions for Europe? Well, we're looking at that and it depends on how long it's taking Europe to heal. Italy is starting to make a comeback."
    },
    {
      "text": "I'm very happy to see that with my friend, the prime minister. It's tragic what went on in Italy, and Spain, and France, and Germany frankly, and every country over there. It's tragic. But we'll be looking at what's happening in Europe and certainly we want to do that and they want to do it too. They want to do it very badly. Yeah. Speaker 12: () Do you have any update on Kim Jong-un's health? Say it. Speaker 12: () Have you gotten any update on Kim Jong-un's health? Has he responded to your letter from March?"
    },
    {
      "text": "On Kim Jong-un? I can't tell you exactly. Yes. I do have a very good idea but I can't talk about it now. I just wish him well. I've had a very good relationship with Kim Jong-un. If I weren't president, you'd be in war. You would have been in war with Korea. You would have been in war with North Korea if I wasn't president. That I can tell you. He expected that. That I can tell you. I hope he's fine. I do know how he's doing relatively speaking. We will see. You'll probably be hearing in the not too distant future."
    },
    {
      "text": "All right, one or two more. Go ahead. Please. Speaker 12: () Are you confirming he's alive? Speaker 13: () Yeah, I had a question about the 2020 election. Your likely Democratic opponent, Joe Biden, recently suggested that you were considering changing the date of the election, that you might try something like that. That's my first question. The second question is- I never even thought of changing the date of the election. Why would I do that? November 3rd, it's a good number."
    },
    {
      "text": "No, I look forward to that election and that was just made up propaganda, not by him but by some of the many people that are working, writing little statements. I see all the time statement made, you say so statement made per Joe Biden, Sleepy Joe. He didn't make those statements but somebody did. But they said he made it. No, let him know I'm not thinking about it at all. Not at all. Go ahead, in the back please. Please."
    },
    {
      "text": "Speaker 14: (:37) The bipartisan Senate Intelligence Committee came out with the fourth installment of this report. It concluded that Russia interfered in the 2016 elections and there was not political bias. Do you accept its conclusions? Oh, I don't know. I haven't seen the report. I haven't seen the report. Yeah, please go ahead. Speaker 15: (:51) President, nice to see you."
    },
    {
      "text": "I think you have a good relationship with North Korea and with Kim Jong-un, but last Saturday, Senator Graham, he mentioned in the Fox News, he interviewed. He said that- He didn't say anything last Saturday. Speaker 15: (:12) ... that Kim Jong-un- Nobody knows where he is, so he obviously couldn't have said it. If you have a... This is breaking news that Kim Jung-un made a statement on Saturday. I don't think so. Speaker 15: (:22) But anyways- Okay, go ahead. Let's do one more. Please, in the back."
    },
    {
      "text": "Speaker 16: (:26) If an American president loses more Americans over the course of six weeks than died in the entirety of the Vietnam War, does he deserve to be reelected? So yeah, we've lost a lot of people, but if you look at what original projections were, 2.2 million, we're probably heading to 60 thousand, 70 thousand. It's far too many. One person is too many for this. And I think we've made a lot of really good decisions."
    },
    {
      "text": "The big decision was closing the border or doing the ban, people coming in from China. Obviously other than American citizens which had to come in. Can't say you can't come back to your country. I think we've made a lot of good decisions. I think that Mike Pence and the task force have done a fantastic job. I think that everybody working on the ventilators, you see what we've done there, have done unbelievable. The press doesn't talk about ventilators anymore."
    },
    {
      "text": "They just don't want to talk about them and that's okay. But the reason they don't want to talk... That was a subject that nobody would get off of. They don't want to talk about them. We're in the same position on testing. We are lapping the world on testing and the world is coming to us. As I said, they're coming to us saying, \"What are you doing? How do you do it?\" We're helping them. So, no, I think we've done a great job and one person, I will say this, one person is too many. Thank you all very much. Thank you."
    }
  ]
}