{
  "speech_id": "024",
  "title": "Donald Trump Small Business Relief Speech Transcript April 28",
  "date": "20200428",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-coronavirus-press-conference-transcript-april-28",
  "topics": "Economy, Government Policy",
  "num_segments": 63,
  "content": [
    {
      "text": "Well, thank you very much everyone. This is a great honor and I see you have social distance on your mind and that's a very good thing. Jovita, congratulations. Tremendous job you're doing. I want to thank everyone for being at the White House, a very special house, a very special place, no matter where you go in the world, they love the White House. And being here, the East Room of the White House in particular where so many important functions have taken place over the years."
    },
    {
      "text": "And today were really celebrating American workers and small businesses and we've done a job for you and we're going to make it so as we open up our country, you're going to be in good shape as opposed to be either losing your business or how do we get some people to work here, especially since your employees was so good over the years and those are the ones you wanted. So we made that possible for you."
    },
    {
      "text": "We're delighted to be joined this afternoon by representatives of several incredible small businesses from across our country, also with us, our Treasury Secretary, Steven Mnuchin. Steve, thank you very much. And the SBA administrator, you've been... you've been busy, Steve, by the way? A little bit. Broke every record in the book and SBA administrator Jovita Carranza. Thank you, Jovita. Have you gone to sleep the last two weeks? I don't think so. You broke every single lending record."
    },
    {
      "text": "Numbers of loans, amount of loans, small business, it's actually a very big business when you think about it. Thank you very much, Jovita. Great job. As our nation battles against this terrible scourge, we continue to pray for the victims as well as for those Americans who are grieving their lost ones and their loved ones. There's never been anything like this. We suffer with one heart, but we will prevail. We're coming back and we're coming back strong."
    },
    {
      "text": "And we built the greatest economy anywhere in the world two months ago and we're going to build it again. We're going to build it fast. It's going to go very quickly, and Larry, thank you for being here very much. You see what's going to happen. I think you have the same feeling as I do. It's going to come back very fast. Now that our experts believe the worst days of the pandemic are behind us, Americans are looking forward to the safe and rapid reopening of our country."
    },
    {
      "text": "Throughout this ordeal, millions of hardworking Americans have been asked to really make tremendous, tremendous sacrifices. It's sacrifices like nobody thought would even be possible. Nobody thought would ever be talking about something like this. This virus has inflicted an enormous and painful toll on our nation's workers and small businesses. That's why last month I asked Congress to pass the Paycheck Protection Program, giving small businesses emergency economic relief to keep workers on the payroll."
    },
    {
      "text": "Four weeks ago I was proud to sign it into law. We did that at a great ceremony with many of the people here and the officials here and it was something. And I can tell you, I'm going to ask Steve to say a few words, but the kind of numbers and the kind of jobs they've done and the kind of jobs that have also been saved. It's incredible. You'll be seeing that in the coming weeks. The Treasury Department and the Small Business Administration launched the program in record breaking time, just one week."
    },
    {
      "text": "And in the 14 days following its launch, we processed as many loans as the SBA would typically process in over 14 years. So in 14 days they did more work and more loans, both in terms of applications and in terms of a dollar amount, than they did in 14 years. 14 days, 14 years, easy one to remember. That's some record."
    },
    {
      "text": "The first round of funding provided more than 1.6 million small businesses with over $340 billion so that American workers can retain their jobs, receive their paychecks, and help our economy take off quickly, once America reopens for business. Which is happening right now as we sit, we're going to be all set and you all ready? I know you are. I talked to you back there, you're ready. You folks are ready. Our swift action supported or saved 30 million American jobs at least."
    },
    {
      "text": "And last week, Congress answered our call to replenish the program and I was honored to sign an additional $ 320 billion for American workers into law. At least $60 billion are reserved for community financial institutions, including those that serve minority and distressed communities. And that's also when you think it's African American communities, it's Hispanic American communities, Asian American communities. We began accepting applications for the second round of funding yesterday."
    },
    {
      "text": "Demand is extraordinarily high and there are already twice as many users accessing the system as on any day under the first round. And one of the things that the Secretary of the Treasury told me is that the amounts are much more loans at much smaller amounts. So we like to hear that because we're looking at the small amounts, the smaller businesses and that's what we want. Nonetheless, we're processing loans at a pace never achieved before."
    },
    {
      "text": "In the first 24 hours of the second round of funding, we've handled over 30% more loans than any previous day of the program. So far, we've processed an amazing 450,000 loans totaling over $50 billion. That's in phase two. That's incredible. Along with Administrator Carranza and Secretary Mnuchin, Ivanka has played an essential role in spearheading this important program. Incredible girl. That's what she wants to do. She wants to help people."
    },
    {
      "text": "From the beginning of my administration, Ivanka has used her experience as an entrepreneur to fight for the American worker. She's created many jobs. That's what she did when she first came in. She just wanted people to be able to get jobs and job training. Went to the biggest companies anywhere in the world that are located in our country and they would take hundreds of thousands of people and train them and I think you got up to almost 15 million people. 15 million."
    },
    {
      "text": "She started off with a goal of 500,000 she wanted to get 500,000 and she is now on almost 15 million people. And I'd like to ask if I might, Ivanka to say a few words as to what's exactly happening today, what's what's happening over the next week. And what her views are for what's going to happen over the next period of time. It's going to be something, I think it's going to be very special and bigger and better than anybody really understands. Let's see if I'm right about that. Ivanka, please."
    },
    {
      "text": "Thank you very much Michael. That's better than we did. Much better, Michael, you did a better job. Thank you very much. That's beautiful. Stick around. You'll get hear the press, ask some questions and they'll probably be a little bit nicer if you're in the audience. Right, Amy? That's pretty good. Also, I'd like to ask Tony Stafford, chief, very sort of the boss, I guess you could say, chef and founder. You're the boss, right? Wouldn't you say? Of Ford's Fish Shack. And I hear it's good stuff."
    },
    {
      "text": "How about explaining, please? [inaudible :18] Best, oh, I'll have it. Be careful. Thank you. Come on up, please. Fantastic, thank you. Speaker 1: () Thank you. Is he a great chef or a good chef? Speaker 1: () He's a great chef. Thank you very much, thank you. [inaudible :20] That's great. That's a great story, your mother lives with you, five children, that's a great story. So that was a rough day, right? Wasn't it, huh? Never happened to you before probably."
    },
    {
      "text": "Yeah, it happened to a lot of people it never happened before so ... but we're bringing it all back. There are been a couple of places that have opened and I don't know if you saw this, Tony, they have some restaurants and they have lines that are very long to get in. People want to be back, they want to come back. We're going to bring our country back. They want to get to work. And I know you were in that category very much, so it's great. Thank you fellas very much."
    },
    {
      "text": "Jackie Krick CEO and founder of ECU communications. Jackie, please. I'll get in trouble for touching it. They'll say he touched the microphone. What am I going to do? Great job. Thank you Jackie, great job. Chris Stansbury, co-founder and partner, West Virginia Eye Consultants. I like West Virginia. I like it. I'll put that up. [inaudible :23] That's fantastic. So you do eye examinations, Doctor? And you do a glasses and all that? I may have to see you."
    },
    {
      "text": "Okay, I guarantee you're probably better than these high priced people. I used to see the highest priced and they were not the best. I bet you're better than all of them so I may have to see you, Doctor. I'm serious about it. We can do something quickly, all right, you move quickly too, right? No long meetings? Good. I may have to see you, Doctor, thank you. Tisa Clark, president and CEO, J.D. Clark Professional Services, J.D. Clark. Hi, come on up, please. Have you ever thought about running for office?"
    },
    {
      "text": "You could do it very easily. [inaudible :38] You are something, that's a very good job. Thank you very much. Luke Bernstein, executive vice president, chief retail officer and chief communications officer for Orrstown Bank. Come on up, Luke. Thank you very much, Luke, that's a beautiful job. Brandon Hutson, president Ed & Jim's Body Shop. I know what that means. I'll bet you've fixed beautiful cars, you make them beautiful, right? I bet you do. Please come up. Thank you. And what do you do with cars, explain?"
    },
    {
      "text": "Can you generally fix like when there's a problem with a car, can you generally fix it without sending for new pieces or do you generally have to put new pieces on, if it's a big collision? After today you'll have a lot of customers. Thank you very much. Thank you, Brandon. Thank you, Brandon. Ali Mills, executive vice president, Plum Contracting Inc. Come on up here. He was so good. Put that mask on the way you had it [inaudible :38]. Thank you."
    },
    {
      "text": "I was with governor Ron DeSantis of Florida, which is interesting from your standpoint, because we talked about the business that you're in. And he noticed that right into the immediate shutdown, he noticed there was very few cars on the road. And he did very opposite of what a lot of governors did. He said, \"This is a great time to fix our roads and highways.\" And I said, as soon as he said it, this was in the Oval Office two hours ago."
    },
    {
      "text": "He said, \"I noticed there was very few cars and isn't that better than fixing them during rush hours, and when there's traffic, and one it's booming?\" Like hopefully over the next few months it's going to be again, just like it was before, the best we've ever had. And then we had to close it down. So he's fixing roads, and bridges and doing a tremendous amount of work during this period of time. And I thought it was very smart. So it's a little bit the opposite, but to each his own, right? To each his own."
    },
    {
      "text": "But it made a lot of sense to me when I heard it. I'd like to ask Secretary Mnuchin to come up and explain just a little bit about how well it's going. The kind of numbers, the kind of records, to a point where there's never been anything like this. Loans coming in, and how the loans are actually smaller than in phase one. And that makes us happy, because that means smaller businesses and that's what we're looking at. That's what we're aiming at this time. Please, Steve. Thank you very much, Steve. Thank you."
    },
    {
      "text": "And Steve, on the enhanced payments. We're really looking to the state to give that out. And unfortunately, some of the states have very old computerized equipment from many generations ago. But, they have the money to give out and they'll give it out as it comes. And hopefully they'll be able to do the job. Some states have been very efficient and others have had a hard time. But you'll work with the ones that have had a hard time."
    },
    {
      "text": "But we relied on the states, and we are relying on the states to get it out as quickly as they can. Considering, especially some of the equipment they have. Maybe now they'll be able to buy new equipment, right? When we get all finished, we'll have nice new computerized equipment so they can do it. With that, if you'd like to ask a few questions, I think this would be a good time. Because with these incredible people, this is the media, you've heard me talking about it on occasion. Seldom, right? But on occasion."
    },
    {
      "text": "And I think with you in the room, I have a feeling that they'll ask me much nicer questions. They'll tone them down, right? And thank you for the apology. I appreciate it. That was very nice. Yahoo, I appreciate it. That was very nice. Yeah. Go ahead, Jim. Go ahead. Well, it will go down to zero, ultimately. And you have to understand when it comes to cases, we do much more testing than anybody else. So we could go to some of these other countries, as an example, China. If you test, you're going to show many more cases."
    },
    {
      "text": "So we're testing. We're doing more testing than any other country in the world by far, which we just discussed over in the Oval Office. So we're going to show more cases because we're doing much, much more testing. Double anybody else. Somebody said if you add everybody else combined, that would be a number. And it will be at the appropriate time, it will be down to zero. Like we said. Yeah. Right. Also experts, many very good experts, very good people too, said that this would never affect the United States."
    },
    {
      "text": "It wouldn't affect Europe, it wouldn't affect anything outside of China. So we were listening to experts, and we always will listen to experts. But, the experts got it wrong. A lot of people got it wrong. And a lot of people had no idea it would be this serious. I listened to experts. I'll tell you what, I did something that the experts thought I shouldn't have done. I closed down our country and our borders."
    },
    {
      "text": "I did a ban on China from coming in, other than US citizens, and we did very strong checks on even our US citizens. Ron DeSantis was telling me before that when they came in, people were put into quarantine. People were checked, and we're doing that now. So yeah, I think we did something well ahead of schedule. And we did that at the end of January. People were talking about this wouldn't have an impact, as you know, even into March. So I think we've done a great job in the sense that we were early."
    },
    {
      "text": "I think by banning China, by banning China and banning people coming in who would have been very heavily infected, we probably saved hundreds of thousands of lives. So on that, I'm very proud. Yeah, please. Speaker 3: () Mr. President, this is actually for Secretary Mnuchin as well. What about the idea of another round of stimulus payments to American taxpayers directly?"
    },
    {
      "text": "Democrats, of course, up on the Hill are talking about the idea of a guaranteed income, which obviously could go on for months, and months and months. What about another round of stimulus? Well, I like the idea of the payroll tax cuts. I've liked that from the beginning. That was the thing that I really would love to see happen. A lot of economists would agree with me. A lot of people agree with me. And I think, frankly it's simple."
    },
    {
      "text": "It's not the big distribution, and it would really be an incentive for people to come back to work and for employers to hire. The double tax on the company and also on the person. That's what I like. And something like that could happen. Also, I think you have to look, because a lot of people are talking to, I assume your next question would be about states. And Steve and I talk about it, and I talk about it with Mitch, and with Kevin, and with everybody."
    },
    {
      "text": "And the problem with the states is we're not looking to recover 25 years of bad management and to give them the money that they lost. That's unfair to other states. Now, if it's COVID related, I guess we can talk about it. But, we'd want certain things also, including sanctuary city adjustments, because we have so many people in sanctuary cities. Which I don't even think are popular even by radical left folks. Because what's happening is people are being protected that shouldn't be protected."
    },
    {
      "text": "A lot of bad things are happening with sanctuary cities. But, that's just standing up here answering this question. That's one of the things I think about. If we're going to do something for the states, I think they'd probably want something having to do with sanctuary cities, something having to do with other different points that we can discuss a little bit later on. Yeah. Jeff, go ahead, please. Well, we haven't been talked about, it hasn't been asked on other industries yet."
    },
    {
      "text": "But with the meat packing and with the transportation, we have had some difficulty where they're having a liability that's really unfair to them. And we're going to be doing that, I think Mark, we're going to be doing that fairly soon. It's getting drawn up. I should be signing that over the next hour or so. Taking the liability, which frees up the entire system. And I fully understand it. Not their fault. Yeah. Please, go ahead. No. Over here first. Speaker 4: () Thank you, Mr. President."
    },
    {
      "text": "I just want to go back to what we discussed a little earlier today. Are you considering asking airlines to test passengers on international, but also domestic flights? Yeah. We're looking at doing it on the international flights coming out of areas that are heavily infected. As you know, Brazil is getting to that category. I think they're going to be okay. I hope they're going to be okay. He's a very good friend of mine, the President."
    },
    {
      "text": "But, I think that we're going to look at it from the standpoint, I was discussing that with the governor of Florida, with Ron a little while ago. So we're going to be looking at that coming in from other countries, frankly. But, South America seems to be one that's talked about because they have so much business going into Florida. With all of that being said, Florida's done incredibly well. And they're starting to open up, and open up very rapidly. But we will be looking into that in the very near future."
    },
    {
      "text": "We're looking at it very strongly. Speaker 4: () And the airlines would have this responsibility? Either the airlines or government. One or the other. We're working with the airlines. Maybe it's a combination of both. Kristen, go ahead. Well, it will increase it, and it'll increase it by much more than that in the very near future. We're way ahead of everyone on testing. We haven't been given the press in terms of, I think fairness of the press, but that's okay."
    },
    {
      "text": "And that's why I appreciated the statement before by Yahoo. We are way ahead on testing. We are the best in the world on testing. We've tested much more than anybody else, times two. Or every country combined, we've tested more than every country combined. And they keep talking about South Korea. And I'm very friendly, as you know, with President Moon, who just had a great victory. A new victory, as we're very about. But he will tell you how well the United States has done on testing."
    },
    {
      "text": "And he told me that very strongly. The quality of our test is the best and the number is the best. Now, with all of that being said, we will be going to an even higher number. And it goes up exponentially. And I've told you that we inherited a very broken test, a broken system, and a broken test. And within a short period of time we were setting records. So we have set records, we've done more than the entire world combined. We've done more than any other country in the world."
    },
    {
      "text": "So I think we've done a really good job. Now, with that being said, not everybody feels as strongly about testing as others. We have some governors that are very strong on testing. We have other governors, frankly, that aren't nearly as strong on testing. Their test is much more modest, and their real test is when people stop getting sick and they'll be able to do that too. And I understand both systems very well. But we're going to maximum testing, even though some people won't even want to use it."
    },
    {
      "text": "Well, we're going to be there very soon. If you look at the numbers, it could be that we're getting very close. I mean, I don't have the exact numbers. We would have had them if you asked me the same question a little while ago, because people with the statistics were there. We're going to be there very soon. I mean, I watched your report on NBC today, and it was an incorrect report. Because we're really doing a great job on testing."
    },
    {
      "text": "Unfortunately, the administration, the people that work our government hasn't been given the kind of credit that it deserves. Last month it was about ventilators. Now, we have so many that we're able to give them to Italy, France, Spain, other countries have been asking us for ventilators. We're making over 150,000, we've distributed thousands and thousands. New York is in great shape with what we've done, as you know. New Jersey's in great shape. We spoke just recently. Ivanka just spoke with the governor."
    },
    {
      "text": "And they're in very good shape with the ventilators. And most of them have far more than they'll ever need. They're starting to send them back. So- ... far more than they'll ever need. They're starting to send them back, so nobody went without a ventilator. Yet if you read the media from a month and a half ago, it was all about ventilators and ventilators are tough. That was a tough thing, but we should be very proud of our country."
    },
    {
      "text": "We took assembly lines and they converted from cars and other things into ventilators and the job that we've seen has not been seen since World War II. What they have done in terms of the manufacturer of very high-grade ventilators is a basis, so now we don't hear about that and I noticed that the testing is starting to die down because we now have the best testing anywhere in the world by far and we have more and that's a good thing. That's a very good thing. I'm happy about it."
    },
    {
      "text": "Now the following day, if you'll get a Democrat on the call, they'll say, \"I saw some of them today.\" They were so thrilled yesterday on a call that they thought it was a close call and today they were good, but they weren't the same as they were yesterday because that's the business they want to try and win on November 3rd. But we're doing a job the likes of which nobody's ever done."
    },
    {
      "text": "I'm not talking about myself, I'm talking about people in the Army Corps of Engineers where we built hospitals, where we built thousands and thousands of beds all over the country. New York, what we did was incredible. 2,900 beds in a matter of days. What they've done is so incredible and FEMA, what they've done and the doctors and the professionals and all of the people that you see me with all the time, these are great people and they've really done a great job."
    },
    {
      "text": "Now our country's opening up again and I think it's going to be very, very successful. I think that, I mean, Larry is here, we talked about it and we talk about it all the time. I think that third quarter, it's obviously a transition quarter, but I think it's going to be okay, maybe better than okay. Larry thinks better than okay. I think even more so than I do and then I think fourth quarter will be great and I think next year is going to be a tremendous year for this country. Jennifer."
    },
    {
      "text": "I think Mitch is looking at it, as I do, to an extent as the infrastructure, he likes infrastructure. We all do. We have to rebuild our country. $8 trillion has been spent. I wasn't in favor of it. I can tell you that in the Middle East, $8 trillion. Think of it. Yet you wanted to fix a pothole in a roadway or in a highway in this country and you didn't do it because they didn't have the money because so much money was spent in the Middle East. Well, that says a whole different story now."
    },
    {
      "text": "We want to do infrastructure, but a lot of people, a lot of the Republicans would like to keep that as a separate bill, so we'll see how that works out, Jennifer. We'll see. Yeah, please. Speaker 5: () Mr. President, you said at the top of your remarks that you feel the worst of the pandemic is behind us. But without a treatment and without a vaccine [inaudible :], how can you be so sure? Well, I think that like other things we're going to, hopefully we're going to come up with a vaccine."
    },
    {
      "text": "You never know about a vaccine, but tremendous progress has been made. Johnson & Johnson and Oxford and lots of good things. You've been hearing the same things as I do. Tremendous progress has been made, we think, on a vaccine. You always have to say, think, and then you have to test it and that takes a period of time. But a lot of movement and a lot of progress has been made on a vaccine."
    },
    {
      "text": "But I think what happens is it's going to go away and this is going to go away and whether it comes back in a modified form in the fall, we'll be able to handle it. We'll be able to put out spurts and we're very prepared to handle it. We've learned a lot. We've learned a lot about it, the invisible enemy. It's a bad enemy. It's a very tough enemy, but we've learned a lot. It's in 184 countries, as you hear me say often. It's hard to believe it's inconceivable."
    },
    {
      "text": "It should have been stopped at the source, which was China. Should have been stopped very much at the source, but it wasn't. Now we have 184 countries going through hell. But I think that a lot of good things are going to happen and I really believe that fourth quarter is going to be, maybe, tremendous. The next year, I think, has a chance to be really getting close to record setting. We hope so. We hope we can be back where we were."
    },
    {
      "text": "We had the strongest economy anywhere in the world and I hope we're going to be back there again. Go ahead, please. Speaker 6: () Mr. President, you've spoken about your friend who passed away. I was wondering if you've spoken to the families of anyone else who has lost loved ones to COVID-19, if there's any particular stories that have affected you? Well, I have. I have many people. I know many stories. I've spoken to three, maybe, I guess, four families unrelated to me. I did. I lost a very good friend."
    },
    {
      "text": "I also lost three other friends, two of whom I didn't know as well, but they were friends and people I did business with and probably almost everybody in the room did. It's a bad death. It's a bad thing. It grips onto some people. Now, we found out that young people do extraordinarily well. That's why I think we can start thinking about schools, but of course we're ending the school season, so you wouldn't be back for too long."
    },
    {
      "text": "I noticed where Purdue University, a great school in a great state, wants to open and have students come in. I think that's correct. Some colleges, I think, I saw Harvard wants to have students come back in the fall. I would hope that they'd have students. I think that the whole concept of computer learning is wonderful, but it's not, telelearning, but it's not the same thing as a being in a classroom in a great college or a college of any kind. College, university, there's nothing. You can't replace that."
    },
    {
      "text": "Hopefully they're going to be coming back. Young people do very well with this horrible scourge. They do very well. I am going to see you tomorrow and we'll have other things to talk about. We have a lot of interesting things. I don't think we should have a news conference today because this is a news conference. In addition, it's a celebration of these incredible people that have done such a good job and I think we found a couple of stars in this room today. I won't tell you who, but there are a couple."
    },
    {
      "text": "This guy right here is the biggest star in the room. Right? We'll all agree he's the ... I vote. I vote for you. Great job you've done and I really appreciate it. I appreciate you being here. Couldn't have done better. Speaker 7: () Of course, [inaudible :24] would like you know if you and some of your hostess, staff members, bodyguards or anybody in your company would like to come to Annapolis to our [crosstalk :33]- Be careful. That could happen. That could happen. Be careful. We'll have to do that, Amy."
    },
    {
      "text": "I think we could, maybe we could do something like that. You're very good. He's stolen the show, right? Do we agree? Doc, I'll tell you. I'm getting ready with the eyes. Come on with me if you want. Do a quick one. Want to save a lot of time. We need time. We're opening up the country doc, so we need a little time. I don't want to spend two and a half hours at an eye doctor, all right? We'll think about that. We want to do that. I want to thank everybody and in particular, Jovita."
    },
    {
      "text": "I want to thank you very much and Steve, I can call Steve at any time. I can call him at 2:00 in the morning, 6:00 in the morning. It doesn't make any difference. I say, \"Did I wake you?\" The answer is always, \"No.\" He's doing a great job. We're proud of him and everybody is, everybody. Our government, we have to be proud of our government, that we have to be proud of our country. These are really terrific people. We're going through a period of time, the likes of which we've never seen in this country before."
    },
    {
      "text": "Certainly even if you go back into 1917 that was the worst of all time, but it was also not as bad here. It was very bad. It was very rough. It was a bad one, but it wasn't. It wasn't quite like what we're going through right now and it's because of the amazing ... When you look at how contagious this is where people literally just being in the same area with other people, it catches. I'm very proud of this country, I have to say. I'm very proud to be a president and I'm very proud of this country."
    },
    {
      "text": "Thank you very much, everybody. Thank you. [crosstalk :21]. Speaker 7: () We're at 121 Dock St. in downtown. 124 Duck Street? Speaker 7: () Dock Street in the [crosstalk :28]. Get it ready. Speaker 7: () All right. If I don't do it, they're going to be very upset with me. You know that? Speaker 7: () They should come too if they want. They will. Thank you, everybody."
    }
  ]
}