{
  "speech_id": "029",
  "speaker": "Trump",
  "title": "Donald Trump & NJ Governor Phil Murphy Meeting Transcript on Coronavirus",
  "date": "20200430",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-nj-governor-phil-murphy-meeting-transcript-on-coronavirus",
  "topics": "Healthcare, Government Policy",
  "num_segments": 36,
  "content": [
    {
      "text": "Okay. Thank you very much. It's an honor to be with governor Phil Murphy, a wonderful state known as New Jersey. I spent a lot of time in New Jersey. It's a beautiful state. People don't realize how dense it is, right? Keep saying, I guess you're number two and I've even heard number one right? Nobody would think that about New Jersey, but it's a great place in a great state and they have a wonderful man that's running it. He runs it with heart and with brains and he's done a terrific job. We are together."
    },
    {
      "text": "We are working closely. I think we ... Somebody said we got you more ventilators maybe than any other state, which surprised me also. But you've used them well. And your numbers are headed in the right direction and I just want to thank the governor and his very capable people. The relationship's been a very good one and we're working very hard with New Jersey. We're working hard with everybody, but we're working hard with this governor. He's one of the governors that's really done a job."
    },
    {
      "text": "He stepped up to the plate and he swung and you're going to see the results very soon. So with that I'd like to ask Phil, perhaps you'd like to say a few words. Thank you very much. And we have been helping other hospitals and you know, hospitals have been really under a stress to put it mildly, right? You know, you have some hospitals where you don't have such a big COVID problem and they do what they do. In fact, they really could do a lot more because they weren't allowed to use the elective."
    },
    {
      "text": "And by not having the elective, all of a sudden they had such a different situation from you. Of course you had to use it for COVID and it, it was a tremendous strain. So we're going to work with you on that. We have been, but we're going to be working again then I just want to thank you for the great job you've done. Thank you mister president. And likewise, thank you for your partnership and leadership on this. It's meant an enormous amount of our state. Thank you very much."
    },
    {
      "text": "And I have to speak as president, but I also speak with somebody that is in New Jersey a lot. It's a great place. It's a beautiful state. People don't understand New Jersey quite, but it's a beautiful state and it's great to have you as the governor. Thank you. Thank you very much. And by the way, he's a Democrat, so I'm getting myself in trouble, but that's okay. I have to tell the truth. He's something. So any questions? Jim? Well, I think we're going to have a great third quarter. That's going to be a transition."
    },
    {
      "text": "So when I say great, I think the transition is going to be really terrific and we're going to take it into the fourth and I think we're going to have potentially a great fourth quarter. There's tremendous pent up demand. I don't know if Kevin said that or Larry Kudlow, but the telling, they see it, but I feel it. I feel it. I think sometimes what I feel is better than what I think, unfortunately, or fortunately felt."
    },
    {
      "text": "But I tell you what, I feel it and I will say that I think next year is going to be a spectacular year in terms of growth, in terms of bringing our country back. I think we're going to have a really good year. We want to be where we were and I think we can actually surpass where we were and we were the strongest anywhere in the world. We were the best that we ever were, but we were the strongest anywhere in the world. But I view what we have now as obviously a period of here we are, it is what it is."
    },
    {
      "text": "We just got hit by a vicious virus that should have never been allowed to escape China. They should have stopped it at the source. They didn't do that. 184 countries have been devastated by it, including China, by the way, because I looked at their numbers and their numbers are terrible and it's just a very tough situation for the people of our country. All the loss, the death, it's a terrible thing, but I think we're going to make a very strong comeback. It'll start with the third quarter."
    },
    {
      "text": "I think you're going to see some pretty good numbers. I think you're going to see really good transition numbers, but the fourth quarter is going to be ... I really believe it's going to be terrific. And I think that next year is going to be a great year. Sure, I think they do. I think they have to do a number of things. They do have to do that and maybe Phil could speak to that because I think I've handled it ... And not me. I think our whole group has been spectacular."
    },
    {
      "text": "We had ventilators, we didn't have any, we built them. We have thousands, tens of thousands right now under construction and we've given, as Phil said, you've got I think more ventilators than anybody in the United States, New Jersey needed them very badly. And there was never a person that needed a ventilator that didn't get one in any state, not one person that needed a ventilator. So we didn't say he didn't get a ventilator and somebody passed away, somebody didn't make it. Now we had a mask problem."
    },
    {
      "text": "Now we have so many masks, we don't know what to do with them. We had a big problem and you have to understood, we took over the cupboards were bare. And the thing that, frankly, it's not as tough as the ventilator situation, we're the king of ventilators, but what we have done is on testing with billing numbers, the likes of which nobody's ever seen before. I told you the president of South Korea, President Moon called me to congratulate me on testing."
    },
    {
      "text": "And we did more tests than any other country anywhere in the world. And I think they told me yesterday a number, if you add up the rest of the world, we've done more testing, and it's a higher quality test. So I think we've done a ... I think the whole team, federal government, we built hospitals for you and others. We built medical centers and I'm talking about thousands and thousands of beds, many, many medical centers."
    },
    {
      "text": "We had, as you know, we had the governor of Florida, the governor of Louisiana over the last two days. They could not have been ... And one was a Democrat and this gentleman happens to be a proud Democrat. They could not have been more supportive of the effort of the federal government. And I'll tell you, Jim, let me just tell you we have ... We started off with empty cupboards. The last administration left us nothing."
    },
    {
      "text": "We started off with bad broken tests and obsolete tests, we've come up with, between the Abbott Laboratories, we have the five minutes. Did they test you today? Now I feel better. You did the five minute, the Abbott test? You know what? That's a brand new test. That didn't exist eight weeks ago and now it's like the rage. Everybody wants that test. No, I think we've done ... I think we've done a really great job. Well, I know Jim, let me just say- Jim, we had broken tests."
    },
    {
      "text": "We had tests that were absolutely, we had tests that didn't take care of people. But here's what's very important. If you take a look at the swine flu, H1N1 or as Joe Biden would say N1H1, but it's actually wrong. He didn't even know the name. Okay? H1N1, the swine flu. The Obama administration was a disaster and they did polling on how did they do and their polls was so negative, so bad. They did a very poor job and they did a poor jo on a lot of things."
    },
    {
      "text": "They did a poor job on our military, they did a poor job on our ammunition. When I got here, we had no ammunition. Just like we had no ammunition, we had very little medical too. So I think when you ask how did we do, and I have to say it because the news is so fake and so corrupt, I think we did a spectacular job. I'm not even referring to me."
    },
    {
      "text": "I'm referring to all of these people, including your people who have been working with my people so closely, but the federal government has done a spectacular job to a point where we're building now, we're going to have thousands and thousands of ventilators and we're helping other countries because Phil doesn't need ventilators. You needed them very badly in the beginning. And maybe you could say something to Jim's question. Right. And Phil how did we do on ventilators as an example where you were really ..."
    },
    {
      "text": "You needed them badly. Thank you, Phil. Speaker 4: () Mister president, on operation, on this vaccine operation, [inaudible :39], who's in charge of that and are you over promising when you say you're going to have 300 billion doses of vaccine? No, I'm not over promising. I don't know who said it, but whatever the maximum is, whatever you can humanly do, we're going to have and we hope we're going to come up with a good vaccine."
    },
    {
      "text": "Johnson and Johnson and Oxford and lots of different great companies, representatives of our country in some ways, NIH is working very hard and doing a terrific job. No, I hope we're going to have a vaccine and we're going to fast track it like you've never seen before. If we come up with a vaccine, I think they probably will. Speaker 4: () Who's in charge of that operation? We have ... You know who's in charge of it honestly? I am. I'll tell you, I'm really in charge of it. I could say somebody else."
    },
    {
      "text": "I will say what dealing with, as you know, the general and the admiral, they're very much in charge, but I think probably more than anything, I'm in charge and I'm the one that gets blamed and I get blamed anyway. Don't forget, if we come up with a vaccine in record time, they'll say I should have done it faster, but we have a lot of good possibilities like the Gilead yesterday, that was a big thing."
    },
    {
      "text": "That was a big thing and as explained, and I think very importantly that was a step, that was a big step, 31% step. But the step means, I guess Deborah with Tony yesterday was explaining, the step means you now take another step, another, all of a sudden you're up to 50, 60, 70 but that was a very positive, it was a big step, as I understand it. Speaker 5: () Mister president. Go ahead please. Yeah, Jeff go."
    },
    {
      "text": "Well, I haven't seen the report yet, but I will tell you if you speak to the head of intelligence right now, you speak to the head. They did say that I was given a briefing when I said I was given it, not before. And they also said that it wasn't specific and it was not a panic briefing. It wasn't like, \"Oh, we're going to be invaded.\" It was in January, later January. And I think what you'll do is you'll speak to them."
    },
    {
      "text": "In fact, I'll ask Mark to make a report to you because the news was totally, as usual, fake and corrupt. So intelligence is doing a report and the report turned out to be exactly as I said. Speaker 5: () So mister president, so you're saying that you got a briefing in January about the coronavirus? No, I'm not saying it. I'm not. You didn't hear me. I said intelligence is saying it and they're going to give a report and it will make you very unhappy because it makes you so wrong. You in particular. Go ahead."
    },
    {
      "text": "Behind you please, please. Speaker 7: () Governor, states received 150 billion in the first CARES act. What are you going to need now to get back on your feet? What [inaudible :42] from and how do you address Republican complaints that the federal government should not be bailing out the space who were badly managed prior to the pandemic? And we did."
    },
    {
      "text": "I will say that's a tough question because you're talking about the states and whether you call it a bailout or a lot of money and a lot of it's for years long before you were there. You can't have a better representative than this man, that I can tell you. Plus he's an old Goldman Sachs guy. And what they don't know about him, he's done a great job, but he went through a big operation just before this happened and that's a hell of a thing. That was a big deal. No, not at all. No. We solved that problem."
    },
    {
      "text": "We solved that problem yesterday. I expect to see the supply chain as strong as ever. Maybe stronger for certain reasons. We did something, we got ... We had a roadblock though, it was a legal roadblock more than anything else. It was a foolish thing that nobody ever took care of for a long time and we took care of it. No, I expect things to go very smoothly. Speaker 8: () So the American people shouldn't worry about- Not even a little bit. There's a lot of supply too, but now they're going to get it."
    },
    {
      "text": "And that was solved yesterday very late in the evening. Okay? Speaker 9: () Mister president, at what point do people need another check? If unemployment's at 20- Well, we're talking about that I know a lot of people are talking about it, but we've given a lot of stimulus and, again, we think now it's, it's so great. I'm so happy that you're opening up parks and things because that's a big step for New Jersey because they were hit very hard."
    },
    {
      "text": "I think you're going to see something that's going to surprise maybe the world. We're the leader of the world. We're really the leader in this case, the leader of the world. And we've done better. If you look at our deaths, if you look at mortality rates, if you look at the things. In fact, I'm going to get a chart because it's maybe the most impressive thing, right? How we've done, and that's a tribute to the governors and its a tribute to the federal government and all of us working together."
    },
    {
      "text": "I would love you to get that if you could, because we're right at the top, meaning top in a positive way of of those charts. I think you're going to see economic numbers that are going to be fantastic. I believe it very strongly and you're going to start to see it with the transition period, which is number three and quarter four, you're going to have tremendous numbers, you're going to have tremendous numbers, and I think next year you're going to really have tremendous numbers. Yeah. Yeah."
    },
    {
      "text": "Well, I tell you, sure. When I looked at what they did to him, they tormented him. Dirty cops tormented General Flynn. General Flynn is a fine man. 35 years or so in the military. You don't get to be where he is by being bad. That I can tell you. And then right at the beginning of the administration, the dirty cops came in and you've seen the notes, Jim. I mean whether you're on our side, that side, whatever, I mean I assume, let's all talk about fairness."
    },
    {
      "text": "What they did to General Flynn, and by the way to Roger Stone and to others was a disaster and it would disgrace and it should never be allowed to happen in this country again. And what I really hoped, because CNN tormented him in all fairness, I really hope to see, because they haven't been doing it. And I appreciate your question. I hope to see that CNN will not even apologize, which they should, but just cover it fairly because he's in the process of being exonerated."
    },
    {
      "text": "If you look at those notes from yesterday, that was total exoneration. These were dirty, filthy cops at the top of the FBI. And you know the names better than I do, and they were dishonest people. Now we have to see what's going to happen. But General Flynn was treated like nobody should. And I'm not talking about generals, I'm saying like nobody at this country should be treated. And they did it right at the beginning. They did it right- Well, look at what they did to the guy."
    },
    {
      "text": "I mean he couldn't have known too much what was happening. They came at him with 15 buses and he's standing in the middle of a highway. What they did to this man, they tormented him. They destroyed him. But he's going to come back, like I say, he's going to come back bigger and better. But what they did to him, and I hear there's a lot of other stuff coming out if I believe everything I'm reading because I like to stay out of it. I don't have to stay out of it at all, but I like to stay out of it."
    },
    {
      "text": "And Jim, what they did to him is terrible and I hope that CNN is going to give them a fair shake and cover it because I think it's very important. Yes? Well, what I wish I had was all the information where they were out to get him. They wanted him ... They were trying to force him to lie. You see the written statements where they were trying to force him into a position where we can get them on a lie or can we get them this way or that way? This is terrible."
    },
    {
      "text": "This is like what happened in, and I'm not going to name the countries because we deal with these countries. Okay. But what would happen in other countries, not the USA. What they did to General Flynn and others and others is a disgrace. And I hope really, I hope your networks are going to cover it because I've seen where it's the biggest story in the world a year ago in a year and a year and half, Flynn, Flynn, Flynn, and then he's essentially exonerated. Now, that's not official yet."
    },
    {
      "text": "But when you read the notes, how could you do anything else? And I hear there's much [crosstalk :42] I hear Jim, I hear there's much more coming up. I think it would be so good for CNN if you covered it honestly, and if you reported honestly, that would be so good for the network. Okay, with that, thank you all very much. [crosstalk :]. Thank you Jim."
    }
  ]
}