{
  "speech_id": "037",
  "speaker": "Trump",
  "title": "Donald Trump Coronavirus Task Force Briefing April 9",
  "date": "20200409",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-coronavirus-task-force-briefing-april-9",
  "topics": "Economy, Foreign Policy, Government Policy",
  "num_segments": 45,
  "content": [
    {
      "text": "Thank you very much everybody. I'd like to begin by saying that we just completed a meeting with the Secretary of Treasury, Steve Mnuchin and Secretary of Transportation, Elaine Chao on proposals regarding the airlines and the airline business, and we're working very closely with a lot of different people. We'll be probably putting out a proposal and giving them some of the details, some of the very powerful details over the weekend. It's moving along quickly."
    },
    {
      "text": "The airline business has been hit very hard as everybody knows, and we are going to be in a position to do a lot to help them so that they keep their employees and they save their businesses, and that'll be taking place I think you can say over the weekend. We may even have discussions with some of the airlines or all of the airlines over the weekend. And I think it's going to be a very acceptable package. It's a very big package and a very acceptable package."
    },
    {
      "text": "It'll be good for our country, good for the airlines, good for a lot of people. Likewise, I just spoke with the President of Russia, Vladimir Putin and the King of Saudi Arabia, King Salman, and we had a big talk as to oil production and OPEC and making it so that our industry does well and the oil industry does better than it's doing right now. The numbers are so low that there'll be layoffs all over the world. There'll be certainly layoffs in this country. We don't want that to happen."
    },
    {
      "text": "We built a great, great energy business in the United States, so we have tens of thousands of jobs. We had a very good talk. We'll see what happens. But as you know OPEC met today and I would say they're getting close to a deal. We'll soon find out. So that was a conversation we just had. So we had a busy hour and a half. And let me begin by expressing my sincere gratitude to the American people."
    },
    {
      "text": "Millions of Americans are making profound and difficult sacrifices in their own lives because they know it will save the lives of countless others. And that's exactly what it's doing. You see what's happening and where we are, where we stand. And hopefully we're going to be opening up. We can call it opening very, very, very, very soon I hope. Together our people are writing one of the most noble chapters in the proud history of our nation."
    },
    {
      "text": "Americans are also encouraged to learn that Boris Johnson Prime Minister has been moved of intensive care. That's a tremendous statement and we continue to pray for him and his fast recovery. That's a very, very positive development. As the New York metropolitan area continues its battle against the outbreak, the full power of the federal government is there to support them."
    },
    {
      "text": "As you know the Javits Center has now been fully converted into a 3,000 bed hospital, one of the largest anywhere in the country, and by the incredible professionals, I have to say the Corps of Engineers, what they can do is just incredible. They've done a fantastic job and they're building nationwide 21 temporary hospitals and care facilities, adding 17,000 hospital beds and they did that all within a very short period of time. It's incredible what they've done. Army Corps of Engineers."
    },
    {
      "text": "And FEMA has been fantastic. Our sweeping airlift operation to keep doctors and nurses supplied with protective equipment. Project Airbridge continues to expand with more than 24 flights already completed and 49 additional flights now scheduled in the near future. So that's been very successful, and that gear and those outfits are being handed out as they arrive. They're going directly to point."
    },
    {
      "text": "The American medical system continues to perform beyond our highest expectations, reminding us that the United States is blessed with the most advanced healthcare and the most skilled healthcare workers anywhere in the planet. Other countries are looking to what we're doing and our testing operation has now become far and away the most sophisticated and the best anywhere. And we want to thank all of the heroes on the front lines as they fight to save American lives."
    },
    {
      "text": "We're at the top of the Hill, pretty sure we're at the top of the hill and now we're going downward. In some cases we've already started that process. Earlier today, I spoke with hundreds of mental health leaders and advocates from around the country to discuss the vital work and the vital work they're doing."
    },
    {
      "text": "We had the top doctors in the country, some international doctors, mental health, big factor, not only as the virus inflicted immense physical suffering on many people, but also mental and emotional suffering as well. Even though we're staying physically apart, no American is alone and we're all in this together, but the mental health doctors and experts, a very great call. It was a very interesting call. They're working very hard."
    },
    {
      "text": "We're also seeing encouraging signs in our race to develop breakthrough treatments and therapies. Pfizer revealed today that it has found a promising new treatment that might prevent the virus from replicating and it hopes to begin testing in clinical trials very soon. It's going to be very, very soon. They have great feelings for this particular therapy and they think that a lot of good things are happening."
    },
    {
      "text": "Through the FDA's coronavirus treatment acceleration program 19 therapies and treatments are now being tested and 26 more in the active planning or clinical trials. So we have 19 therapies being tested currently and 26 more are in the active planning for clinical trials. That's a big statement. That's a lot. Trials for Gilead's anti-viral drug remdesivir continue and the company has also expanded emergency used for new patients. Getting good early results, by the way."
    },
    {
      "text": "The companies that manufacture hydroxychloroquine are massively ramping up production. As you know many people are recommending strongly Z-Pak be added. The Z-Pak and also zinc. And the federal government continues to build our stockpiles and distribute millions of doses for doctors to use as they see fit. And I'm pleased to inform you we're just having... A lot of good things are happening, but we'll have to see how that all works out."
    },
    {
      "text": "But we've purchased and we have stockpiled millions and millions of doses and we're distributing it some states who want it very badly. Michigan, we just sent a lot to Michigan and other areas. I'm reporting today that we passed a 2 million tests completed in the United States, first time, most anywhere in the country. It's a milestone for our country. It's a milestone anywhere. Nobody's done anywhere close. Our tests are highly sophisticated and highly accurate."
    },
    {
      "text": "At the same time, we're making important progress on the economic front of this war. In a few moments, Secretary of labor, Eugene Scalia will explain new steps that were taken to ensure American workers swiftly receive unemployment and paid leave benefits and that employers protect the health and safety of all workers, including essential workers on the job. Working very, very closely with workers and with employers."
    },
    {
      "text": "To provide further economic relief the Federal Reserve announced this morning that it'll provide up to $2.3 trillion in support to businesses, states and local government. $600 billion in loans will be available for mid-size businesses with up to 10,000 employees and $500 billion will be available for states, counties with over 2 million residents in cities with a population of over 1 million."
    },
    {
      "text": "My administration's also working with Congress to replenish the very successful, incredibly successful the way it's going, paycheck protection program, which is allowing hundreds of thousands of small businesses to keep their workers on the payroll, meaning it'll keep those businesses open. We need both Democrats and Republicans to come together to get this legislation completed, and it looks like it's on its way, but we need both."
    },
    {
      "text": "And it should be for people that are working, for the workers, and if you look and you see we have a lot of people that are affected by that and it's a very positive development. So we have to get a bipartisan approval of that and hopefully that'll happen. Today the Department of education is also announcing the availability of more than $6 billion in emergency grant funding to assist college students impacted by the cancellation of classes and the suspension of housing."
    },
    {
      "text": "A lot of people had a lot of things suspended, housing is one of them. Previously we waived student loan payments for six months, so student loan payments have been waived for six months and we'll discuss it after that, it may go further. Although this medical war has separated our citizens for a period of time, it's also united our entire nation, I think I can say like almost never before."
    },
    {
      "text": "Americans are moving forward with common purpose and shared resolve, determined to vanquish the virus and lift our nation to even greater heights. We are supremely confident in the magnificent future that awaits the American people. And with that, before I invite our vice president, our great vice-president and Gene Scalia to speak, we'll take a few questions and then I'm going back into negotiations on oil and on airlines. Yeah, please."
    },
    {
      "text": "Speaker 1: () Can you tell us a little bit more about your conversation With President Putin and the king. Had a very good conversation. Speaker 1: () Did you organize that call and do they understand the problems they're causing with the oil output situation? There's so much production nobody even knows what to do with it. That's how it's working."
    },
    {
      "text": "And Saudi Arabia and as you know Russia, it's well known that we're producing a lot and they were perhaps fighting with each other over the production and the amount of oil being produced. And frankly there's not enough room to even store it. Our storage is now full, going to be very soon. Our strategic national storage is, I said this is a great time to fill it up, load it up with oil that frankly is at pricing that nobody's ever seen before. I don't think we've seen this probably since the 1950s."
    },
    {
      "text": "That was with big dollars. So we'll see what happens. The conversation was very good. They're getting close to a deal. That's OPEC and many other countries outside of OPEC. And we'll see what happens. [crosstalk :42] No, I think they were getting along very well. We had a very good call. I think it was a very good call. We're going to see what happens, but it was a very good goal. They'll probably announce something either today or tomorrow. One way or other."
    },
    {
      "text": "Could be good, could be not so good, but I think one way or the other. Go ahead, Jim. No, we have a great testing system. We have the best, right now the best testing system in the world. But there are certain sections in the country that are in phenomenal shape already. Other sections are coming online, other sections are going down. And we in addition to that are giving out millions of tests and every day we're doing it exponentially."
    },
    {
      "text": "We're picking up and what we'll be doing in the very near future is going to certain areas of our country and do massive testing. It's not necessary, but it would be a good thing to have. We want to have it and we're going to see if we have it. Do you need it? No. Is it a nice thing to do? Yes. We're talking about 325 million people and that's not going to happen as you can imagine, and it would never happen with anyone else either. Other countries do it, but they do it in a limited form."
    },
    {
      "text": "We'll probably be the leader of the pack. Please. Speaker 2: () Mr. President, what do you say to the 16 million Americans, more than 16 million Americans who have lost their jobs in the last three weeks and fear that the economy won't just bounce back like you said? Well, I think the economy is going to do very well. Now that's just my feeling. It's a strong feeling. I've had good, proper feelings about a lot of things over the years and I think we're going to do well. We're doing very..."
    },
    {
      "text": "Looks like we're at the lower end of the curb in terms of death, which is a terrible word, a terrible dark word that we've experienced like nobody's ever seen before in this country. We have numbers that are terrible. But when you look at the lower prediction levels of a 100,000 to 120,000 to 220,000, or if we did nothing up to 2.2 million people, we're looking at a much lower level than the level of, I hope, than the level of 100,000. So we're going to see."
    },
    {
      "text": "We're going to have to, you can never do anything about the people that lost their loved ones and lost their friends. The great friendships. And I'm not sure a lot of people will ever be the same, but I think our country from an economic standpoint will end up being stronger than ever. We have tremendous stimulus. We have tremendous stimulus plans. We have things in the works that are going to really, I think, fire the country."
    },
    {
      "text": "I think that what's going to happen is we're going to have a big bounce rather than a small bounce. But we will be back and I think honestly, I think our country's going to be back from an economic standpoint, again, you can never replace the people that were lost and to their families, certainly you can never do a thing like that. But we will have succeeded in many ways. Hopefully keeping the number way below our minimum numbers and also from an economic standpoint."
    },
    {
      "text": "We met with the mental health people today and that takes a... This is taken a tremendous toll mentally on a lot of people. I think we're going to open up strong. I think we're going to open up very successfully and I'd like to say even more successfully than before. Please. Speaker 3: () Thank you. Mr. President oil was trading today at about $23 a barrel in New York. What would you want to see the price? Do you want it at $30, $40, $50 a barrel?"
    },
    {
      "text": "Well, I want to see it where there's a certain market, but I don't want to see it where people have no idea. We'll be opening up areas for storage of oil, massive areas for storage of oil because oil today is not selling and what happened is the virus knocked out 40% of the market. You know that. You know the number. 40%. Now there was a lot of oil, but it was very controllable. All of a sudden they lost 40%. you look at the roads, you look at the car, you look at what's going on. There's nobody driving."
    },
    {
      "text": "There's no reason for it right now. That'll start coming back. But we are storing millions of barrels of oil that nobody thought would even be possible. Frankly, ships turned out to be a good business for some people because they're filling up tankers, sending them out to sea and not saying where to go. They're just sitting out there loaded up with oil. So we want to save our energy. In this country, we want to make sure that our energy companies, businesses, and employees, workers remain strong."
    },
    {
      "text": "So that's how I'm involved. And I think that's going to happen. So right now, if you look, you're probably talking $23-$25. If they announce a deal, we can get it up. We need a minimum number so the companies don't go out of business. So they're not going to lay off all of these energy workers who are important to our country. And we're now energy independent. We could do something where we only used our oil, but I think the longterm benefit is to be able to- ..."
    },
    {
      "text": "But I think the longterm benefit is to be able to just go with the market and it's going to work out. It's all going to work out. If you looked at three weeks ago, as you know, because we talked about three weeks ago and two weeks ago, this was catastrophic. I think it's really hitting bottom and I think that ... I mean, we've had a bottom, but now at $23 and $25 and probably heading up, at the same time, we save our energy and we also produce great cheap energy and we save our jobs. Yeah?"
    },
    {
      "text": "Speaker 4: () I want to ask you about the paycheck protection program because every day we're hearing from small business owners who are telling us that their banks don't know how to access this money. They're trying to apply. They can't figure it out. So where does the fault lie? Does it lie with the banks? I don't think there's a fault. They're doing record numbers of dollars. They're dealing with many community banks. They're dealing with Bank of America, Citibank, a lot of ..."
    },
    {
      "text": "Wells Fargo, as you know, is very much involved and they're dealing with, the bankers. Can't go that quickly, but I'm hearing it's a very, very successful rollout. They did want changes in applications, they want change in loan requirements, et cetera, but they're taking billions and billions of dollars worth of loans and in the very near future, the banks will be relieving the money. They'll be paying out the money. Yeah, please?= Speaker 5: () Thank you very much sir."
    },
    {
      "text": "Are you still expecting the USNCA to take effect on July 1st and considering the fact that the auto industry is hurting these days, are you ready to postpone- Well, we had the deal. Yeah. The deal is with Canada, deal is with Mexico. We have a deal and obviously the deal is different from the standpoint that production will be lower, but we have a deal. It's a signed deal. It's a deal that's a ... One of the worst deals that we've ever had was NAFTA, one of the worst trade deals ever made by any country anywhere."
    },
    {
      "text": "We'll be terminating that, and the new deal is a great deal for our country, so that's something. Now, again, we get hit by the virus and we'll see where that all goes, but certainly car production's going to be down for a little while, but ultimately good for our farmers, great for our farmers. We'll be helping our farmers, by the way. We have money going out to our farmers in the pretty near future, having to do with ... You see what's happened, the farmers got hurt very badly by all of this."
    },
    {
      "text": "People are eating less from the standpoint that there's no restaurants that are open. No businesses are open, no hotels are open. They'll start to come back, but we're going to be helping out our farmers. Yeah, please? Go ahead. I'm not, because we're in very good shape. You'll be speaking with Mike Pence about this and a little while. You look at the hospitals, you look at what's going on. I spoke to ... Yesterday I spoke with the governor of Louisiana."
    },
    {
      "text": "I'm saying, \"Do you think we need that extra 1,000 beds that we're in the process of building?\" And we are really in good shape. You're not hearing people and needing ventilators much. In fact, we're going to start helping other countries with ventilators. We're going to end up having a lot of ventilators for future, should something happen for hospitals ideally to keep and have, but no. I think we're in very, very good shape. We have calls with governors all the time and the governors in very good shape now."
    },
    {
      "text": "We have helped ... We have sent billions and billions and billions of dollars between ventilators, equipment, protective equipment, masks. We have 500 million masks coming, 500 million from one group, 500. It'll be 300 million and 200 million over a short period of time. Now I think we're in very good shape. Please? Speaker 6: () President, speaking of testing, some experts, including Scott Gottlieb, have talked about 750,000 tests per week being needed before the economy has opened. Can you address that?"
    },
    {
      "text": "Do you agree with those numbers? If not, how many tests per week do you think we should have, before the economy is needed? Yeah. I don't like using the word needed because I don't think it's needed, but I think we're going to try and hit a number like that. That's a very high number, but we're going to be trying to hit it and we probably might be able to do that. Please go ahead. Speaker 7: () Thank you, mister president."
    },
    {
      "text": "Today, the Democrats pushed for more rescue money for states and hospitals, which are complaining that they need it to fight the coronavirus pandemic. Do you think hospitals and states need this money, would you support that- I do and I do support something, but I support it for the next phase. It's much simpler in the next phase, whether that phase is infrastructure or whatever. So I'm going to leave you now with Mike Pence and with Eugene Scalia and if you would, I look forward to seeing you tomorrow."
    },
    {
      "text": "We'll see you tomorrow. We have a lot of ... I think a lot of very big news to report. We've had a tremendous day between, I believe, what's happening with the energy industry and, I believe, what's happening with airlines. I look forward to seeing you. Thank you very much everybody. Thank you. [crosstalk :28]."
    }
  ]
}