{
  "speech_id": "042",
  "title": "Donald Trump ‘Kids First’ Roundtable Transcript August 12: Reopening Schools",
  "date": "20200812",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-kids-first-roundtable-transcript-august-12-reopening-schools",
  "topics": "Education",
  "num_segments": 17,
  "content": [
    {
      "text": "... extraordinary experts with us. I'd like to maybe start off by asking our vice president to say a few words, and then if you would, Betsy and Kellyanne, and we'll go around and talk to some of the parents and teachers. And thank you all for being here very much. Appreciate it. Please. Would you like going back immediately, right? A lot of people agree. A lot of people agree. Thank you. [inaudible :33] a good job."
    },
    {
      "text": "So sitting in isolation with a computer, looking at a laptop, is not the same as being out there in the real world? Dr. So, if you're a presidential candidate and you're sitting in a basement and you're looking at a computer, that's not a good thing? It sounds like it would be the same. Dr. I won't put you on the spot. I'm not going to put you on... Thank you very much. A lot of truth to that. That's great. Thank you very much. Thank you very much. And the concept of every other day seems a little ridiculous, right?"
    },
    {
      "text": "If you're going to do it, you do it. If you're not going to do it... The concept of going back, even from a management standpoint from the school, every other day seems very strange. Dr. Okay. But you'd rather see them go back, period. Right? Dr. You'd rather not see that at all. Dr. Okay. Great job. Thank you very much. Dr. That's great. Thank you very much. Well said. Very exciting. Thank you. Thank you very much. Say hello to [inaudible :57]. I know the area well. It's great. Thank you."
    },
    {
      "text": "And what I'd like to do is I'd like to see the money follow the student. If a school is going to be closed, and we're giving all of this money on the federal basis to a school, and if a student is going to go to a different school, really at the choice more of the parent in all fairness, than the student, you know where you want to go and what school you want to bring the student to. I think the money should follow the student. And that's something that we want to do."
    },
    {
      "text": "We're having a hard time with the Democrats. They want the money to follow the Union, to be honest. It's very simple; give it to the Union. But the fact is give it to dues. Because the Union people are fantastic people in there. But the people that run the Union it's disgraceful and the dues that they charge the teachers, and that's what it's all about. So I would like, anyway, I would like the money to follow the student. And this way you can make your own choice. If the school is closed, why are we paying?"
    },
    {
      "text": "If a school is closed, why are we paying the school? I'd rather give it to the student, the parents, and you do your own thing. And to me it makes a lot of sense. So Mike, we'll let him know we're in favor of that. Tim Scott is fantastic and the bill is really good. So why don't we do that? Okay? That's really well said. So, it's been a burden, a tremendous burden. And what you've been through has been a great burden, obviously. How do they change that? How do they change it? What would you recommend?"
    },
    {
      "text": "That's a lot of work. Fantastic job. Thank you very much. How did she do, Chris? Good? Not too bad. That's great. Thank you very much. Appreciate it. That sounds like a good idea. It is interesting because one thing we've learned during this horror show of the China plague is that virtual is not as good as being there. Virtual is just not the same thing. And, for a long time, we've been here and how great it would be, how great it would be."
    },
    {
      "text": "Well, we've had the ultimate sample, right, namely the whole country practically. And it's not as good. We've also learned that telehealth is very good. Telehealth is up 3,500%. It's great. Can you imagine that 3,500, where people can stay in their homes, their apartments, wherever they are, and they can not have to go to hospitals, and doctors, and everything else. That's been an incredible success. Who would have thought? That's become tremendous and really has been good."
    },
    {
      "text": "But the virtual learning is not like being in a classroom. And we've learned that, I think, very strongly in almost all cases. People thought for a long time that would be the answer. But that's not the answer. The answer is an old fashioned one. Isn't it? Thank you. Great job you're doing in Florida. Thank you very much. Mr. Thank you very much. Speaker 2: () Thank you. Very uniform. Very interesting. I think most people do feel this way. Wouldn't you say? I think most people feel this way."
    },
    {
      "text": "We have a man with us who's a great expert from Stanford. He's working with us, he's consulting with us and he's going to be at our press conference in a little while, at 5:30, but maybe a Scott Atlas, Dr. Scott Atlas could say just a couple of words. We're going to be covering it in more detail in a little while. You folks are, if you're interested in watching, we'd love to have you. Scott, please. Speaker 2: () Okay. Thank you, Mr. President."
    },
    {
      "text": "It's a great honor to be asked to help out in any way I can and the event I thought was terrific. I want to thank everyone for participating and sort of to reiterate the bottom line on this as the President and Vice President and Secretary Devos have said, which is we know that the risk of the disease is extremely low for children, even less than that of seasonal flu."
    },
    {
      "text": "We know that the harms of locking out the children from school are enormous and we also know, as we all would agree, that educating America's children is right at the top of the list for our nation's priority. I thank the president and everyone here for acknowledging these truths and to get kids back to school safely. Thank you. Thank you, Scott. It's very good. We'll have more from Scott in a little while."
    },
    {
      "text": "We're going to meet together and we've been working with him very closely, all of the taskforce, all of the White House, and we've made a lot of progress. We've made tremendous progress. You see countries, other countries are now blowing up in terms of the disease. You call it, what you want."
    },
    {
      "text": "So many different names for the disease, whether it's China virus and some I won't get into because I just get myself in trouble every time I do, but I'm angry about it and so is everybody else in this country, angry about it. We will have a press conference in a little while. You'll be seeing the doctor. You'll be seeing a few of the people and I'll be making a statement and I think that'll start at about 5:30. I want to thank everybody very much for coming in and being with you. We're on your side, 100%."
    },
    {
      "text": "We're on your side. We'd like to also see football get going. We want to see college football and I don't know what they're doing with high school football, but I guess it's the same kind of a thought process. We want to see that happen and I think some of it will happen, to a large extent it's going to happen. They want to do it. I'll tell you who what's that do it are the players and the coaches. They want to do it. I spoke with Trevor Lawrence, the great quarterback, and he's a very smart."
    },
    {
      "text": "He understood it very well. He said, \"Hey, I'm a lot safer in the field that I am being out there.\" And he got it. He got it very quickly. Coach O, I spoke with him. He's some coach that one. He's a great coach. He feels his players just want to be out there. We've spoken to a lot of different people and they want to get out. And our country's opening up. We're opening up very strongly. If you look at retail sales numbers, car sale numbers, used car numbers and employment numbers."
    },
    {
      "text": "We're hiring over the last three months, the most people ever hired in the history of our country. You had a lower base, but nevertheless, we hired it. Tremendous amount, by far the biggest number of people ever hired doing a three month period for the quarter. I just want to thank everybody. We'll see you folks in a little while and thank you very much. Appreciate it."
    }
  ]
}