{
  "speech_id": "073",
  "speaker": "Trump",
  "title": "President Trump & FEMA Briefing Transcript August 27: Hurricane Laura",
  "date": "20200827",
  "url": "https://www.rev.com/blog/transcripts/president-trump-fema-briefing-transcript-august-27-hurricane-laura",
  "topics": "Government Policy, Climate, Infrastructure",
  "num_segments": 25,
  "content": [
    {
      "text": "Worked everything out for the federal government to be very, very efficient and be very aggressive in getting everything back and going, and going as it should. So I just want to thank Pete and all of the people at FEMA. I want to thank Chad Wolf. I want to congratulate him on his nomination. Fantastic, I hope that goes very quickly. It should go very quickly. You've done a fantastic job. And with that, maybe I'll have Chad say a few words, and then Pete, you can say something."
    },
    {
      "text": "And we'll take some questions, please. Thank you. Good job. Speaker 3: () Thank you, Mr. Secretary. Sir, we're going to go to Dr. Neil Jacobs. He's Assistant Secretary of Commerce for Environmental Observation and Prediction from NOAA. Neil. Dr. Could I ask you, what's the level of danger for... You say three planes flying into this storm. What's the level of danger for the planes, the pilots flying into a storm of this magnitude, where you had up to 185 and even beyond winds? What is that level? Dr. Great."
    },
    {
      "text": "Thank you [inaudible :28]. Dr. Thank you very much. Great job. Thank you. Speaker 3: () Thanks, Ken. Sir, we're going to go to some brief slides, and the first slide is really to highlight our federal partners and our private nonprofit partners. Sorry, just give it a second to catch up here. But this is just not FEMA doing this, this is our great partners like DOD, National Guard, EPA, SBA, you name it. There are people in this building, or virtual because of COVID, that are supporting these efforts."
    },
    {
      "text": "And again like the secretary mentioned, a whole of government response when it comes to this hurricane and any other natural disaster that we may see in the future. Next slide, slide four, please. So just a taste of some of the resources that we have on the ground in response for this hurricane."
    },
    {
      "text": "So from FEMA staff that are here in this building that are embedded with governors and their emergency operations centers in multiple states, Army Corps of Engineers with their power and roof teams that are on the ground doing assessments, urban search and rescue teams. Those urban associate rescue teams serve from Indianapolis. Indiana Task Force 1 is out there today doing assessments."
    },
    {
      "text": "Speaker 3: () Communications teams, we have mobile mercy response units out there that give extra capacity to locals that may have lost their communications. Our other great partners, utility crews from all across the country. 10,000 crew members out there right now and doing restoration where they can, where it's safe, but again, can't do it without them. Red Cross doing sheltering, Salvation Army doing feeding, DOD and National Guard providing helicopters and high water vehicles."
    },
    {
      "text": "And I could go on and on about the team that is assembled to respond to and recover from this disaster, and again, any other disaster that we may face. Speaker 3: () Sir, we have a couple of pictures that we'd like to share with you from the field, and my assistant administrator for response and recovery, Dave Bibo, will help us kind of go through this. But we want to give you a taste of... We've been on the ground since daylight, about six hours so far doing assessments."
    },
    {
      "text": "It will probably take the rest of the day and maybe even tomorrow to kind of see the size and scope and impact of Laura, but we just wanted to share some pictures. And Dave, if you could take us through some of these shots. It's amazing. How many buildings are like that building? You don't want to use that glass contractor, right? They didn't do too good a job. Thank you very much."
    },
    {
      "text": "Speaker 3: () And sir- I just wanted to say Mike did a fantastic job last night, and I think you deserve the honor of making your statement right now. You've made a big statement last night. Let's make a smaller one now. Speaker 7: () Well, thank you Mr. President. All right. Thank you, Mr. President, and I know I speak for you when I express our admiration for the team here at Department of Homeland Security, FEMA, NOAA, this inter-agency effort. This was a serious storm. And Mr."
    },
    {
      "text": "President from this weekend, when you signed an emergency disaster declaration for Louisiana and Texas, this team forward deployed resources. We were ready for the worst, but by all accounts from the experts, it sounds like while this was obviously a major storm with devastating impacts, it was not as bad as it could have been."
    },
    {
      "text": "And the fact that while we grieve the loss of a young girl in Louisiana, and her family has our sympathies, this is a real tribute to first responders and to the people of Louisiana and Texas who really put safety first. But Mr. President, I just would encourage people to keep the people of Louisiana and Texas, and now Arkansas where you've signed an emergency declaration as the tropical storm moves north, keep them in your prayers."
    },
    {
      "text": "But also keep in mind organizations like Red Cross that are also on the ground that are providing assistance and support to all of the efforts for families. Speaker 7: () Mr. President, you often say in moments like this, people can be assured that we will be with them. We were there to respond, rescue, and at your direction with resources that you've deployed Mr."
    },
    {
      "text": "President, we'll make sure that we're with the people in Louisiana and Texas and any other areas of the country impacted by the storm until we bring everyone back, as you often say, bigger and better than ever before. So thank you, Mr. President, and again, I want to echo your thanks and admiration for this team and all the first responders and state and local authorities that are represented here. Great, Mike. Thank you very much. Any questions concerning the hurricane? Very shortly. We'll be doing..."
    },
    {
      "text": "Tonight in fact, I was actually prepared to postpone the speech tonight and make it on Monday. I was going to Texas. I was going to Louisiana, maybe Arkansas. It looks like Arkansas. I just spoke to the governor. It's going to be in pretty good shape, but they'll need some help. But now it turned out we got a little bit lucky. It was very big. It was very powerful, but it passed quickly, and so everything's on schedule."
    },
    {
      "text": "We'll probably be going on Saturday or Sunday, and we'll be heading to Texas and Louisiana and maybe an additional step. So that'll either be on Saturday a little bit in the afternoon or a Sunday, and we'll be ready. I think you'll be prepared by that time. But I just want to thank all of the people from FEMA in particular, and all law enforcement and everyone else locally, because they've done a fantastic job. So we'll be going Saturday or Sunday. Yeah. I can tell you that Wisconsin..."
    },
    {
      "text": "I appreciate the governor calling and saying he wanted National Guard. As you know, last night was very quiet. The night before wasn't, and the reason it wasn't, they didn't have proper protection. But I respect the governor's decision to get that protection. The National Guard did a fantastic job. Mark Meadows is here. We called up the National Guard. We sent it out, and they did a fantastic job last night. We had virtually no incident. Portland should do the same thing."
    },
    {
      "text": "These are all Democrat run cities that should do this as they did, really, in Wisconsin. So it went very, very smooth. We had a relatively small force. We can be much larger if necessary. We'll move a very large force there, but we didn't need too much, and it worked out very well in Wisconsin. And all I ask is that these cities that are having difficulty, if they call us, if they request that we send the National Guard, they will be there instantaneously and we will put out the fire. We will put out the flame."
    },
    {
      "text": "We will put out the vandalism, because the vandalism and the looting is ridiculous to allow this to happen. I don't know how they can possibly do it and why they do it. I don't understand, because all they have to do is call. They could call me, they could call Mike. They can call any one of us. We'll have the National Guard there, and we will stop the violence very quickly. Chad, I think you might want to say something about that."
    },
    {
      "text": "We could solve that problem so easily and so quickly, and it seems such a shame that for, I guess political reasons. I don't know, I can't be good for them politically. But these, let's call them Democrat governors... Or frankly, we'll respond to a mayor also if they need help. But Portland's a great example. It's been going on for 90 days, and we could put it out in one hour. All they have to do is ask us to come and we will be there with the National Guard."
    },
    {
      "text": "We actually sent Homeland Security officers in to protect the courthouse, because they were unable to protect the courthouse. And as soon as they got there, the courthouse was protected. But we'd like to go a big step further than that, and we could fix the problem very quickly. But they have to call us, and we have to respond to their call. That's the way it works. I don't know much about the NBA protest."
    },
    {
      "text": "I know their ratings have been very bad, because I think people are a little tired of the NBA, frankly, but I don't know too much about the protests. But I know their ratings have been very bad and that's unfortunate. They've become like a political organization, and that's not a good thing. I don't think that's a good thing for sports or for the country. The country's doing very well economically. We're on a V. It could even be a super V. We set a record last quarter on jobs."
    },
    {
      "text": "The job numbers where, as you know, over 9 million jobs. That's a record in the history of our country. I think we're going to have a GDP that's going to be mind boggling. Now that'll be announced, interestingly just before the election. So that'll be very interesting, but The Fed, as you know... I guess it was the Atlanta Fed announced that they projected a 26% GDP. There's never been any such thing anywhere in the world as a 26% GDP. So we're doing very well."
    },
    {
      "text": "We're coming back, and that's despite the fact that great places like North Carolina, Pennsylvania, Michigan, are shut down unnecessarily at this point. It's crazy what they're doing, but they're doing it I think for political reasons, because I'd like the number to be as low as possible. And actually, I think they're making a tremendous mistake. And you have to remember, the shutdown, what we did initially was a very, very important thing, otherwise you'd have millions of people dead."
    },
    {
      "text": "You would have millions of people. And then we learned and we watched, and we watched closely, and now we have vaccines coming very soon. We have therapeutics. It's been incredible, what's taken place. But I have to say, they should open up their states. Let them open, let them open safely and carefully. Open up their schools, let them play football. It's got to open up."
    },
    {
      "text": "And we had a great number of doctors, as you know, in the office yesterday, the world's leading experts on this, and there's great danger to shut downs. And that's in the form of suicides, in the form of alcoholism and drug use, and so many other things are caused. It's a bigger problem. So whether it's North Carolina, Pennsylvania, or Michigan or others, they should open up, and we have to get on with it. We have to get on with it. It's very sad. It's very dangerous what they're doing, actually."
    }
  ]
}