{
  "speech_id": "077",
  "title": "Transcript: Donald Trump Speaks in Orange, TX with Ted Cruz & Greg Abbott August 29",
  "date": "20200829",
  "url": "https://www.rev.com/blog/transcripts/transcript-donald-trump-speaks-in-orange-tx-with-ted-cruz-greg-abbott-august-29",
  "topics": "Infrastructure, Government Policy, Healthcare",
  "num_segments": 35,
  "content": [
    {
      "text": "Problem. Okay. Speaker 1: () We appreciate it. We're going to have no problem, but you get a little bit of lucky. So why don't we let the fake news in now and we'll talk to them for a little while. Hello, my friend. How are you? Everything good? I love this guy. Speaker 1: () He's doing a good job. He's doing good. How are you? Hello everybody. Hi. Speaker 1: () How's that new lawsuits coming? Which is the new, Oh. Oh, thank you. That is the- That is great. It's the only way they're going to win."
    },
    {
      "text": "Speaker 1: () He's at that voter fraud. How about they want to send 80 million ballots out. Okay. 80 million. They didn't erase 5,000 they couldn't control it. 5,000. 80 million. That was great. It was a great day. We had tremendous, I think tremendous success. I'll let you know on the 4th or the 3rd or the 30th or five months later, if you don't win those lawsuits, right. Well, thank you very much, everybody. I very much appreciate you being here. Thank you. And we love this state."
    },
    {
      "text": "It's been a great state for me and it's been a great state for everybody in this room I can tell you Governor, right? And we're here to help. We're joined today by Governor Greg Abbott, very special man. And he's doing a fantastic job for the state of Texas. And he has from day one and Lieutenant Governor Dan Patrick, another friend of mine. And thank you, Dan."
    },
    {
      "text": "And I watched you the other night on a very important show and you did incredibly well representing the state and State Attorney General Ken Paxton, where he's a very aggressive attorney general and that's what we like. And you have got some very big ones, including the mail in ballots, right? Unsolicited I call them. The unsolicited mail in ballots, where people are sitting home and they just get hit with mail in ballots all over the place. Well, I hope you're going to be successful."
    },
    {
      "text": "I think it's actually a very important case. Not only here, but for the whole country. So I know you're really on top. I think we have about 18 of those cases throughout the country in Pennsylvania. We have in North Carolina, we have a lot of them, so we'll see. But you're one of the great leaders. Thank you very much, Ken. I appreciate it. A man who has really been there when we need him and he's been incredible for Texas and he's been my friend, Ted Cruz. Thank you."
    },
    {
      "text": "We spent a lot of time before and we're working on getting Texas everything they need. We'll bring it back. Congressman Brian Babin. Brian, thank you very much. A warrior and a really terrific guy. Randy. Where's Randy? Randy. Thank you, Randy Weber, Congressman. Thank you very much. And we have a couple of people who have been friends of mine and I won't mention too much, but they got a little shot of COVID and I understand they're going to be perfect. They're going to be absolutely fine."
    },
    {
      "text": "I want to say hello to Becky Ames. Becky, thank you very much. You're doing good, right? Everything okay. Where you hit hard? Yeah, could have been a lot harder. Well, thank you very much, Becky. I hear you're doing a great job. And again, we were talking before about the path and the path could have been much more because the power was incredible."
    },
    {
      "text": "Louisiana took a very, very hard hit, but even Louisiana, if it was over just a little bit further, it would have been a record setting hit because the power was record-setting. It was at 185 and 175. It went to 150 miles an hour when it hit. But it was even worse than that. And it came quickly. It came very quickly. In fact, I guess you would say Pete, they were looking at that as a storm and all of a sudden the storm became a monster. Yeah. It went from a storm to 185 and 175 miles an hour."
    },
    {
      "text": "And then when it hit, and I think they say it was the the strongest that they've had in Louisiana and Texas in 150 years, but the path was a little bit lucky. So we got a little bit lucky so that's great. I want to also introduce Chad Wolf who, as you know, we just took the acting away from his name and you're doing a fantastic job, Homeland Security, and hopefully Ted will be pushing that very hard and we'll get him through quickly because he's done a fantastic job. Thank you very much, Chad."
    },
    {
      "text": "He'll do it, all right. Good. If he says it, that means it's a good sign. That's a good sign. And FEMA Administrator Pete Gaynor, who's been doing this with me for a long time and we haven't had a loss yet. We haven't had a loser. I'll tell you we do it good and we do it fast and we get you back up and everything. I think Governor has been signed and you're ready to go, right? You're ready to go. I will dispense with all of the different numbers. You know what they are. We just sort of did it."
    },
    {
      "text": "We were in Louisiana and we went through and they have been hit hard. We went through a couple of areas. I've never seen anything quite like it. You had trees ripped out from the roots. You had pine trees that were broken in half, not even from there. And you just don't see that kind of power. So we went through something that was pretty, pretty bad. I don't think you got anything like that and that's good. So we took the emergency declaration. We gave it to the governor immediately and Dan called about it also."
    },
    {
      "text": "And I appreciate that call and between the two of them, that's a great one two punch. The governor told me that himself so I appreciate it. And FEMA has delivered 400,000 liters water and 250,000 meals already. We've worked with the private sector to restore power to remaining 200,000 residents. And they think the power is going to be restored almost in very good order- Speaker 2: () Pretty quick. ... I believe. Yeah, I believe so."
    },
    {
      "text": "And all of the other things that we've been doing, the infrastructure, all of the elements that we've been working on and we're working very close with Ted Cruz and with John Cornyn, who I hear is doing very well by the way. I he's a great senator. He's doing a fantastic job. And we've been working with the governor and with Dan and I think maybe it'd be good if you would tell us how are we doing and what can we do and how can we help you Governor? Well, thank you very much."
    },
    {
      "text": "Again, you're doing a great job in every way. In fact, I noticed your COVID, you say COVID-19 many different names, at least 20 different names, right? But you go like COVID-19, that's okay with me, at least for today. Generally, I call it something else. But you're doing very well in that. You're coming down very rapidly, Texas, and so is Florida, and so is Arizona. It's been incredible. It's down to its lowest numbers. So it's really doing well."
    },
    {
      "text": "So, that's prior to this and I like what you're doing with respect to keeping people separated during this problem with the hurricane. Great job. Really great job. Thank you very much. Thanks Greg. Ted, please? That's right. Great job. Thank you very much. Dan, please? Well, I knew he was going to be up. [crosstalk :57] With him, I don't have to worry about that. No I know. I know. Just for the record. That's great. It's going really fast. It's great, yes. Great. Good job, Judge. [crosstalk :08]. Thank you very much, Dan."
    },
    {
      "text": "I appreciate it. Ken, please? Right. Thank you very much. Brian? That's right. Thank you very much. I appreciate it. And say hello to the mayor. He will be fine. I know it. Just tell him to get well. Speaker 3: () I also want to say one quick thing for Chad Wolf. I met your daddy yesterday and I don't know, did you grow up in Orange at all? You're checking him out, right? That's very good. He knows more. He's doing a great job. Thank you very much. Thank you, Brian. Randy, please? Thank you, Randy, very much."
    },
    {
      "text": "You're doing a great job. Chief, please. Okay, thank you very much. A very important state, a great state, and a got to take care of the people of Texas. That's all there is to it. Becky, please? Well thank you very much. Thank you very much. You're doing a great job. Thank you, Becky very- Thank you very much. Speaker 4: () We appreciate it. You're doing a great job. Thank you, thank you very much. Speaker 4: () Thank you so much. Judge, I want to thank you very much."
    },
    {
      "text": "I hear just the job you do is incredible, and I can see the passion you have for it so it's really great. We appreciate it. How's that going for you? Do you think it'll work with the army Corps? They're building our wall. They're doing a very good job. 10 miles a day, roughly 300 miles. It's going good. How is that working? Speaker 5: () Sir, are you asking the wall? No, the wall I know. The wall is good. With the levy? Speaker 5: () Within Orange, we're excited."
    },
    {
      "text": "As the judge said, we have the ability now, we're moving forward with design. We're going to end up with about 25 miles a wall, different types of wall, that also end up with about seven pump stations in about 30 days. That will stop the water from pouring in? Speaker 5: () Sir, we're confident that it will. Also, not only in Orange, but with two neighboring communities in Port Arthur and Freeport, it's going to create a system. Those two communities have walls."
    },
    {
      "text": "We're going to continue to develop it and improve those walls. Collectively those three projects are going to improve the protection on over 100,000 residents in this community, critical infrastructure and also critical energy sector infrastructure. What is your timing there? Speaker 5: () We're starting to design right now with Orange. Right now, we're looking at all three of those projects being completed between 2025 and 2027."
    },
    {
      "text": "We're moving forward and what makes them impressive, and the judge is a great partner in this, is we're doing this with the local communities. We're doing this with the state. This is a partnership we've talked about for allowing us to develop something that not only will withstand, as you said, the storms, but also allow the communities to take care of these projects and the residents behind them in the future. What do you think the cost will be of the project?"
    },
    {
      "text": "Speaker 5: () Right now with the Bipartisan Budget Act of 2018, we got $ 4 billion to move these three projects forward, so we have that funding in hand and are moving forward. Also, as part of that act, we received additional funds to study the remainder of the Gulf Coast, so we're working hard. We've got a study that we're going to publish an interim report on in the near future, within the next month. It looks at Houston. It looks at Galveston. It looks at Bolivar Point Peninsula."
    },
    {
      "text": "Is that part of the original approval? Houston? Speaker 5: () Sir, when we got the Bipartisan Budget Act, that study was part of that. Okay. The governor, when he called me, he said, \"Could you do me a favor? Just one more favor. That's all I want. It's very small.\" I said, \"How much governor?\" He said, \"It's not much. $10 billion.\" I said, \"$10 billion?\" He said that would really do something with respect to this tremendous flooding every time you have a hurricane."
    },
    {
      "text": "Really Phase One is what we're talking about, but you could do something. That will also take care of the Houston area? It will work, right? Speaker 5: () Yes sir. We're not going to build it, and say, \"Oops. It sprung a leak, and that's the end of that.\" It's a big project, but it will work right? Speaker 5: () Yes sir. Okay. If you guys do it, it's going to work. A question down on the other side and you've done a fantastic job. Do you have anything to say? Speaker 7: () Yes, sir. I would like to now Mr. President."
    },
    {
      "text": "I appreciate you being here. My community appreciates it. Thank you for what you do for our country. We really appreciate that. Also, I want to thank a Judge John Gothia, and somebody we didn't mention, Joel Ardoin. He's our Parks and Management coordinator. They've done an outstanding job, and we appreciate the work they've done. I also want to thank everyone in this room that has helped us here in the community. Thank you very much. Thank you very much. Speaker 7: () Thank you Mr. President."
    },
    {
      "text": "Greg, do you want to finish it off? Thank you very much. Do you have any questions for the governor, the Senator or anybody? Anybody have any questions? Speaker 8: () For the Governor, Governor, what is the status in Galveston Bay with the refineries and the hundreds of chemical plants? If you could share just an update on the economic and environmental impact. Okay. Anybody else? Speaker 9: () Mr. President, I have a question on, this is obviously an important trip to visit these communities."
    },
    {
      "text": "Do you plan to visit Kenosha, Wisconsin as well, another community that's obviously in pain? Probably so. We've had tremendous success. As you know, we were finally able to get the go ahead from the local authorities to send in the National Guard. We sent in the National Guard, and within a few minutes of the guard, everybody cleared out, and it became safe. That was three days ago. We've had absolutely no problem from then. We sent in 1000 National Guard, and that's not even a big force."
    },
    {
      "text": "We could clean out, as an example, Portland, we could fix Portland in, I would say, 45 minutes. The people in Portland should protest because the mayor doesn't know what he's doing. He has no clue. He doesn't even have a clue. This has been going on for years in Portland. It's now been going on 94 days. If he would call, or if they would ask, or if the governor would ask, we would have the National Guard there in a very short period of time."
    },
    {
      "text": "That would be cleaned out in a matter of literally minutes, and you'd have a safe Portland. It's ridiculous that they go on like this. With Kenosha, it's been in very, very good shape from the moment they set foot in that area. The Sheriff's been great. The police commissioner, the police chief has been great. We've been working with all of them, but the governor let us do what we had to do, and we cleaned it up. We'll see what happens. We have to keep it going, but we won't have any problems."
    },
    {
      "text": "Speaker 9: () Sir, one thing on that. I think yesterday you did comment on the killing of Jacob Blake. You said you didn't like how it looked. I wonder if you could comment about the other shooting that took place in that community. Yeah, I said ... Speaker 9: () You mentioned the National Guard going in on enforcement, but this was a young man, 1- year-old, who's facing murder charges for having shot two people."
    },
    {
      "text": "There's some folks who've said conservatives are holding up this young man, have having done so within his rights, so self protect. I'm wondering if you've read much about this case. If you have concerns about ordinary residents with guns in situations like this and what a dangers that might present. Well, that's under investigation right now. They'll be reporting back to me over the next 24 hours, 48 hours maybe max, and we'll have a comment about it."
    },
    {
      "text": "Right now, we're looking at it very, very carefully what we are doing. It's a great state, Wisconsin. Great state, and they should not have to put up with what they went through. The National Guard has done a fantastic job. Any other questions? Speaker 10: () Mr. President, Why is the D and I no longer going to be updating the House and the Senate on election security issues? Well, I could have Mark answer that question, please. Director Ratcliffe brought information into the committee and the information leaked."
    },
    {
      "text": "Whether it was \"Shifty\" Schiff or somebody else, they leak the information before it gets in. What's even worse, they leak the wrong information. He got tired of it, so he wants to do it in a different forum because you have leakers on the committee, obviously, leakers that are doing bad things, probably not even legal to leak. We'll look into that separately, but they were leaking the information as brought in. Howard, you don't have that in Texas. Ken, you wouldn't allow that in Texas."
    },
    {
      "text": "I guarantee, Ken will not be allowing the leakers to be doing that. He wanted to make sure that it doesn't leak. Yeah, please. Speaker 12: () A question about Laura. In June of this year, NOAA issued a report indicating that climate change is at least in part responsible for increasing sea temperatures, which then in turn lead to storms like Laura and Harvey."
    },
    {
      "text": "In an area where petrochemicals and the energy industry are so critical, how do you balance that with, at the same time, attacking climate change so that storms like this don't continue to ravage the Gulf Coast? Well, I'll tell you, you've had tremendous storms in Texas for many decades and for many centuries. That's the way it is, is we handle them as they come. All I can do is handle them as they come, and that's what we do, and nobody's ever done a better job of it."
    }
  ]
}