{
  "speech_id": "087",
  "title": "Trump and Vance Speak at Atlanta Rally",
  "date": "20240805",
  "url": "https://www.rev.com/blog/transcripts/trump-and-vance-speak-at-atlanta-rally",
  "topics": "Economy, Government Policy",
  "num_segments": 84,
  "content": [
    {
      "text": "We are one movement, one people, one family, and one glorious nation under God. So, with American pride swelling in our hearts, and American courage stirring in our souls, I say these words to you tonight. We will make America powerful again. We will make America wealthy again. We will make America strong again. We will make America proud again. We will make America safe again. And we will make America great again. November 5th is going to be the most important day in the history of our country."
    },
    {
      "text": "And we will bring our country back together, bigger, better, bolder, brighter, happier, stronger, freer, greater, and more united than ever before. And together, we will win, win, win. They're not coming after me, they're coming after you, and I just happen to be standing in their way, and I will never be moving. Donald Trump, Jr. On November 5th, 2024, we will take back our country, and we will make America great again. Speaker 3 Thank you. Thank you very much to the next vice president of the United States, J."
    },
    {
      "text": "D. Vance. He's doing a great job. They go after J. D. You know why? He's for the worker. He's for people that get out and they want to work, work, work. And frankly, they are people that have been taken advantage of, and he doesn't like it. And he's done great. He's done great. He's been everything we could have expected and much more. So J. D., thank you very much, I appreciate it. (:57) And thank you to Atlanta. I'm thrilled to be back in the great state of Georgia, I love Georgia."
    },
    {
      "text": "With thousands of proud, hard-working American patriots. Crazy Kamala, ultra-left, you know that, she was here a week ago, lots of empty seats. But the crowd she got was because she had entertainers, and it all started to unfold when they started to leave about 10 minutes into the speech. It was very boring. I don't need entertainers, I fill the stadium because I'm making America great again. That's our entertainment. That's our entertainment, making America great again."
    },
    {
      "text": "(:45) And I have to tell you, we have thousands of people outside. And the state was terrific, and the fire marshal, I will say, could not have been better. Thank you to the fire marshal. But the school administration stopped us from getting another 500, 600, even 1,000 people in. Thousands of people were told no, and that was okay, but we could have fit another 600 people. So, I don't know anything about this school. I don't know anything about this school, but they could have allowed more people."
    },
    {
      "text": "You got people standing outside, just look at all the people outside. They could have come in. They could have come in. So, we're not happy. Hello, out there. And then they actually pushed the people very far away from the building, where we have beautiful cameras set up for the overflow crowds. The administration of the school. So, I'm not sure if I'm going to be sending anybody to this school. I'm not happy about it."
    },
    {
      "text": "If they're going to stand in the way of admitting people to our rally, just imagine what they're going to do on election day. We're not going to let that happen. (:04) 94 days from now, we're going to win the great state of Georgia in an epic landslide, and we're going to defeat crazy Kamala. Kamala. You know, there's about 19 different ways of saying it. She only likes three. Biden never even came close. Hamala, he goes, Hamala. No, it's Kamala."
    },
    {
      "text": "We're going to evict this radical, incompetent administration from the White House. They're destroying our country. We're going to save our country. We're going to save our country. (:47) Yesterday, it was announced that unemployment is surging, with 350,000 Americans joining the unemployment rolls just last month. Tell you what, we could end up in a depression. We could end up in World War III and a depression, how about that? Could happen, too."
    },
    {
      "text": "Under Harris-Biden policies, we now have the highest unemployment rate in three years. Just came out yesterday, even I was surprised. Those numbers were terrible. If Harris wins this election, you will quickly have a Kamala economic crash. You're going to have a crash. You could also have a crash like in 1929, more specifically, because that's where we're headed. When we win, you will rapidly see a brand new Trump economic boom. It's going to be booming like it was four years ago."
    },
    {
      "text": "(:42) With your vote, inflation will stop, the illegal aliens will be turned back. They're not coming in, we got to stop them. Did you see what she's now saying? \"Oh, we have a very good border.\" Oh, great. They had the worst border in the history of the world. It's all misinformation, that's all they're good at. That and cheating on elections, they're very good at that."
    },
    {
      "text": "The cartels will be crushed, crime will plummet, incomes will soar, the wars will end, and the American dream will come roaring back bigger, better, and stronger than ever before, right? Yes? Thank you. (:27) But with four more years of Kamala the California socialist, you know she destroyed San Francisco? Then she destroyed the whole state. Look at what's going on in California, with your family and our country, it'll never recover. If you have any more time with these people..."
    },
    {
      "text": "I'm worried about the next three months, if you think about it. These people are grossly incompetent. You'll end up in World War III, I'll tell you. And I hope I'm not right about that. Do you ever see the hats? \"Trump is right about everything\". I don' He'd gone to prison for assault and armed robbery many times. Since I was president, aggravated assaults in Atlanta are up 17%, and there's a 20% increase in shoplifting and a 90% increase in overall crime. Murders are up massively, murders."
    },
    {
      "text": "You go to the store, \"I want to buy a loaf of bread, darling.\" You come back, \"Ma'am, I'm sorry, but your husband's been killed. He went for bread across the street. He's been shot to death, ma'am.\" (:33) Nationwide, there's been a 43% increase in violent crimes since I left office, including a 58% increase in rape, 89% increase in aggravated assault, and a 56% increase in stone-cold robbery. July 4th weekend in Chicago, 117 people were shot. I'm not talking about... I'm talking about shot."
    },
    {
      "text": "Not aimed at and missed, but I can guarantee you that number was big. But 117 people were shot. Of the 117, 17 died. Many are going to be incapacitated. They're going to be working for the rest of their lives just to move. Many are paralyzed. Many of those people are paralyzed right now. Nobody ever talks about that. 117 people shot, 17 died; many very seriously hurt for the rest of their lives. (:31) If Kamala wins, it will be crime, chaos, and death all across our country. We're going to have just the opposite."
    },
    {
      "text": "It's up to the governors and the mayors to run things, but with Minnesota, which was a disaster, Minneapolis state crimes. You remember the CNN reporter? \"This is a friendly riot. Oh, please, I had rather not use the word riot. This is a friendly get-together.\" And behind him, the whole city is burning down. Remember that? Remember, it was like the flames were going for miles. And then he got hit on the knee with something. I think it was a hand grenade that didn't go off. Remember him with the shaved head?"
    },
    {
      "text": "Ding, ding, ding. Shaved his head. \"How do I look?\" \"Great.\" Then he goes down, a hand grenade hits him. \"How do I look, darling?\" \"Oh, you look great.\" They call it the summer of love, remember? Speaker 4 They took over Seattle 20%. If I didn't have the soldiers ready to go that morning, that Seattle would still be occupied. They actually took over a large percentage of Seattle. Portland, What they did with Portland. I was in the real estate business."
    },
    {
      "text": "I love storefronts beautiful bronze, I love bronze and everything. Storefronts so beautiful. In Portland, you know what they have a storefront? Their storefronts have been so decimated they use old two-by-fours with a wooden door; no glass, no windows. It's the worst looking avenue I've ever seen because... And I spoke to people that have shops there, but they don't have them anymore; they've all fled. But the few people that remain, they have wooden storefronts made out of old lumber."
    },
    {
      "text": "And they said, \"No, anything we put up, including this will be knocked down the next time.\" And it happens on a weekly basis and nobody does anything about it. (:19) They knew the military was coming in the next day in Seattle. If they didn't know that and they fled, they all said, \"Oh, it's about time to get it.\" When they were doing monuments in Washington, Marjorie knows this, I got an old bill because I doubt we could ever get Congress to pass one like this, and they were trying to rip down monuments."
    },
    {
      "text": "And then it was Abraham Lincoln. They were going to rip down the monument to Abraham Lincoln. They were ripping down other monuments. They didn't care who it was, they just wanted to destroy our country. And I took this old bill from 1889. Today you wouldn't have the guts to sign a thing like that, although they should. They should make it even tougher. And it said, \"If you desecrate or even touch a monument in any way, shape, or form, you go to jail for 10 years.\" And there's no shortened sentence."
    },
    {
      "text": "There's no shortened sentence. There's no like you get nine years off for good behavior. No, it's 10 years and you're not allowed to even do that. No judge is allowed to do it. In fact, it was so old when I had... I'm saying, \"This is an old sucker.\" This thing is old, but I reinstituted it. It was so severe, frankly, that they didn't use it. (:36) And then I had a press conference, you remember, and I announced anybody..."
    },
    {
      "text": "And people were doing lassoes of those gorgeous horses and all the things up there, and yet you saw it the other day; they were doing it again in Washington, DC with spray paint into limestone and granite. The limestone, it's a very porous stone. And I was very good at this. I was a builder, as you may have heard. And the limestone, that paint goes in there, sucks. In 100 years, you'll see that. There's nothing you can do. It just goes right in. It's very, very porous. It's sand, basically, beautiful sand."
    },
    {
      "text": "Beautiful lions, beautiful monuments, the bells and everything desecrated. And I wonder what happened to those people. Probably nothing. Probably nothing. What they did, they did tremendous damage. They did tremendous damage. (:23) But so I announced this bill, and the bill... I had a press conference to announce it, and I said, \"10 years for anybody even touching any of our beautiful monuments.\" You know what happened? It was a beautiful site."
    },
    {
      "text": "I saw thousands of asses, only the back walking out of town; some were running. They didn't want to do anything, they just wanted to get the hell out of town. And that was the end of the problem. We didn't have any more problem. We had no more problem after that. There was no problem. And that was the end. (:56) You didn't about it after that, Mr. Congressman, did we? Collins. Good speaker, he is. He's got a future. Does he have a future, Marjorie? I don't know. Got the look. He's got the hair. Good job. I watched. Good job."
    },
    {
      "text": "(:13) We will restore law and order to America. We will bring back public safety to the great state of Georgia, which is doing very badly in that way. And on day one, we will seal the border, stop the invasion, and send the illegal aliens back home. And we'll do it very quickly, very quickly. For three and a half years, borders are Harris. And again, she refuses to acknowledge that she was the borders there. She was the worst, worst manager we've ever had ever."
    },
    {
      "text": "(:51) And by the way, all of the people in charge of the border, they've all endorsed me. They said, \"He was the greatest president we've ever had.\" Tom Homan, Brandon Judd, all of those guys, they've all endorsed me, and they said, \"She's the worst.\" It's hard for them to say that, but they said, \"There's never been anybody so incompetent.\" For three and a half years, borders are Harris; has allowed terrorists and criminals to pour across our wide, open border. And now she's denying it. You can't fall for it."
    },
    {
      "text": "Disinformation, deny, deny, deny, deny for a year. \"Were never there. Nothing happened. We were great. We were great. We were so tough.\" And some people will start to believe it. They used the word brainwashed. Did you ever hear the word brainwashed? Speaker 4 Mitt Romney's father used that word. It wasn't good when he used that word. It destroyed his career. But they were brainwashed. Some people get. They hear it over and over again how bad they were and they say how great a job they did. \"They did great."
    },
    {
      "text": "They did great.\" They say it again and again, and all of a sudden people... And don't forget, it's not their main thing. They're accountants, they're lawyers, they're taxi drivers, they're carpenters, they're electricians, they hear it over and over again. All of a sudden, they say, \"She was really great on the border, wasn't she?\" No, she was a disaster. She has destroyed our country. We're going to bring it back, but she has destroyed our country. She's incompetent."
    },
    {
      "text": "(:16) They're coming from South America, they're coming from Asia, they're coming from Africa and the Middle East, from prisons and jails. They're coming from all over the world. They're not just coming from South America. Everyone thinks, oh, South America. They want to vote in Spanish and they're going to... By the way, we are doing better with the Hispanic population, I think, now than they are, so that's not working out too well. But they're coming from all over the world, not just South America."
    },
    {
      "text": "Welcome to the United States of America.\" (:06) The only good thing is, I say this all the time, these people are so violent and vicious that are being brought into our country, they're so violent, so vicious that they make our gang members and bad people and criminals look like the nicest people on earth. When we see an MS-13-some person now, we say, \"Well, they're not that bad.\" These are the worst people anywhere in the world coming into our country."
    },
    {
      "text": "They're coming in at levels that nobody's ever seen before. There's nothing good about it. Nothing can be made of it. (:38) And they're actually trying to get them to sign up and vote. They don't even speak the language. They don't even know where the hell they are. They want them to sign up and vote. And we have the head of our great Republican Party here, and he is not letting it happen, wherever you may be, wherever you may be. You're doing a great job. You know that, right?"
    },
    {
      "text": "They're coming in and they're trying to sign them up. (:05) Because I used to say only two reasons this could be happening. They hate our country or they're stupid. Well, they're not stupid because anybody that can cheat on elections that good is not stupid. And they do, I really believe they do to a certain extent hate our country because why? But I never really talked about the third reason because it's so sinister, but they want to sign these people up to vote, and if they do that, this country is destroyed."
    },
    {
      "text": "We've become a dumping ground for the entire world, and we're not going to take it anymore. (:45) Just a few months ago, right here in your state, I met with the devastated family, what a beautiful family of Laken Riley, the brilliant 22-year-old nursing student, top of her class who was out for a jog on the campus of the University of Georgia when she was assaulted, beaten, and horrifically killed. Her family, look, they'll never be the same. Incredible family."
    },
    {
      "text": "(:13) Kamala Harris let in the savage monster who murdered Laken. He was an illegal alien who was in border patrol custody, but under Harris's policies, instead of being deported immediately and fast, he was set free into America. \" Please enjoy your stay.\" Laken's blood is on Kamala Harris' hands. And she was in charge of the border. But there are many, many people like that. Laken is not the only one. Kamala is responsible for the death as though she was standing there watching it herself."
    },
    {
      "text": "She was responsible, and for so many more. (:57) Three days after releasing Laken's killer into the United States, Harris went on television and lied to the American people saying, \"The border is secure.\" Quote, \"The border is secure.\" What kind of a politician lies to Americans about keeping the border open while precious young girls are being assaulted and killed?"
    },
    {
      "text": "(:17) And Laken is one where the press was very strong on it, but there are thousands of people that are being killed and being criminalized and victimized by these people that are pouring into our country. I call it migrant crime. We now have migrant crime in our country. It's a new form of crime. It's called migrant crime, and it's vicious and it's really bad. Kamala Harris should not be asking for your vote, she should be begging Laken Riley's family for forgiveness."
    },
    {
      "text": "(:50) And Joe Biden never would mention her name. Do you remember when Biden wouldn't mention her name? Because Laken was really... That was a big deal. That was a very horrible... Just horrific. And he wouldn't mention her name, and then he finally did it, and then he called her the wrong name, \"Lincoln.\" Called her Lincoln. Good coach, Lincoln Riley. Good coach. Maybe that's where it came from, but called her Lincoln. And he was so bad. He's such a bad president, such a bad president."
    },
    {
      "text": "And precedent was set by having him as a president. He was a disaster for this country. You get angry talking about it because it's almost impossible to believe you can be that bad. (:46) People like certain people. And I understand it; they could have different beliefs, different policies. Like Ronald Reagan, he had something special about him. There was an aura. I didn't agree. I didn't agree with him on trade. I didn't think he was as good on trade as he could have been. Could have tougher on trade."
    },
    {
      "text": "But he had something special. But this last group, there's nothing they have. They have nothing. I call him Crooked Joe for a reason. He's crooked. I also call him Sleepy Joe. He's sleepy. He's sleepy, he's crooked, he's incompetent, he's dumb, and she's worse, she's worse. If Harris wins, a never ending stream of illegal alien rapists, MS-13 animals, and child predators will flood into your communities. (:32) If I win, on day one, we will begin the largest deportation operation in American history. Have no choice."
    },
    {
      "text": "We have no choice. No country can sustain this. We have no choice. And we will immediately expel every single criminal that border Czar Harris has allowed into our country. No country can sustain it. In a recent CBS poll, 62% of American support large-scale deportation, and others are saying it's 83%, 85%, including 53% of Hispanic voters because they see what's happening. (:17) By the way, the Hispanic voter and me have this special relationship. I understand them."
    },
    {
      "text": "They're very entrepreneurial, very smart, but they also understand security better than anybody. And they don't want to have murderers released into our country. They don't want. It's very interesting. And I built massive amounts of the wall. The wall was incredible. We built it, and hundreds of miles of wall, and they wanted it more than anybody because it worked. Remember I used to say two things work. Everything else is obsolete after two. You do a new computer, in about three weeks is totally obsolete."
    },
    {
      "text": "Nobody wants it. Two things have never been obsolete: wheels and walls. Wheels work and walls work. And you have a lot of different things becoming obsolete, but the wheel in the wall, the walls work. Harris wants to be the president for criminals and illegal aliens. I will be the president for law-abiding Americans of every race, religion, color, and creed. (:20) And it's no wonder the Democrat Party and their thugs are so desperate to stop us. They know that we are the only ones who can stop them."
    },
    {
      "text": "We're the only ones that are going to be able to stop. Nobody else is going to be able to stop these lunatics. All of their persecution of me is only happening because I am running for president and leading very big in all of the polls. If I wasn't running for president, I could be vacationing next to one of the many beautiful oceans of the world as the waves come in. Beautiful, but it's boring. I'd rather be with you figuring out this mess, figuring out this mess that we've gotten ourselves into."
    },
    {
      "text": "We're going to figure it out. We've got it figured out. Speaker 4 Thank you. Speaker 4 Thank you very much. Speaker 4 Now we have two things we have to do. We have to vote and we have to make sure that we stop them from cheating, because they cheat like dogs. I don't know if you've heard, but the Georgia State Election Board is in a very positive way. This is a very positive thing, Marjorie. They're on fire. They're doing a great job. Three members, Janice Johnson, Rick Jeffries, and Janelle King."
    },
    {
      "text": "Three people are all pit bulls fighting for honesty, transparency, and victory. They're fighting. Are they here? Where are they? Where are they? Where are they? Thank you. What a job. Thank you. Thank you. Wow.But we have a couple of other members that aren't so good. We have some that aren't so good, but these three are really doing the job because they don't want to see this... That will destroy our country."
    },
    {
      "text": "(:38) They just passed a rule for Georgia elections requiring that three people at each precinct independently count the total number of ballots before certification. Who could be against that? Who could be against it? Thank you, Janice, very much. That's really amazing. Thank you all, thank you all. Those are great people. I'd say brave, but I mean to you it's like that you got to do what you have to do. It's not like a question of brave. They said I was brave two weeks ago. I had to do what I had to do."
    },
    {
      "text": "It's not like brave, it's just we do the right thing. Go. Speaker 4 All right, thank you. Speaker 4 My courage was contagious. Well, your courage is contagious too. Thank you. Thank you. Nice. It's amazing. People want it. That's what they want. Thank you, Janice. That's great. And those three people are incredible. (:55) Let me give you the bad news. It's that for whatever reason, Brad Raffensperger and Brian Kemp, your governor... Who I got elected, by the way. Who wasn't for me, he would not be your governor."
    },
    {
      "text": "I think everybody knows that. He's a very disloyal person, is indeed very disloyal. But these two are doing everything possible. Plus your attorney general would like to see him show up and do something. (:27) Look at the love and adulation and applause, because this is like a poll, this is like a poll. We have thousands of people. That's better than going out and paying a half a million dollars to have some pollster go out and poll 212 people. Look at this. Look at the love they have for Janice."
    },
    {
      "text": "That's what people want. They want to have honest elections, and they want to have strong borders. Very simple. (:55) But your governor, Kemp and Raffensperger are doing everything possible to make 2024 difficult for Republicans to win. What are they doing? I don't know. They got something in mind. They got a little something in mind. Kemp is very bad for the Republican Party. He wouldn't do anything. (:15) We have Bert Jones over here. We have Bert Jones."
    },
    {
      "text": "All he wanted in the Senate was to have a special resolution passed, and it was all done. Every senator wanted it, every Republican wanted it. And we have Senator Beech here someplace too. Where is Senator Beech? Oh, I can't forget him. We can't forget him. A warrior, a warrior, you know that, and many others in this group. (:44) But all they wanted was to have just a special... We want to go over the election. We want to look because there's too many things. And the governor wouldn't sign it."
    },
    {
      "text": "And I knew he would because I got him elected. I sent a young guy over to his office, \"Would you please have him sign this?\" And the kid came back. He said, \"Sir, he won't sign.\" \"Of course he will. I got him elected. Give me a break. Of course he will.\" \"No, he wouldn't.\" And then I said, \"Well, go back over. Tell them it's for me. It's a good thing, not a bad thing. They want to look into possible election fraud.\" Wouldn't you say, senator, that's a good thing, right? They want to look into election fraud."
    },
    {
      "text": "(:21) It comes back, \"Sir, I said it was for you.\" This was a few years later after I won him the election. Don't forget, I endorsed him. And you had a very good man, Casey Cagle, your lieutenant governor. He was going to win easily. And David Perdue. Where's David? I love David. But that was his only mistake. He said, \"Sir, would you endorse a friend of mine, Brian Kemp?\" I said, \"Who's Brian Kemp?\" He said, \"He's a friend of mine,\" sir. And Sonny came too. This was probably the only mistake of David's life."
    },
    {
      "text": "That was a beauty, David. Thanks, David, I appreciate it. (:55) And I endorsed this guy. He was way down on the list. He was doing terribly. My endorsement means a lot, and I'm very careful with it. And I endorsed him, and he won in a landslide. And then he said, \"I can't beat Stacey Abrams. I can't beat her. She's going to be too tough.\" And she felt that too, by the way. She still feels it. She's constantly saying she won the election. She can say it, but I'm not allowed to say it, I'm not allowed to say it."
    },
    {
      "text": "And Michaela, I love you, Michaela. I'm in love with Michaela. Please explain that to Melania. Please explain that to our first lady. You are fantastic. No, you are a special person. (:42) But I endorsed him. And then she said, \"I can't beat Stacey Abrams.\" He said that. And his wife said it too. I said, \"Well, you won the nomination, so let's do some big rallies.\" And I did them out at an airport. Massive rallies; 55,000 and 52,000. There may have even been a third. I don't know. I remember two monster rallies."
    },
    {
      "text": "And I said, \"You're going to win.\" He said, \"I don't think so, sir.\" I said, \"No, you're going to win. I'm telling you. I can tell the vibe of the people.\" I'm like, I think, David, 287 and 0 in the last 12 months with endorsements. People respect my endorsement and I respect them. And I love them, I love them. (:28) I did these two big rallies, and he won. He did win. He won by 2%. And his wife looked at me and said, \"Thank you, sir. We'll never ever be able to repay you for what you did."
    },
    {
      "text": "You got my husband the nomination, and then we beat somebody who was unbeatable.\" She was, in theory, unbeatable. She was the hottest politician in the country at the time, Democrat politician. I would say I was hotter because I was president, so I was hotter. No, I'm not. I'm only kidding, Marjorie. I'm only kidding. Although maybe I'm not kidding, actually. No, she was certainly the hottest Democrat politician in the country. And she was going wild for years. She's still going. She can't even believe."
    },
    {
      "text": "(:11) But I got him by doing massive rallies. I really worked hard. He's the most disloyal guy I think I've ever seen. But think of the wife. \"We can never repay you for what you've done, sir. We could have never won.\" And now she said two weeks ago that, \"I will not endorse him because he hasn't earned my...\" I haven't earned her endorsement. I have nothing to do with her. Somewhere he went bad. And you know what? Your numbers in Georgia are very average."
    },
    {
      "text": "Your crime numbers, your economic numbers, all of your numbers, you're a very average. You can do a lot better. And you'll do a lot better with a better governor. You can do a lot better, just so you understand. But I don't want her endorsement, I don't want his endorsement, I just want them to do their job for Georgia. And you know what? He's the governor. He ought to support his Republican Party because if he doesn't have his Republican Party, I could tell you where he came from, and it wasn't good."
    },
    {
      "text": "(:14) And you have a great leader of the Republican Party right here. Stand up, please. He has done an unbelievable job. And he has to work like hell with a governor that doesn't help him. And Raffensperger ought to make sure that the vote is honest. And they don't want the vote to be honest. In my opinion, they want us to lose. That's actually my opinion. And we can't let that happen because if we lose Georgia, we lose the whole thing and our country goes to hell."
    },
    {
      "text": "Because we can't have her be president of the United States. She's grossly incompetent. We can't let that happen. They're the ones. (:53) Don't forget who got Fani Willis and her loverboy boyfriend all jazzed up. This guy, the governor, the governor. You know what? She's an embarrassment to the state of Georgia. He's the governor of Georgia. He ought to do something. Many, many people, their lives have been... Forget about me. I'm used to it. It's true. I am used to fake crap that goes on with these politicians."
    },
    {
      "text": "But many, many people, their lives have been destroyed because of Fani, F-A-N-I, Fani. You have to pronounce it Fani. It's called Fani. You have to pronounce Fani. She should add a little U in there someplace if she wants be able to call her... No, her and her lover, loverboy Wade, she hired him because of experience. Paid him almost $1 million a year for experience. He's got great experience. He never did a thing like this in his life. He knew nothing about it. The only thing he knew about was something else."
    },
    {
      "text": "He knew about that. That's all he knew about. He didn't know a damn thing. Do you know him? Have you ever met him? A couple of times. You ever see the phone records, phone calls being made at 3:00 in the morning. Every single night, phone call, phone call from her house. And he said, \"No, not well. I don't know her well.\" No. (:27) And this governor, I assume, I don't know, he could straighten it out because his state has become a laughingstock over it. And you know what? I love this state."
    },
    {
      "text": "I won this state twice, in my opinion. Once I won. And I did much better the second time. And Burt knows it and Beech knows it, and everybody else knows it. He could have ended the travesty with a phone call because I did nothing wrong and neither did all of those good people that are being persecuted. People in their 80s, they signed something because they see what's going on. I guarantee if I took a vote of this audience, if I said, \"What do you think?\" I won't do that."
    },
    {
      "text": "They'll come and indict you if you say that. Now, they can say it. Stacey Abrams can say that she won; the election is fine. But if we say we won the election, and we did, that's not fine. We can't do it. (:22) Hillary Clinton is still complaining about the election, even though she called me up that night and conceded. But Hillary Clinton is constantly complaining about it. Nothing happens to her. We have two sides of justice, and we can't do it anymore. We have to get back to making America great again."
    },
    {
      "text": "We don't have time for this nonsense. (:50) Fani wanted to indict a certain US senator who had nothing at all... He say, \"Why are they calling me?\" I won't use his name because I don't want to hurt him. But she wanted to indict, and somebody along the way stopped her from doing it. She had many, many more people. She was going to indict almost everybody that came into the state for a visit. (:13) But Kemp doesn't want to end it because he's a bad guy, he's a disloyal guy, and he's a very average governor."
    },
    {
      "text": "Little Brian, little Brian Kemp, bad guy. But think of it. Just think, and then that's it. I got this guy nominated. I then got him elected. Without me, he doesn't get nominated and he doesn't get elected. He had no chance of winning either one, and all he had to do is sign something where the Senate would like to look at election integrity. This is an honest man, that's an honest man. They were all honest. They were looking at something very legitimate."
    },
    {
      "text": "And this bad guy said, \"I'm sorry, sir, I can't do it.\" I called him, See, now the average politician, that's dead. For me, I don't care. I just want to tell you, you are an unbelievable person with a great personality. You lit up the whole room. You lit up the whole room. I said weeks later I'd go, who is that person that was so incredible? She knew everything about me. She had no idea I was coming."
    },
    {
      "text": "She knew everything about me and the historically black colleges and universities, I gave millions and millions, billions of dollars to. They kept coming back and I said, why are you doing this? We gave them long-term funding and she knew that because she said her college, which was she loved her college. She said it was so great, right? You loved it. Yeah, that's right. She loved her college and she said, you saved my college. What was your college, tell them?"
    },
    {
      "text": "And it was so impressive and I felt so good because she really did. She really said... I said, \"Did you like the college?\" She said, \"No, I loved that school. I love that college.\" And that's what it's all about. But you are an incredible person. I think you have a tremendous future. I really do. And I'll do whatever I can to help you. Okay, thank you. Thank you much. (:25) You want to say something else? She's great. Thank you. That's a great person, great woman. Thank you very much. Thank you very much."
    },
    {
      "text": "From the moment we take back the White House from Kamala and Crooked Joe and he is crooked as a $4 bill. I believe we're going to have the four greatest years in the history of our country. Starting on day one, we will end inflation and make America affordable again. (:15) We're going to make it affordable again. Thanks to Kamala Harris's tie breaking vote here in Atlanta, you suffered the highest inflation of any city in the country last year. Good job governor. Great job governor."
    },
    {
      "text": "Under Kamala, the typical Georgia family has lost $28,000 in inflation and to inflation hikes. To bring down the prices of all goods, we will stop the Biden Harris War on American energy. American energy is such a big deal. We will drill, baby drill. We'll get that number down. We'll bring energy prices down. Everything else will float with it. We will terminate the green new scam and I will end the Biden-Harris electric vehicle mandate right on day one. It will be ended."
    },
    {
      "text": "We will pass massive tax cuts for workers and that includes no tax on tips, Michaela. (:14) To further protect Georgia workers, I will revoke China's most favored nation's trade status. I will pass the Trump Reciprocal Trade Act. If China or any other country makes us pay a 100 or 200% tariff, we will make them pay a reciprocal tariff of 100 or 200% right back. You heard us, we heard you. It's an eye for an eye. We'll take in a fortune and they'll stop doing it before I even arrive at the Oval Office."
    },
    {
      "text": "Shortly after we win the presidency, I will have the horrible war between Russia and Ukraine settled and I will prevent, and I'm the only one that's going to do it. 100% will prevent World War III, which is very close to happening. I will restore peace through strength. And in my next term, we will build a great Iron Dome missile defense shield over our country, a dome like none other, like nobody has ever seen before. And it will all be made in the USA and much of it will be made in the great state of Georgia."
    },
    {
      "text": "And I will not cut 1 cent from Social Security or Medicare. I kept that promise four years ago, and I will keep it again and seniors will not pay taxes on Social Security. (:42) We are going to rebuild our cities into beacons of hope, safety, and beauty, better than they have ever been before. We will take over the horribly run capital of our nation in Washington D.C and clean it up, renovate it, rebuild our capital city so there's no longer a nightmare of murder and crime."
    },
    {
      "text": "We're going to stop the murder and crime. You go down from your state, you end up getting mugged or murdered in our capitol. It'll be run tough and strong by our great police officers, but rather we will become the most beautiful capitol anywhere in the world. I could say again, but it's been so badly run for so long. I almost don't want to say again."
    },
    {
      "text": "On day one, I will sign a new executive order to cut federal funding for any school, pushing critical race theory, transgender insanity, and other inappropriate racial, sexual or political content onto the shoulders of our children. And I will not give one penny to any school that has a vaccine mandate or a mask mandate. (:49) And I will keep men out of women's sports if that's okay."
    },
    {
      "text": "If Kamala Harris gets in, the travesty that is taking place at the Paris Olympics will come to America when we host the Los Angeles Olympics. And by the way, which I was president, we happened to get it. I was the president. I also got you a thing called the World Cup, which is coming very soon. I might as well say it myself because nobody else will say it, but I got them both. And you're going to have a lot of fun with it I hope."
    },
    {
      "text": "Harris is a radical trans activist and she is the candidate of letting men beat up women in the name of tolerance. But you look at what's happening over in Paris, it will never happen here. I will never let it happen. (:42) I will get all males off your daughter's soccer teams and volleyball teams and get them out of your locker rooms once and for all. That's going to be cleaned up. And we will fight to make sure that the LA Olympics protects women and protects girls."
    },
    {
      "text": "I will fully uphold the Second Amendment and we will protect innocent life and we will restore free speech in our country. We don't have free speech any longer. And very importantly, I will sue, and this is so to me, so important what we've been through in this country. I will secure our elections. Our goal will be one-day voting with paper ballots, proof of citizenship and voter ID. (:27) But until then, Republicans must win. We want a landslide that's too big to rig. Too big to rig."
    },
    {
      "text": "If you want to save America, get your friends, get your family, get everyone you know and vote. Vote early, vote absentee. Vote on the election day. Do whatever you want, but you have to vote. And if you want to help us ensure election integrity, please sign up, protectthevote.com."
    },
    {
      "text": "We stand on the shoulders of American heroes who crossed the ocean, settled the continent, tamed the wilderness, laid down the railroads, raised up those great big, beautiful skyscrapers, won two world wars, defeated fascism and communism and made America into the single greatest nation in the history of the world. (:40) But now we are a nation in decline. We are a failing nation. We are a nation that has lost its confidence, lost its willpower, and lost its strength."
    },
    {
      "text": "We are a nation that has lost its way, but we are not going to allow this horror to continue. Less than four years ago, we were a great nation and we will soon be a great nation again. With our leadership, every disaster, Kamala Harris and Joe Biden have created can be fixed and it will be fixed very quickly. Every problem can be solved and every wrong can be rectified. (:24) By this time next year, America's borders will be strong, sealed, and secure. Inflation will be in full retreat."
    },
    {
      "text": "Our economy will be roaring back. It's going to be roaring back. Optimism will be surging. The American dream will be thriving again for citizens of every race, religion, color, and creed. Law and justice will reign all throughout our land. Freedom will be restored. The flame of liberty will be burning bright. Joe Biden and Kamala Harris, the worst administration in the history of our country, will be a fading memory of the past."
    },
    {
      "text": "And our great silent majority, including the once-forgotten men and women of our country, will be the one shaping America's magnificent future when I am the 47th President of the United States. (:21) Because we are all Americans and together we will show November 5th to be the most important day in the history of our country. We are one movement, one people, one family, and one glorious nation under God. And together we will make America powerful again. We will make America wealthy again."
    },
    {
      "text": "We will make America strong again. We will make America proud again. We will make America safe again. We will make America free again and we will make America great again. Thank you, Georgia. God bless you all. Go out and vote. God bless you all. Thank you. Thank you."
    }
  ]
}