{
  "speech_id": "093",
  "title": "Trump Speaks at Alabama GOP Dinner after New Indictment Transcript",
  "date": "20230807",
  "url": "https://www.rev.com/blog/transcripts/trump-speaks-at-alabama-gop-dinner-after-new-indictment-transcript",
  "topics": "Immigration, Government Policy",
  "num_segments": 55,
  "content": [
    {
      "text": "I want to thank Governor Kay Ivey for being with us tonight, and Kay, you look great, Kay. I'm not surprised. Doing a good job too. We appreciate it very much. Thank you. Also, Chairman John Wall. He broke all sorts of records tonight. They wrote the attendance and the fundraising records. They broke every record in the book, so John, really good job. Please sit down. We're going to be here for a little while, right? Sit down. Thank you very much. John's been a friend really from the beginning."
    },
    {
      "text": "() Today I'm also greatly honored to receive the endorsements of so many outstanding Alabama leaders. We have just about all of them that we were looking for. They've been warriors with me and they know how we fight and they know how to fight, and they know that we win. Most of whom, though, are with us tonight, including your great senator who just introduced me, Tommy Tuberville. What a great man. He's strong, he's smart, he's loyal, and then he's truly a fantastic guy and he's my friend, and we love Tommy."
    },
    {
      "text": "Treat him good. You have one of the really ... thank you. We have one of the great ones there. () Representatives, Jerry Carl, Barry Moore, Mike Rogers, Robert Adderholt, Dale Strong and Gary Palmer. These are warriors. Gary's feeling better now. He had a little problem with the back, but he's feeling good and he wanted to be here and I appreciate it. These are fantastic people. Lieutenant Governor Will Ainsworth, thank you, Will, very much, for being with us. You're doing a great job."
    },
    {
      "text": "Agriculture Commissioner Rick Pate. Rick, thank you very much. Public Service Commission President Twinkle Cavanaugh, I love that name, Twinkle. Thank you very much. Thanks. Public Service Commissioners Jeremy Odin and Chip Beaker, and I really appreciate you and being here. Cliff Sims, thanks for doing a fantastic job, Cliff. () I'd also like to recognize Alabama Secretary of State Wes Allen, who's here. Wes, thank you. Thank you, Wes. State Senator Gerald Allen. Senator, thank you very much."
    },
    {
      "text": "Friends of mine, Ambassador Lindy Blanchard and her great husband, John. Thank you very much. Wonderful job, a wonderful, wonderful job as ambassador. A man who's just been incredible. What a voice he's got and what a wife he's got. His wife is named Kim and his name is Lee Greenwood, and he sings that beautiful song. Where is Lee? Is Lee here? We've got to see Lee. Thank you. What a voice. What a voice. We don't know what it is, Lee, but it works. They love it, and congratulations. Great career and great family."
    },
    {
      "text": "Thank you very much. Appreciate it. Thank you. () Catherine Engelbrecht, a real incredible woman. Where's Catherine, and Greg Phillips? Where are they? True the Vote. They have done a job. They found more fake votes than many people I think in this country, and they are fake with all of the things and they have them on tape, and you go through a lot and we appreciate it and get ready, get those votes ready. Just get them ready."
    },
    {
      "text": "Keep those tapes handy, because you're going to need them and we're going to all need them as a country. Thank you very much. You do a fantastic job, real patriots. We appreciate it. () Eight years ago this month, we held one of the very first rallies of the 2016 campaign right here in Alabama. Together we launched the greatest political movement in the history of our country, and now with the help of Alabama patriots ... oh, we love Alabama, won it by 45 points ..."
    },
    {
      "text": "but Alabama Patriots like you, we're going to do it again, but we're going to do it even bigger and better than 2016. I don't know if you know, we got a hell of a lot more votes in 2020 than we did in 2016, millions and millions of more votes, but 2016 was very, very special, and we taught people a lot and they taught us a lot, frankly, but this state has been with us right from the beginning, Kay, I have to say, right from the beginning, and we will completely finish the job."
    },
    {
      "text": "We are going to do something that's going to be so incredible. On Election Day 2024, we're going to evict Crooked Joe Biden from the White House. We're going to expel the criminals and thugs from the halls of power in Washington D.C., and we are going to make America great again. From the beginning of our movement, it's really been a true force in American politics that's dared to stand up. It's an incredible thing. We dared to stand up to the corrupt political establishment. That hasn't happened."
    },
    {
      "text": "() That's why we have such difficulty, because they just can't stand us, but they're getting smaller and smaller. They're getting weaker and weaker, and we have to go on and we have to win some battles, and I think you're seeing that we're winning a lot. We're going to have a tremendous election. The poll numbers are the highest we've ever had and people are very upset out there. Angry, upset. They don't like what's happening to our country, because our country is going to hell. Going to hell."
    },
    {
      "text": "() We said no to open borders, no to globalist trade deals, no to endless wars and no to the godless values of the Communist left. That's what they are. They skipped socialism. Remember I used to say this will not be a socialist country, and I was right. They skipped that station. We always put America first. In response, our enemies unleashed an army of rabid left-wing lawyers and really corrupt, Marxist prosecutors. These are dishonest people, bad people."
    },
    {
      "text": "Deranged government agents and rogue intelligence officers to try and stop our movement. () Remember the 51 intelligence officials that lied about the laptop? They said, \"Oh, the laptop, Russia disinformation.\" No, they all lied. 51 of them lied, and it would've made a difference of about 11 points in the election, according to the pollsters. They lied. As an example, every one of these many fake charges filed against me by the corrupt Biden DOJ could have been filed two and a half years ago."
    },
    {
      "text": "They didn't want to do it two and a half years ago. They wanted to wait, and they did wait. They waited right to the middle of an election, and they waited until I became the dominant force in the polls because we're dominating everybody, including Biden, in the polls."
    },
    {
      "text": "() Then they filed them all, every one of them, all at essentially one time, including local DAs and AGs and even other cases, right in the middle of the campaign where we're leading by so much and it's not going to make any impact, because every time they file an indictment, we go way up in the polls. We need one more indictment to close out this election. One more indictment, and this election is closed out. Nobody has even a chance. We've already defeated the Republicans. There are two and three and one."
    },
    {
      "text": "() They all want me to go, okay, onto the debate stage. I say, well, if we're at 71 and they're at zero, one, two, three, some of them at four or five, I don't know. Does it really make a lot of sense? It doesn't, really. I love to debate, but sometimes you don't want to be a fool. You want a smart president. You don't want a stupid president. () You know, the radical left."
    },
    {
      "text": "What they say is, \"Oh, we want Trump.\" That's only because we're leading in the polls, because they're a party of disinformation, misinformation, a big party of disinformation. The person they don't want is Trump. We beat them by so much last time. We beat them with Crooked Hillary. They've never recovered from that. That's why the hatred is so great, but remember this. If somebody else were leading this banner, they'd be attacked with false stories also."
    },
    {
      "text": "They'd be attacked with the Russia, Russia, Russia hoax and the fake dossiers and all of the crazy things that these people do. They're lunatics. () The question is, I don't believe they'd be able to handle it, because you've got to be very different. I'm not going to go beyond that, but you've got to be very different to be able to do what we did in four years."
    },
    {
      "text": "We had one of the most successful administrations in history, with the tax cuts and the rebuilding of our military, the greatest regulation cuts in history, and we didn't get involved in any wars. We brought our people back home. We defeated ISIS, all of the things that we did. () The fact is that it's not fair and it's probably not legal, what they're doing. They want to interfere in my campaign. They want to interfere in the elections, a commonly-used tactic in Third World countries."
    },
    {
      "text": "That's where this tactic comes, Third World, Fourth World, Fifth World countries. They're taking it to a level that our country's never seen. () The fake charges put forth in their sham indictment are an outrageous criminalization of political speech. You saw this. You make a statement. \"Oh, we have to indict him because he said we were dishonest. Let's indict him.\" They're trying to make it illegal to question the results of a bad election. It was a very bad election."
    },
    {
      "text": "Everybody knows that, but only a party that cheats in elections would try to make it illegal. Because if you have nothing to hide, why would you do that? Why would you be afraid to have those results come out? If you can't challenge a rigged election or if you don't have borders, then in actuality, you really don't have a country. You don't have borders. Millions and millions of people are pouring through our borders like an open wound, like a sieve. We're not the ones trying to undermine American democracy."
    },
    {
      "text": "We are the ones fighting to save our democracy. We're fighting to save our democracy. This ridiculous indictment against us, it's not a legal case. It's an act of desperation by a failed and disgrace Crooked Joe Biden and his radical left thugs to preserve their grip on power. They want to do anything they can to preserve it. We are in their way, because we want to bring our country back. Our country has never been so bad. I don't think it's ever been in this position, so bad."
    },
    {
      "text": "We have a very dangerous situation, because we have other countries with nuclear weapons and the weaponry is so powerful, and we have a man that can't put together two sentences and he's in charge of whether or not we have a nuclear war. I don't like that and you don't like that either. Biden and his protectors know he cannot win this race any other way, so now they're trying something that hasn't been tried in this country, election interference. They rigged the presidential election of 2020."
    },
    {
      "text": "We're not going to allow them to rig the presidential election of 2024. () As the nation's top legal scholars have stated, the Biden administration's charges are a legal and constitutional travesty. Jonathan Turley, great guy, highly, highly respected, said this is a free speech-killing indictment, killing free speech. That's what it is."
    },
    {
      "text": "Referring to the deranged Jack Smith, he's not only going to have to just bulldoze through the First Amendment, he's going to have to bulldoze through a line of cases by the Supreme Court of the United States. In other words, this is an absolute case of prosecutorial misconduct. () Andy McCarthy, highly respected, said this."
    },
    {
      "text": "() The only civil rights that have been violated in this matter are my civil rights and those of the countless people that Biden and the Communists have been persecuting, and they are Communists and they're Marxists, and they're people that don't get it. They get it. They're vicious and they're smart, but we're smarter and we're tougher than they are, and we're going to take it back. We have no choice, because otherwise we're not going to have a country. () The reason this is happening is simple."
    },
    {
      "text": "Joe Biden is the most incompetent, and at the same time, most corrupt president in the history of the United States. The Biden crime family was taking in money from China, Ukraine, Russia and so many other countries. Now, every time more Biden corruption is exposed, his henchmen indict me, because they want to knock out the bad publicity. Do you ever see? Whenever they have something big happening, they put another indictment or a special indictment."
    },
    {
      "text": "It's called a coverup, and what they do is illegal and horrible. Every time the radical left Democrats, Marxists, Communists and fascists indict me, I consider it a truly great badge of honor, We built the greatest economy in the history of the world. There's never been an economy like that. We achieved energy independence, and we're soon going to have energy dominance for the first time in 78 years. We appointed over 300 federal judges and three great Supreme Court justices."
    },
    {
      "text": "Look what they just gave us with colleges. You actually, if you get good marks, you can actually get in. You don't have to take second fiddle to somebody that didn't get good marks. Last year, those justices ruled on a thing called Roe v. Wade. They ended it, and nobody thought that was possible. () I have to tell you, from the Republican and conservative standpoint, you have to learn how to talk about pro-life. You have to learn how to talk about that decision because you don't know how to talk about it."
    },
    {
      "text": "Pro-lifers have a tremendous power now with that termination to negotiate. They had none. They didn't have any before that ruling. They had no power whatsoever. They could kill babies at any time they wanted, including after what we would call birth. They could kill babies. () Now they have tremendous power to negotiate because they don't have Roe v. Wade. This moves the issue back to the states where all legal scholars felt it should be, out of the federal government and back to the states. That's a big deal."
    },
    {
      "text": "On both sides, they felt it should be. Now, like President Ronald Reagan before me, I support the three exceptions for rape, incest, and the life of the mother. I will say that in terms of running, you have to go with your heart. You have to go with what you want. () But the three exceptions, to me, are very important, and the three exceptions, I think, to a large portion of the people on this issue, are very important. Very, very important."
    },
    {
      "text": "Remember, the Democrats are the radicals on this issue, and you have to remember that. We're not the radicals on this issue. The Democrats are the radicals because they're willing to kill babies in their fifth and sixth and seventh and eighth and ninth month and even after birth. () Remember the governor of Virginia, that whack job who thought he was Michael Jackson, remember?"
    },
    {
      "text": "They said, \"Let's see you moonwalk, Governor,\" and his wife saved him because he would have moon-walked, and it wouldn't have been pretty. He was ready to do it. It would not have been good. But he said, \"Yes, the baby's born. And then we sit down and we talk to the mother and we decide whether or not we essentially terminate the baby's life.\" This is a baby born. () They have that, too, numerous states, that you can kill the baby after birth. So they're the extremists, not us."
    },
    {
      "text": "You have to fight that issue differently. A lot of Republicans, a lot of House members, they weren't able to talk about the issue. They didn't know how. They didn't say that they were the radicals, that they were the extremists. They're the extremists. They didn't say that it gave us tremendous power to negotiate, and we now have that tremendous power. () They have to talk about it right. It'll be your issue, not their issue."
    },
    {
      "text": "I fully rebuilt the US military, created Space Force, and put the US Space Command in Alabama, which Biden just moved the hell out of your state. But maybe that's not going to be the end of that story. We defeated ISIS and brought our troops back home. Yeah, we moved the whole thing into Alabama, and they just announced they're going to take it out of your state. So you'll remember that. () I was the first president in decades who didn't start a war. We got people out of wars. We defeated ISIS."
    },
    {
      "text": "We defeated 100% of the ISIS caliphate. But all of that was only the beginning. Here's just some of the agenda that I will immediately implement when we become the 47th president of the United States, and it's we, not I. I will totally obliterate the deep state. It's a sick, bad group of people. I will say no to 87,000 IRS agents who want to take your money and destroy your lives. () I will end the disaster known as Bidenomics, which shall henceforth be defined as inflation, submission, and failure."
    },
    {
      "text": "We will turn around our economy very, very quickly. I will cancel every Biden regulation that's harming Alabama workers and workers all over the United States. One of the first things that I will do to help the great people of Alabama is to approve a six-lane I-65 from Huntsville to Mobile. Huntsville to Mobile. () I heard some of your great congressmen who I introduced ... All of your congressmen, every one, have endorsed me. It's such an honor."
    },
    {
      "text": "But I said, \"What can I do for this great state?\" \"You could make a six-laner.\" Does everyone agree that's a big deal? Yeah? Okay. We'll get that done on the first day. Okay? First day. I'll bring down the cost of energy, and we will become energy independent and even energy dominant, just as we were three years ago. () We were going to supply all of the energy to Europe, oil and gas. We were going to make so much money. Then we were going to start paying down debt. You ever look at the balance sheet of Saudi Arabia?"
    },
    {
      "text": "We have more oil than they do. We have more oil than Russia has. I got ANWR approved. No president could get that done. Ronald Reagan tried. They all tried. I got it done. The first thing that Biden did is he ended it, ANWR in Alaska, probably the largest site for oil anywhere in the world. I will reverse every one of Biden's globalist economic betrayals to once again put America first and put Alabama first."
    },
    {
      "text": "We're going to put Alabama first, where it should be, unlike Ron De Sanctimonious who voted to gut Medicare, can you believe that, and also voted three times to decimate a thing called Social Security and also to raise the retirement age on Social Security all the way up to 70. I mean you earned that. There are many other things we can cut. () We could do a lot of things that you won't be feeling, but you can't play with Social Security and Medicare."
    },
    {
      "text": "But we will always protect Medicare and Social Security for our great seniors. Not going to touch it. You saw that because we didn't touch it. Before I even arrive at the Oval Office, shortly after we win the presidency, because we are going to win it, I will have the horrible war between Russia and Ukraine settled. I know them both very well. They will settle. Would have never ever happened. It will be done very, very quickly. () I'm the only candidate who can make this promise. I will prevent World War III."
    },
    {
      "text": "Don't kid yourself. We're a lot closer to it than you think, a lot closer. That would be a war like no other because we wouldn't have Army tanks going back and forth shooting. They have nuclear. The levels of power are not to be believed. To stop the destruction of our wealth, I will impose a border tariff on all foreign-made goods. You just want to sell into our country, you're going to have to pay for that. That's a great privilege that we do that. () We get hurt so badly with trade."
    },
    {
      "text": "I made so many great trade deals, including with Japan and South Korea. By the way, China, for our farmers and manufacturers, $50 billion a year. I don't even talk about that because of what they did with COVID. I will also pass what we call the Trump Reciprocal Trade Act. In other words, if China or any other country makes us pay a 100% or 200% tariff, we will make them pay a reciprocal tariff of 100% or 200% right back. () One of two things will happen. They'll end their tariff, which in most cases will happen."
    },
    {
      "text": "Or we'll take in a lot of money and so will they, but we'll take in a lot of money. Can you imagine? They charge us 100% tariffs and 200% tariffs and, for the same product, we charge them nothing. We were all set to get that done and approved. And then COVID came in, and we had other things to do. But we're going to get that done. Reciprocal, it's got to be reciprocal."
    },
    {
      "text": "() We will gain total independence from China, and I will hold the Chinese Communist Party accountable for unleashing the China virus upon the world. It's estimated they can't pay it. Nobody can pay it, $60 trillion in damages and the death, the death, the millions and millions of people all over the world, the damage they did. I always said it came from the Wuhan lab, and it did. It came from the Wuhan lab. They said the other day, \"Trump was right about that one, too."
    },
    {
      "text": "Trump was right about everything, actually.\" () I will immediately terminate every open borders policy of the Biden administration. What's happening on our border is unthinkable. We had the safest border in the history of our country, and now we have the most unsafe border, I think, anywhere in the world. There's never been anything like it. No third world country would have a border like that. They'd fight people with sticks and stones if they had to."
    },
    {
      "text": "Under Biden, other countries are emptying out their prisons and insane asylums and mental institutions and dumping everyone, including terrorists, into the United States of America. () Many terrorists are coming in. Their prisons are emptying out all over the world, not just the three or four countries that we consider more or less neighbors. Guatemala. Guatemala's a very small prison population. El Salvador, very small. Mexico, very small. They're emptying them out."
    },
    {
      "text": "There was a psychiatrist who's been at a certain South American country for many years running a big mental institution, and they showed him sitting in the institution reading a newspaper. They were interviewing him. () He said, \"How are you doing?\" He said, \"I have nothing to do. We had many, many mental patients, people very, very sick, very ill, and they're no longer here.\" The reporter said, \"Where are they?\" They've all been brought into the United States of America."
    },
    {
      "text": "They've been dumped into the United States of America. How stupid are we? How stupid are we? They're emptying out those institutions, and they're emptying out all of their prisons and all of their jails. They're coming in here, and we're going to get them out of this country fast. We're going to get them out so fast. () It's a very bad situation. We're going to be paying a price for that for a long time. Who could want that? Who could want it? Who could want it? They are either very stupid, which they're not."
    },
    {
      "text": "You can't cheat on elections like that and be stupid. They're either very stupid or, in the alternative, they truly hate our country, and I believe they truly hate our country. () When I'm back in the White House, following the Eisenhower model, we will use all necessary state, local, federal, and military resources to carry out the largest domestic deportation operation in American history. We have no choice. Some people won't like that. We have no choice. No country can bear this."
    },
    {
      "text": "I believe the real number is 15 million people. I looked the other day on television two days ago. I saw thousands and thousands and thousands of people on Madison Avenue in New York. They are illegal immigrants. () I looked, and I said, \"This city cannot survive like that.\" But all of our cities are going through it. And even before that, the Democrats are doing such a bad job of running our cities. They're running them into the ground. The crime is setting records."
    },
    {
      "text": "We have numbers that are up 250 and 300% from just a few years ago. The laws are being broken. The prosecutors go after Trump. Let's go after Trump. But if somebody murders somebody, they know they're there and they don't even bother picking them up. () Our country is sick. It's sick. We have to change it, and we're going to change it fast. I will use Title 42 to end the child trafficking crisis by returning all trafficked children to their families and their home countries immediately."
    },
    {
      "text": "We will restore the Trump travel ban to keep radical Islamic terrorists out of our country, as I did with great success. You saw that for four years. We had no problem. To stop the Marxist prosecutors who release rapists and murderers while persecuting Republicans, conservatives, and people of faith, and they do that. () I'll tell you, they're really after the Catholics. They are after the Catholic church. It's incredible. I don't know how many Catholics are here, but they are after the Catholic church."
    },
    {
      "text": "They're after parents, school boards. It's unbelievable. I will direct a completely overhauled DOJ to investigate every radical DA and AG in America for their illegal, racist-in-reverse enforcement of the law. On day one, I will sign a new executive order to cut federal funding for any school pushing critical race theory, Thank you. We have one of the great ones there. Representatives Jerry Carl, Barry Moore, Mike Rogers, Robert Aderholt, Dale Strong, and Gary Palmer. These are warriors. Gary's feeling better now."
    },
    {
      "text": "He had a little problem with the back, but he's feeling good and he wanted to be here and I appreciate it. But these are fantastic people. () Lieutenant Governor Will Ainsworth, thank you Will very much for being with us. Doing a great job. Agriculture Commissioner Rick Pate. Rick, thank you very much. Public Service Commission President Twinkle Cavanaugh. I love that name, Twinkle. Thank you very much. Thanks. Public Service Commissioners, Jeremy Oden and Chip Beeker, and I really appreciate you and being here."
    },
    {
      "text": "And Cliff Sims, thanks for doing a fantastic job, Cliff. () I'd also like to recognize Alabama Secretary of State, Wes Allen, who's here. Wes, thank you. Thank you, Wes. State Senator Gerald Allen. Senator, thank you very much. Friends of mine, Ambassador Lindy Blanchard and her great husband, John. Thank you very much. A wonderful job, a wonderful, wonderful job as ambassador. A man who's just been incredible, what a voice he's got and what a wife he's got."
    }
  ]
}