{
  "speech_id": "096",
  "title": "Trump Gives Keynote at New York Young Republicans Gala Transcript",
  "date": "20231211",
  "url": "https://www.rev.com/blog/transcripts/trump-gives-keynote-at-new-york-young-republicans-gala-transcript",
  "topics": "Economy, Immigration, Government Policy, Social Justice",
  "num_segments": 104,
  "content": [
    {
      "text": "Well, thank you very much. Wow, some really great speeches. That was something, that was something. Very special people, very special place. I know Wall Street very well for a lot of years working here, owning property on Wall Street and being in this great city that's under tremendous seize right now. It's a terrible thing that's happening, but it is great to be back in New York and it's a true honor to address the oldest and largest Young Republican Club in the United States."
    },
    {
      "text": "I want to express my tremendous gratitude to all of you for being one of the very first organizations in the entire nation to endorse my 2024, doesn't it sound good? So now it's happening, it's happening. () We shouldn't have had to wait this long, but things like that happen, things like that happen."
    },
    {
      "text": "But when we were at four years and we were fighting because we had a rigged election like nobody's ever seen before, and a lot of people thought it could happen maybe sooner, and it should have happened sooner because of what they did, a bunch of cheaters, they are cheaters like nobody's ever cheated before, third-world country. But now the time is here and we're going to do it."
    },
    {
      "text": "We're going to do it right, and we're going to find out what happened then, but more importantly, we're going to take our country to new levels, levels that nobody would've thought possible when you're looking at what's happened today. () Let me especially thank your president Gavin Wax. Gavin, that was an excellent speech, that was an excellent speech. Wow. I want to thank you and for your future wife, even though you haven't told her that yet. Don't lose her Gavin, don't lose her."
    },
    {
      "text": "We cannot have you be depressed because we're going to take New York and if you lose her, you'll be a very depressed person, you won't be able to do your job. So don't lose her Gavin. But Gavin for his outstanding leadership along with Lee Zeldin, who did a fantastic job, who was a great run, and he's endorsed us very early, a long time ago, and he is a fantastic guy and the entire executive committee of this storied organization."
    },
    {
      "text": "With crime at record levels and hundreds of thousands of people living on the sidewalks and streets and with illegal aliens invading our city and state like nobody thought possible, did anybody think this was even possible? I believe we have a great chance of winning New York, Rudy. I think we have a great chance. Greatest mayor in our history, greatest mayor in our history. By the way, his crime, when he took over New York, the crime was almost as bad. It can't be worse than this, Rudy? Can it?"
    },
    {
      "text": "I want to say it was worse, but I don't think it can be worse than this. You're going to have to tell me about that, but it was bad. () And he and the man sitting right next to you, a very special, stand up Bernie, stand up Bernie... You know I pardoned Bernie and he was very emotional when I did it right. I didn't know he cried."
    },
    {
      "text": "I never thought he cried when he was a little baby, but he was very emotional, and now Bernie is cleaner, this is the expression they say, I never quite understood it, than a newborn baby's ass. Did you ever hear that? I don't know what that means exactly, but that's what they say, but you are. You're the cleanest person in the room. () We're going to get Bannon there too. He's pretty close."
    },
    {
      "text": "But Lee Zeldin, all of you people that have been so incredible and everyone in the room, we are going to give all the resources that you need. We have a lot of resources. You know we take in millions and millions of dollars a week from people, average $61. Can you believe that? $61, and we're taking in numbers that nobody's ever seen before. That's like a poll. When you think of it, that's like a poll, isn't it?"
    },
    {
      "text": "But we're going to give you all the resources you need, Gavin and Lee and everybody that's working on it. And Rudy, you have to work. You know they love you in this city, Rudy, they love you. They love you. () And if we win New York, and likewise we're going to put a heavy play on New Jersey, Virginia and a few other states that people say, \"Gee, I don't know if you can win,\" then we win the election very easily, very, very easily."
    },
    {
      "text": "If we win New York, it will counter all of the cheating that will go on because we have to catch them. And we have a congressman sitting right there who's got his eye on it. I want to thank a lot of senators that are here tonight, a couple in particular, US Senator J. D. Vance, a friend of mine, he's done a great job. I endorsed him. He went from fifth place to first place and he's been a really tremendous senator."
    },
    {
      "text": "() And another one that I was really honored to endorse and help, and he's been an incredible senator and I got to listen to part of his speech, Roger Marshall. He's been fantastic. Roger, thank you. Great speech, by the way, Roger, you are a good speaker. I know that from impeachment hoax number one and impeachment hoax number two. I said, \"Who's that guy? He's made some good speeches.\" That's why I liked you."
    },
    {
      "text": "That's why we have that relationship, very special that you did that, but thank you very much for everything. You really have done a great job, thank you. Also, representative Cory Mills. Thank you, Cory, stand up. Mike Collins, thank you Cory, Mike Collins, wherever you may be Mike, you know they say there's 2,500 people here, there's about 5,000 people outside. Paul Gosar. Paul, thank you very much, Paul, Good job Paul. And Paul has to fight his very liberal family all the time, I don't know, but Paul wins."
    },
    {
      "text": "And you heard the real Matt Gaetz tonight. That's the real Matt Gaetz, right? Man. That was great, Matt. () You know they have a big deal going on at Mar-a-Lago right now. They have a 1000 people. For a friend of yours, you know what's happening. They all think you and I are supposed to be there, but we're very happy being right here for Gavin and Lee and everybody else. And Ginger, you are such a good addition. You're keeping him grounded."
    },
    {
      "text": "It's so nice to see this, but you are really a fantastic woman, very smart woman. () Another one who has done an unbelievable job. I watched her run over the head of Harvard, the head of Penn, the great old Wharton School of Finance, Elise, Elise Stefanik. Elise, thank you Elise. What a job she's done. You know I watched the way, she's very smart, I watched the way she was asking the questions and they were asked in a very complex way."
    },
    {
      "text": "And these women who, I guess they're smart, but boy, they were really dumb answers, weren't they? But they were asked in a very complex way, and these people had no idea what the hell they were doing. I said, \"I think she's got to lose her job. I guess they're all going to be losing their job within the next day or two,\" but one down, two to go, but there's many more out there like that and I don't get it. I don't know why, why that would be."
    },
    {
      "text": "A special person is in this room tonight because former mayor, Rudy Giuliani did the greatest job. He was the greatest mayor in the history of this city. It was safe, it was prosperous. It's right, Rudy. Special guy and he fought like hell, and by the way did a hell of a job. He was out there, he was fighting, and he'd go and see legislatures and he'd go to the different legislatures and talk to legislators, and he would be, I mean, he was incredible."
    },
    {
      "text": "And he'd leave and they all agreed with him a 100%, but then courts would hold them back because judges didn't have the courage to do what they should have done. But Rudy is a warrior. He's a brave guy, he's a brilliant man, and he's been our friend and there's nobody like him, really there's nobody like him. When I see what's happened to the city in such a short period of time, it's very sad. But thank you. And you happen to have a great son who's a friend of ours named Andrew. Where is Andrew?"
    },
    {
      "text": "Don't play golf with Andrew. He's too good. Andrew's a great golfer too. Andrew's a great, great young guy who really ran a very good race. When he announced, a lot of people weren't thinking you were going to get the numbers you got and then immediately he went over with Lee and they worked together beautifully. It was a beautiful thing to see Andrew, and thank you very much. Also, former New York City Police Commissioner when we had real safe city, we had a real safe... Bernie, stand up again, please."
    },
    {
      "text": "Thank you, Bernie. Great job. New York City council member, Inna Vernikov. Where is Inna? Where is Inna? Where are you? I want to see Inna. I hear so much about her. I read so much about her. Is she still there? What the hell is she doing so far back? Come up here, I want to see you. Come up here. I'm reading all about her and how incredible. You do a great job. I think, are you the only Republican still on city council? Just... Come here. () Don't fall. Joe Biden has taught us it's not good to fall. Thank you, darling."
    },
    {
      "text": "That's why I wanted to see her. Beautiful job. Great job. Very popular. Very, very popular. Bo Hines is here. He is going to be a congressman very shortly. Bo Hines, thank you. D. C. Draino. Where's Rogan? Rogan O'Handley. Where is Rogan? Oh, he's so good to me. Thank goodness he's on my side. Oh man, I would hate to have D. C. against me, right? But Rogan, thank you very much, a great special guy. J. R. Majewski, somebody that the deep state did some really bad things to, but we stuck by him, we stuck by him."
    },
    {
      "text": "And J.R., where's J.R.? What a job. What a job. Well, it shows perseverance works, right? He backed me. He took a tractor. He had a sign. Trump, Trump, Trump all over the fields of your beautiful state, and you've been totally exonerated. You told the truth and they played dirty pool, but you'll get a second shot, right? You're going to get a second shot. Great job. What they did to you was very unfair. () A man who's been a friend of mine for a long time, he looks fantastic."
    },
    {
      "text": "He just had his 49th birthday and he looks much younger than that actually. I don't know how the hell, he really looks so much better than 49. And I have to tell him about the meeting. Should I tell him, Steve, real fast? So we had a meeting when it was looking bad, we had one of the 29 or 30 inescapable things that happened. We had the John McCain incident that I want to see the one who wasn't caught. We weren't the one who wasn't caught."
    },
    {
      "text": "And people said, \"Sir, that doesn't work\" and that was fine, but we had a lot of inescapable situations. But probably the biggest inescapable one was the one we know about, Steve, right? So it doesn't matter what one because I don't want to exactly bring it up, but we had a group of people around in my apartment and it looked like it was in trouble and we went through a list of very well-known Republicans. () What do you think we should do?"
    },
    {
      "text": "\"Sir,\" one said, \"Sir, I think you should resign,\" and this is in the middle of the campaign. I already got the nomination. This is in October. \"I think you should resign, sir and I think we should appoint either Mike Pence or somebody else.\" How about that one? \"And maybe,\" he said, and \"maybe they'd have a chance of winning.\" I went to the next, we had about 10 people, went to the next. \"Sir, I don't think you'll be able to make it, sir.\" I went to one person who said something that was so horrible."
    },
    {
      "text": "They said, \"Sir, you can stay in and have the single greatest defeat in the history of politics or you can get out. We'll appoint a Republican to take your place and maybe that person will have a chance of winning.\" And we went through it like this. () And then I got to Steve Bannon. I said, \"Steve, so what would you say we should do?\" It's a true story. This is a true story. I said, \"So Steve, what would you say I should do?\" \"You should stay in, sir."
    },
    {
      "text": "You're going to win this race 100%.\" He's the only guy, right? \"100%.\" True story, it's a true story. He said, \"100%.\" I said, \"That guy's the greatest bullshit artist I've ever heard.\" I don't know, I don't know if he believed it, but boy did he say it, and I think he was convinced. Steve, did you really believe that? He said, \"Yes, I believed him,\" but it is true. He was the only one in the room. And then I made my decision. I said, \"Look, here's the way I look at it. If I get out, it would be historic."
    },
    {
      "text": "It'll be the only time anyone's ever gotten out before a race after getting the nomination in a landslide. I mean, we wiped them out. We started with 18 and every week, one out, two out, three out, and it was a great campaign and we were doing really well.\" () But this one particular event came up and I said, \"If we get out, it's historic. If we don't get out, we lose. If we lose, we lose. We're realistic, it could happen, right? And it's not that big."
    },
    {
      "text": "It's big, it's horrible, but it's not historic because somebody always loses a little bit, right?\" I didn't like the concept of it, but the other was [inaudible :59], so I said, \"We'll stay in,\" and did we kick ass after that, right? And you know we probably have to go a little further 'cause they seem to be enjoying this, Steve."
    },
    {
      "text": "We could go on about this one, but the next day or very shortly thereafter, we had the debate starring crooked Hillary Clinton, who I don't call crooked anymore because I use the name now for Biden. Now we call her beautiful Hillary. She's a beautiful woman. Now I want to use that name 'cause it's more appropriate. I like... which is better, sleepy Joe or crooked Joe? I like crooked better. () What do you like better? Ready? A poll, a free poll. Crooked Joe or sleepy Joe? I may have to change it back."
    },
    {
      "text": "But I went onto that stage just a few days later and a general who's a fantastic general actually said to me, \"Sir, I've been on the battlefield. Men have gone down on my left and on my right. I stood on hills where soldiers were killed. But I believe the bravest thing I've ever seen was the night you went onto that stage with Hillary Clinton after what happened. And then that woman asked you the first question about it.\" And I said, \"Locker room talk. It's locker room talk. What the hell? What are you talking?"
    },
    {
      "text": "Locker room talk.\" That was not a great... and you know I dropped 11 points, 11 points and then after the debate, I went up 13 points. You remember that? I went, boom, boom. It looked like somebody with a really bad heart. It went like this, bing, bing. There was a little gap. In fact, to this day, people say what the hell was this event? () I can tell you, but we won't get into it, but that was an incredible event, but it was an incredible campaign and we won, and nobody thought we could win."
    },
    {
      "text": "Nobody thought any Republican could win. And now they're starting to say, we can. The Washington Post had us 11 points up and they said, \"This is an outlier.\" They paid a million and a half dollars for a poll and they said their own poll is an outlier. I said, \"This is like...\" So then they had it rechecked and it turned out to be 12 points. You know that. They haven't announced it. So we're going to give it a shot. And I'll tell you what, I've never seen enthusiasm like I've seen right now, Steve."
    },
    {
      "text": "There's never been enthusiasm. () We did great with one. We did better with two, but there's never been anything like this. And Gavin, I will tell you in writing down, and I was just asking Secret Service, \" How the hell do they know I'm in the car 'cause we have windows this thick.\" They're really good, very good. I have guys walking up to that thing. If they held a little thing, I'd say, \"Go ahead, shoot, shoot.\" You know what happens? The bullet bounces back and kills them. That's when I got them."
    },
    {
      "text": "They say, \"I got this guy.\" I got them. Go ahead and shoot, here I am, shoot, bing, bong, that's the end. The windows are that thick. And by the way, it's a Saturday night, there's not a lot to do. So we'll stay here for a while. Do we agree? And another person who's a warrior, she happens to be a beautiful woman, but I never think about that because I never talk about beauty. To me, I can see the most beautiful woman in the world, it doesn't register with me at all. Beauty doesn't matter."
    },
    {
      "text": "But she's beautiful, but she's a great lawyer and she's been a tremendous protector of a lot of very important people and she's done an incredible job and she has tremendous courage. I have these high-priced lawyers, and they're fine, but they go out and I say, \"Go speak to the press.\" And you have these animals out there. Oh, there they are, right up there. You have these animals out there. They're vicious animals."
    },
    {
      "text": "() And these high-priced guys, they're beautiful guys, nice, beautiful suits, everything nice and I pay a lot of money to these people. Go out and speak to the press. \"Sir, I'd rather not.\" And she goes, \"I'll do it.\" And she goes out there. She's fierce. She's a fierce person and we appreciate it. Alina. Alina Habba. Alina. She says, \"I'll do it, sir. I'll do it.\" She goes, and she makes the news every night. She makes the news every night, screaming at these maniacs. Alex Bruesewitz, who has been incredible ..."
    },
    {
      "text": "Where's Alex? I want to see him. Alex Bruesewitz. Where are you, alex? Thank you. What a job you've done, between you and DC Draino and Alex Stein and Jack. Where's Jack? Where's Jack? Where is he? Jack, I want to see you. Great job, Jack. Thank you. What a job you do. () We have an incredible thing. We're always talking about the fake news and the bad. But we have guys, and these are the guys should be getting Pulitzers."
    },
    {
      "text": "We're suing the Pulitzer organization, and we're suing them because they gave the Pulitzer Prize to people that reported on fair and accurately Russia, Russia, Russia, but it turned out to be totally false. Even they admit now it was a scam. We're actually suing them. Right, Boris? We're suing them, and I hear we're doing very well. They haven't got a response. () We're demanding that the Pulitzer Prize be taken away from these people that got it because they were wrong."
    },
    {
      "text": "The ones that should get it are also here, many of them. They're incredible people, and they should get it. We want them to get it, and we also want damages because great damage was caused by their bad reporting. Raheem Kassam. Raheem. Where is Raheem? What a good job you do. Thank you, Raheem. Great job. Scott Presler, fantastic. Thank you, Scott. And of course, Kash Patel. Thank you, Kash. Great job. Get ready, Kash. Get ready. All of you guys, get ready. () Paul Ingrassia, thank you very much. You've been fantastic."
    },
    {
      "text": "What a writer. Thank you. Thank you. What a job. And all of the countless other distinguished guests that we have here, we have too many to go through, but I wanted to mention a few. They're really incredible people. They're very brave people, and they're very great patriots. 11 months from now, each of you will vote in the most important election of your lives. It's the most important election. () I used to say 2016 was the most important election, but this is far more important."
    },
    {
      "text": "We had a border problem in 2016, but it was minor by comparison to this. I ran the campaign on the border, and I won, but this is far greater. In 2020, I kept saying to my people, \"I want to talk about the border.\" They said, \"Sir, we don't have a problem. You straightened it out.\" I said, \"That's good. I want to tell them that.\" He said, \"Nobody wants to listen to that, sir. You straightened it out.\" () We had a great border. I couldn't even talk about it. Now, the border crisis is the worst in history."
    },
    {
      "text": "There's never been any border like this from any country. So this election will decide whether your generation inherits a fascist country or a free country, whether you have the rule of tyrants or the rule of law, whether America will be destroyed by crooked Joe Biden and his goons or whether we, the people, will make America great again, make America great again, which I think is the greatest phrase in the history of politics. Don't you think? I think so. () Ronald Reagan had let's make America great."
    },
    {
      "text": "So it was different. Somebody said, \"Oh, but Ronald Reagan.\" No, he didn't. Number one, it wasn't a big deal with him. But he had let's make America great, which is okay. But make America great again, how powerful is that? MAGA. MAGA. I tell that to Biden. I say, \"Joe.\" When he gets up, \"We've got to stop the MAGA extremists.\" Yeah, I'm extreme about making America great again. We're extremists. We're extremists. () They can't get away. They can't get away."
    },
    {
      "text": "We almost changed it to KAG, you know that, because we had America great. We were doing so great. We had the greatest economy, all the things. So I had another one, keep America great. But somehow, it never registered the same way. MAGA is the greatest phrase, I think, in the history of politics anywhere. I tell the story that Pat Buchanan, who's a wonderful guy, a great conservative guy, and he became a very famous political pundit, did great. () He had a wonderful life, and I think he's around."
    },
    {
      "text": "He's an older guy right now. But he had a wonderful life, on doing well in New Hampshire. He did well in New Hampshire. We won 50 states. Think of it. Last time, we won 50 states. We won 32 states in the election, but we won 50 states. We probably won 50 states in the election, too, but we won't get into that. But think of it. This is the greatest movement in history. () When you look outside and you see thousands of people, when you see us coming down, I was about to say they couldn't see. The people were going wild."
    },
    {
      "text": "Somebody in my car said, \"You can win New York. The people are going wild.\" And I said, \"How do they know it's even me in the car? Because you can't tell.\" The people are going crazy. They're waving and giving you all sorts of fist pumps and everything. I'm telling you, this is a place that can be won, and we have the team to do it. () For four straight years, our opponents have been waging an all-out war on American democracy."
    },
    {
      "text": "They tried to overthrow the duly elected president, thank you very much, with one hoax, witch hunt, and abuse of power after another, one after another, all of the different things. We had Mueller to take care of. We had more than anybody. Think of it. We had all of that going on, and still people ... I was reading today. Some people, many people considered this to be one of the greatest presidencies. All of the many things we did, greatest tax cuts in history, rebuilt our military, defeated ISIS, Space Force."
    },
    {
      "text": "() We did so much. We became energy independent. We were soon going to be energy dominant. Then they rigged and stole the election of 2020. Since Biden got in, he has been weaponizing government against his political opponents, like a raging third world tyrant. That's what he's been doing. He looks like an innocent guy. I actually don't really know that it's him because I know the people that surround him. I think it's them, and he's the perfect vessel. He's so good."
    },
    {
      "text": "() They love him because he has no idea what the hell he's doing. He has no idea where he is. He can't put two sentences together, and he can't get off a stage. He can never find his way off the stage. This stage has a stair there, a stair here, a stair here, a stair there. Or you could jump off the front. But to show you how dishonest the press is, until I got indicted, I was pretty nice to him because I have great respect for the office of the presidency. You don't mind if I go off teleprompter, Steve?"
    },
    {
      "text": "It's so much better. () Because I have so much respect for the office, so I wasn't really hitting him. In fact, some people said, \"You could hit him harder.\" I said, \"No, he's president. I don't want to hit him that hard.\" Once I got indicted the first time, and then the second, third, fourth, and then they were going to do two more and they called in, \"We're going to indict this guy into office. Stop. Don't do them. Don't do them.\" I could be indictment-proof right now. I don't think they can do it, Sid."
    },
    {
      "text": "I don't think they can do it. But they stopped it. They heard about it. () I think they sent their biggest people, \"Don't do it.\" Local DAs all controlled by the White House. Local attorney generals, state attorney generals. What's happened is since the indictment, the gloves are off. You can't do any worse than this. I got indicted. First time in history. First time in history. I always say Al Capone, the greatest of them all, gangster, Scarface. He'd kill you. He'd kill you, Mr."
    },
    {
      "text": "Congressman, if he thought you were smiling at the table. If you were smiling at him in a way that he thought was mocking, because he was a nasty person, he would kill you. () He would kill many, many people. He was probably the greatest gangster of them all. He got indicted one time. I got indicted four times. Scarface, not a very nice person. But many people that are major criminals, very few have had an honor of being indicted four times. I'll tell you one thing."
    },
    {
      "text": "I'm the first guy that ever got indicted whose poll numbers went up. Nobody. That's a first. Who the hell gets indicted, Matt, and their poll numbers went up? I don't mean went up, I mean like a rocket ship because the people get it. They get it. () But crooked Joe Biden's banana Republic ends on November 5, 2024. You've been seeing what's going on. In the past few weeks, the radical left Democrats and their fake news allies have unveiled their newest hoax, that Donald J."
    },
    {
      "text": "Trump and the Republican Party are a threat to democracy. Do you believe it? Can you believe it? This is their new line. It's here we go again, Russia, Russia, Russia, Mueller, Mueller, Mueller, Ukraine, Ukraine, Ukraine, one hoax after ... () How about FISA? They don't talk about the fake FISA report signed. It's so bad, right? Signed. But no, I'm not a threat. I will save democracy. The threat is crooked Joe Biden. That's the threat. They think that the threat to democracy ... That's what it is, it's a hoax."
    },
    {
      "text": "We call it now the threat to democracy hoax because that's what it is. These guys are so good with misinformation, disinformation, it's a slight difference. You know that, Sid, right? There is a slight difference. If you want, we can talk about it, but let's not bore the audience. () You know that, Bannon? It's like all of the prisoners that are coming out from all over the world in jails and prisons. So people say, \"Why do you say jails and prisons?\" Because there is a slight difference."
    },
    {
      "text": "Well, there's also a difference in dis and mis, right? All of these hoaxes and all of them have been created. This is all they do well. They are sick people. They don't care about our country. They should spend the time on China screwing us on trade. () We would have the greatest country. If they use that sick genius, they could do some wonderful things, but they don't because they're sick."
    },
    {
      "text": "They think the threat to democracy hoax will save Biden from having created the worst inflation in our country's history, a fragile economy that may soon end in a depression, much like 1929. Have you heard that before? You watch. We are very, very close to a depression, the likes of which you have never seen. () We owe $36 trillion, and this guy has no clue. You know that Mitch McConnell gave him $10 trillion for them to hand away like candy."
    },
    {
      "text": "He's almost, I could say, and maybe he is worse than any of them, that he allowed them to have votes. He needed 10 votes, 12 votes. He needed different votes. He gave them many times votes. You add it up. It's close to $10 trillion. They go, and they hand it out like candy. It's the one thing they can say. The only reason they got it is because Mitch McConnell and his little gang of people gave it to them. It's a disgrace to the Republican party, and it's a disgrace to our nation, disgrace."
    },
    {
      "text": "() But I have to be careful when I say that because Matt Gaetz is a big, big fan of Mitch McConnell. He's a big fan. Bannon must love him. You love Mitch. I don't know. He seems to be checked out now. He seems to be checked out. Hey, I hope to hell he gets out of there. The other thing I'll do that nobody else would be able to do or even think about is we will not have a World War III under President Trump, but you might very well have one under what's happening now."
    },
    {
      "text": "() If this happens, this will be a war like no other war. This will be a war the likes of which this world has never seen because of modern day weaponry. I mean think about it in Hiroshima. We've all seen it many times. Nagasaki, just think about it. Multiply that explosive power times 500, Mr. Congressman, 500. That's the kind of power we're talking about. This would be a war like nobody's ever seen, probably obliteration. () Biden is the real threat to democracy for two simple reasons."
    },
    {
      "text": "He's corrupt, and he's incompetent, grossly competent. But we have to fight Democrat misinformation at every corner if the Republican Party is to survive. I mean they're trying to end this party. Not going to happen, by the way, but they're trying. We're not going to let that happen. Much more importantly, if our country survives, our country's in trouble. We're not respected. We're not listened to. () Three years ago, we were more respected, I believe, than this country has ever been. I would call these guys."
    },
    {
      "text": "I would get whatever the hell I wanted from them. I didn't have to even make trips. President Xi respected your president, and he respected our country. Now they laugh at us. They lecture us about all sorts of things. They would have never done that with me. But it's so sad when I see what's happened to our country. We're no longer a leader in the world. () When they talk about Ukraine, we put up 200 billion. The European nations who are approximately the same size as our economy when added up are in for 18."
    },
    {
      "text": "Why doesn't somebody say, \"Equalize,\" like I did with NATO? I said, \"You have to pay your bills.\" I took in $400 billion. Just like with Russia, Russia Russia, the radical left communists, Marxists, fascists are always accusing us of exactly what they themselves are doing. It's what they do best. It's really what they do best. () They're bad on borders. They're horrible on policy. They want high taxes."
    },
    {
      "text": "They're really bad on everything except for cheating on elections, in which they're perhaps one of the most brilliant groups of people in history. Every abuse of power, the fake news is ridiculously claiming I will commit, is in fact being committed by crooked Joe and his thugs. They're trying to lock up their political opponents. They want to lock up their political opponents, in particular, me. Thank you very much. It's an honor."
    },
    {
      "text": "() They're trying to criminalize free speech and take total control over the American people. But then I came along, and I'm standing in their way. Now millions of Americans are joining us. Millions and millions are joining the Republican Party. We've never raised so much money. You know who's giving us the biggest share of the money? People that are paying $61 on average a piece. Think of it. Not the people that are giving us millions and millions of dollars, but the people that are paying $61."
    },
    {
      "text": "There has never been anything like it. () The only one, and it's not even close, is Bernie, crazy Bernie. Bernie had a little thing going. I remember when he had his rallies and if he had 2,000 people, they used to say, \"This rally is massive. It's unbelievable.\" I'd have a rally down the street. We'd have 35,000, and they'd say, \"Trump's giving a rally today.\" They always used to talk about how big his rally ... Remember, Steve? Bernie would have 1,500 people."
    },
    {
      "text": "\"This is a magnificent crowd.\" I'd give one, 35,000 people. \"Trump had a rally, too.\" () These people, they are the most dishonest people anywhere in the world. They're the fake news. Fake news. They are fake. One of our better terms. We've had a lot of good names. I think fake news is one of the best. The only problem is it's not tough enough because they're much worse than fake. They're fake, and they're corrupt. There are a lot of terms, but somehow fake seems to have stuck. So let's leave it that way."
    },
    {
      "text": "() Poll numbers reveal that Black, Hispanic, Asian and just about everybody else want to join the Republican Party right now because the Republican Party is the American dream, not the Democrat Party of open borders, chaos, uniform laughter. They laugh at us all over the world. The world is laughing at us. Can you imagine President Xi? I have to say the press gets very angry when I call him a brilliant person."
    },
    {
      "text": "If I say he's brilliant, the next day article, \"He called President Xi a brilliant person.\" He controls 1.4 billion people with an iron fist. () They want me to say he's just of average intelligence. But the look, the whole thing, he stands in front of a million soldiers. They walk by. They want me to say bad things. I can't say bad things. But can you imagine guys like this? Putin. Many of them, even France, Macron, he's a tricky little guy. No, but they're all sharp. How about Kim Jong Un?"
    },
    {
      "text": "He's got more nuclear missiles. I said, \"Can you do anything else? Let's go to a ballgame or something.\" We became very friendly, and they hate when they say that. () Well, we started off very rough. Steve was there. Remember little rocket man? He's little rocket man. He said, \"I have a red button on my desk.\" And I said, \"I have a red button too, but mine's bigger and mine works.\" We had a meeting. When we had a meeting, it was in Singapore. It was the biggest press gaggle anyone's ever seen."
    },
    {
      "text": "There must have been 10,000 there when I met with Kim Jong Un, because he was getting ready to blow up the world, and I wanted to give it a shot to stop him. () Obama, before you take office, you sit with the president. I said, \"So tell me. What's the biggest problem?\" He said, \"North Korea is the biggest problem by far.\" Remember that? He said, \"The biggest part. I mean there's nothing you can do."
    },
    {
      "text": "He's got a lot of nuclear weapons, and I think he's willing to use them.\" I said, \"Have you called him?\" \"No.\" But actually he did call him. He called him 11 times, and it wasn't responded to because they didn't respect that group of people. They just didn't respect him. () But I was back and forth, and they were nasty. I was calling him little rocket men. ... Fascist indict me. I consider it a great badge of honor. I'm being indicted for you. These are not indictments in the traditional sense."
    },
    {
      "text": "These are Biden indictments against their... This is just against a political opponent and the press refuses to say. They act like these indictments are legit. They're not legit. And with that, he's opened up a Pandora's box that may never let our country be the same. That's a very bad thing what they did to me, because this was something that was not doable. But they've opened up a Pandora's box and I only can say to Joe is be very careful what you wish for, because what you've done is a terrible thing."
    },
    {
      "text": "When a president leaves, especially a very popular... I got 75,000,000 votes that they know of. We're not talking about the millions that were played with. Never forget, our enemies want to take away my freedom because I will never let them take away your freedom. It's very simple, very simple. (:08) They want to silence me because I will never let them silence you. And in the end, they're not after me. They're after you. I just happened to be standing in their way and you've heard that before. I mean that 100%."
    },
    {
      "text": "This is far more than a campaign we're all involved in. This is a great political movement. This is the greatest political movement in the history of our country. There's never been anything close. Together, we achieved the most secure border in US history. We built, as I said, 561 miles of border wall and got Mexico to give us 28,000 soldiers free of charge. You know when they say, \"Mexico didn't pay?\" Mexico paid far more, they gave us 28,000 soldiers. (:55) I said, \"You have to give it to us."
    },
    {
      "text": "If you don't give it to us, we're going to have a problem.\" They said, \" No, no, we're not going to give you soldiers.\" I said, \"Okay, then we're going to tariff all of your products coming into the United States.\" And they said, \"Sir, it would be our great honor to give you as many soldiers as you'd like.\" I got it free of charge. So when they tell you about Mexico didn't pay, Mexico paid much more than if they actually contributed to a war, which was a very hard thing to get done legally."
    },
    {
      "text": "Not to get done, to get done legally. (:25) I took on communist China like no administration in history, bringing hundreds of billions of dollars pouring into our Treasury when no other president had gotten even 10 cents from China. I appointed more than 300 federal judges and three great Supreme Court Justices. And I kept my promise, recognized Israel's capital and opened up the American Embassy in Jerusalem."
    },
    {
      "text": "I also recognized Israeli sovereignty over the Golan Heights, something that nobody thought was possible. And with the Abraham Accords, I even made peace in the Middle East. So we will once again have peace through strength when we become the 47th President of the United States. It's all about peace through strength. (:16) Just this week, crooked Joe Biden raised the prospect of American troops fighting Russian troops in an all-out war. I'm the only candidate who can make this promise."
    },
    {
      "text": "You are not going to have any more wars. You don't need wars. We can solve all of these problems and everyone knows that if we don't solve them, we'll do the same thing to them as we did to ISIS. ISIS was defeated. Nobody thought that was possible, including our wonderful television generals. Three years ago, we had the strongest border in our history. Now we have the worst. Does anybody know the snake? Has anybody heard the snake? Should we do it or not? What the hell? We have nothing to do. Should we do it?"
    },
    {
      "text": "Bannon, should we do it, the snake? So this is about the border. This is about allowing people in that you know there's going to be trouble with, and it was a song. It was an old song. It wasn't meant for this, it was meant for other things, but it's been very popular. Has anyone ever heard it? The snake? It's amazing. All right, you're going to hear it now then. A legendary piece of poetry. (:38) \"On her way to work one morning, down the path along the lake, a tender-hearted woman saw a poor half-frozen snake."
    },
    {
      "text": "His pretty colored skin had been all frosted with the dew. 'Poor thing,' she cried. 'I'll take you in and I'll take care of you.' 'Take me in oh, tender woman. Take me in for heaven's sake. Take me in oh, tender woman,' sighed the vicious snake. She wrapped him up all cozy in a comforter of silk and laid him by her fireside with some honey and some milk. She hurried home from work that night and soon as she arrived, she found the pretty snake she'd taken in had just survived."
    },
    {
      "text": "'Take me in, oh, tender woman, take me in for heaven's sake. Take me in oh, tender woman,' cried the vicious snake.\" (:35) \"She clutched him to her bosom. 'You are so beautiful,' she cried. 'But if I hadn't brought you in by now, you truly would've died.' She stroked his pretty skin again and kissed and held him tight. But instead of saying, 'Thank you, ma'am,' the snake gave her a vicious bite. 'Take me in oh, tender woman. Take me in for heaven's sake. Take me in oh, tender woman,' sighed the vicious snake."
    },
    {
      "text": "'I saved you,' cried the woman, 'And you've bitten me. But why? You know your bite is poisonous and now I'm going to die.' 'Shut up, silly woman,' said the reptile with a grin. 'You knew damn well I was a snake before you took me in.'\" That's what's happening to our country. That's what's happening to our country. We're taking in people into our country that shouldn't be in our country. (:49) Thank you very much."
    },
    {
      "text": "On my first day back in the White House, I will terminate every open border policy of Biden and the Biden administration and stop the invasion of our country. On Tuesday, we had the single highest day of illegal border crossings ever recorded. We had 12,000 in one day. Many coming out of the prisons, many coming out of mental institutions all over the world."
    },
    {
      "text": "In Staten Island recently, two elderly World War II heroes and a Korean War veteran were thrown out of their nursing home to make room for these illegal alien migrants. They were thrown out. They were 94 years old. This is just one more reason why upon my inauguration, we will begin the largest domestic deportation operation in American history."
    },
    {
      "text": "(:47) I will immediately restore and expand the Trump travel ban on entry from terror-plagued countries, and I will implement strong ideological screening for all immigrants. And by the way, the travel ban worked 100%. I didn't want to talk about it during my term, but I talk about it now. We didn't have one attack. We didn't have one attack. We were safe. And you know who else was safe? Israel was safe and Ukraine was safe, and Taiwan was safe. They would've never done it."
    },
    {
      "text": "If you hate America, if you want to abolish Israel, if you want to sympathize with Jihadists, then we don't want you in our country and you are not getting in. You're not coming in. (:28) I will terminate crooked Joe Biden's electric vehicle mandate on my first day in office. We want cars that will go far. You'll be allowed to buy gasoline powered cars, hybrids, and also, you'll be allowed to buy an electric car if that's what you want. You will have your choice, and you'll also have your choice on schools."
    },
    {
      "text": "We will have school choice also. You'll have car choice and school choice. We will not force the trucking industry to go electric when everyone knows that it is economically impossible for them to survive. Crime in our Democrat-run cities is out of control like never before. Every one of them is setting records in murder and violence. Their court systems are rigged against people like you and me. (:17) The whole world is watching my trial where I've been proven innocent every day. Every day they have nothing."
    },
    {
      "text": "Alina knows that better than anybody. The case going on right now in New York State Supreme Court is a ridiculous, never-brought-before case, using a statute against me that has never been used, where a jury is not allowed, I'm not allowed a jury. And where a radical left judge has refused to let go of the case, which was brought by the most corrupt Attorney General in the United States, working in close association with Washington and the DOJ. They're working in very close association."
    },
    {
      "text": "And if it was brought, it should have been brought in the commercial division. This judge would not let it go. I have proven my innocence. Literally every single day we prove total innocence. (:10) The clubhouse appointed a highly partisan judge who is crazy, ruled violently and viciously against me before he ever knew what the case was about and before we even started the trial."
    },
    {
      "text": "He ruled against me before the trial was started, it should have never gone to court in order to make the case for the racist Attorney General, Letitia 'Peekaboo' James. He had to get the values of my properties down very substantially from the true values. (:41) So he stated as an example, that Mar-a-Lago and Palm Beach, Florida was worth $18 million. When in fact, the real number is anywhere from 50 to 100 times that amount, maybe higher than that."
    },
    {
      "text": "An unassailable expert testified just this week that it's worth much more than $1 billion. Another highly respected expert witness in the case testified on Thursday to the Attorney General, \"You really ought to be ashamed of yourself for bringing this case against this man.\" His expert finding after exhaustive research, one of the most respected people in the country, after exhaustive research is there is no evidence whatsoever of any accounting problems or fraud."
    },
    {
      "text": "There is not a single reference to a violation of any accounting provision. He concluded by saying, \"If Mr. Trump was his student at the Stern School of NYU,\" where he's a top professor, one of the most respected people in the school, \"President Trump would get an A on his financial statements. He would get an A.\" (:49) \"In over 40 years,\" he said, \"I've never seen a statement that provides so much detail and is so transparent as these statements."
    },
    {
      "text": "These statements also have an ironclad disclaimer clause stating that the user must use his own due diligence and analysis and not rely in any way on the statements.\" Right there, we win the case, but this guy refuses to acknowledge it. The prosecution star witness, their only witness, stated on the stand loud and clear, Boris, that he lied. He said he lied. \"I lied.\" It was like Perry Mason. He said he lied. You did a very good job on that, Alina. I'm proud of you. This was like Perry Mason at the end."
    },
    {
      "text": "\"Yes, I did it. I did it.\" It's always the last three minutes. It was like the last three minutes too. He said he lied. He actually said he's the only witness they had. (:44) So we asked the judge to dismiss the case and he said, \"No way I'm dismissing.\" It's a hell of a thing. It's a kangaroo court. This judge couldn't care less. He's out to do a job on all of us and we cannot let it happen. An Appeals Court threw out approximately 90% of the case was thrown out."
    },
    {
      "text": "But this judge openly refuses to honor the Appeals Court decision as he trudges forward. Facts mean absolutely nothing to him. He cannot wait to render a decision in favor of the crooked Attorney General, who used me to run for her current position. And then remember, she ran against our Governor now, she ran for Governor and she failed, only getting a few points in the polls. She dropped out. She then went back to the Attorney General's office stating that she had something very big to do."
    },
    {
      "text": "You know what the very big is? Me. She's a vicious lunatic. She's an incompetent. (:44) As everybody knows, she was the one, she sued ExxonMobil in 2019, Letitia James, in a much watched legal battle. The end result was that Exxon moved out of New York. Do you think that's a good idea? ExxonMobil, one of the biggest companies in the world left New York and they went to Dallas. Great job, Letitia. And that's what's happening right now. Businesses are fleeing our country."
    },
    {
      "text": "Businesses are leaving this whole horrible system. They're leaving the state. They're leaving our country. Our country has changed so radically. It's business unfriendly and they're going to other places, but they're fleeing New York State and no businesses are coming back. Nobody wants to come back into New York State, but they're actually fleeing to other countries."
    },
    {
      "text": "(:40) She and the judge are having a great time together as they mock the system and disregard the Appellate Division's decision with a laugh and with a smile. I've never heard of a case where you win in the Appellate Division and the judge says, \"I don't care. I'm not going to abide by the Appellate Division.\" That's what we have. And that would've meant 90% of the case would be won. So all of this, while murder and violent crime is taking place right outside of this courthouse."
    },
    {
      "text": "(:09) So just to wrap up, I want to say this. We have a sick country. As a couple of you have said, we have a nation in decline, in very, very serious decline. We're going to run in New York, we're going to run strong in New York. We're going to do things that nobody ever believed. We're going to win New York, we're going to win New Jersey, we're going to win Virginia. And then we're going to win a lot of the states that we're expected to win. And we're going to do a job like nobody's been able to do."
    },
    {
      "text": "(:38) And we're going to bring law and order back. We're going to do something that I will say is slightly controversial, but it shouldn't be. We are going to indemnify policemen and precincts and states and cities from being sued. We want them to do their job. Our police and law enforcement has to come back and they want to come back, and they want to do their job. And we are going to indemnify them so they don't lose their wife, their family, their pension and their job."
    },
    {
      "text": "We are going to indemnify policemen and law enforcement and we're going to tell them to get out. We love you. Do your job. (:22) So I want to thank everybody. Mr. Mayor, I want to thank you very much. I want to thank everybody for being here. This is a record crowd. This is a record time. We're going to be back in New York a lot. We're going to actively campaign in New York. We are going to win the election. We're going to win this great state, once great state, and with you at my side we will demolish the deep state."
    },
    {
      "text": "We will expel the warmongers from our government. We will drive out the globalists. We will cast out the communist, Marxist and fascist. We will throw off the sick political class that hates our country. We will rout the fake news media. We will evict Joe Biden from the White House and we will finish this job of making our country great again once and for all. Thank you very much everybody. Thank you. Thank you very much. Thank you. Thank you."
    }
  ]
}