{
  "speech_id": "097",
  "title": "Donald Trump Rally in Reno 12/17/23 Transcript",
  "date": "20231218",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-rally-in-reno-12-17-23-transcript",
  "topics": "Economy, Climate, Foreign Policy, Government Policy",
  "num_segments": 29,
  "content": [
    {
      "text": "... the worst presidents in the history of the United States and added them up, they would not have done near the destruction to our country as Joe Biden and the Biden administration has done. If you want to save America from crooked Joe, then get every patriot and get them out to vote in their local caucus meeting on Thursday, February 8th. Go with Michael McDonald and all of the great people that are working so hard to turn your state around. You got to get out there. You got to vote."
    },
    {
      "text": "And again, remember please, they say we're going to win by a lot. Don't count on it. Just get out and vote. Otherwise, bad things happen. It's happened before. Bad things can happen. Remember, we're not talking about the meaningless government run universal mail-in ballot primary on Tuesday, February 6th."
    },
    {
      "text": "They have another, they have a primary, which doesn't matter because you have caucus and there will be no delegates awarded for the primary, so it really is, as I said it, the caucus is the only way to vote for President Trump. () It's safe, it's secure, transparent, but it's also the only one that counts. It's February 8th. February 8th. Bring in as many people as you can. Sign up at nv.donaldjtrump.com. That's very important. Get out and vote even if you think we're going to have a massive landslide."
    },
    {
      "text": "Don't believe those polls as I said, assume you're one point, two points or three points down. Together we're taking on some of the most menacing forces and vicious opponents in our history. There's never been anything like it. And in conclusion, it doesn't matter how hateful and corrupt the communists and criminals are we're fighting. We're fighting against some really vicious people within our country."
    },
    {
      "text": "We have vicious people outside, but I believe truly that the people inside of our country are far worse because we can handle with the right president, in particular president, we can handle China or Russia. We can handle North Korea, Kim Jong Un. I saved us from a nuclear war. If Hillary Clinton got in, you would've ended up with millions of people being killed in a nuclear war."
    },
    {
      "text": "() We can handle that if we have the right president, but what's very difficult are these corrupt communists that we have within our own country. They're very dangerous people, and you must never forget, this nation does not belong to them. This nation belongs to you, it belongs to you. This is your home. This is your heritage, and our American liberty is your God-given right."
    },
    {
      "text": "From Las Vegas to Carson City, from Henderson to Minden and from Elko to right here in Reno, we stand on the shoulders of red-blooded American patriots who poured out their heart, sweat, and soul to secure our liberty and to defend our freedom. Nevada was founded by some of the toughest men and strongest women ever to walk the face of the earth."
    },
    {
      "text": "This state was built by pioneers and prospectors, miners and cowboys, laymen, builders, innovators and trailblazers who tamed the frontier, raised up the mighty Hoover Dam, transformed a sprawling desert into a shining oasis and lit up the brilliant lights of the Las Vegas strip. That's what it is. Our American ancestors risked everything to make this into the greatest nation in the history of the world. (:53) But now we are a nation in decline. We are a failing nation."
    },
    {
      "text": "We are a nation that has the highest inflation in 50 years where banks are collapsing and interest rates are skyrocketing. Likewise, we are a nation where energy costs have reached the highest levels in our history. We are no longer energy independent or energy dominant as we were just a few short years ago. We are a nation that is begging Venezuela and others for oil. \"Please, please, please help us,\" Joe Biden says, and yet we have more liquid gold under our feet than any other country anywhere in the world."
    },
    {
      "text": "We are a nation that just recently heard that Saudi Arabia and Russia will be reducing their oil production while at the same time substantially increasing the price. And we met that threat by announcing that we will we no longer be drilling for oil in large areas in Alaska or elsewhere, anywhere in our states. We are a nation that is consumed by the radical left's Green New Deal, yet everyone knows that the Green New Deal is fake. It is really the green new scam."
    },
    {
      "text": "(:18) We are a nation whose leaders are demanding all electric cars despite the fact that they can't go far, cost too much, and whose batteries are produced in China with materials only available in China when an unlimited amount of gasoline is available inexpensively in the United States but is not available in China."
    },
    {
      "text": "And now we are a nation that wants to make our revered and very powerful army tanks the best in the world, all electric, so that despite the fact they are also not able to go far, fewer pollutants will be released into the air as we blast our way through enemy territory, at least in an environmentally friendly way. And they also want to make our jet fighters with a green stamp of energy savings through losing 15% efficiency. That's all we'll lose, sir. That's all we'll lose."
    },
    {
      "text": "But allowing us to keep our enemy's atmosphere clean of emissions as we viciously and unceremoniously attack them at levels never seen before. Who are these people that would do this to us? Who are these people? It's so sad. It's so sad. It's so sad. (:51) We are a nation that ended oil exploration and production in the US just as the price of oil reached an all time high. What country would do such a foolish and self-destructive thing? Can we be energy independent or even energy dominant ever again? Yes, oh yes."
    },
    {
      "text": "And quickly says President Trump. Yes, oh yes and quickly. We can. We are a nation that surrendered in Afghanistan leaving dead soldiers, American citizens and $85 billion worth of the finest military equipment in the world behind. And also abandoning Bagram, one of the biggest military bases anywhere in the world and only one hour away from where China makes its nuclear weapons. One hour away where weapons of mass destruction are being produced. And we left it, one of the biggest in the world."
    },
    {
      "text": "And we are a nation that allowed Russia and Ukraine to fight killing hundreds of thousands of people and it will only get worse. It would never have happened with me as your president. (:11) And for four straight years it didn't happen. Likewise, the horrifying attack on Israel would never have happened. They wouldn't even have thought of doing such a thing if President Trump was in the Oval Office. They would not have even thought about it. Iran was broke under President Trump."
    },
    {
      "text": "They didn't have the money to fund Hamas, Hezbollah and all of the other instruments of terror that they can now fund very easily. But those sanctions were lifted by a corrupt Biden administration and now Iran as a rich country with $200 billion and another 6 billion for hostages and $10 billion for electricity to Iraq all compliments of the incompetent Biden administration. And China with Taiwan is next."
    },
    {
      "text": "We are a nation that allows radical left terrorists to violently attack our cities, leaving behind massive destruction and death. And nothing happens to the criminals that do these terrible things. There is no punishment. But when people who love our country protest in Washington, they become hostages and prisoners unfairly imprisoned for long periods of time. We are a third world nation that has weaponized its law enforcement against the opposing political party like never, ever before."
    },
    {
      "text": "(:38) We've got the Federal Bureau of Investigation that won't allow bad election changing facts to be presented to the public and which offers $1 million to a writer of fiction about Donald Trump to lie and say it was actually fact. Where Hunter Biden's laptop from hell was rushing this disinformation and the FBI knew it wasn't, but 51 intelligence agents said it was. And a Department of Justice that refuses to investigate egregious acts of voting irregularities and fraud."
    },
    {
      "text": "And we have a man who is totally corrupt and the worst President of the history of our country who is cognitively impaired and in no condition to lead and is now in charge of dealing with Russia at possible nuclear war, which would be World War III and far more devastating than any of the previous world wars because of the weaponry involved, because of the power of the horrible, horrible weaponry. We are a nation that no longer has a free and fair press."
    },
    {
      "text": "Fake news is all you get and they are indeed the enemy of the people. (:56) They refuse to discuss the Biden crime family, but enjoy covering the false indictments of Donald J. Trump who has done nothing wrong except win an election. We are a nation where free speech is no longer allowed and where crime is rampant and out of control like never before."
    },
    {
      "text": "We are a nation that is allowing Iran to build a massive nuclear weapon and China to use the trillions of dollars it has taken from us to build a military to rival our own. And less than three years ago, we had Iran, China, Russia and North Korea in check. They respected us. They were afraid of us. They were never going to do a thing to us and everyone knows it. Now Russia and China are holding summits to carve up the rest of the world."
    },
    {
      "text": "And perhaps most importantly, we are a nation that is no longer admired, respected, or listened to on the world stage. We are a nation that in many ways has become a joke and we are a nation that is hostile to liberty, freedom, faith, and even to God. (:13) We're a nation whose economy is collapsing into a cesspool of ruin, whose supply chain is broken, whose stores are not stocked, whose deliveries are not coming, and whose educational system is ranked at the bottom of every single list."
    },
    {
      "text": "We are a nation where large packs of sadistic criminals and thieves are allowed to go into stores and openly rob them, beat up and kill their workers and customers and leave with armloads of goods but with no retribution. Where the authority of our great police has been taken, where their families and pensions have been threatened and their lives would be destroyed for the mere mention of the words law and order."
    },
    {
      "text": "We are a nation where fentanyl and all other forms of illegal drugs are easier to get than groceries to feed our beautiful families. We have become a drug infested, crime-ridden nation, which is incapable of solving the simplest of problems. We will institute the powerful death penalty for drug dealers where each dealer is responsible for the death, during their lives, of 500 people or more. This is the the only thing that will work. (:33) Let me know when you're ready."
    },
    {
      "text": "Mothers will never again be forced to watch their children overdosing and hopelessly dying in their arms screaming, \"What can I do? What can I do?\" We are a nations whose once revered airports are a dirty crowded mess. You sit and wait for hours and then are notified that the plane won't leave and they have no idea when they will, where the ticket prices have tripled. They don't have the pilots to fly the planes."
    },
    {
      "text": "They don't seek qualified air traffic controllers and they just don't know what the hell they're doing. We are a nation that has lost its confidence, willpower, and strength. We are a nation that has lost its way, but we are not going to allow this horror to continue. Three years ago we were a great nation and we will soon be a great nation again. It was hard-working patriots like you who built this country and it is hard-working patriots like you who are going to save our country."
    },
    {
      "text": "We will fight for America like no one has ever fought before. With you at my side, we will demolish the deep state, we will drive out the globalists, we will cast out the communists, we will throw off the sick political glass. We will rout the fake news media. We will drain the swamp and we will liberate our country from these tyrants and villains once and for all. We will be liberated. Like those patriots before us, we will not bend, we will not break, we will not yield. We will never give in."
    },
    {
      "text": "We will never give up and we will never, ever back down. With your support, we will go on to victory, the likes of which no one has ever seen before. We will evict crooked Joe Biden from the White House and we will take back our country on election day 2024. The great silent majority is rising like never before. And under our leadership, the forgotten men and women will be forgotten no longer. We will love our country. We will take care of our country. We will pray to God for our strength and for our liberty."
    },
    {
      "text": "We will pray for God and we will pray with God. We are one movement, one people, one family, and one glorious nation under God. And together we will make America powerful again. We will make America wealthy again. We will make America strong again. We will make America proud again. We will make America safe again. And we will make America great again. Thank you very much. Thank you Reno. Thank you Reno. Thank you Nevada. God bless you all. God bless you."
    }
  ]
}