{
  "speech_id": "101",
  "speaker": "Trump",
  "title": "Trump Holds Rally In Iowa Moments After Colorado Supreme Court Blocks Him From Ballot Transcript",
  "date": "20231220",
  "url": "https://www.rev.com/blog/transcripts/trump-holds-rally-in-iowa-moments-after-colorado-supreme-court-blocks-him-from-ballot-transcript",
  "topics": "Economy, Immigration, Foreign Policy, Government Policy",
  "num_segments": 34,
  "content": [
    {
      "text": "Waterloo, thank you very much. It's great to be here. And a lot of people outside, a lot of people outside. We want to stay right here and I want to thank you very much. This is an honor. We cover all corners of your great state, you know that. And they said, \"Waterloo. What about Waterloo?\" I said, \"We got to get to Waterloo.\" So here we are. And I'm thrilled to be back in your incredible state with thousands of proud, hardworking American patriots. Let me begin by wishing you all a very merry Christmas."
    },
    {
      "text": "Do you remember about seven years ago, I came, I said, \"They're going to be saying Merry Christmas again\" because department stores, of course, they have other problems now. They're being robbed. The department stores right now, they have very big problems. 400-500 people run into them, grab everything, run out, nothing happens because our law enforcement's not allowed to do their job. They're great. They're not allowed to do their job, so they have other problems too, but they say Merry Christmas now at least."
    },
    {
      "text": "And it's very important. () That was a big deal and now nobody even thinks about it. We say Merry Christmas. I'm honored by that. We're just 27 days away from Iowa's first-in-the-nation. Thank you very much President Trump because you're first-in-the-nation because I said you were first-in-the-nation. It's very simple. And the caucuses are a big deal."
    },
    {
      "text": "On Monday, January 15th, we're going to win the Iowa caucuses and then we're going to crush crooked Joe Biden next November, and we're going to, very simply, make America great again. Thank you. Thank you guys.I want to thank a very special person. She stepped up very early and very strong and she's a highly respected. We have to call everyone a politician, I guess, if you run for office. I think she's probably your most popular politician right now in Iowa. Brenna Bird, your Attorney General. Thank you, Brenna."
    },
    {
      "text": "Thank you, darling. She's been incredible. () A man who endorsed me before I was even running. I said, \"Who's this guy from Iowa that keeps talking about Trump?\" I call him the Marlboro man. He's a handsome guy. State Senator Brad Zaun. Brad, Brad, where's Brad? Thank you, Brad. Thank you very much. He's been great. I mean, he was endorsing me before I ran. I said, \"Who is that guy?\" But he was probably the first one in the whole country. State representatives, Bobby Kaufmann, who's fantastic by the way."
    },
    {
      "text": "His father's fantastic too. Derek Wolfe, Craig Johnson, and of course Iowa GOP Chairman, Jeff Kaufmann. There's a slight relationship there. Thank you very much. Thank you everybody and a great job, and it's fantastic to be with you. We'll be back a few more times, believe it or not. We have that big day coming up. We'll be back. () We got to be sure that we put this thing away. The poll numbers are scary because we're leading by so much."
    },
    {
      "text": "The key is you have to get out and vote because I tell it all the time, if you don't get out and vote, we can put this to bed after Iowa, if you want to know the truth. We can put it to bed for them too, they can go home and forget it. But you have to go out. Don't sit home and say, \"I think we'll take it easy, darling. It's a wonderful day. Beautiful. Let's just take it easy, watch television and watch the results.\" No because crazy things can happen. You got to get out. This is really important."
    },
    {
      "text": "Our country's at stake. We have a country that's never been in trouble like it is right now. So get out and vote whether we're leading in the polls or not leading in the polls, and in this case we're leading by 30-40 points, I guess, but we got to win. Maybe we can win by more than that. () Because if we win in a massive number, but it's a little bit less than that, they'll say, \"Oh, he didn't meet expectations,\" because they're fake news. We know that. They're fake news. They are the biggest fakers in the world."
    },
    {
      "text": "During this holiday season, families all across America are struggling under the brutal weight of crooked Joe's failures, disasters, heartless betrayals and inflation. While the stock market is making rich people richer and I mean, it's crazy what's going on. Rich people are getting richer. Of course, I'm a politician now, so we just keep chugging along, but you're going to have a crash, the likes of which you haven't seen because of what they're doing. It's going to be scary."
    },
    {
      "text": "Biden's inflation catastrophe is demolishing your savings and ravaging your dreams. His sky high energy prices, the highest we've ever had, are brutalizing your wallets. Our border has been erased. Criminals are running wild and our Democrat run cities and thanks to crooked Joe's breathtaking weakness, the world is going up in flames. The whole world is up in flames. () You didn't have any of this stuff when I was president."
    },
    {
      "text": "I'd call and I'd say, \"You can't do that,\" to the head of a country, and they wouldn't do it, and Russia would've never done it, and Hamas would never have done it because Iran wouldn't have given him the money or had the money to do it. No, it's very terrible what's going on. Hard to believe actually. Joe Biden and the Democrat Party are incapable of solving any problems. Crooked Joe Biden is a low IQ individual. He is truly the worst, most incompetent and most corrupt president in the history of our country."
    },
    {
      "text": "Other than that, I think quite a bit of him. Can you believe what's going on in our country? Can you believe what's going on with the border? And the fake news doesn't want to show it too much, certain of them, and I will tell you what's going on in our border. They're coming in by the millions and we have no idea who they are, coming from all over the world. () But with your vote this election together, we're going to save America and we're going to bring our country back from hell. Our country has been in hell."
    },
    {
      "text": "Not one thing has gotten better under crooked Joe Biden. Under the Trump administration, you were better off. Your family was better off, your neighbors were better off, and our country was better off. And you're also much safer when you had me behind the desk of the Oval Office. You were better off five years ago. Think of it."
    },
    {
      "text": "Just ask yourself, were you better off five years ago or are you better off today with the inflation with bacon that cost you four times higher than you would've had to pay a little while ago? It's going up. Nobody's ever seen anything like it, but what a difference a president makes. A president makes a big difference. Since Joe Biden took over, we've had a three year inflation rate of over 20%. Under my leadership, inflation was non-existent, and we had gasoline at $1.87 a gallon."
    },
    {
      "text": "() After three years of Bidenomics, the average monthly mortgage has gone from $1,700 under my administration to $3,400 under this terrible administration. As long as Joe Biden is in the White House, the American dream is dead. It's dead. There is no American dream. But all of that will change the minute the polls close on election night 2024. It's going to all change. The next economic boom will begin the instant the world knows that crooked Joe Biden is gone, and Donald J."
    },
    {
      "text": "Powered by the momentum of our historic victory, by Christmas of next year, it's a couple of months later, by Christmas of next year, the economy will be roaring back, energy prices will be plummeting, the hoards of people charging across our border will have totally ended, the invasion will have stopped."
    },
    {
      "text": "() And I heard somebody today say, one of these genius analysts, \"The stock market's good, the rich get richer, but the stock market's good because they think Trump is going to win the election.\" And I believe that's true, and whatever good they have right now is the fumes of what we left them. It's coming off the fumes of what we've left them. But the stock market is good because a lot of people think we're going to win the election, so that's an interesting fact."
    },
    {
      "text": "I felt that, but I didn't want to say it, but I think we will say it because just like three years ago, they will know that I will catch. And when you have people that are pouring across the border at levels like no country has ever seen, not us, no country has ever seen, third world nations have never seen. They'd stop them with sticks and stones, I say."
    },
    {
      "text": "() But they'll know that I'll catch them and will send them home and the entire world will be safer and more peaceful because everyone will know that the days of Biden surrenders are over. So many mistakes. There's been nothing good that's happened, nothing good. What good has happened in the last three years? Our country's gone to hell. As soon as I get back in the Oval Office, I'll also immediately end the war on Christians. I don't know if you feel it. You have a war. There's a war."
    },
    {
      "text": "Under crooked Joe Biden, Christians and Americans of faith are being persecuted and government has been weaponized against religion like never before. And also presidents like never before. Here I am. I always say Al Capone was treated better than I was treated. Scarface, Al Capone, he was a tough one. Biden and his corrupt department of injustice have sent SWAT teams to arrest pro-life activists. They've targeted conservative parents of school board meetings who don't want filth taught to their children."
    },
    {
      "text": "It's filth. What they're teaching in schools is filth and nonsense, and we can't let that happen, but they're being targeted. () And now the communist Marxists and fascists are going hard after Catholics. Even plotting to send spies into Catholic churches. It's all come out just like in the Soviet Union from days gone by. Now, think of it, if you're Catholic, why would you vote for a Democrat? What they're doing to Catholics, I don't know what's going on with the Catholics, but they're really being persecuted."
    },
    {
      "text": "Why would you vote for Biden and why would you vote for a Democrat? A new report from the House Judiciary Committee proves that the Biden FBI actually targeted Catholics as potential domestic terrorists. You believe this? And evangelicals will not be far behind because when that starts, it starts happening on a very major scale. When I'm back in the White House, never again will your government be used to target Christians and other religious believers."
    },
    {
      "text": "Upon taking office, I will create a new federal task force on fighting anti-Christian bias to be led by a fully reformed department of justice that's fair and equitable. Its mission will be to investigate all forms of illegal discrimination, harassment, and persecution against Christians in America. They are going after Christians in America. Who can believe all this stuff? It's not believable, is it? But it is fact. It's just like so many of the other things."
    },
    {
      "text": "When I stand up and I say that we will stop and I've said it, we will stop men from participating in women's sports. I mean the whole thing. No, but things that you say that you can't believe, you're up here and saying it. We are for parental rights. You have to say that. () No, no, think of it. We are for parental rights. Who believes it? 10 years ago, 15 years ago, who would ever have to say a thing like that? We're for parental rights. Of course we're for parental rights, but the Democrats aren't. They're fascists."
    },
    {
      "text": "They're not. They want school boards. They want people to take your children and do things with your children that are not even speakable. Americans of faith are not a threat to our country. Americans of faith are the soul of our country, and they have been from the beginning. I will defend religion and I will defend in God we trust. We will defend, in God we trust, which is... And you know that very important phrase is under siege. You do know that, right? We will defend it 100%."
    },
    {
      "text": "When Joe Biden lit the national Christmas tree earlier this month, he completely failed to even mention the birth of Jesus Christ, which is hard to do if you're celebrating Christmas, right? He didn't mention Jesus Christ in his remarks. Not for three years. He hasn't mentioned that and barely mentioned God. () When I was president, we brought back the beautiful phrase, \"Merry Christmas,\" and I said I'd do that."
    },
    {
      "text": "I'm very proud of that actually, because as I said at the beginning, it was really under siege, and when I lit the Christmas tree each year, it was my honor to publicly celebrate the true source of Christmas joy, which is Jesus Christ. As president, I kept every promise I made to Christians and more, and I think everybody in this room understands that very well. That's pretty well documented. In our first four years, we appointed nearly 300 federal judges and three great Supreme Court justices."
    },
    {
      "text": "I stood up for religious liberty at home and all around the world. I protected innocent life and I defended the Judeo-Christian values of our nation's founding. I proudly recognized Israel's eternal capital and opened the American Embassy in Jerusalem, which is a big thing. () I also recognized Israeli sovereignty over the Golan Heights, and they were looking to get that for 72 years. They'd fly in, they'd fly out, they'd fly in."
    },
    {
      "text": "Every year, they'd fly in, they'd discuss it, they'd fly out, and I got it done in about 12 minutes. We got it done very quickly. And with the historic Abraham Accords, I even made peace in the Middle East. Unfortunately, they haven't taken it any further. It should have been taken. We could have had everybody signed up. It's no wonder crooked Joe Biden and the far left lunatics are desperate to stop us by any means necessary."
    },
    {
      "text": "They're willing to violate the US constitutions at levels never seen before in order to win this election. Joe Biden is a threat to democracy. It's a threat. () They're weaponizing law enforcement for high level election interference because we're beating them so badly in the polls. The new CBS poll, remember I always used to talk about polls, but only if they were good. I don't mention them if they were bad. I had a tendency if they were bad, I didn't talk about them. I don't know."
    },
    {
      "text": "That's probably a little bit like the fake news would do, so I feel very embarrassed by it. But the new CBS poll just out has us at 58% of the state with the sanctimonious 40 points behind us, 40 points. Three years ago, we were a great nation, and we will soon be a great nation again. It was hardworking patriots like you who built this country, and it is hardworking patriots like you who are going to save our country. We will fight for America like no one has ever fought before. 2024 is our final battle."
    },
    {
      "text": "With you at my side, we will demolish the deep state. We will expel the warmongers. We will drive out the globalists. We will cast out the communists, Marxists and fascists. We will throw off the sick political class that hates our country. We will rout the fake news media. We will evict Joe Biden from the White House, and we will finish the job once and for all. The great silent majority is rising like never before, and under our leadership, the forgotten men and women..."
    },
    {
      "text": "The men and women of our country have been forgotten. They will be forgotten no longer. They weren't forgotten for four years. You know that better than anybody. Nobody's ever done better than we did during that four year period. () We will love our country. We will take care of our country. We will pray to God for our strength and for our liberty. We will pray for God and we will be with God. We are one movement, one people, one family, and one glorious nation under God."
    },
    {
      "text": "And together we will make America powerful again. We will make America wealthy again. We will make America strong again. We will make America proud again. We will make America safe again, and we will make America great again. Thank you very much, Iowa. God bless you. Get out and vote. Get out and caucus. Thank you all. Thank you, front row Joes. You follow me no matter where I go. We love you. Thank you very much. Thank you."
    }
  ]
}