{
  "speech_id": "104",
  "speaker": "Trump",
  "title": "Donald Trump, Emmanuel Macron NATO Summit Meeting Transcript",
  "date": "20191203",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-emmanuel-macron-nato-summit-meeting-transcript",
  "topics": "Foreign Policy, Economy",
  "num_segments": 39,
  "content": [
    {
      "text": "I'm sorry. Well thank you very much. It's great to be with President Macron of France, and we've had a very long relationship and a very good one. And we were just discussing certain things, and then we'd have a long conversation afterwards. First of all, before we begin, I want to pay my respects to the great warriors that you lost in Mali, 13 helicopters. It was sad. I've gotten a report on it. We talked about it, and please give my condolences to the families and to France, great fighters."
    },
    {
      "text": "You've done a fantastic job in that whole area. It's a tough area, so we appreciate it very much. We'll be talking about a lot of things including NATO and including trade. We do a lot of trade with France, and we have a minor dispute. I think we'll probably be able to work it out. But, we have a big trade relationship, and I'm sure that within a short period of time, things will be looking very rosy, we hope. That's usually the case with the two of us. We get our work done. We've had a lot of cool things."
    },
    {
      "text": "We've done a lot of good things together as partners. Our countries have been partners in many good ventures including some having to do with radical Islam and others. It's always worked out, so I look forward to our discussion. We made a lot of progress in our first 25 minutes, and we intend to make a lot of progress in our next hour, maybe hour and a half. So, thank you very much. Well, we just began discussing NATO."
    },
    {
      "text": "And what I'm liking about NATO is that a lot of countries have stepped up, I think really at my behest and also yourself. You're close to that level. They've stepped up, and they've put up a lot of money. I think it was 130 billion dollars, and that's a lot. They're not stepping up again. It's going to be 400 billion dollars. But we are very sure we have commitments to 400 billion dollars."
    },
    {
      "text": "We just left the Secretary General, and he's got some things that are very important, and discussed with him the flexibility so that we have it's not just with one area of the world. You and I discuss this all the time. We have all areas of the world because NATO's a lot different than it was, and now it's certainly a lot different over the last three years. So, we have a lot of countries stepping up and putting up a lot of money. The number, as of this moment, is exactly 131 billion dollars."
    },
    {
      "text": "That's a year, and that's a tremendous amount of money, but it's not enough. They also raised and have commitments for 400 billion dollars. So, NATO, which was really heading in the wrong direction three years ago is heading down. If you look at a graph, it was to a point where I don't think they could've gone on much longer. Now, it's actually very strong and getting stronger. Many people are committed to that 2%, and ultimately, I think the 2% will be raised."
    },
    {
      "text": "The President and I, I think, feel that we need more flexibility. And I think we both agree on that so that we can use it for other things, not just looking at one specific country. A lot of people say it was meant to look at originally the Soviet Union, now Russia. But, we also have other things to look at, whether it's radical Islamic terrorism, whether it's the tremendous growth of China. There are a lot of other things."
    },
    {
      "text": "NATO is becoming different than it was, much bigger than it was, and much stronger than it was because people are now fulfilling their commitments. There are some countries that aren't fulfilling their commitment, and those countries are going to be dealt with. Maybe I'll deal with them from a trade standpoint. Maybe I'll deal with them in a different way. I'll work something out where they have to pay, but we don't wan to have people delinquent."
    },
    {
      "text": "I really don't think it's fair for us to be involved, including France, by the way, to be involved if you have countries that aren't paying their way. They're less than 1%. You have a couple that are less than 1%. Not fair. NATO has made a lot of progress over the last three years, and the word flexibility is very important. They're not just looking at one area now. They're looking at the world, and it's very important. To me, it's very important. Yes?"
    },
    {
      "text": "Well, one thing I would also like to say that you've been really doing a great job in Africa, and you've been very much involved there, more than most. And that's been fantastic. I appreciate you saying the United States for decades have been paying really way, way disproportionately too much, and you have other countries paying far too little that are very directly benefited by it and by the United States' involvement. We're changing that around somewhat, it's important. But, we're a very important player."
    },
    {
      "text": "I think without us, NATO certainly is not the same thing as we discussed, and discuss it at length. This morning, we discussed it with Secretary General Stoltenberg. But, we're behind you 100%, and all of the money that's been raised, and all of these countries that are all of a sudden putting up money, it's a great thing to see. But, we do have a great... We really have a different objective, I think, right now. We're looking at a much bigger picture, and that includes..."
    },
    {
      "text": "You mentioned Iraq, but it really includes Iran, too, I think. If you look at what's going on in Iran, they have massive riots. They're having protests all over the country, and they're killing a lot of people. Everybody knows that. That's why they turned off their internet system, so nobody can find out. But, if the media would go there, and I think it's very hard for the media to go there, frankly, right now. But, they're killing a lot of people."
    },
    {
      "text": "But, NATO has come a long way in three years, and it's something that we're very proud of because we're with them. NATO serves a fantastic function if everybody's involved. If they're not involved... And I really believe that the President is very much involved and likes the idea of NATO, but he wants it also to be utilized properly. If it's not utilized properly, we all agree, right? That's no good. We've had a very good discussion. A lot of people, and we're meeting with a lot of countries later, as you know."
    },
    {
      "text": "They're really stepping up. For the most part, they're all stepping up. We have one or two that aren't, and we'll have to deal with them in a different way. Maybe, as I said, we'll deal with them on trade. We have a lot of power with respect to trade. They make a fortune with the United States, and then they don't pay their bills. That's no good. But NATO's come a long way in three years, and it's become very powerful, I think, very very powerful."
    },
    {
      "text": "It's become, I think, a much fairer statement in terms of the United States because we're able to go down a little bit. We were paying four or 4.3% of the largest GDP ever. Nobody's ever had a GDP like we have right now, and nobody's come close. Other people were paying 1%. Some people were paying less than 1% of a very small GDP. It's not fair. And they get it back. We protect them, but it's not fair. So, a lot of changes have been made. [Phil :18], go ahead. Right. Well, we're working on that right now."
    },
    {
      "text": "We have discussed it. I think we'll be able to work something out, I hope, and maybe not. Maybe we'll do it through taxing. We could work it out easily through taxing. But, the American companies, the tech companies that you're talking about, they aren't my favorite people because they're not exactly for me. But, that's okay. I don't care. They're American companies, and we want to tax American companies. It's important. We want to tax them. That's not for somebody else to tax."
    },
    {
      "text": "As the President knows, we tax wine, and we have other taxes scheduled. But, we'd rather not do that. But, that's the way it would work. So, it's either going to work out, or we'll work out some mutually beneficial tax. And the tax will be substantial, and I'm not sure it's going to come to that, but it might. Speaker 5: () Mr. President, has France committed to step up when it comes to beating back foreign fighters in Syria? Well, I haven't asked that to the President today. I have over the period of time."
    },
    {
      "text": "We have a tremendous amount of captured ISIS fighters over in Syria, and they're all under lock and key. But, many are from France, many are from Germany, and many are from the UK. They're mostly from Europe, and some of the countries are agreeing... I have not spoken to the President about that. Would you like some nice ISIS fighters? I could give them to you. You can take every one you want. This is why he's a great politician because that was one of the greatest non-answers I've ever heard, and that's okay."
    },
    {
      "text": "France has actually taken back some fighters. But, we have a lot of fighters. We've captured a lot of people, and we have captured 100% of the caliphate. But, you know that that means they keep going and going. We sent a small contingent in, and we wiped out another portion of ISIS. We don't want to happen to me what happened with President Obama, where it reformed, and then it became stronger than it was in the first place. So, we don't want that to happen. As I said before, we've taken the oil."
    },
    {
      "text": "We have the oil, so we have total control of the oil so that they're not going to be able to use it. They use that oil to really fuel up their wealth, to fuel up their money. That was a primary source of income. And they get contributions, and we have now lists of where these contributions come from, which is very important. People contributed, if you can believe it. Some of these people are wealthy people that made contributions, and we have lists of... We learned a lot."
    },
    {
      "text": "When we got al-Baghdadi, that was a great get. And when we killed him, we have a lot of information that I'm revealing now for the first time. But, we also got a lot of good information. A lot of things are happening, and France has been very helpful. I have to say that they've been very very helpful. Okay. Go ahead. Any other questions, please? Speaker 6: () [French :28]. I largely agree with that answer."
    },
    {
      "text": "I just have to say that I came into a position, where the European Union was making anywhere from 100 to 150 billion dollars a year in deficits to the United States. They were making it. We were losing it, so we had to do something that is fair, not severe. I think fair. We're losing tremendous amounts of money. As you know, the European Union is very strong on barriers. Barriers meaning certain of our products can't come in, including agriculture product. It just can't come in."
    },
    {
      "text": "We can't sell it, and yet the European Union sells openly to the United States and generally untaxed or taxed at a low level. So, these are problems that we're talking about. These are problems that we're working out, and the digital tax is the least of it. I inherited a situation where the European Union, which was formed partially for this reason. I guess for a lot of reasons, it was formed, but partially to make better or take advantage of the United States."
    },
    {
      "text": "They've done that very brilliantly, and frankly, it's not right. So, I've exposed it. A lot of people didn't know it, and we're doing things about it. We have no choice because the United States can't continue to lose the kind of money that they've lost literally since the formation of the European Union. And I think we'll work something out. They want to talk, as you know. The new head wants to talk, who is supposed to be a very respected woman, very highly respected, and I look forward to meeting her."
    },
    {
      "text": "They want to meet. But, we have a very unfair trade situation, where the US loses a lot of money for many, many years with the European Union, billions and billions of dollars. To be specific, over 150 billion dollars a year. So, we don't want to be doing that, and we can make a deal, or we could take a harsh approach. We could solve that problem instantaneously, if we wanted to. But, I don't want to do that. These are friends of ours."
    },
    {
      "text": "These are people that we've had very extraordinary relationships with, and I do personally. And I'm sure we can work something out. Speaker 7: () You mentioned earlier the Iran protests. Does the United States support these protesters in Iran? I don't want to comment on that, but the answer is no. But, I don't want to comment on that. Speaker 8: () Mr."
    },
    {
      "text": "President, on Turkey, President Macron just say he wanted the United States to do more than standing up to President Erdogan, which is clarifying the terms of that relationship. Are you supportive of those efforts by the NATO allies, or are you staying away? Well, I can only say we have a very good relationship with Turkey, and with President Erdogan, I do. I can't speak for the President of France. We have a very good relationship. We pulled our soldiers out and we said, \"You can patrol your own border now."
    },
    {
      "text": "I don't care who you do it with, but we're not going to have soldiers patrolling the border that's been fought over for 2,000 years.\" But, we took our soldiers out. We put some of the soldiers around the area where we've captured the oil and taken the oil, and we have the oil. And we've brought some home, and we will be bringing some home, and we've sent some to other areas. But, we have a very good relationship with Turkey. Speaker 9: () Mr. President- This is really why we're having meetings."
    },
    {
      "text": "Those are our points, and we'll be discussing that with the President today. Yes? Speaker 10: () Mr. President, will you issue sanctions on Turkey over their purchase of the S-400 missile system? We're looking at it now, and we're talking about it now. As you know, Turkey wanted to buy our Patriot system, and the Obama administration wouldn't let them. They only let them when they were ready to buy another system, which is not the same system."
    },
    {
      "text": "But, Turkey, for a long period of time, wanted very much to buy the Patriot system, which is our system, which is what NATO uses, which is a great system, which is the best system. They wouldn't sell it to Turkey. So, there are two sides of the story. I have to say this. But, we will be discussing that with Turkey in a little while. We'll be meeting with Turkey in a little while, and also tomorrow. [crosstalk :16]. Are you talking about Ambassador.... Speaker 12: () Boris Johnson. [crosstalk :05]."
    },
    {
      "text": "Speaker 11: () Who is the Prime Minister. Oh, I thought you meant Woody Johnson. Speaker 11: () No. I said, \"Boy, he's really risen rapidly.\" Woody. Where is Woody? Is he here? He's not here. This is his house. I can't believe he's not here. Yes, we'll be meeting with Prime Minister Johnson in a little while. I'll be seeing him later on. We're going over to number 10, which is a very exciting place to be, as you know. And we'll be discussing a lot of different things. Yes."
    },
    {
      "text": "Speaker 11: () And one other related question, the London Bridge attack from a few days ago. Do you have any comment here, your first day? No. I don't have a comment on the London Bridge attack, other than to say that I was very proud of those people that grabbed them and did such a good job between the fire extinguishers and whatever else. It was an amazing job they did, and he was very violent. You could see that. I mean this was captured very much on tape. I think they were British citizens."
    },
    {
      "text": "The way they stepped up was incredible. That was really great. So, a terrible thing, a terrible attack. A lot of people very badly hurt. I believe three or four killed. Is it four now today? So, it's terrible. It's a terrible thing, and I know it's an act of terrorism. It's been declared an act of terrorism, radical Islamic terrorism, by the way. And it's very bad, very bad. But, I think the way they stepped up, to me, that was something very special. Okay? Speaker 13: () Mr. Trump, a question on Russia. Mr."
    },
    {
      "text": "Macron says that Russia shouldn't be designated as an adversary of NATO. Do you agree with that? Do you think Russia is the enemy? And Mr. Macron, who is the enemy today? I don't think he does feel that. I think we get along with Russia. I think we could get along with Russia. I think you feel we can get along with Russia. We've discussed that before. But, certainly we have to be prepared. Whether it's Russia or somebody else, we have to be prepared. But, you and I have a pretty similar view on that."
    },
    {
      "text": "I think we feel that we can get along with Russia, and I think it's a good thing to get along with Russia. I campaigned on it, when I go into big stadiums, people like it. And, I think the Russian people would like to see it, too. A lot of good can come out of it. But, the purpose of NATO is that, but the purpose of NATO can be much more. And that's where we've shown the flexibility over the last period of two years. Speaker 14: () [French :36]. And I think the situation in Ukraine is very important."
    },
    {
      "text": "I think that the meetings coming up with Russia and Ukraine are very important. There is a possibility that some very big progress can be made. It's very important for Ukraine. I think it's very important from the standpoint of Russia, also, that they work out a treaty, they work out peace because they've been fighting a long time, too long. I think there's a really good chance that that will happen."
    },
    {
      "text": "Also, with respect to nuclear weapons, I've spoken to President Putin, and I've communicated with him, and he very much wants to and so do we, work out a treaty of some kind on nuclear weapons. That will probably then include China at some point, and yourselves, by the way. But, it will include China and some other countries. But, we intend to see if we can work something out to stop the proliferation, to stop what's happening because we are making a lot, and we are renovating a lot."
    },
    {
      "text": "And frankly, the whole situation with nuclear is not a good situation. We ended the treaty because it wasn't being adhered to by the other side. But, they want to make a treaty, and so do we, and I think it would be a great thing. I think it's one of the most important things we can do, frankly. So, we're going to be dealing with Russia on a treaty where we really... And we're focused on nuclear and nuclear weapons, missiles, and nuclear weapons. And we think something can be worked out."
    },
    {
      "text": "We think they want to do it. We know they want to do it, and we want to do it, also. I've spoke to China about it. During one of our trade negotiations, they were extremely excited about getting involved in that. So, some very good things can happen with respect to that. I think it's very important. The whole nuclear situation, very very important. [crosstalk :26]. Thank you all very much. Thank you. [crosstalk :36]. [inaudible :41] these people again. [crosstalk :48]. (silence)."
    }
  ]
}