{
  "speech_id": "141",
  "title": "Donald Trump Parnas-Yovanovitch Recording Transcript: Trump Discusses Firing Yovanovitch at Donor Dinner – “Take Her Out”",
  "date": "20200126",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-parnas-yovanovitch-recording-transcript-trump-discusses-firing-yovanovitch-at-donor-dinner",
  "topics": "Economy, Foreign Policy",
  "num_segments": 92,
  "content": [
    {
      "text": "Please. They're good genes, the Jack Nicklaus genes over there. So Jackie is your father? I don't know if you ever heard this, but he made one of the best speeches I've ever seen, in the Rotunda right? Right. The congressional whatever it is. Freedom Medal. Which is a big deal and your father made one of the best speeches I've ever seen. And that's pretty good, I've seen a lot of speeches."
    },
    {
      "text": "But I said, \"Are you a professional speaker?\" He said, \"No.\" I said, \"Then maybe you should be.\" So what is it your cousin or whatever had the hole in one the other day? That was something. The swing looks good. How good a golfer is he? Oh really? His swing looked... His swing looked perfect, yeah. He has the gene I guess, right? Did it really? Why are you not that good of a golfer? What was your lowest handicap? See a three would be a bad player in the [crosstalk :57]. What's that? Oh yeah, it's a great family."
    },
    {
      "text": "Say hello to all. Special guy. Special people. Thank you all very much. Great to be with you. You see what's happening? We're doing really well. I don't know why, I get nothing but bad publicity and the polls keep going up. They're at the highest level they've ever been since we've been in office. Quite a bit higher than election day, which was pretty amazing. That was an amazing day, right? I told your grandfather that, he said it was incredible. I said, what you did is more incredible. You won 18 Majors."
    },
    {
      "text": "He said, \"No, it's not.\" I said, \"Yes it is.\" I still say it. It's harder and more improbable to win 18 Majors. Just ask Tiger, right? It looks like it's going to be a tough one. But we're doing better than ever before and we're accomplishing a lot. The North Korea thing is moving along really well. We have a site now, we picked a site. They announce pretty soon and a location plus a date. He really wants to do something, I'll tell you."
    },
    {
      "text": "Part of the reason he wants to do two things, I mean maybe the rhetoric and maybe we put sanctions like you wouldn't believe. The team is heading over to China today, tonight to work on the whole trade craziness because they've been averaging $500 billion a year. Mr. Somebody has to. It's brutal. They're tough. But I always say when you're $500 billion down, you can't lose the trade war. You can't lose. It's like somebody said today, because I'm doing a very aggressive thing, this is all like off the record, right?"
    },
    {
      "text": "But they said, \"Why would you be doing that with China blah blah blah. You could do much less,\" I said, \"Yeah but much less doesn't get you...\" I said this is like you own a baseball team and it's the first inning and the other team scores 32 runs, what do you have to lose? You walk away, you start a new game the next day. 32 runs in the first inning because that's basically what it is. We're $500 billion down with China. We're $800 billion down throughout the world. $800 billion a year. Mr."
    },
    {
      "text": "So we lose $800 billion in a year. Then you have the globalists that think that's okay, but they're wrong. They think it's fine when a factory or a plant moves to Mexico and opens up and you lose 3,000 jobs in Michigan. It's not. You have people, smart people they really believe it but then you have other smart people that don't believe and I'm one of them. Tell me and I hear steel is doing better now. We put very substantial tariffs on steel. We're doing pretty big numbers on stopping some of it from coming in."
    },
    {
      "text": "I don't want to stop too much because I don't want to run out of steel because the economy is doing really well. Are you finding it's better now because of what I'm doing? They do. Can you believe it? We're doing a big number for them, can you believe it? So they do the transshipping, right? So they're transshipping what steel? China's steel? Yeah, South Korea. I could write a book on it. How we ever got involved in South Korea in the first place, tell me about it."
    },
    {
      "text": "How we ended up in a Korean war, fighting a Korean war to keep these two places from [crosstalk :55]. Not only that, I mean they're one of the toughest traders we do business with. They're probably tougher than China, they're just smaller so the numbers are smaller. We have a $32 billion deficit with South Korea. I asked the General, \"Why do you think we're doing this service for trade?\" I say, \"We're $500 billion in that area.\" We're doing this for trade, but we're losing $500 billion including China."
    },
    {
      "text": "We're losing $32 billion with South Korea. It's crazy but it is what it is and it's coming out good. A lot of good things are happening and the trade deals are being renegotiated, including the deal with South Korea. What do you think of the quota deal we had? We lowered it by 30%. I don't want to be at a point where we don't have enough steel in this country. All of a sudden steel triples. Did you know what we're doing with South Korea, 30%? 30% back."
    },
    {
      "text": "Don't forget when I do the tariffs and nobody talks about that, they talk about jobs, they talk about steel. Now steel has been doing much better and your steel is opening up like four plants now, which is unthinkable. They haven't done it in 30 years. Don't forget that the country's taking in billions of dollars. Nobody talks about that."
    },
    {
      "text": "When you charge 25% and 15% or 10% for aluminum and all that stuff is pouring in and you're charging a 25% tax, so the steel that's coming in, we're taking in as a country billions of dollars. Nobody talks about that. They talk about jobs and they talk about steel plants. But to me the big thing, I mean we're taking in billions and billions of dollars by doing nothing."
    },
    {
      "text": "We're also negotiating deals that we could've never negotiated because countries are now coming to us begging to negotiate deals that had been screwing us for years. They've been screwing us so badly it's hard to believe and now they're coming, \"We'd like to talk,\" like the European Union. That's another beauty. We don't make with anybody, we lose with everybody. There are about two countries, one sells us lemons, Argentina. We made about $3 with Argentina."
    },
    {
      "text": "We have actually a trade deficit of $800 billion including. Well the WTO is the problem. Without the WTO China's... That's right they go to a different location. Yeah they get it in all sorts of ways, but it ends, it ends. If it was more expensive? Well, you're going to see prices go up. Hopefully not too much. See, I have a theory that if we didn't put quotas on it, China subsidizes their steel, they have to. If we didn't see quotas, the steel wouldn't even go up."
    },
    {
      "text": "Because they'll put more money into it even with the 25% tax, it's still not going to come up because they'll just put more money into it. We take it a lot of money, we make a fortune on it, so we'll see. Aluminum has gone down. I put a 10% tax on aluminum coming in, it's actually gone down 4%. Now it's about even, but it actually started out going down 4%. So it's been pretty wild. I think we're going to have some very good times, but we have some very big trade deals to worry about."
    },
    {
      "text": "China, when they hear what we're proposing, they're not going to be too happy. Well the WTO is worse than them. The WTO is totally in their pocket. The people that made the deal with the WTO were not smart people. They made a deal with the WTO where we lose every lawsuit until the last year. In the last year we've won every lawsuit because they often got to pull our country out. We're like the punching bag. We're like the dummies that get punched in the face all day long and come back for more."
    },
    {
      "text": "But they now know that I get the WTO. China didn't become great until the WTO. From the day they joined the WTO, which was a Clinton disaster, they went up like a rocket ship. They were this way for 1,000 years and then they got into the WTO and they've taken it... Look, I give them credit. Speaker 7 Yeah, but I give them credit. Our former leaders are great geniuses [crosstalk :]. Bush, he gets us into the war. He gets us into the Middle East, that was a beauty."
    },
    {
      "text": "So we're in the Middle East right now for $7 trillion. If you want to fix a window on a school, they don't have the money. But we're into the Middle East as of this moment for $7 trillion, now that's over 18 years. Speaker 7 Yeah, probably. Speaker 7 Well that's the beauty of it. China rips us off for years and we owe them $2 trillion and $2 trillion more through our bonds. Speaker 7 Yeah well eventually that's what we'll do. So the WTO allowed China to do what they're doing."
    },
    {
      "text": "The WTO was a weapon to hurt the United States, to allow people to enrich themselves. The European Union's the same thing. The European Union is a group of countries that got together to screw the United States. It's as simple as that. Frankly, they're probably worse than China in a sense, just smaller. They're worse than China in the sense of barriers. We lose $151 billion to them. Speaker 7 Yeah, but the European Union's really bad. It doesn't sound like it. The European Union, we're all sort of from there, right?"
    },
    {
      "text": "But the European Union's brutal, but we're changing that around too. They can't even believe it. So we're having fun, it's what we do. But you have people that work for me that just don't realize they're so... They want to make these deals, they're just nothing deals. Not only Congress when they come, \"Please don't go after NAFTA too hard.\" I said, \"I'd like to terminate it.\" It's like oh my God, they're petrified because they know what they have."
    },
    {
      "text": "Like the farmers who are great, actually, the farmers know what they have and they've been on a downward trend for 15 years. So I said, look, you guys are on a downward trend, you could be on an upward trend, but to do that you have to shake it up. Meaning you terminate a couple of deals like NAFTA. NAFTA's the worst deal we ever made. I think that WTO is actually the worst deal ever. I think the World Trade Organization maybe is worse because it allowed China to kill us, but we don't have any good ones."
    },
    {
      "text": "Hillary Clinton made a deal with the South Koreans, that was a South Korean deal. You know that deal, that was a Hillary special. We're going to make 250,000 jobs and she was right, for South Korea. Good job. She said this is going to create 250,000 jobs. 250,000 jobs and she was right, in South Korea. Mr. How's your golf club [inaudible :12]? Mr. Have you seen it? Is it a nice club? Is that where they had the... What? Mr. How did you like the Presidents Cup? Mr."
    },
    {
      "text": "So the Presidents Cup has never been the Ryder Cup and you think the concept is better. The Ryder Cup is the most unbelievable sporting event. The Presidents Cup is good, but it's never been the same. You would think the concept is better. Mr. You know what doesn't make sense, we're playing Britain or whatever, UK and that competition is tougher than when we play the world. Figure that one out. Mr. No, but isn't that right? The Ryder Cup is tough to win."
    },
    {
      "text": "The Ryder Cup is only the UK, but the spirit at the Ryder Cup is really a unique experience and the Presidents Cup so far has never captured it. Mr. Don't they have a women's tournament too, a big one? Mr. How's it doing? How's business over there? Good? Mr. Oh in South Korea? Mr. I wrote you a letter of recommendation, right? Mr. No that letter is fine. I know they have the letter because the President told me he got the letter. So they must be treating you pretty good. Mr. It must be tough dealing with these people. Mr."
    },
    {
      "text": "Go ahead. We're very far down the line, but I will. You know that Kim Jong-un is a great golfer you know that right? [crosstalk :06] look like a beginner. Did you ever hear that? He shot an 18. Mr. [crosstalk :17]. It was actually his [inaudible :22] who say said shot an 18. Absolutely. Thank you fellas that was good. Business is good, look at this. What a great [inaudible :58]. Business is good, right? Look see that they [crosstalk :00]. No, he said today that President Trump should get the Nobel Prize."
    },
    {
      "text": "I said it's a little early because Obama got it and never did anything. He got it for winning the election. Are you doing the shiny finish or are you doing a rough finish? I can't believe how they can plant that thing. That's great. Are you doing that with the Army Corps of Engineers? That's great. Well it's going up. It's going up. Do you see what's going on at the border though? Can you believe it?"
    },
    {
      "text": "Well you take a look at that, you've got thousands of people and if you really look to take the wall down, they'd just keep walking in. You can see it, now a few people can get up. It's amazing that they can shimmy up that steel though. Now that's old stuff and it's rough on the outside and rusty, it's been there a long time. You do have to be able to see through the wall I think. If you can't see through the wall that's a problem because then you don't know what's on the other side."
    },
    {
      "text": "Because I really wanted a concrete wall 30 feet high, very slick outside. You know they actually said that these drug dealers, it's so dangerous to have a solid wall because they take the drugs and it weighs a hundred pounds approximately, a bag or satchel, they call it a satchel. They throw it out over the wall and it goes over the wall and it will land on a guys head and it kills him. No our border guys will be walking and they throw it from one side."
    },
    {
      "text": "So if you can't see through the wall, they throw the drugs, they have a catapult, they throw it over the wall and it lands on the other side of the wall. It can hit people. Can you imagine you get hit with a hundred pounds of drugs. No, no. They usually have the deals on the other side ready, but when they see the border guys they head out. The whole thing is preposterous. I would've loved to have seen a concrete wall, you just can't do that."
    },
    {
      "text": "We actually have the new one is like that now it's taller, it's got the thing. It's got nothing in between. It's held to the ground like lead bolts and it's got very strong points at the top. That'll be much tougher. Mr. It's like pointed, yeah a wall. How sharp is that? That's pretty cool. It's very hard to shimmy over that. [inaudible :16]. Well I know. As you know, most times you don't. But I think the economy is so good. That's good. That's fine."
    },
    {
      "text": "I think the economy is so good that we're going to do much better than [inaudible :47]. I guess it's complacency. Something happens when you win the presidency, then you go on and you win the presidency 10 years after that. History, it's almost like 100% of... it's a lot. There's nothing 100%, I think- ... it's a lot. There's nothing 100%. I think 93% of the time, they lose the Mid-cap. But look, we have to see what the economy is in a few months. Speaker 10: () It's going to be good. Speaker 6: () It's booming."
    },
    {
      "text": "I think so, right? Speaker 6: () It's absolutely booming. The stock market's up 40% since I won. But actually, the economy is actually better than that. Speaker 6: () I got into a discussion with someone in real estate about immigration. \"I like everything President Trump's doing except for immigration. We need people over here.\" Speaker 6: () I said, \"Of course, we do.\" By the way, what did President Trump say that we didn't need in immigration? I said, \"Look, let me put it to you in a really easy example."
    },
    {
      "text": "You're in real estate. You own buildings. You've got a water main that comes into the building. You need water, good clean water in the building to make it run, yeah. What do you do when the water main breaks? How do you fix it?\" He said, \"Well, you shut it off.\" I said, \"Yeah, you shut if off, and then you fix it. And then you turn it back on, and you bring nice water in. You don't shut the pump into the basement and pump it up while it's still broken.\" I said, \"That's all President Trump want to do."
    },
    {
      "text": "The water main's broken. We need to shut it off, fix it, and bring the water back into the building control. Speaker 7: () It's all merit. You need someone who's going to come here who can actually contribute, not just fuck off. Speaker 6: () 100%. Speaker 7: () It doesn't work. It's all changing. Speaker 6: () They're changing, because they realize it's terrible. This whole caravan is a positive thing because it's showing people how crazy it is. Speaker 7: () Where is it now? Are they at the border waiting?"
    },
    {
      "text": "But they won the race in Arizona three nights ago. Of course, we're getting no credit for that. They're saying we shut it, because I won it by 22. She won it by six. Speaker 6: () You don't even hear about it. I would've taken the, two votes is okay as far as I'm concerned. The headline is, \"Oh, it was much closer.\" We lose and then they win. You know we won six of them and nobody talks about it. We won six special races. I think we lost one, and we lost the one in Pennsylvania."
    },
    {
      "text": "[crosstalk :50] that was a separate race. Speaker 6: () Two and a half years ago I was with Goldman Sachs. I said, \"President Trump, Trump's going to win the election.\" He said, \" You're crazy.\" I said, \"Absolutely, and I'll bet you anything you want.\" They all sat there, and they thought I was nuts. They said, \"Well, why do you think that?\" I said, \"Because I'm in the heartland. I know what's going on. I see what the real workers, the forgotten people, want. Not everybody can work in Silicon Valley."
    },
    {
      "text": "I'm not going to retrain someone in Sharon, Pennsylvania to go to Silicon Valley. They're 55 years old. They can't sell their house there. They deserve to earn a good living. What's wrong with working with your hands?\" My point is, sure enough, you did. That night we were jumping up and down with our son on the bed, and I'm texting these guys at Goldman Sachs saying, \"I told you. I told you.\" So, you can't-- Well, that was the most exciting evening. Speaker 7: () That was incredible."
    },
    {
      "text": "Speaker 6: () You can't believe the polls. ESPN said that was the greatest sporting event. Speaker 8: () That's what it was. It was a sporting event. It just didn't stop. It's Ohio. It's this one. Speaker 6: () Standing up there in the second [crosstalk :54]. Speaker 7: () At 99% it had like three votes left. And honestly, they're going more crazy now. The press is now more crazy. Speaker 7: () Mr."
    },
    {
      "text": "President, I've got a thousand employees in Pennsylvania, and there's a hard hat signed by about 200 of them sitting in a bag over there for you saying thank you. So, we appreciate it. They're very- Well, I think the press is now more crazy than they were. They're going totally bananas. It's all right. What the heck. I think we're going to do well. I don't want to say it too much, but I think we're going to do better than people think [crosstalk :48]. Well, they have low light."
    },
    {
      "text": "You have this one woman, Maxine Waters. She's a very low IQ person. Speaker 7: () We've heard that one [crosstalk :13]. You don't hear from her anymore, it's the craziest thing. Since I've said that, I don't hear from her anymore. Really. It's crazy. How's the food? Good? Speaker 6: () It's excellent. It could be good. People think about it, right? Speaker 6: () Connie and I do a lot of work with Candace and Charlie Carson, and so yeah, it's been great. She's really become- Speaker 6: () She's great."
    },
    {
      "text": "She works for Charlie [inaudible :46]. How are your businesses going? How are they doing? Speaker 8: () Well we're pumping a lot of natural gas or will add to this house and everywhere else. So, why are the prices so high? There's so much oil and gas. Is that OPEC? But oil is so high. Oil's almost at 70. Speaker 8: () Wall Street. Huh? Speaker 8: () I would think that somebody's-- Well, it's the monopoly of OPEC pricing. Aren't the frackers- Yeah."
    },
    {
      "text": "Aren't the frackers out now because of the price, and they're going crazy opening up new wells? Speaker 8: () Absolutely. That's what I've heard. Speaker 8: () Yeah, you can't have... 30's too low. 80, 90's too high. That healthy range in there, they can make money there. Is the fracking starting, Lynn? Because for a while now, the price was too low and then it goes up. So will that drive the price home? [crosstalk :20]. Is it going to? Speaker 7: () We're actually self-sufficient really right now basically."
    },
    {
      "text": "Speaker 8: () Absolutely. 100%. Speaker 7: () Meaning, producing as much as our own. So, how big is West Texas? Comparing West Texas to Saudi Arabia okay, what's your difference? Speaker 8: () Well, probably 60%. 60? Is that right? That's a lot. Speaker 8: () Yeah. That's just West Texas. What's the quality in West Texas? Speaker 8: () Light and sweet. So what's the quality of Venezuela? Very bad right? It's very heavy? Speaker 8: () Heavy. And is that hurting oil prices? You need what? New refineries."
    },
    {
      "text": "Speaker 6: () New refineries that are able to refine the crude [crosstalk :26]. Under the tax plan, we can-- Yeah, just put it down. Speaker 8: () Before cell phones. When was that? Speaker 8: () Last week. Speaker 6: () Wow. Speaker 8: () But the geopolitical conduit and that's L&G changes the game right? If we export L&G we can supply Europe and Putin's done. Yep. But that's more expensive. Well how about Germany opening up a pipeline into Russia? We're supposed to be fighting Russia."
    },
    {
      "text": "So Germany is paying Russia like $2 billion a month. And they're a member of NATO. And we're paying 90% of the cost of NATO. How's Ukraine doing? Don't ask. Great. I'll tell you, they're great fighters. I think they are. They're great fighters. They've been fighting for so long, they don't know what to do without fighting. Yeah, well they've been fighting for a long time. But, it's a problem, a big problem. Speaker 6: () Just like the order of javelin and missiles over there right? The antitank missiles. Today?"
    },
    {
      "text": "Speaker 6: () I read about it today. I don't know when it happened. It must have happened within the last couple days. Do you think Russia ever goes in and gets Ukraine or no? Ukraine has oil? Speaker 8: () Oh a lot. Ukraine? How come they [crosstalk :55] they don't have any money. Why aren't the companies doing it? Too risky? How long will they last in a fight with Russia? How's Ukraine feeling about it all right now? No, but do they feel they're going to be okay? Speaker 12: () Yes. What do you think of the leader?"
    },
    {
      "text": "Speaker 12: () The leader is good. See it's always us that has to support everybody. And you wonder why isn't Germany supporting? Speaker 12: () He's very much, he needs support. Germany has supported him, yeah. Not at all. Speaker 10: () Germany is going behind- Germany is not doing much. Speaker 12: () They're supporting Russia. You think so? It just makes no sense. It makes no sense. Speaker 12: () I'm sure they need support from you the President. Where? The ambassador where? Ukraine? Really?"
    },
    {
      "text": "\"He'll be gone tomorrow.\" What's her [crosstalk :30]? Speaker 12: () I don't remember. Get rid of her. Get her out tomorrow. I don't care, get her out tomorrow. Take her out, okay? Do it. Pompeo is going to be good. He's doing a good job. Already he's done a good job. Now we got to go, I'm pretty good. We got a lot of interesting things. No it's a deep state deal but it's going good. You see the other side. Speaker 7: () Unbelievable. Yeah."
    },
    {
      "text": "The stuff that they have is so bad about the other side, that they're trying to keep it. It's now coming out. Yeah I have to wait. I'm waiting for the timing, the right timing. Speaker 8: () Smart. It's such bad stuff. Like Combe is guilty already. Every time he goes on television he gets another- Speaker 6: () He changes the story. Speaker 7: () [crosstalk :03] Their attempt to settle was the biggest backfire in the history. But they're not so happy. Thank you sir. Thank you everybody."
    },
    {
      "text": "Guys enjoy your meal, whatever it is. I can't have different from other people. Who wants a steak? Who wants a steak? Speaker 12: () No, no, no. Speaker 7: () I got Presidential burger [crosstalk :03]. We just like the burger. Speaker 11: () You're going to a hotel. Speaker 7: () The habits. I was going to say they brought my a shrimp cocktail, I'm looking who else has one? Speaker 6: () You are the President. Speaker 7: () And owner of the hotel. The hotel's pretty great. Speaker 12: () It's great. It's amazing meal."
    },
    {
      "text": "I said this is great. What? Yeah, and what led cannabis, look, you mean you're talking about marijuana right? Why? You can't do banking there? Yeah, it'll be, it's all working out. That whole thing is- I don't know if that's a good thing or a bad thing [crosstalk :00]. Speaker 6: () It's a big issue with a lot of people [crosstalk :04]. Speaker 7: () The military and the vets, it's a big one there. But do you think the whole marijuana thing is a good thing? In Colorado they have more accidents."
    },
    {
      "text": "It does cause an IQ problem.[crosstalk :46]. But it's actually good for opioids. Speaker 12: () Yeah. How's Florida doing now with Rich Scott? How's he doing? Is he going to win or is it- How are you doing? Speaker 12: () Good. Thank you very much. So now, what are you doing? Oh good. So you're involved [crosstalk :02]. Poland is great. How's that going? [crosstalk :06]. Speaker 7: () My grandpa, he's 78 years old and he doesn't need to deal with that kind of ego."
    },
    {
      "text": "He came in with a sizable investment and- At the time it was the right thing to do. Speaker 6: () Exactly. Speaker 7: () We figured for his- So are you just sort of sitting back now? He was telling me he's just going to sit back and, who cares? Or is he- Speaker 7: () We're trying to figure out ways to deal with it as non-compete right now because within the company he's got I think a five year non-compete. At 78, five years is a long time. Speaker 7: () Exactly. It's happening."
    },
    {
      "text": "Between him and your father, they're great designers. And they work, you don't want to waste five years. At the end of five years you can do what you want to do? Speaker 7: () If you have any kind of celebrity attached to you, it's kind of hard to enforce a non-compete of that length. All the news that we're getting back is positive, on the five year span. In the meantime, they're trying to figure out ways."
    },
    {
      "text": "They've got a few things in the pipeline where they can restructure some deals to, if they're not taking up front design fees, then maybe you factor in a charitable aspect. He's going to find a way to do some work. Which he likes any way. Speaker 7: () Exactly. He's got, as you know the [inaudible :35]. It's just an exhausting part, because I know him. I know the guy. Speaker 11: () Howard. These New York guys huh? [crosstalk :46]. Did he buy it? Speaker 11: () I believe so. Within the last year or so."
    },
    {
      "text": "Speaker 6: () What's that? Speaker 11: () Golf magazine. Speaker 6: () Golf magazine the what? The club company? What company? Howard bought Golf magazine. Bought if for $15 million. 10 years ago you would have paid $300 million. Speaker 8: () $15 million that's a- 15. Can you believe that? Magazines are dead. I think cable TV is okay, right? Is it? I will say, if we ever lost an election, cable TV is dead. You can imagine if they had a normal candidate. That's all they talk about."
    },
    {
      "text": "Trump stories, Trump, Trump, Trump, that's all they talk about. They have a normal candidate. They had Hilary, crooked Hilary. Speaker 8: () Oh my God. Their ratings would be 1/5th. Speaker 6: () Well they just hope for her case. That's why I tell everybody they're going to endorse me. About six months before the election they'll endorse me and then they'll un-endorse me after that. Now, but they're bad, they're bad. Obama would have been easier. Second term. Speaker 12: () You would have destroyed him."
    },
    {
      "text": "Romney should have never lost anything. Obama would have been much easier second term. I think so. I think Obama, second term, not first [crosstalk :43]. Speaker 7: () Bernie would have beat Hilary [crosstalk :45]. All those people that hated her so much who voted for me. I got 20% of Bernie vote, people don't realize that, because of trade. He's a big trade guy. He's basically said we're getting screwed on trade, and he's right. And we can do something about it."
    },
    {
      "text": "Had she picked Bernie Sanders, it could have been tougher. [crosstalk :31]. If they had a conversation. Speaker 13: () He has three beach houses. Of course. Speaker 13: () He should be going nuts. Speaker 14: () Of course, 100%. Is he going to be running again? Speaker 14: () I don't think so. I think he might. Speaker 14: () You think he might, again? Because he does a lot of television. Usually when they do a lot of television that means they're running."
    },
    {
      "text": "[crosstalk :13] Speaker 13: () Biden seems like he's still [crosstalk :14]. I like him because I'm a big Giuliani fan. I hope Biden runs. Speaker 14: () I hope Biden runs. Speaker 15: () He's in our video. Speaker 13: () Let me ask a question about wind and solar versus and natural gas, and electricity versus natural gas for vehicles. I have all four, the momentum that electric vehicles have."
    },
    {
      "text": "But here we are in North America with Shell oil and gas, with Shell gas, which we have an abundance of natural gas, but here we are permitting these L&G tankers to ship them in and try to sell it to us. Now ... Well, that's good though. Right? Speaker 13: () It's great. It's great but here we are, we have these car manufacturers that are just standing ready, and they're trying to figure out a way to meet emission standards, and everything else. Yeah, but we're going to lower them. Speaker 13: () We are, we are."
    },
    {
      "text": "You know that the café standard? Speaker 13: () Absolutely, I mean you've done a great job of that, by the way. How can, I mean there is a huge opportunity to open up, compressed natural gas, C&G, to be on parity and unlike electric vehicles, we don't want any tax credit. All we want is- Is that what business are in, compression? Speaker 13: () Yes. Gas business. Compressed or- Speaker 13: () We're on the compression side. We're not on the production side."
    },
    {
      "text": "They make the compressors to move the natural gas through the pipeline. Speaker 13: () To move the natural gas through the pipeline. But if we can make C&Go natural gas vehicles to be on a par basis for manufacturing with electric cars with the manufacturers who have a choice- How are electric cars doing now? Speaker 13: () Not good. Why? You know what happened- Well, Tesla, he's got an electric car. Speaker 16: () Well, Tesla's broke. [crosstalk :18] 100%. Why? Because they can't produce them."
    },
    {
      "text": "Speaker 13: () Well a number of reasons. Speaker 16: () Well, a) they can't produce them. He's already, these auto companies have caught up to him. The other auto companies have caught up to him. He's never generated anywhere close to positive cash flow. He's subsidized by $25,000 per vehicle. It's over. The other thing that people forget about, it's great to have an electric vehicle, but you got to plug it in and get it charged somewhere."
    },
    {
      "text": "Speaker 16: () And the carbon footprint of this phone is the same as a refrigerator running. You need to generate the power. And generating it with wind and solar, wind and solar only generate 3-1/2% of our power usage. You would take 50 years to get up to 5% at the rate we're growing. It's still the fossil fuels generating power. You have to have nuclear. You have to have- Speaker 13: () Oil and gas. Speaker 14: () Coal. Speaker 16: () ... Oil and gas, and you have to have coal. [crosstalk :20]."
    },
    {
      "text": "How come the stock price is so high? Speaker 16: () Because he's a great salesman. Speaker 13: () Because he's a great salesman. But the stock is still doing very nice. Speaker 13: () Yeah. [crosstalk :48] That stock is history. He's done. [inaudible :50] against it? Speaker 16: () Yeah. Speaker 13: () He's a very smart guy. He's a brilliant guy. Speaker 15: () He's a little off socially. Speaker 16: () He's a brilliant guy, but the company's done. Tesla as a car maker is done."
    },
    {
      "text": "[crosstalk :01] Speaker 13: (:01) But, regardless, regardless. I think the nation- Speaker 16: (:06) You got to relax once in a while. Speaker 13: (:08) They're going electric, they're saving the planet. I think it's awesome that they'd want to do that. But give the auto manufacturers an opportunity to put out C&G cars where we have all this natural gas- Speaker 16: (:28) 100%. Free almost free. Speaker 13: (:30) We have all this natural gas that- Speaker 15: (:38) Plus, plus ..."
    },
    {
      "text": "Speaker 16: (:38) Saudi, Brazil, Venezuela and Russia has natural gas. We have the most natural gas of anywhere.. [crosstalk :38] Plus the many country operations, it's all [crosstalk :38] to converting existing engines to natural gas engines versus- So that's a third type of car now you're talking about? Speaker 13: (:48) No. Speaker 15: (:49) But the good thing is [crosstalk :51] it's great for trucks. Speaker 16: (:51) Trucks and buses. Speaker 15: (:57) Like Ford F150."
    },
    {
      "text": "You know, which is the most popular truck and vehicle. It is? Speaker 15: (:03) I think so, yeah. Speaker 16: (:04) Absolutely. Why is that? Speaker 13: (:07) Because it's a light utility truck that everyone- Is that the aluminum one? Speaker 17: (:10) It's what I drive. [crosstalk :12] Speaker 13: (:13) You're thinking of the Raptor. It's aluminum frame. They invented an aluminum truck. Speaker 17: (:20) I've got the aluminum body, yeah. What do you think of it?"
    },
    {
      "text": "Speaker 15: (:21) But you can't do that in electric vehicles. Oh, you like it? Speaker 17: (:21) I love it. Is it strong enough? Speaker 17: (:21) Yes sir. Does it dent easier? Speaker 17: (:28) I'm sorry? Does it dent easier? You think so? Speaker 17: (:36) It takes a lot [crosstalk :36] As far as the bed's concerned, it's lined properly so if you throw anything in it, properly [crosstalk :40] Speaker 13: (:36) The problem is repairs. You have the aluminum body? Speaker 17: (:45) Yes sir. And did you request that?"
    },
    {
      "text": "Speaker 17: (:47) No, actually Ford, I think the new line of trucks, I think 2017, they started- Speaker 13: (:51) They started with the Raptor. Has that turned out to be a good investment for them, or not? Speaker 13: (:55) No. Speaker 17: (:56) I'd have to look more into it. As a consumer, I like it. Back in the day, I had, about 10 years ago, my first truck was a 2008 250, and I mean, I can just feel the difference driving the thing. It's lighter? Speaker 17: (:11) So much lighter. I mean the performance."
    },
    {
      "text": "It drives like a high-performance vehicle. Speaker 13: (:15) I think guys that are doing heavy work probably prefer the steel body. Speaker 16: (:18) Well you have high [crosstalk :21] Speaker 13: (:20) ... that have made up that ground tremendously. The aluminum, when you go to a body shop to repair aluminum, it's three times the cost, or more Speaker 17: (:30) No way."
    },
    {
      "text": "Speaker 13: (:31) It's just a whole different level of technical- Also, repairing aluminum stuff- Speaker 13: (:34) Yeah, the welding takes a whole new skill set. It's a- Speaker 16: (:37) Well, the parity between electric and C&G, will provide incredible jobs for your auto manufacturers- Speaker 15: (:45) Well, just because of the variety. Speaker 13: (:46) Imagine the drilling and crafting. Speaker 16: (:48) Natural is locally- Speaker 13: (:52) We can't store enough of it. Speaker 15: (:57) And it's clean."
    },
    {
      "text": "That's the other thing. It' Why. Speaker 13: (:02) Because today, the auto manufacturers are not incentivized at all to put sealing carbon. But people still like gasoline cars? Speaker 13: (:14) Absolutely. Speaker 14: (:14) Still the majority. They really don't want the aluminum. I mean, they don't want the electric. They majority is still gas. Is hybrid working? Speaker 13: (:29) Yeah. But not great? Speaker 15: (:30) For trucks and stuff. [crosstalk :32] People still like gasoline right? That's interesting."
    },
    {
      "text": "You like 547s? Wait, but you said it doesn't have the power and it doesn't run as well. I think that is wonderful. [crosstalk :32] Speaker 16: (:33) Isn't also that it's not as prevalent? Speaker 13: (:34) It's not as prevalent. But maybe you're taking the routes that may not be the most effective route? Speaker 17: (:38) Not really. Yes and no. What do you mean trucks? What do you mean trucks. What do you do? Speaker 17: (:45) Our main thing we do, we haul mail for the postal service. Oh, I see."
    },
    {
      "text": "So you know the difference, right? You have every kind. Is there anything like gasoline? Speaker 17: (:53) Nope. Well diesel for trucks. How is diesel compared to regular gasoline? [crosstalk :00] Speaker 17: (:00) Diesel, you can't run diesel in a semi. Big tractor. Oh, I see. Why can't you? It's not as strong? Speaker 15: (:06) But you can run- Speaker 17: (:08) It doesn't have the BTUs that diesel has. But in mail trucks you're using diesel? Speaker 17: (:13) Well, semi. We're long haul."
    },
    {
      "text": "And you've tried with the compressed gas? Speaker 17: (:18) We do run it. We have some C&G trucks. And how do you find them? Speaker 17: (:23) We don't like it. The C&G, the pricing is really good. But you said it's more expensive. [crosstalk :33] Speaker 13: (:33) ... technology has been around for ever, but it's shut off because everyone went to battery. But the truck [crosstalk :43] touching on trucks- Speaker 17: (:45) The distance, you have to keep refueling."
    },
    {
      "text": "So there's issues with it that aren't hard to overcome, but you got to understand that world is going either electric or fossil fuel. No. Speaker 17: (:03) But the rate they're held back, the millennials and the rest of them, are- Speaker 13: (:04) ... afraid of holding back. We could be doing more business, you can't get trucks. And there's two reasons why. You can't get trucks? Speaker 13: (:15) You can't get trucks. You can't buy them? Speaker 17: (:17) No, no, no. People are not going into the business."
    },
    {
      "text": "And now it's gotten worse. [crosstalk :25] Speaker 13: (:25) Sorry, I guess what I'm saying. You can get trucks, you can't get somebody, another driver. You need somebody- Speaker 17: (:33) So, Mr. President, while trucking is a tough job to go into, so that's number one, and they made it a lot tougher with the e-logs. So e-logs limits, any time the wheel turns in a truck, it's part of the log for the day. It's a 14-hour day."
    },
    {
      "text": "So let's say if someone is half an hour from home in their truck, in their long-haul truck, they literally have to pull over on the side of the road and stop. They can't go home. So they don't even want to do it anymore. So we have people that don't want to go into the trucking business and we can't get enough drivers and tractors to haul our product around the country. So you say you don't have manufacturers that can make enough trucks? Speaker 17: (:28) No. Speaker 13: (:28) No, they're making trucks."
    },
    {
      "text": "The drivers [crosstalk :30] You can't get drivers? You mean they can only drive so much? Speaker 13: (:49) It's like a pilot. Speaker 17: (:51) E-logs. Speaker 13: (:52) Exactly. [crosstalk :53] So they have a method that you shut down a truck? Speaker 13: (:58) So every truck now is on an e-log, you're electronically watched so if that truck, if he turns up for 14 hours, if he's at 20 minutes to get home, he could be fined huge and actually done trucking. [crosstalk :15] No, everything's e-log."
    },
    {
      "text": "It has to be e-logged. What happens if you have two drivers? How's Amazon doing? That's what the other guys are starting now, Walmart and all these. I know them very well. They're ripping off the post office. But 40% of the business you do is with Amazon. And they don't pay- Speaker 13: (:40) No, 2% to the postal service. They say it's 40. They actually said it's 40."
    },
    {
      "text": "Maybe because you're using compressed gas, you can't [crosstalk :42] Speaker 13: (:42) I have a lot of information on the postal service, if you want to get it. How is the postal service doing? Speaker 13: (:06) Actually, I've been dealing with them for over 40 years, and I think they're the best they've ever been. Really? Speaker 13: (:12) They have great management. They basically break even other than the pension that they're re-funding."
    },
    {
      "text": "But as a solution rather than a problem, I do think that the government should do a 500-mile piece of road, dedicate a lane on both sides for autonomous trucks. Talk about a driver shortage. If these trucks, all the technology is there right now. There isn't any reason to not have autonomous trucks, other than putting amongst the cars. You can't put them with cars. Why can't you put them with cars? Speaker 13: (:56) Just the shortage, the regulations, the states, the perception."
    },
    {
      "text": "But if you would put a separate lane, just- How safe is autonomous? Speaker 13: (:03) It's absolutely safe. If you- So why isn't it [crosstalk :15] I don't think so. I said I was going to spend $1 billion building a building, I spent $150, 000. Speaker 13: (:31) Really? We took the building and we just ... did you ever hear that? Speaker 13: (:37) The hotel? So we were going to spend $1 billion on the embassy in Jerusalem. And I had to pay for it. [inaudible :47] $100 million."
    },
    {
      "text": "And David, he said we can take the existing building that we have- Yeah, take a corner of the building. So, I said, you don't have to make it $150,000. Make it $250,000. [crosstalk :07] It would be open in two weeks. It took like three months to build. That doesn't mean we're not going to knock it down. [crosstalk :34] They had to go out and buy a site, so a tremendous amount of money. But they have a building on an existing that's a better location, the best location. It's even set back."
    },
    {
      "text": "It's a fairly large site, a setback, which is good for safety. Speaker 16: (:49) And I heard other countries are now joining in and will- Yeah. So they took a corner of the building, fixed it for $150,000. So instead of the $1 billion, they spent $150,000. Isn't that amazing? One of my favorite [inaudible :04] when he called- For $150,000 versus a billion, and we have a better location because there was no location as good. Speaker 16: (:13) Mr. President, can I share with them about what the Rabbi did to you?"
    },
    {
      "text": "I think it's special. Yeah. Go ahead. Speaker 16: (:21) Since you're Jewish, you know about the messiah. So the head rabbi was saying, we took the president, Donald Trump's name, and they came out the same lettering as the messiah. So it's a very special thing that they have [inaudible :36] So folks, I want to thank you all very much. I'll get back. Speaker 13: (:06) Thank you so much. It's not a long trip. Speaker 13: (:09) You don't have to wait for lights and stuff like that either."
    },
    {
      "text": "Because every time I'm here you're moving at about 125. You never saw anything like it. It's incredible. And they do a great job. The Secret Service does. But we have like 115 cars. So it's not that easy to come over. Don always says, \"Oh can we do it outside of the White House. I guess, I don't know- There's a ridiculous campaign thing about that, which I think is wrong. Doesn't make sense. They spend a fortune getting over here. Speaker 16: (:39) Doesn't make sense. Cost nothing. Costs nothing."
    },
    {
      "text": "Speaker 16: (:41) It has to come to you. It's a mistake. I'm sure it's a mistake. But I like this hotel anyway. We can't get [crosstalk :47] Speaker 17: (:49) I have a MAGA hat I wear all the time, if you can sign it for me. Yeah give it to me, where is it? Speaker 16: (:55) Mr. President, in the meantime, we'd like on behalf of this group here tonight, to offer you two honors. One is the great Teddy Roosevelt, 1913, created the famous speech, The Man in the Arena."
    },
    {
      "text": "And we framed it here tonight and would like everybody to sign it on your behalf. But it says here, and you against all odds, \"Never having run for office.\" That is true. Speaker 16: (:23) \"Taking on 17 plus Republican candidates and winning substantially.\" And we're going to win for you again. You don't have to sign it. You know, I'd rather have [crosstalk :24] I want Jack Nicklaus to sign it. [crosstalk :30] Thank you. Speaker 16: (:42) Thank you so much. This is Jack Nicklaus. He's a good guy."
    },
    {
      "text": "Speaker 17: (:53) Yes sir. See the other side doesn't want to go to South Carolina, which I understand. Let me see it. Did you sign it? That's very nice. Easy job, right? Good. Hold that for me, will you? Thank you everybody. Speaker 16: (:03) We appreciate everything. Good job. Speaker 16: (:06) Keep up the good work. Thank you, I will. Speaker 15: (:08) You're doing a great job. Thank you. This was fun tonight. Speaker 15: (:12) Don't listen to those idiots in the press. [crosstalk :12]"
    }
  ]
}