{
  "speech_id": "147",
  "title": "Donald Trump Delivers Keynote Speech at New Hampshire GOP Annual Meeting Transcript",
  "date": "20230130",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-delivers-keynote-speech-at-new-hampshire-gop-annual-meeting-transcript",
  "topics": "Economy, Immigration, Government Policy",
  "num_segments": 74,
  "content": [
    {
      "text": "That was great. That was... What a good job. I've known this gentleman for seven years. I've never heard him make a speech. I'm with him all the time. He talk. That was a very good speech. Thank you very much. Great job. Thank you, Steve. Thank you very much. I appreciate. () So we're here and we start. We begin and I want to thank New Hampshire for the warm welcome outside. There are literally thousands of people. I don't know if you've seen them, but they're all..."
    },
    {
      "text": "And no negatives, all positives and it's really beautiful and it's so great welcome and I'm thrilled to be back at this beautiful state that we all love and so near and dear to my heart. I want to take a moment to salute your incredible outgoing chairman. Steve, what a job you've done. You really got [inaudible :54]. Steve, stepping up. () Two terms outstanding service to the New Hampshire GOP and Steve, just congratulations on a job well done. He worked so hard."
    },
    {
      "text": "He loves the state, he loves the people of the state and we all love you Steve, and that's why I'm going to be making an announcement about Steve. Should I do it or should I just leave it? () I'm also so really excited to do this because I know so many people and so many people would like to do it, but Steve is going to be stepping down and he'll be coming on board as the senior advisor for my New Hampshire campaign. He's going to help us to ensure that we have a win in the granite state in 2024."
    },
    {
      "text": "We stop the communist, we stopped the Marxists. If we don't stop them this time, I think that's going to be the end. I really do. I believe that. I believe that we have to stop them and we have to stop them quickly. Now, although your next state chairman has not been announced, I believe they're going to be doing that right after this. I want to congratulate both candidates, Lou and Chris, two incredible guys for having the courage to step forward and serve. You'll be hearing about that shortly."
    },
    {
      "text": "() Let me also thank the New Hampshire house speaker, Sherm Packard. Sherm, nice looking guy. Central casting, very good. He's really... House majority leader, Jason Osborne. Jason. Jason. Hi Jason. How are you? Thank you. Great job, Jason. Deputy House majority leader, Fred Doucette. Fred. Hello Fred. You know they're shy politicians. That means they do their job. The ones that aren't shy, they don't do their job, they'd sit down. They don't have to get up because everyone knows the great job they've done."
    },
    {
      "text": "Thank you very much. Great job all of you. () Senate majority leader, Sharon Carson. Sharon, Sharon. Thank you Sharon. Great job, Sharon, and executive counselor, Dave Wheeler. Dave, thank you. Thank you very much. As someone who has won the New Hampshire presidential primary, not once but twice. And by the way, I believe we also won two general elections. Okay? If you want to know the truth."
    },
    {
      "text": "And I believe it very strongly in plenty of other places also, but I know better than anybody what a special role the state has, the people have. And really it's a place for American presidents. And one of the things Steve told, I told him, \"Steve, you can help with the campaign a little bit, but what I really want is help on that final day of voting.\" It used to be a day right with paper ballots. Now it's in some cases 64 days. How about that? We have 64 days to vote and we have all machines."
    },
    {
      "text": "We have no paper, we have no nothing and lots of surprises. I said, \"I really want the biggest help to be on election day or election period.\" Think of that, we have to call it an election period. Someday we'll be back to paper ballots. We'll be back to voter ID. We'll be back to doing it the way it's supposed to be, one day voting. In France, they had an election, it was one day. They had 38 million people that took one day. By 10 o'clock in the evening, all the votes were counted."
    },
    {
      "text": "You had a winner, you had a loser. And everybody said, \"Good luck. See you next time.\" But we don't have that in this country anymore. We've gone crazy in so many ways, but that's why from the very beginning I've strongly defended New Hampshire's first in the nation primary status. I have been your defender. () No, I've been your defender and I've refused to let any Republican. And there are some, you know who they are, even think about taking that cherish status away. It's a cherish status."
    },
    {
      "text": "And they wanted to take it away. And we said, \"No, we're not going to do it. You see what's going on with the Democrats? They taken lots of things away.\" And believe me, there are so many people looking to do harm to and generally no reason. You have an incredible tradition and we're going to keep that tradition and we guarantee it. And I said it last time and I said at the time before, and I've lived up to that promise just as I have many other promises."
    },
    {
      "text": "So you have it, you're first and you're going to remain first. Okay? But if you look just to try and compare and look on the other hand, lost the New Hampshire primary, Joe Biden lost it badly and it was a very tough time. He had a humiliating fifth place to feed, and now he's taken a revenge on the voters of your state by cruelly and disgracefully trashing this beloved political tradition. It's a great tradition and I hope you're going to remember that during the general election."
    },
    {
      "text": "Don't worry about it now, just general election, you're going to remember that that he took it away. He took it away. He's going someplace else. You know about that. Now, maybe that'll be stopped legally or through the courts. I don't know. But he wants to take it away from New Hampshire. () I stand before you today and make this solemn pledge. When I'm back in the White House, I will ensure that New Hampshire remains the home of the first in nation Republican primary for many, many years to come."
    },
    {
      "text": "And I think maybe more than anything else, I've proven that I keep my promises. I've proven it more than just about any president they say. But it's a true privilege to have this opportunity to speak with you. And my very first trip back to New Hampshire, this is about the beginning. This is it. We're starting, we're starting right here as a candidate for president. And you've probably seen the polls, we're really doing great. () Remember I used to try... In 2016, I talked about polls all the time."
    },
    {
      "text": "In 2020, I didn't have to because we didn't have a lot of competition. We had no competition. And I don't think we have a competition this time either, to be honest. But I talked about the polls and I will say that our polls, we are absolutely. We are so far ahead in the polls, both in New Hampshire. One came out this morning, a very nice poll, we're way ahead and one came out yesterday on Nationwide Poll, and we're 35 points up, 39 points up. That's a lot."
    },
    {
      "text": "We won't play prevent, defense like they do in football though however. You know about prevent, defense? The team holds them and there's no way. They hold them for almost four quarters and then they have to just stop them one more time and they go to prevent. And they always lose, don't they? We don't do prevent defense. We just keep defending and we're going to win and we're going to win very big. () But our polls have been fantastic. Everyone in this room shares the one key mission."
    },
    {
      "text": "We're going to defeat Joe Biden, defeat Joe Biden and the radical Democrats. These are radical left people. I think in many cases they're Marxists and communists and I used to say that seldom. Now, I say it all the time because they are. You look at what they're doing to our country, and we're going to turn New Hampshire red on November 5th, 2024. I hope we can have the help with everybody. () Under Biden, our nation is being destroyed by a selfish, radical, and corrupt political establishment. That's what it is."
    },
    {
      "text": "Nobody even knows. Why are they doing? Why are they doing these things? Guys like Adam shifty Schiff, AOC plus three. The three love it when I say that. They love that. They love hearing AOC plus three, all on one of the three. But they're bad. Crazy Nancy Pelosi and crying Chuck Schumer, and the group, they're running our country right into the ground. They're destroying our country. To save America, we need a leader who's prepared to take on the forces laying waste to our country."
    },
    {
      "text": "And we need a president who is ready to hit the ground running on day one and aye, here, boy, am I hitting the ground? () The fake news, we have a lot of news today. Some of it's fake, but some are actually are very good. Some are very impressive. But they said when I announced I just want to put my cards in the table, we're playing that very big game right now, the biggest game of all because it involves the country and the survival of the United States of America."
    },
    {
      "text": "But when I put the cards on and then I said, \"All right, let's go.\" They said, \"He's not campaigning.\" This is about a month ago when I announced. Well, I said, \"I got two years.\" They said, \"He's not doing rallies, he's not campaigning. Maybe he's lost that step.\" I'm more angry now and I'm more committed now than I ever was because... () Now, I read a story. I read a story where they talked about why isn't he out there? It was like on a Friday night, and then I actually did something that night."
    },
    {
      "text": "Little low-key stuff and lots of... There is lots of work. We have great people with us, amazing people that I've met and really gotten to know because as a non-politician, I didn't know anybody. I went to Washington. I tell the story. I'm driving down Pennsylvania Avenue with our great first lady and I'm looking over and I'm saying, I saw the hotel that I built. It was very, very successful in Pennsylvania. And we had more police and more... I never saw anything like it."
    },
    {
      "text": "We're going down Pennsyl, crowds are cheering and just going absolutely crazy. Motorcycles all over the place, hundreds of motorcycles and so beautiful, beautiful weather, beautiful everything. I looked at our first lady, I said, \" Do you believe it? I'm the president of the United States.\" () And I was never a big Washington person. It wasn't my world. I was a New York person. So I didn't know the people in Washington like a politician would who spent 25 years and then ran for president."
    },
    {
      "text": "So I had to learn and I had to learn quick. And I've learned over four years. I know the great ones and I know the not good ones. I know the rhinos that aren't going to get it done, and I know people that are going to really get it done. I had to rely on, in many cases, some rhinos that we didn't even know they were rhinos or not. But they're more dangerous in many ways than the Democrats, I tell you. They are actually. They're more dangerous. () And we have incredible people."
    },
    {
      "text": "When you think of what we've done, we had the largest tax cut in the history of our country. We had the largest regulation cuts in the history of our country. We had the safest southern border in the history of our country. We had the least amount of drugs in decades and decades. Right now, it's 10 times the drugs are pouring into our southern border as when I left. Think of that, 10 times, not a hundred percent more. Think of that, 10 times more. It's coming in like water and cheaper than candy."
    },
    {
      "text": "Fentanyl, you buy cheaper than candy. You can go buy a candy bar, of course, you're much more than fentanyl and they can kill the entire nation with it. And frankly, that's probably what they're trying to do. So we had it done and we had a great thing going, and we had built hundreds of miles of wall. () All of the things that we did to make it so good. Stay in Mexico, nobody even heard of it. Stay in Mexico. Mexico said to us, \"Well, we are not going to do it.\" I said, \"Yes, you are, you are.\" They said."
    },
    {
      "text": "I said, \"No, no, no, you're going to do it, a hundred percent.\" Then a representative came down and I dealt with somebody, a very nice woman for the State Department. She worked with Mexico, on Mexico for 25 years. Very nice. She said, \"Sir, you can't get these things. Stay in Mexico. They'll never agree to that. They'll never agree to any of this stuff.\" I also said, I want 28,000 soldiers from Mexico guarding our borders. Will you pay for it? No, we're not paying anything."
    },
    {
      "text": "And so she smiled and not as a bad person, she smiled. She thought it was a immature ask. () I said, \"No, we'll get it, a hundred to one.\" I mean, I will tell you it's not even a chance that we want. I said, \"Sir, okay.\" Then the representative from Mexico came into the room. I'll never forget. Nice guy too, quality guy. And I really like, even though he is a socialist, I really like the president of Mexico. We have a very good friend. In fact, it took him a long time to call up President Biden."
    },
    {
      "text": "It took him a long time. He couldn't. There were many leaders of countries that just couldn't do it. They didn't believe it actually, even though we were very tough on many countries, we were tougher in Russia than anybody would've been. As you know, that would've never happened. The horror show that's going on right now would've never happened. But many, many countries felt that way. They just didn't believe the result."
    },
    {
      "text": "() But I said, \"Here's what we need, we need 28,000 soldiers and we want everybody staying in Mexico, never coming into the United States until we have them approved.\" So he said, no. And I said, \"Here's what's happening. If you don't approve it, then we're going to put a tariff on all of the cars that you stole from our country to make in Mexico of 25%."
    },
    {
      "text": "And every product that's made in Mexico is going to have a tariff of 25% on it, which would amount to tens of billions of dollars for the United States.\" So the same gentleman, and he was, he's a nice guy. He said, \"I can't believe you'd do that.\" I said, \"No, a hundred percent. Here's the document right now. I'll sign it. It's a Friday.\" And in effect, this goes on on Monday at eight o'clock in the morning. () And I had the document right here, showed him the document. He was a little surprised."
    },
    {
      "text": "He said, \"May I take five minutes to make a call?\" I wonder who he called, called the president and came back. \"Sir, we'd be honored to give you 28,000 soldiers and we would be honored to keep everybody in Mexico, even the MS13 gang members and everything until such time as they have to.\" And we had it going so good. And then think of it, they didn't want. They come in, they said, come into the United States. They stopped the wall construction."
    },
    {
      "text": "We had built hundreds of miles of wall, but they stopped the construction. Three weeks, it could have been the addition because we added a lot more than we originally said we were going to do. We had to wait two and a half years because the Democrats sued us. We had 11 different lawsuits. We won all of the lawsuits. I actually got a lot of the money. I took it out of the military because I consider it to be defense of our country."
    },
    {
      "text": "() It's an onslaught what's coming in, and we did all of those things and then they come in and what they've done to this country is incredible. Even staying out for medical reasons, you know all about that. Stay out for medical reasons. I mean, people are very ill and they're coming into our country. Now, they're emptying out as you know, He goes Biden, and he said Brandon. You're both right. We have no voter ID when everyone wants voter ID."
    },
    {
      "text": "Even at the Democrat National Convention, they had a card on the front of them that was bigger than their chest, with the exception of some people. They had a card. It had everything, pictures, everything. But not for the United States votes, right? So think of it, no voter ID when everyone wants it, even the Democrats. They did a poll, 88% of Democrats want voter ID. They don't want it because they want to cheat. That's what they are best at."
    },
    {
      "text": "() We have a woke military that can't fight or win, as proven in Afghanistan, but we lost unfortunately $85 billion of it to Afghanistan where we stupidly gave $85 billion to these people. We had them in check. We had them totally in check. Abdul, the head of the Taliban. \"Why are you speaking to him, sir?\" Who else do I want to speak to? Who else am I supposed to speak to? We want to end it.\" I told Abdul. I said, \"Abdul, you're killing a lot of our people.\" They did a lot during the Obama administration."
    },
    {
      "text": "The snipers, they were killing our soldiers left and right, a lot of them, and the roadside bombs. () You all know because it's a very military state, very state-focused on the military. I said, \"Abdul, you're killing a lot of people. Here's the story. If you do this anymore, we are going to hit you harder than anybody has ever been hit by this country, and that's pretty hard. We're going to hit you so hard, left and right, up and down, you're going to regret it. You have to stop."
    },
    {
      "text": "There's no more, no more.\" This is over a telephone conversation, can you believe it? And, \"Yes, Your Excellency. I do understand.\" () He called me Your Excellency. I wonder if he calls Biden... He's still there by the way, Abdul. He can't believe his luck. Did he get lucky? Did he get lucky? We were getting out because it was time, 21 years, right? We were getting out, but we were going to get out with pride. We were going to get out. We were going to take our military out last, not first."
    },
    {
      "text": "We took our military out, and once we took the military out, they had... I could just see Abdul, tough, smart guy, sitting there, \"Sir, they just took the military out,\" and he looks at the guy and probably said, \" This guy is the stupidest guy. That can't happen.\" () They did. They took the military out first, and we left. Right now we have many, many hundreds, maybe thousands, but hundreds of American citizens there, they're stuck. But we didn't take the equipment out, and we could have taken it out easy."
    },
    {
      "text": "I had one of our generals that's currently there say to me, \"Sir, I think it's cheaper to leave the equipment than to take it.\" $85 billion, and I said, \"What do you mean cheaper? We have brand-new airplanes over there. You mean it's cheaper to leave a $100 million aircraft, latest and the greatest, the helicopters, brand-new Apache helicopters, hardly used, it's cheaper to leave it than to fly?\" () \"Yes, sir.\" That's when I knew that this guy wasn't too good."
    },
    {
      "text": "I said, \"Listen, so you think it's better than we could give it a half a tank of gas, fly it to Pakistan, and then take it over here, right? Let it fly its way over, a couple of gallons extra, a little bit of extra fuel,\" jet fuel, which today you can't get by the way. Actually today he might be right. You can't get it because of us. But think of it. I said, \"You think it's better just to leave it?\" () \"Yes, sir. I think so.\" So we left them 700,000 rifles of the best."
    },
    {
      "text": "We left them 70,000 vehicles, many of them armored, cost millions of dollars, armored plate. Four inches of steel on the bottom, you can imagine what they cost. 70,000. I don't know if anyone's in the car business, but I have a friend who's very big in the business. I said, \"Did you ever have a car lot with 70,000 cars?\" He said, \"70,000? If we have 200, we'd consider that oversupplied.\" I said, \"70,000, think of it.\" () And binoculars. They never fight..."
    },
    {
      "text": "They're very good fighters, the Taliban, but they never fight at night because they don't have binoculars. We have given them brand-new thousands of binoculars, better than what we have, far better than what we have because they're brand new, they're the best. They are now one of the biggest sellers of arms to other countries because they have so much, they can't possibly use that much. 700,000 rifles and guns they call it. 700,000, mostly brand-new stuff."
    },
    {
      "text": "We just dumped it over there and many other things, so this is what happened. So that's April Fool. () We have a military that has to get back on track, and they don't want to. We've proposed mandatory electric stoves and electric cars, when everyone wants at least the option of choice because gas stoves cook better and gasoline cars go a lot longer. I have a friend who got an electric car. After two hours, he's like, \"Where the hell do I get this thing..."
    },
    {
      "text": "Where do I get electric, please?\" He used to drive for 12 hours. Now he drives for a very short period of time, but he's happy because he thinks he's helping the environment. I said, \"You're not helping the environment.\" () If you knew where the batteries were made, all made out of China, and they're all made with minerals and substances found in China. The substance we have, more than anybody else, is something that gets refined into gasoline, and we have more, and they don't want to use it. This is a plot."
    },
    {
      "text": "() We have people in the midst of the greatest crime wave in history that want to defund our police. That's April Fools', isn't it? Right, let's defund the police. You can't even get in your car. You go to New York, nobody ever gets prosecuted. I'm the only one they go after. No, it's true. Nobody gets prosecuted. They go after me. () I have a man, he's 75 years old, he got prosecuted because he didn't pay tax on a company apartment. Who does? I mean, do people pay? He didn't pay a tax on a company car."
    },
    {
      "text": "75 years old, he has a company car, didn't pay tax. I guess didn't pay tax on the education of his grandchildren. I paid for the education of his grandchildren. I have a lot of money. I paid for the education. They want to put him in jail. They put him in jail. Can you believe this? () These crimes, fringe benefits it's called. These crimes have never been prosecuted before. To the best of our knowledge, we've never seen anything like it, only if it's somehow Trump-related."
    },
    {
      "text": "Think of it, didn't pay tax on the use of a company car. Most people wouldn't even know where to begin. What is it? Well, how much is the car? Think of it, never been charged before that we know of, and they charged him criminally and they put him in jail, and it's a disgrace to our country. He's a fine man, never had a problem, I don't think he ever had a parking ticket. It's never happened before. How sad is it? That's what's happening to our country. We're going Marxist."
    },
    {
      "text": "We have skipped socialism, that train has already left. () We have men being encouraged to compete against women in sports, okay? Now think of it. The story I tell about the swimmer, where this great champion swimmer wants to win this race. She's worked so hard all her life. She's looking up and down, and she's seen the same girls and women that she's fought and swam against."
    },
    {
      "text": "Then she looks to the right, same thing, but there's this giant standing right next to her, and he hurt her very badly because he went by her so fast that she suffered massive windburn during the race, the whole thing. I think he beat her by, what is it, 36 seconds, right? She wanted to win. If she could win by an eighth of a second, she's going to win. She's worked all her life for this, all her life. She's going to win by an eighth of a second. She's going to set the U.S. record. She's a great athlete."
    },
    {
      "text": "He beat the record by 38 seconds. That's not right. That's not right. We have Antifa and BLM who hate our country and burn down our cities, and they're protected by law enforcement, while we put great American patriots in jail and destroy their lives, right? It's an unbelievable situation. () We're begging foreign nations for oil when we have far more oil than they have. I call it liquid gold that's under our feet. We decided to stop drilling oil as it hits an all-time high."
    },
    {
      "text": "It hits the all-time high, highest ever, we're going to stop drilling. Think of it. It's supposed to be the opposite. See, this is again, it's April Fools' Day. Who would do that? Some friends of mine are great business people here. You got a lot of good business people up here, but they hear that when the price goes high, that's when they start. No, the price hits an all-time high, and that was the day where he said, \"No drill. We're not going to drill. We're going wind.\" Let's kill all the birds."
    },
    {
      "text": "Let's destroy our plains and our beautiful oceans and seas and everything else. () And then on top of it, we sell China millions and millions of barrels of cheap oil. We're selling it to China. We demand windmills be built on our oceans. We demand they go on our prairies and our mountains and our plains, only to realize that they're killing all our birds at a level that... If you go out hunting and you happen to shoot a bald eagle, they put you in jail for five years, right?"
    },
    {
      "text": "They kill thousands of them with these windmills, nothing happens. It's the most expensive and least reliable form of energy on our planet, extremely expensive, and the wind turbines are all made in China. Some are made in Germany, but most are made in China. () We have a president whose son's laptop from hell gets taken over and exposes massive corruption like nobody's ever seen before. You think the father... Did you ever hear this? Do you think the father was upset? \" Dad, I left my laptop in a repair shop."
    },
    {
      "text": "I forgot to pick it up, and this repair guy went a little crazy when he saw what was on it.\" () \"What's on it, son?\" () \"Every crime that you've ever committed, pa.\" () At what point does the father get angry, like, \"This kid is not working out well for me.\" () Then the FBI goes and convinces the media that it's Russian disinformation. Remember, they went over to see the people at Twitter and other media and other agencies also, but the FBI, can you imagine the good old FBI?"
    },
    {
      "text": "It's hard to believe what's happened there. \"This is Russian disinformation, so if you hear anything about it, don't put it in. Don't do it. Don't do it. You better not do it because it's Russian disinformation. It's not true.\" Even though they know that's a lie that they're telling them. () Instead of doing that, they come after Trump. \"Let's go after Trump. Let's raid Mar-a-Lago.\" Nice secure place too. We have an FBI and Justice Department that does raid Mar-a-Lago in Florida. It's placed under lock and key."
    },
    {
      "text": "A very, very powerful building, very secure, very thick walls. It was built actually as a southern White House by Marjorie Merriweather Post and E. F. Hutton. They willed it over to the government. Jimmy Carter turned it back. He said it was too expensive. Can you believe it? And I say, \"Thank you, Jimmy. I appreciate it.\" () But they asked if we could do them a favor. They saw the room. We're having very good discussions with NARA, which is what we're supposed to do. We looked at the room."
    },
    {
      "text": "They asked us, \"Would you do us a favor?\" They came down and looked at it. I told them, \"Absolutely, go down and look.\" They looked at the room. They found everything in order. It was sealed. There wasn't stuff lying all over the garage floor. What a pigsty that place was, right? Classified documents. () They looked at the room, and they made a request, \"Could you put on an additional lock?\" We had a strong lock. \"Could you put on an additional?\" I said, \"Absolutely. Let them put it on."
    },
    {
      "text": "Tell them.\" We put on additional. Then they came in and they raided Mar-a-Lago after that. We were having very good discussions with NARA, but of course, NARA is very radical left. They have a red flag. I don't know. Does anybody know this? It's a red flag meaning danger. The Constitution of the United States and the Bill of Rights, can you imagine? This is what we're dealing with. They have it red flagged. So they raided, but if you take a look at it, and if you look at all these things, all of these things,..."
    },
    {
      "text": "() I was going to go longer, but we want to get to who the hell your next boss is going to be, okay? I was going to go a lot longer, but honestly, I said, \"I'm not sure the cameras have that much time.\" Look at all that press. Look at all that media. That's because this man, this great man's leaving, that's why. That's because Steve is leaving, and he's coming with us. Thank goodness."
    },
    {
      "text": "If he wasn't coming with us, I might just have to forget about New Hampshire and just mark it down to a loss, but with Steve, I don't think we can lose. I don't think we can lose. I think with Steve, we are going to mark it down to a victory. () In recent weeks, I've begun to introduce our bold, ambitious agenda to control and confront the colossal disasters that Joe Biden is leaving in his wake, what he's done to this country, the damage."
    },
    {
      "text": "I say all the time in the rallies, which are starting very soon, even though it's still very early. I almost enforced that we entered the rallies. \"Why isn't he doing rallies two years early?\" But we're going to do them soon. () I think we should do a big one up here, Steve, okay? Let's do a big one. They love our rallies. Bigger than they've ever been too, and the reason... It's bigger. It's hotter. There's more enthusiasm now. I'm in Florida, and I'm driving over to a big meeting, a destination."
    },
    {
      "text": "And I will force China to sell any current holdings in the United States that puts our national security at risk. They're buying land right next to our very important military areas. I took in hundreds of billions of dollars in taxes and tariffs from China. Think of that. Hundreds of billions of dollars. I gave 28 billion to the farmers because they were treated so badly and it was just peanuts compared to what I took in. () The farmers love me. You go to Iowa. Those farmers, they better love me."
    },
    {
      "text": "But you have some wiseguy coming and say how great he is to the farmers. No, I don't think they would buy it. Took in $28 billion for the farmers. I gave them a checks. We split it around. Everybody got, because what China did to the farmers was incredible. And we brought many businesses back from China because of what I did with the taxes and tariffs. () It gave an incentive for them to come back. And no other president has ever done anything like it. And no other president, I took in hundreds of billions."
    },
    {
      "text": "Think of that. Billions, not millions. Billions of dollars. Took in hundreds of billions of dollars from China. Not one other president took in 10 cents, not 10 cents. They never had the courage to talk 10 cents. And I got along great with President Xi, but he understood that we understood what the game was. () And then when COVID came, I didn't get along because I said that was too much to bear. That was just too much. What they did with the Wuhan lab, it came out of the Wuhan lab. And I said that for a long time."
    },
    {
      "text": "Came right out of the Wuhan lab. We'll crack down harder on violent crime, investigate radical left wing prosecutors. These are radical left wing prosecutors who just are absolutely horrible, horrible people. And if necessary, use federal assets in Democrat-run cities to restore law and order. The Democrats are supposed to do that. You have to get their permission in theory to go in. () Next time, it's one thing I would do different. I did it for a reason. I wanted to show how bad they would be."
    },
    {
      "text": "And they were just so bad. Seattle, they took over Seattle. Minneapolis, look at that. How about they took over the police station and then ultimately I said, \"I don't care. We're sending in the National Guard.\" We sent it in. But you're supposed to wait for the governor or the mayors to ask for approval. And I wouldn't wait very long. I will tell you that. I did it. I did it the right way. () The one thing that I have shown how bad they are, how bad they are and how dangerous they are because they would never call."
    },
    {
      "text": "They could have a city or state taken over and they would not call for military help. But we came into, as an example, Minneapolis. Remember that? Seven days it was going. And then you have CNN saying, \"Not much is happening,\" and the reporter behind them, the whole city's burning. God! Do you ever see that? \"We're here and there's been some minor skirmishes. Not bad.\" Behind him the entire city is in flames. () So, I'll support a constitutional amendment to impose term limits on members of Congress. It's time."
    },
    {
      "text": "It's time. And only a non-politician would do that. A lifetime ban on lobbying by former members of Congress because I see the things that are happening. And also cabinet members and a ban on members of Congress getting rich by trading stocks with insider information like Nancy Pelosi and her husband. () We will keep America out of foolish foreign wars just as I did as commander- in-chief. And I will restore pre ... It's called peace through strength."
    },
    {
      "text": "By the way, and everyone thought when I ran, they said, \"This guy's going to be in world ...\" Remember crooked Hillary? \"He's going to cause a war in his first week in office,\" because they think that's my personality type. It's actually the opposite. My personality kept us out of war. And I told you before, would've never happened with Russia. Would've never gone in Putin, would've never, ever gone in. And even now I could solve that in 24 hours. It's so horrible what happened."
    },
    {
      "text": "Those cities are demolished now, the people. I'll bet you have millions. It could be millions of you. They bomb a city to the ground. These big buildings come tumbling down. They say, \"Two people were injured.\" Not two people. They lie. I mean, they lie. () But, if I were president, you would have zero chance that that war would've happened. And even now, as bad as it is, should have never, ever happened."
    },
    {
      "text": "I mean, the country, how does it ever rebuild those cities, those magnificent buildings that came down that are a thousand years old with the gold domes? You can't do that. But it would've just ... So, so sad to see that. A deal would've been made very quickly. I'm not even sure a deal would've had to be made. I don't think he would've ... He would've never done it. And let's see what happens with China and Taiwan because they see how incompetent we are. So, let's see what they're going to do there."
    },
    {
      "text": "() But we will root out the deep state and stop the weaponization of federal agencies because there's a weaponization like nobody's ever seen. We will use every tool at our disposal. We'll give to Steve to defend election integrity and we will dismantle the illegal censorship regime and bring back free speech to America. And as they say in New Hampshire, live free or die. That's pretty good, right? Live free. () So ... That's good. Proud of ... That's great. That's great. Live free or die."
    },
    {
      "text": "This is just the beginning of our agenda. I look forward to returning. Many times I'll be here. Many times I'll be with you. I like it here, first of all. I guess if I didn't, maybe I wouldn't be back so much. But I love the people here. They're great spirit. They're incredible people. Thank you. Who said that? Who? Stand up. That's how nice is this woman. Thank you very much. That's very nice. Thank you. I appreciate it. () One year from now, we will win the New Hampshire primary."
    },
    {
      "text": "And then, with the help of the good people of this state, I love the people, we are going to take back our country and we'll take back the White House and we're going to straighten out the United States of America, okay? And God bless you all. () Now, I am going to be reintroducing Chairman Stepanek, who is going to do a very important thing. He's going to make an announcement. And the announcement is who is going to be the next New Hampshire GOP chair."
    },
    {
      "text": "So, whoever that is going to be, I'm going to immediately start treating him very nicely because he'll have a big impact on the election. Ladies and gentlemen, thank you very much. Steve, you take over. Thank you very much. Thank you. Hi. You go here. Thank you. [inaudible :03]. Thank you. [inaudible :30]. Good. Good. [inaudible :52]. Thank you. Thank you, everybody."
    }
  ]
}