{
  "speech_id": "154",
  "speaker": "Trump",
  "title": "Donald Trump Roundtable Meeting Transcript on Venezuela July 10",
  "date": "20200710",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-roundtable-meeting-transcript-on-venezuela-july-10",
  "topics": "Foreign Policy, Government Policy, Social Justice",
  "num_segments": 58,
  "content": [
    {
      "text": "But thank you very much. Great job. And he recovered successfully. He was positive. He tested positive. I heard about it. I wasn't thrilled, but he fought it out. Somebody said his immune system must've been good. It wasn't perfect, but you still went through a little bit, right? Congressman Mario Diaz- Well, my administration as you know, it stands with every citizen of Venezuelan and Cuban, Nicaragua. It stands with the righteous struggle for freedom."
    },
    {
      "text": "The patriots here today fled socialism to find freedom and socialism and other things, as you know, and a step beyond socialism in many cases. And now Joe Biden and the radical left are trying to impose the same system, socialism plus, in America. Biden is a puppet of Bernie Sanders, AOC, the militant left, the people that want to rip down statues and monuments to George Washington, Thomas Jefferson, Benjamin Franklin, Jesus. Jesus. They want to rip down statues to Jesus."
    },
    {
      "text": "So we're dealing with a group of people that they will not win. They will not win at all. But this election coming up is a very important one. I used to say 2016, the most important. And maybe I'll still say that, but this is equal to that. This is equal because we need that extra time to have it seed. Like a tree, you move it, it has to grab on. And that's why I appreciate you're all being your great leaders. And I appreciate you being here."
    },
    {
      "text": "Nobody will be safe in a Biden America, but Biden doesn't know what a Biden America is. If you asked him to define it, he wouldn't even know what it is, but other people do. And he will have radical people running that. He'll be choosing a vice president who, we'll see what that ends up being, but he'll be choosing somebody. But even that person won't have as much to do with running the country as you'd believe. Biden wants to defund the police."
    },
    {
      "text": "He wants to call the cops the enemy, which he did the other day leaving every citizen at the mercy of a socialist mob or a mob far worse than socialism was ever meant to be. I'm fighting against this horrible situation. I'm fighting and I'm fighting hard. And I want the Republicans to get strong and tough. And I want people that agree with me on the Democrat side, of which there are many, I think we're going to have a tremendous Democrat surge. In the real polls, we're doing very well."
    },
    {
      "text": "We reviewed polls this morning with different states. We're doing very well. By the way, you'll be happy to know in the state of Florida, we're doing great. You see the boaters out there, thousands and thousands of boats every weekend. And we appreciate it, but nobody's seen anything like it ever. And we have that in many other states with boaters and bikers and everybody. There's a spirit that nobody's ever seen. I don't think we had anything like this even in the 2016 race because they see what happened."
    },
    {
      "text": "We built the greatest economy in the history of our world. Greater than anything we've had, but greater than anything the world has ever seen. China was not doing well. China went down to the worst. It was the worst year they had in 67 years. This is before the plague came into China, virus came in. And the worst economy they had in 67 years. They were doing not well with the tariffs and all the other. We're taking billions of dollars from China. I was giving it to farmers and giving it to people that were targeted."
    },
    {
      "text": "And we were doing great and then the plague came in. I said, \"Oh, there's the plague. The plague is coming in.\" And we closed our borders to China, very heavily infected. And we did the ban. And if we didn't do that, we would have had hundreds of thousands of more people dead. And then we did the ban to Europe because we saw what was happening with Italy and Spain and some others, many others. And we were ahead. But we're still fighting it, and we're going to do very well."
    },
    {
      "text": "We're testing at a level that nobody's ever tested before. We're making ventilators for the world. We literally had no ventilators and now we're making thousands of ventilators a month. Thousands, thousands, and thousands. And we're helping other countries. We're giving, as an example, to Mexico. We've given 600 ventilators and they desperately needed them. The president of Mexico was up at the White House two days ago and he is a great guy, the president. We had a tremendous day and evening."
    },
    {
      "text": "We had dinner with a lot of the real leadership of Mexico and it was a fantastic thing. And a lot of people didn't think we would get along and it was just the opposite. We were joking about it a little bit. People thought maybe we're very different type people, but we're not really. We got along great. So the relationship with Mexico and the United States is very strong. We just signed the USMCA, which is tremendous. We had a horrible, horrible situation with NAFTA."
    },
    {
      "text": "It was the worst trade deal I think probably ever made. And now we have a great trade deal for the United States that also it's very fair to Canada and to Mexico. So that's good. We imposed historic sanctions on the Maduro regime. We indicted Maduro for narco terrorism as you know, everybody here knows. We're standing with the righteous and rightful leaders of Venezuela. This time it Juan Guaido. We impose sanctions on Nicaragua for human rights violations. They've been violating a lot of human rights."
    },
    {
      "text": "A lot of very bad things are happening in Nicaragua. And I ended the Obama-Biden sellout to the Castro regime in Cuba. We've been very strong on Cuba. Cuba is not doing so well. Joe Biden has pledged to reinstate the pro-communist policies of the Obama-Biden administration. They were pro-communist policies. The deal we made with Cuba was ridiculous. It's ridiculous. What he did for Cuba and what they did for Cuba is ridiculous."
    },
    {
      "text": "And I guess it's why the Cubans gave me the Bay of Pigs Award just before the last election. If you remember, I got the Bay of Pigs Award, which was a great honor. I have it very proudly in my office. Republicans are the party of freedom. Democrats are the party of socialism and worse that's what's happened. The Democrat party is a whole different deal. They tear down the monuments and they think it's good. Nancy Pelosi made the statement, \"Well, that's okay."
    },
    {
      "text": "That's no big deal.\" And the reason she said that she has no control over it. She didn't say it because she really believed it. She said it because she has absolutely no control over what these people are doing and we do. We do. We were going to go into Seattle. We were all set to move and then they heard that we were and the police came out and they did what they should have done weeks before. So we got that done. Minneapolis, same thing."
    },
    {
      "text": "We said, \"You got to send in the national guards after four days of ridiculous, no law enforcement.\" We demanded that the National Guard be sent in, and the minute it was sent in, it all ended. They walked through the streets like a knife goes through butter. It was pretty amazing. Now what we're doing is in Portland, we have a very radicalized group and we have it so under control. We have an under control. The local police have not done the job."
    },
    {
      "text": "I think they were told not to do a job, but we have it very much under control. We're taking very strong measures and we're looking at other places too. When you see what's going on in some of these Democrat run cities, all Democrat run cities in every case, and they're to hell. And we're doing a lot of things to get that changed. And we're going to get it changed very quickly. So I'd like to ask our great Congressman to say a few words if he would. He understands the situation. He loves this area very much."
    },
    {
      "text": "He will constantly call me. And if I can't get back to him immediately, he'll call me again because he wants money coming here and he wants a lot of other things coming here. And that's the way a good Congressman supposed to be. Right? And he's not a good Congressman, he's a great Congressman. So if you would please, Mario. Congressman Mario Diaz- Thank you very much, Mario. Appreciate it. Great job you do. How about we go down the line, please. That's very nice. I appreciate it. Beautifully said."
    },
    {
      "text": "And it is a catastrophe when you think of what happened to Venezuela. Thank you very much. Speaker 2: () Thank you, Mr. President. It's an honor to be here with you and to hear these stories on why the fight for freedom can never be forgotten. Mr. President, your- Speaker 2: () Can never be forgotten. Mr."
    },
    {
      "text": "President, your campaign and the Republican National Committee are building the largest grassroots movement in American history because of you and your steadfast commitment to always put America first for every American. The Republican party is growing by the day because Americans know that you're standing up for our freedoms and what makes America great no matter the criticism. And because of that, the Republican party is now the party of freedom thanks to you. As we say here, [foreign language :41]."
    },
    {
      "text": "We're the party of freedom because we stand for freedom of religion, freedom of speech, freedom for the unborn, freedom of commerce if it's free, fair, and reciprocal trade, freedom at home and abroad. The Hispanic and Latino community in Florida knows the horrors of life without freedom. They've seen firsthand how leaders who value control, not freedom, destroy prosperity, security, and opportunity. Speaker 2: () That's what happened in Venezuela, in Cuba and Nicaragua. That's what socialism does. Mr."
    },
    {
      "text": "President, freedom and faith in America are now threatened by the same radical left ideology seen in places like Cuba and Venezuela as that ideology now controls today's Democrat party. And the only protector of our American freedom and American greatness is you Mr. President. That's why everyone around this table and the communities outside of this church are working hard every day to reelect you as our president for four more years."
    },
    {
      "text": "We're registering voters, we're knocking doors, we're sharing this Republican message of freedom in English and Spanish telling folks why you need four more years for America Mr. President. Speaker 2: () When you declared before our union, that America will never be a socialist country, the words made clear to freedom-loving people across our hemisphere that you stand with those who love freedom and the community here in Doral knows that."
    },
    {
      "text": "Thank you for standing up for America, for standing up for our freedom, for our greatness. Only you can rebuild the economy, this economy to secure our safety and prosperity for future Americans. American saw historic low unemployment for every community across America under your leadership, including Hispanic and Black Americans, and with God's help and with your leadership, we know that the best is yet to come. Thank you for your time today Mr. President and thank you to all the great leaders at this table."
    },
    {
      "text": "I want to get that speech. Do you mind giving me that speech? I could use it. How good was this? Who's your speechwriter? You write that yourself? You want to work for me as a nice speech writer. [crosstalk :31] He's too big. He works for me anyway in a different way, but you've done a great job. That's a beautiful speech. I want to thank you very much. Speaker 3: () That's true. I want it. You think I'm kidding too, don't you? He thinks I'm kidding."
    },
    {
      "text": "It's true the Republican party has grown incredibly from where it was and we have a whole different group of people in the Republican party. People don't remember, nobody ever heard of it until I came along. Nobody remembered it for a long time or they didn't use it, at least I use it all the time. Abraham Lincoln was a Republican. You say that people say. I didn't know that. But he was a Republican. So we're doing a great job, but that's beautiful job. I appreciate it very much. Thank you. Please. Okay."
    },
    {
      "text": "Thank you very much. Great job. Thank you. Please. Go ahead, please. Speaker 4: () Sure? I'm very sure. Speaker 4: () Listen, before I start, I need to first thank you for your sacrifice and the job you have done. And I also want to make sure that we understand that you are surrounded with very good people here in the State of Florida. And just to mention a few, we have the best Governor and Lieutenant governor in DeSantis and Jeanette Nunez."
    },
    {
      "text": "We have the best two senators in Mario, Mario is a congressman, but the two senators, Scott and Marco. Best congressmen for sure, guys sitting to your left, my dear friend. And I can not forget somebody who's just been promoted very recently or I hope he gets vetted in front of the Senate, our dear Carlos [inaudible :], very young man with a tremendous future. Thank you very much because you have selected those people and I assure you, they will be eternally loyal to you and they have your back."
    },
    {
      "text": "I assure you of that. Speaker 4: () Now, my story is very simple. We always talk about socialism. Socialism is nothing but communism during Halloween. There's no such thing as socialism. America has always been the most socialist country in the world. We're definitely the most generous. Look at the people in this table. Look at our backgrounds. Just thinking that in 1961, as a 13 year old, by myself, on my way to Spain. I wasn't even coming here."
    },
    {
      "text": "I arrived in this great country and almost 60 years later, I'm sitting next to the President of the United States talking about the American dream. The only country in the world, no other country in the world that you can start a business from the trunk of your car and within a very few years with hard work, commitment, and all the core values that we learn from this very culture of ours, we can become very important to our future."
    },
    {
      "text": "We can become those people who make the next generation better than the one before. This is the only country. Why do you think you had to close the border? Speaker 4: () Because everybody in the world wants to come over here. Nobody's ever forced to come over here. We come over here, in my case because my parents chose that I would not be indoctrinated by the communist country, by the totalitarian country, by the totalitarian regime. They don't educate children. Absolutely not."
    },
    {
      "text": "And this is something that we need to understand. What is happening in our backyard today, I experienced as an 11 year old. I remember vividly all the promises that a guy named Castro gave and how 99% of the people swallowed the pill. Speaker 4: () It took many years later after I read somebody named Saul Alinsky that I realized that all those people were nothing but useful idiots. I remember Castro while in the mountains being interviewed and asked if he was a communist. He went crazy."
    },
    {
      "text": "\"I dare you,\" he says,\" [foreign language :]\" the Roman Catholic. Educated by the Jesuits he was. \"How dare you? We even have a priest in the mountains.\" We used to have priests in the mountains. I remember I was in Marist Brothers, Christopher Columbus here for those who you know. And I remember the Brothers, the Marist Brothers used to send young kids to the mountains because it was the second coming of our Lord. He was going to save Cuba."
    },
    {
      "text": "I remember how he promised to the farmers, to the [foreign language :48] that you're going to own the land. I remember all the promises that we hear today about free education and free healthcare. Speaker 4: () About free education and free healthcare and free land. My God, no freedom. But he never said that until after he was in power, got rid of all the police, got rid of all the military, been there for the last 60 years and counting. And he destroyed each and every one who helped him."
    },
    {
      "text": "The Catholic church, everybody. And why do I know that? Because I happened to come to this country with a very last nine cloister nuns from Convent Santa Clara, because he had taken over the convent. And I was on my way to Spain, I wasn't even coming here, because I was going to join my brother, who my parents had already sent a few months before because he was in the age where the government will take him for indoctrination purposes."
    },
    {
      "text": "Speaker 4: () My dad who had experienced the same thing coming from Spain at the turn of the century, running away, not from socialism, communism. He knew better. I remember when he used to tell my mom, \"Fefe, this SOB's a communist.\" My mother says, \"Luca, how can you say that? He's Catholic. Look, he's wearing ...\" He had rosary beads all over his neck. It just so happened that when I was on my way to Spain to meet my brother, I was going to go to the marriage brothers in La Coruna, Spain."
    },
    {
      "text": "Same brothers here at Christopher Columbus, by the way. My brother died. And I was kept in this country. Greatest blessing I ever had. But imagine what happened to mom and dad. Speaker 4: () One day, you lose both kids. This is a family who had never been involved in politics. My father came at age 18 from Spain, running from communists. By himself, never went back."
    },
    {
      "text": "After a long, long life of sacrifice, when he was about to enjoy the fruit of his labors just like a president that is helping us today, because he could have been just having a good time, one of his many beautiful golf courses. But no. But yet he gave up enjoying the fruit of his labors to do this. So did my dad, that's why I love you. Exactly the same. So when they're about to do that from one day to the next, they end up in this country with the shirt that he was wearing on his back."
    },
    {
      "text": "And they did maximum, have been here already for years. But thank God for Pedro Pan. Speaker 4: () Talking about socialism, Catholic church, 14,000 kids who came like me in this country without parents. And we were provided an opportunity. This is what makes our country great. They didn't give me free nothing, they gave me the opportunity. That is the most valuable thing in the world."
    },
    {
      "text": "Now, when I said they didn't give me any free something, please understand that at 13 years old, I had to be provided with a home, had to be provided with food and an education. That is socialism, that's Americanism, that's the America that these people are trying to destroy today by using funny terms like socialism. They're not, they're communists. Don't ever forget that. I know our President understands that because he knows, he's been all over the world."
    },
    {
      "text": "And you're surrounded with great people, very loyal people, and we have our back. Speaker 4: () I remember the first time I gave little speech about something like this, tell him about I came from Cuba, blah, blah, blah. I remember this was around October 2016. I thought you were a little crazy for the sacrifice you were about to take, but I predicted that we were going to elect you in November and I was going to see you in the White House in January. Thank you very much."
    },
    {
      "text": "Because of the situations right now, I cannot give you hug. Otherwise, thank you very much. And I going to leave you with one last thing. Never forget about my dad who only had a sixth grade education, but I think he was the greatest philosopher I ever met. He used to tell us how lucky he was because he was able to come from Spain to Cuba. And then he came from Cuba to United States. And he saw me graduate from college and that was the biggest prize he ever had."
    },
    {
      "text": "And he said, \"Don't lose these place because you're never going to be as lucky as me. Because if you lose this place, you have no place to go.\" Speaker 4: () So with that, please keep that in mind. And please, people, explain that to our young people who are demonstrating out there. Don't be useful idiots. Please understand what's happening in our country. See what happens to our parents and see what is happening to America today. Mr. President, thank you very much. And thank you for your hard work."
    },
    {
      "text": "Thank you very much. And he became one of the most successful men in Florida. So he did, that's the only thing he didn't say. But he did, and he's a great gentlemen. Thank you very much, that was very nice. And now that you've cut everyone else down to about one minute, we appreciate that. Okay, do you mind? Okay, let's go. Speaker 4: () I asked that, you know. Okay, thank you very much. Appreciate it. Thank you very much. Beautifully stated. Thank you very much. We're working very hard, you know that. Okay?"
    },
    {
      "text": "Thank you very much. Thank you. Great job. Thank you very much [inaudible :41]. Very nice. Beautiful. Thank you. Thank you. Please. Thank you very much. Beautiful. Thank you very much. Speaker 5: () Thank you so much, Mr. President. I'm truly honored to be here as a voice for freedom of [inaudible :06] people and among so dear friends. Thank you Mr. President, for meeting with us today, for your friendship and for standing with us, the Cuban people, who wants to be free to decide our own destiny."
    },
    {
      "text": "Speaker 5: () Thank you, Mr. President, also for your historic actions to support democracy in Cuba and to pressure the cruel communist dictatorship. Our Cuban people suffer constant oppression from the socialist state. For more than six decades, communist Castro regime has imposed the culture of disclusion and the discrimination against any Cuban with a divergent expression. They abolished our civil liberties, our freedom of faith, and of speech. They tried to delete our history, our faith, and our culture."
    },
    {
      "text": "Speaker 5: () The Castro regime tied the hands of the Cuban people to make us poor and dependent because communism mutilates the human soul in order to control the society. Those who rise their voice in favor of freedom, in favor of justice, those are risking prison and even death. Speaker 5: () This July 22nd, we'll mark eight years since my father, Oswald [Abaya :37], was assassinated by the communist regime. My father founded and led the Christian Movement for Liberation."
    },
    {
      "text": "He was a leader of the political opposition, but he was also a moral leader to thousands and thousands of people who demand their right to have a voice and participate to change the system. He was the most generous man I ever met, and he was killed by the communist regime. They were trying to kill his legacy, because they were in fear of the faithful, in fear of the conviction of a silent majority awakening and demanding freedom."
    },
    {
      "text": "Speaker 5: () Although the communist regime was able to kill my father, they were not able to kill his legacy. They were not able to distinguish the resolve of our people to secure our liberation. On the contrary, our resolve is a stronger than ever. We carry on his work. Our movement grows faster every day. We will not relent until we are free. We're going to finish what he, and many others, started. Speaker 5: () I'm a freedom fighter, but they are many of us among Cuba, and in this table also."
    },
    {
      "text": "I know that you, Mr. President, you are also a fighter for the freedom of the United State and the freedom of the world. Speaker 5: () Mr. President, I invite you to join me in commemorating July 22nd to honor the victims of communism in all the Americas. To honor all of those who has fought and died, defending democracy in Venezuela, in Nicaragua, in Cuba, and in other parts of our continent also."
    },
    {
      "text": "It is important, it's vital, to rise our voices, to call for liberation of the political prisoners and to stop the impunity of the Castro regime. The same impunity that Castro felt when he killed my father, thinking that the world was not going to react. Speaker 5: () Mr. President, Cuba is in crisis. Families are living through a deep humanitarian crisis and political repression. A crises caused by the existence of a corrupt and criminal regime."
    },
    {
      "text": "A regime that has nothing to offer to their own people, but repression and violence. That's what they are implementing right now against the citizenry. People are being detained, threatened, [inaudible :44] cell phones, even physically assault, beaten up in the streets, taken to prison, simply for taking a photo in the streets or posting in social media. That's the lever of fear and the weakness of the Castro regime right now."
    },
    {
      "text": "Speaker 5: () This is why your solidarity and humanitarian help and the economic opportunities that Cuba needs should be directed only towards the Cuban people, preventing intervention from the regime. Because the repressors should be called out. We can, and do, Mr. President to continue shutting down all of the dictatorships sources of funding, which it uses to sustain the Cuban military, its apparatus of oppression, and its narco terrorists activities. Speaker 5: () Mr."
    },
    {
      "text": "President, this hemisphere has paid a high price for tolerating six decades of Castro communism in Cuba. A regime that has cost the end of the democracy in Venezuela and in Nicaragua, and the largest refugee crisis of our lives. It is time to end it. Speaker 5: (:07) The regime that infiltrates society to spread chaos, hate, and division, [inaudible :15] they are democratic governments throughout the hemisphere, and also here in the United States."
    },
    {
      "text": "Throughout the use of propaganda, the communist ideology has contaminated the minds and soul of young people in Latin America and in the United States. It is time to tell them the truth. Speaker 5: (:38) President Trump, this dictatorship threaten peace and security of the continent. As you know, they are involved in criminal and terrorist related activities, drug trafficking, trafficking persons through the communist medical brigades, corruption, providing sanctuary and support to terrorist. Mr."
    },
    {
      "text": "President, I encourage you to indict Raul Castro, Diaz-Canel, and all the top officials of the regime. And very importantly, I encourage you to designate the Cuba military intelligence services and the Cuban Communist Party as foreign terrorist organizations, because they are relation with the crime and the narcoterrorism threatening the region. Our movement, Cuba Decides, is a national and global initiative to force the Cuban regime to submit to the will of the people and leave."
    },
    {
      "text": "It is imperative that all the nations in the free world support the Cuban people's fight for change, because the victory of the democracy in Cuba is essential to open the path to peace, prosperity, and stability in the whole hemisphere. Speaker 5: (:04) Mr. President, my father, in a letter to the Congress, to the United States, he said that we Cubans, we wants to be free and we wants to be friends with the American people."
    },
    {
      "text": "Please accept this cuff links with the coat of arms of the Republic of Cuba as a symbol of the friendship between our two people, and also as a symbol of our appreciation for your actions and your solidarity. Speaker 5: (:40) Thank you so much, Mr. President [crosstalk :42]. I'm looking forward to working together with you very soon for the [inaudible :46] a free Cuba. Thank you so much. Thank you very much. Well, I want to everybody, I will not forget what I heard today. It's very moving."
    },
    {
      "text": "It's a very tough situation. We've made a lot of progress, as you probably have seen and you know. I have a feeling you won't be disappointed. And by the way, 2020 is very important. Very important. Good luck to everybody. Thank you. Really a good job. Beautiful job. I won't forget. You have a great representative right here. Mario will be speaking. Thank you very much. Thank you. Thank you very much."
    }
  ]
}