{
  "speech_id": "157",
  "title": "Donald Trump News Briefing Transcript on Counternarcotics Operations",
  "date": "20200710",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-news-briefing-transcript-on-counternarcotics-operations",
  "topics": "Economy, Healthcare, Immigration, Government Policy, Veterans Affairs",
  "num_segments": 22,
  "content": [
    {
      "text": "Thank you very much. I guess I might begin. It's an honor to be with you and really brave men and women, the job you do is incredible. And the progress that you've made in the last short period of time has been unbelievable. On April first of this year, I announced the launch of a powerful US military law enforcement operation to combat the flow of illegal drugs across the Western hemisphere."
    },
    {
      "text": "Today, I'm pleased to be with Admiral Craig Faller, and his team, done an incredible job at the U S Southern command headquarters to provide an update on this incredible successful effort. We're joined by secretary of defense, Mark Esper, thank you, Mark. Acting secretary of Homeland security, Chad Wolf, Chad, thank you, thank you. Commandant of US coast guard, Admiral Karl Schultz, Admiral. Associate deputy attorney general, Amanda Liskamm. Thank you, thank you, Amanda."
    },
    {
      "text": "Congressman Mario Diaz Bullock, who is a friend of mine for a long time. Thank you very much for a great job you're doing down here. And many, many others, leaders and military geniuses and people that do a fantastic job. In just 12 weeks, SOUTHCOMs surge operation conducted with key regional partners has resulted in more than 1000 arrests and the interdiction of 120 metric tons. I can only tell you that's a lot of narcotics worth billions and billions of dollars."
    },
    {
      "text": "We're determined to keep dangerous drugs out of the country and away from our children. We're securing our seas. We're securing our borders. This is a new operation, not been done before, and this operation has been incredibly successful. As you know, in the United States, at least before the COVID came to us, the flu, the virus, the China virus, whatever you'd like to call it, it's got many different names, but before it hit, we were doing really well."
    },
    {
      "text": "We're still doing very well, but now we're getting back on track. Last year, 70,000 precious American lives were taken because of the poison the cartels bring into our country. Under my administration, drug overdose deaths fell for the first time in nearly 30 years, and they fell fairly substantially. Unfortunately, the shutdowns caused by the China virus have led to a recent rise in overdose deaths, still below the level that they were at, but nevertheless went up a little bit."
    },
    {
      "text": "This is one of the reasons that we're working to safely and responsibly reopen our country, reopen our schools, get our country going again a hundred percent. Were setting records on jobs, were setting records on many different things. We're going to have a great third quarter, third quarter is going to be tremendous numbers, fourth quarter, likewise."
    },
    {
      "text": "And next year economically, will be one of the best years we've ever had, but you'll see the numbers starting to come out really, really high in the third quarter. And you've already seen the record breaking, job numbers, NASDAQ just hit recently about 12 record highs, 12 days record highs, and the other markets are right behind it. There'll be hitting records hopefully very shortly also. That means people have a lot of confidence in what we're doing."
    },
    {
      "text": "With the help of the heroes here at SOUTHCOM, coast guard, CBP, DEA and law enforcement will work relentlessly to seize illegal drugs, arrest traffickers, the traffickers are truly vile. They're terrible, terrible people, what they do mostly to women and children, but women, and dismantle criminal cartels who are responsible for the deaths of thousands and thousands of Americans. I'd like now to introduce secretary Asper, to say a few words. Mark, please. Thank you. Thank you Admiral. They seem to be."
    },
    {
      "text": "It's a fantastic job. Thank you very much. Mr. Congressmen, you like to say something, thank you. Well, I want to thank you for your leadership. You have done a fantastic job. You represent the area so well, I know this area quite well, as you can imagine, but I know it very well. Little Venezuela we call it and incredible people, I know the people. And we're going to be fighting for Venezuela. We're going to be fighting for our friends from Cuba. They know that we've been doing that and so many other places."
    },
    {
      "text": "But Cuba, Venezuela, we have it very well under control and you know what we're doing and we're in touch all the time. So I want to thank you for your tremendous work. And maybe I could ask Amanda to say a few words, please. Thank you, Amanda. Great job you're doing, appreciate it. Thank you. Admiral, please. Thank you very much, Edward. Appreciate it. Now, Chad Wolfe, maybe you could also mention what's going on in Portland because we sent you there recently. It was out of control."
    },
    {
      "text": "The locals couldn't handle it and you people are handling it very nicely. So nicely that the press doesn't want to write about it. But why don't you tell them what you're doing in Portland and also go into this please. Yeah, how many of you arrested? And I know you have it in very good control, but it's a pretty wild group, but you have it in very good control. So we appreciate it. Local law enforcement has been told not to do too much and it's not the way it's supposed to be, but that's okay. Good job."
    },
    {
      "text": "You've really done a great job. Go ahead, please. Thank you very much. Thank you, Chad. And the wall is coming along very well. Chad is responsible for supervising that along with the Army Corps of engineers who have been fantastic. And Mark Esper, that's been really one of your pet projects and it's been going along. We're up to 250 miles and that's real wall. That's a wall that you don't get through. It's a tough stuff and built to the highest standard, built to everything that Border Patrol wanted."
    },
    {
      "text": "They all sat down and they designed their perfect wall. And then we said, \"Let's build it that way.\" And we're up to 250 miles by the end of the year, we'll be up to 450 or so, and we'll have it finished very shortly thereafter. And it's made a tremendous difference because your numbers on the Southern border are very, very small coming through. And especially with COVID that turned out to be very lucky for us that we had the wall, or we would have been inundated because they do have some big problems."
    },
    {
      "text": "I was with a great gentleman, the president of Mexico, two days ago, we had a long talk about the Southern border and Mexico. And they've had some difficulty, but he's doing a fantastic job as president, but the wall is very exciting and we'll have that open relatively very, very shortly. And that was despite all odds, I would say. Mark, wouldn't you say? That was despite all odds. We had a certain party that was against it. They're not against it anymore."
    },
    {
      "text": "In the end they just raised their hand, they said, \"We don't want to take this on because politically it turned out to be as good as we always knew.\" Two things never change, walls and wheels. Wheel will never change. They were talking about technology. Technology is no good without the wall. But it's something that I've heard for a long time. Two things you will never change in a 1,000 years from now a wheel and a wall, they work. And this wall has really been unbelievable the way it's worked."
    },
    {
      "text": "So great job and let's get it finished and tremendous numbers on the Southern border. Very few people coming in. Appreciate it. And we've made a lot of legal changes too. Makes it a lot easier for you. Robert, please. Thank you very much, Robert and James, please. Thank you very much. And Douglas and Henry, if you'd like to say something, go ahead. Would you like to start? Go ahead. Speaker 1: () Thank you, Mr. President, appreciate the opportunity."
    },
    {
      "text": "I'm proudly serving at JIATF South and I'll tell our workforce is ecstatic about the assets that are coming down into our theater. Our morale is very high. Good. Speaker 1: () Our workforce is working relentlessly, as you said, sir. To make sure that we are building our immune system and keeping it good so we can work throughout this COVID crisis. They're doing a great sacrifice to their families at times, but they do it because they believe in the mission that we're doing and we want to stop these transactions."
    },
    {
      "text": "So you're working on your immune system? Speaker 1: () Yes, sir. That's an interesting one. Not too many people have heard that one. I like that. What do you do for your immune system? Stay in shape. Speaker 1: () Absolutely, sir. Working out, hydrating properties. That's good. Speaker 1: () And staying safe-[crosstalk :39]. I'm going to have to start doing that, I think. That's a good idea. Speaker 1: () And we're doing it and we're proud to do it. Thank you. That's great. No, that's great."
    },
    {
      "text": "Speaker 1: () And then lastly, I'll tell you our men and women in the military we really appreciate, and 3.1% pay raise you gave us this year. It means a lot to our men and women who work hard and going in harm's way all across the globe. So thank you so much, sir. Well, thank you. And Mario, obviously had a good immune system because ... Well, thank you. And Mario, obviously had a good immune system because you recovered. Wasn't pleasant, but you got there, right? No, it's not good, but you did a good job."
    },
    {
      "text": "Absolutely. Well, you've been my friend. Thank you very much [inaudible :18]. Please. Well, thank you very much. I appreciate it, Douglas. And we have the best equipment that we've ever had as a military. We spent two and a half trillion dollars on our military and some of it's arriving, some of it's coming in, but much of it's here. So when you say the quality of equipment, we definitely have the best equipment we've ever had. We have the best equipment anyone has as a military."
    },
    {
      "text": "We have things under construction that we're going to take a look at one day soon, where we have missiles that go, I hear, 17 times faster than any other missile and the normal type at least, and it's something that nobody has anywhere in the world, 17 times faster. So it's a little hard to spot it when it goes that fast because by the time you spot it, it's gone. But we have things happening that nobody has even thought about. So thank you very much. You've done a fantastic job."
    },
    {
      "text": "You've all done a really fantastic job and it's an honor to be here. I want to thank all of the folks behind me too. I don't want to be rude because you're more important than all of us, right? But I want to thank you all very much. Great job. Really great job. Great to work with you and with you and say hello. Tell them to get well fast, right? Great man. Thank you very much. Okay. Thank you. Admiral, it's yours. You've done a great job. Thank you very much. Thank you, Admiral. Thank you Admiral. Thank you."
    }
  ]
}