{
  "speech_id": "159",
  "title": "Trump Rally in Florida on 7/09/24",
  "date": "20240710",
  "url": "https://www.rev.com/blog/transcripts/trump-rally-in-florida-on-7-09-24",
  "topics": "Immigration, Climate, Healthcare, Foreign Policy, Government Policy",
  "num_segments": 59,
  "content": [
    {
      "text": "... cold, very cold summer evening. Then right here in the middle of the 10th hole, beautiful hole, isn't it? Look at that lake. Isn't it beautiful? On one of the greatest golf courses on earth and we really want to thank all of the tens of thousands of people that showed up. This is a lot of people. This is a lot of people. As the world can see, we are under the leadership. The Republican Party is bigger, stronger, more vibrant and more united than ever, ever, ever before."
    },
    {
      "text": "Every day we are welcoming more Americans to our ranks. African Americans, Hispanic Americans, Asian Americans, young people, old people, union members, non-union members. Basically everyone is joining our movement because it's a movement of common sense. It's common sense. Whatever happened to common sense in government? We've got it. We've got more than anybody's ever had."
    },
    {
      "text": "() Meanwhile, the radical left Democrat party is divided in chaos and having a full-scale breakdown, all because they can't decide which of their candidates is more unfit to be president. Sleepy crooked Joe Biden or Laffin' Kamala? Laffin' Kamala. As you know in our recent debate and in honor of all of you, I dealt Joe Biden, even according to the fake news media, the most decisive and overwhelming defeat in the history of presidential debates. I think so, right?"
    },
    {
      "text": "I think so and that was a big crowd that was watching. That was one of the highest-rated shows ever on television, so I'm honored to be a part of it. I don't think he's too happy, but I liked being a part of it. Even CNN said as I walked off the stage that it was one of the greatest performances they've ever seen, but it was sort of easy if you want to know the truth."
    },
    {
      "text": "Our victory was so absolute that Joe's own party now wants him to throw in the towel and surrender the presidency after a single ninety-minute performance. They want crooked Joe out of the race. It's a shame the way they're treating him, but don't feel sorry for him. He's a very bad guy. He weaponized government, remember that. He's a very bad guy. Don't feel sorry for him. Tonight I'm officially offering Joe the chance to redeem himself in front of the entire world."
    },
    {
      "text": "Marco and Byron and everybody, here's what we're going to do. You guys can be referees if you like. Let's do another debate this week so that Sleepy Joe Biden can prove to everyone all over the world that he has what it takes to be president, but this time it will be man-to-man. No moderators, no holes barred. Just name the place anytime, anywhere and in the debate Sleepy Joe also declared that he wanted to test his skills and stamina against mine on the golf course. Can you believe this?"
    },
    {
      "text": "Did you ever see him swing? He's like this. That's why this evening I am also and this is in honor of you and everybody here. This is a 45,000 people. That's a lot of people. () I'm also officially challenging Crooked Joe to an 18 hole golf match right here on Doral's Blue Monster, considered one of the greatest tournament golf courses anywhere in the world. One of the great courses of the world."
    },
    {
      "text": "I will give him 10 strokes aside and if he wins, I will give the charity of his choice, any charity that he wants, $1 million and I'll bet you he doesn't take the offer, I would bet because he's all talk, but what that match will do is prove that Joe is in fact all talk and no action, but on many things, not just golf. When pilots walk into the White House, he says he used to fly planes. He didn't. When truckers come in, he says he used to drive a truck. He didn't."
    },
    {
      "text": "When Jewish people are here, he always attended synagogues, he said. He didn't attend a synagogue. Did he ever see a synagogue? He doesn't know what a synagogue is. When black people come, he spent his Sundays in black churches. All of it's false. All of it's fake. He's a fake. () Unfortunately, he was like that in Afghanistan. He was like that with Russia, Ukraine and he was like that on October 7th and the attack in Israel."
    },
    {
      "text": "He didn't know what he was doing, but whatever else can be said about Crooked Joe Biden, you have to give him credit for one brilliant decision, probably the smartest decision he's ever made. He picked Kamala Harris as his vice president. No, it was brilliant because it was an insurance policy. Maybe the best insurance policy I've ever seen, Marco. If Joe had picked someone even halfway competent, they would've bounced him from office years ago, but they can't because she's got to be their second choice."
    },
    {
      "text": "She has no choice and no chance. () As Vice President, Kamala Harris was given two jobs, two very important jobs actually. First, she was put in charge of the U.S border security and the border and she never showed up. She's never gone. She never went there once and the border's the worst border in the history of the world, not just in the number of years. We had the best border in history. She has the worst border in the history of the world and then she was sent to Europe to deter Russia from attacking Ukraine."
    },
    {
      "text": "How did that work out? Not too good. Both times the result was a deadly failure. Since Kamala was made border czar, the Biden-Harris administration has lost track of an estimated 150,000 children, many of whom have undoubtedly been raped, trafficked, killed or horribly abused. Think of it, 150,000 children are missing. Missing. They're gone. Nobody knows where they are. Many are not with us any longer. () She's 100% for the Green New Scam. Supports banning the sale of gas-powered cars."
    },
    {
      "text": "Who wants to drive an electric car for the rest of your life? Does anybody? You don't want to drive for 45 minutes and then stop for three hours, is that what you... Once the American energy industry totally shut down, starting with Pennsylvania fracking and Texas drilling, no drilling in Texas, no fracking in Pennsylvania. We just got a poll from Pennsylvania, we're 12 points up. That's a lot. You got a poll from Texas we're 16 points up and we have some great people from Texas here tonight."
    },
    {
      "text": "() As a senator, Kamala sided with socialist Bernie Sanders. He's a real socialist. He's serious, but not as bad as Biden turned out to be. Bernie is embarrassed by some of the things that Biden did because they push him around. It's the ultra-far-left government takeover of the entire healthcare system and I don't think Kamala Harris California socialism is going to go down well with the people of Doral, the people of Miami or the people of Florida because in Florida we don't like socialism."
    },
    {
      "text": "We want our freedom, right? We want our freedom. We have a lot of people, Marco, from Cuba, from Venezuela, from all over and they don't want to hear about socialism or communism. Thank you. Despite all the Democrat panic this week, the truth is it doesn't matter who they nominate because we are going to beat any one of them in thundering landslides. This November is going to be amazing. It's going to be the most important election in the history of our country because our country's going down the tubes."
    },
    {
      "text": "That's a nice way of saying our country's not doing too well. We've never had anything like it. Our borders, our economy, the worst inflation ever. We have the politics on our side. We have the policies on our side that will make America great again and they don't. They will only continue to destroy our nation. Our nation is being destroyed. Joe, Kamala and the entire Democrat establishment have been caught red-handed in the thick of the biggest scandal and the biggest cover-up, it's cover-up, that's what it is."
    },
    {
      "text": "I said it when they hid this guy in the basement and then they cheated on the election. It's a cover-up. It's the biggest cover-up in political history. () As you know, they are all co-conspirators in the sinister plot to defraud the American public about the cognitive abilities of the man in the Oval Office. Sometimes these days, he's not there often. Laffin' Kamala. L-A-F-F-I-N apostrophe. Laffin'. Laffin' Kamala was in on it. Crazy Nancy Pelosi, who by the way, is also very cognitively impaired."
    },
    {
      "text": "Have you watched her lately? She's not doing too well. She's not doing too well. I think she's worse than Joe, you want to know the truth. She was in on it. Crying Chuck Schumer. You ever see him cry? He cries. The phonyest crying I've ever seen. Crying Chuck Schumer was in on it. Every Democrat cabinet member was in on it. They all knew this guy was grossly incompetent and every Democrat in the house in the Senate was in on it. It was a scam. The American people can never trust this group of liars ever again."
    },
    {
      "text": "They've put our country at great risk and danger. That's why we are going to sweep them all out of office this November. I believe it'll be an election like no other, but the biggest problem for the radical left Democrats is that their candidates are very much, if you take a look, mentally deficient. Is that a nice statement? They are mentally deficient. I'm saying that because the other term is too tough. () The biggest problem is that their policies are no good. Their policies are horrible."
    },
    {
      "text": "Americans want strong borders, not open borders. We want low taxes, not high taxes. They want to increase your taxes four times, by four times. We want a strong military, not a woke military. We don't have a woke. We have some woke generals at top it, but they'll be gone so fast your head will spin, but we have a great military. We have a military that defeated ISIS in four weeks once I got in. We want no inflation, not 30 or 50% inflation, which is what you had. Think of it. You were destroyed."
    },
    {
      "text": "People were destroyed with the inflation. I don't even order bacon anymore. Bacon's gone up like five. I said, it's too expensive, I don't want it. I don't want it. No, it's gone up many times, right? Byron likes bacon. Bacon. Stand up Byron. Byron. How good is Byron? They say it's gone up four times, four times, so we don't eat bacon anymore, right? No more. () We want American energy independence, not all electric cars and the Green New Scam. It's the greatest scam. Above all, we want America first, not America last."
    },
    {
      "text": "They want America last. What they're doing to our country is not even believable, that's why Florida is going to defeat the radical-left Democrat hoaxers and liars on the election day. We are going to tell Crooked Joe Biden, Joe, you've done a horrible job, you're fired. Get out, Joe, you're fired. It's only 103 degrees out here. They built all these... Sir, we have many water spots. I said, what about one for me? Do I have one? I don't have one, Marco. They gave water spots. Everybody has a, call it a water spot."
    },
    {
      "text": "Well, water comes out. They don't have anything for me, I'm being drenched up here. () With your vote, I will begin saving our country from every Biden disaster starting the moment I lift my hand from the Bible after taking the oath of office. We're going to do it on day one. On day one, we're going to do it. I will seal the border, stop the invasion. We have an invasion coming through our southern border. By the way, you know who wants that invasion stopped the most?"
    },
    {
      "text": "Hispanic people because they don't want their jobs taken. They don't want their homes taken and you know who it affects the most is black people because these people are coming in and taking jobs at a level that nobody's ever seen before. What they've done to our country is unbelievable, but we want to send Joe Biden's illegal aliens back home where they belong. Remember, as I said, they come from prisons, they come from jails. () All these countries are at record low numbers of crime."
    },
    {
      "text": "They're sending us their criminals from Caracas and Venezuela, Caracas Venezuela. Next year we'll meet in Venezuela because it will be safe. Their crime has gone down 72% because they've sent all of their drug dealers, their criminals and most of their prisoners into our country, but that's true with most countries and if I were running one of the countries throughout the world, not just in South America, I would be doing exactly the same thing."
    },
    {
      "text": "I would've done it faster than they've done it, but our country's being destroyed. () Two weeks ago, it was revealed that Biden and Harris have allowed more than 50 radical Islamic terrorists, some of the worst in the world, by the way, to cross our border and remain at large in our country and we have no idea where they are."
    },
    {
      "text": "They have no idea, also, where these terrorists are, but Joe and Kamala are simply carrying on with business as usual, holding fundraisers, taking afternoon naps and as Joe says, I want to go to the beach today. The guy thinks he looks good in a bathing suit. Somebody in his staff told him, you look great in a bathing suit. He can't lift a chair. Those chairs that are meant for children and old people to lift, old people and children and he can't lift them. They weigh about four ounces."
    },
    {
      "text": "When I'm president, I promise you this, I will not rest until we have found these radical Islamic terrorists and throw them the hell out of our country. We're going to get them out of here and we will not let them back in. So many people, so many people, very few were thrown out, but the ones that came back in during this Biden administration of open borders, who the hell wants open borders? How crazy is that? () Under the Biden border disaster, other countries are emptying out their prisons in their jails."
    },
    {
      "text": "They're emptying out their mental institutions and I go a step further. You know what an insane asylum is, right? Did anyone ever see the lovely movie Silence of the Lambs? Have you seen it? Did you ever hear of Hannibal Lecter? He was a lovely man. He would love to have you for dinner. He will take you. He had many people for dinner. Well, we have a lot of people coming in. They always say, oh, that's terrible that Trump would say. He is rambling about Hannibal Lecter. No, I'm not rambling."
    },
    {
      "text": "We are allowing people from insane asylums and mental institutions into our country by the tens of thousands and they're closing them down in other countries. You know the cost savings and all of the savings and sending bloodthirsty terrorists, savage gang members and child predators into the United States to prey on our people, to prey on you, to prey on everybody. They're coming not only from South America, but from all over the world. From Asia, Africa and every other place."
    },
    {
      "text": "They're coming from all over the world. () Two weeks ago I spoke to the grieving mother, Jocelyn Nungare, a precious twelve-year-old girl from Houston who was tied up, stripped, assaulted, raped, strangled to death, after walking the block to a 7-Eleven store on the corner. Her body was dumped near the side of the road in a shallow creek. Charged with Jocelyn's heinous murder, beautiful, beautiful girl. The mother is devastated. I mean, pretty much I would say over. I don't know. I spoke to the mother."
    },
    {
      "text": "The mother is just, as you would be, as anybody would be, but charged with Jocelyn's heinous murder are two illegal aliens who Joe Biden set loose into our country. He let them loose and they knew who they were. They came across our border claiming they feared for their lives. No other people feared for their lives when they saw these two guys. They didn't fear at all. They had no fear. Tough, tough people and Joe Biden and his group of people let them in."
    },
    {
      "text": "We're going to bring back, by the way, we're bringing back Tom Homan. We're bringing back all of the guys that did such a great job on the border. We had the greatest border in history. Brandon Judd, great people. These are great people. () One of them was in the country for only 20 days before ending Jocelyn's beautiful American life and recently in Virginia at Trump National Golf Club in the Potomac River, I had lunch with the mother and the sister of Rachel Moran."
    },
    {
      "text": "Police believed the sadistic monster charged with Rachel's death first killed another woman in another country, then fled across Joe Biden's wide-open border into the United States, after which he attacked a 9 year old girl and her mother in a home and home invasion in Los Angeles, before murdering Rachel in Maryland. When I return to the White House, we will stop the plunder, rape, Thank you. They want to silence me because I will never let them silence you. And in the end, they're not after me."
    },
    {
      "text": "They're after you. I just happen to be standing in their way, and I always will be standing in their way. We're not going to let happen to our country, what's happened to so many countries that many of you people were very much involved in through your parents and grandparents. You know what happened to so many of those countries. We're thrilled to be joined tonight by many fantastic Florida patriots, including a man who's become really a friend of mine."
    },
    {
      "text": "We had a vicious campaign for a while, and he was tough and he was smart, and I got to really know him well over the years. And he's a fantastic guy, Senator Marco Rubio. Marco? Thank you, Marco. Thank you. And you have a great tandem because you have another great Senator who was a great Governor, But now we are a nation in decline. We are a failing nation. We are a nation that has the highest inflation in 50 years where banks are collapsing and interest rates are skyrocketing."
    },
    {
      "text": "Likewise, we are a nation where energy costs have reached the highest levels in our history. We are no longer energy independent or energy dominant as we were just a few short years ago. We are a nation that is begging Venezuela and others for oil. \"Please, please, please help us,\" Joe Biden says. And yet we have more liquid gold under our feet than any other country anywhere in the world."
    },
    {
      "text": "We are a nation that just recently heard that Saudi Arabia and Russia will be reducing their oil production while at the same time substantially increasing the price. (:43) And we met that threat by announcing that we will no longer be drilling for oil in large areas of Alaska and elsewhere in our precious land. We are a nation that is considered and consumed by the radical left's Green New Deal. Yet everyone knows that the green new scam is fake and will lead only to our destruction."
    },
    {
      "text": "We are a nation whose leaders are demanding all electric cars, despite the fact that they don't go far, costs too much, and whose batteries are produced in China with materials only available in China, when an unlimited amount of gasoline is available inexpensively in the United States but not available in China."
    },
    {
      "text": "And now we are a nation that wants to make a revered and very powerful army tanks, the best in the world, all electric, so that despite the fact that they are also not able to go far, fewer pollutants will be released into the air as we blast our way through enemy territory in an environmentally friendly way."
    },
    {
      "text": "(:53) And they also want to make our great jet fighters with a green stamp of energy savings, now losing 15% deficiency, but allowing us to keep our enemy's atmosphere clean of emissions as we viciously and unceremoniously attack them at levels never seen before. Who are these people? Who are these fools that would do this to us? Who are these people who would ruin our country? We are a nation that ended oil exploration and production in the United States just as the price of oil reached an all time high."
    },
    {
      "text": "What other country would do such a stupid thing, a foolish thing, and self-destruct itself just like we've done for four years. Can we be energy independent and even energy dominant again? \"Yes, oh, yes, and quickly,\" says President Trump. \"Yes, oh, yes, and we will do it quickly.\" (:53) We are a nation that surrendered in Afghanistan, leaving dead soldiers, American citizens and $85 billion worth of the finest military equipment anywhere in the world. We left it behind."
    },
    {
      "text": "And also abandoning Bagram, one of the biggest military bases anywhere in the world and only one hour away from where China makes its nuclear weapons. And we are a nation that allowed Russia and Ukraine to fight killing hundreds of thousands of people and it will only get worse. It would never have happened with me as your president. And for four straight years it didn't happen. Likewise, the horrifying attack on Israel would've never happened."
    },
    {
      "text": "They wouldn't even have thought of doing such a thing if President Trump was in the Oval Office. Iran was broke under the Trump administration. They didn't have the money to fund Hama, Hezbollah, and all of the other instruments of terror that they use. But those sanctions were lifted by a corrupt Biden administration. And now Iran is a rich country with 250 billion. Think of that. (:04) Iran, from nothing, they were broke. They now have $250 billion. $6 billion they also got for hostages. $6 billion."
    },
    {
      "text": "And for electricity to Iraq, they were given $10 billion. All compliments of an incompetent Biden administration. And China with Taiwan is next. We are a nation that allows radical left terrorists to violently attack our cities, leaving behind massive destruction and death, and nothing happens to the criminals to do these terrible things. There is no punishment. But when people who love our country protest on January 6th in Washington, they become hostages, unfairly imprisoned for long periods of time."
    },
    {
      "text": "But fortunately, the Supreme Court has just ruled and they should be out soon. We are a third world nation that has weaponized its law enforcement against the opposing political party like never seen before in our country. We've got a Federal Bureau of Investigation that won't allow bad election changing facts to be presented to the public, and which offers $1 million to a writer of fiction about Donald Trump to lie and to say it was fact."
    },
    {
      "text": "Where Hunter Biden's laptop from hell was Russian disinformation and the FBI knew it wasn't, but 51 intelligence agent said it was. And a Department of Justice that refuses to investigate egregious acts of voting irregularities and fraud. And we have a man who's totally corrupt, totally incompetent, and the worst president in the history of our country."
    },
    {
      "text": "Who is cognitively impaired and is a president who is not legally allowed to stay in trial because he is mentally incompetent, but he is allowed to become the President of the United States again, and he's in no condition to leave and is now in charge of dealing with Russia and China and all of these countries on possible nuclear war. (:22) He has no clue what he's doing or where he is. And next will be World War III because he doesn't know what he's doing."
    },
    {
      "text": "And this will be a war more devastating than any of the other wars. It will be a war like no other because of the weaponry that no one wants to even think about or ever talk about. We are a nation that no longer has a free and fair press. Fake news is all you get and they are indeed the enemy of the people. They refuse to discuss the Biden crime family, but enjoy covering the false indictments of Donald J. Trump, who has done nothing wrong except win an election against crooked Hillary Clinton."
    },
    {
      "text": "(:16) We are a nation where free speech is no longer allowed and where crime is rampant and not of control like never before. We are a nation that is allowing Iran to build a massive nuclear weapon and China to use the trillions and trillions of dollars it has taken from us to build a military to rival our own. And less than four years ago, we had Iran, China, Russia, North Korea, all in check. They respected us. They were afraid of us. They weren't going to do a thing against us and everyone knows it."
    },
    {
      "text": "Now Russia and China are holding summits to carve up the rest of the world. And perhaps most importantly, we are a nation that is no longer admired, respected, or listened to on the world stage. They just aren't. We are a nation, in fact, that in many ways has become a joke and we are a nation that is hostile to liberty, freedom, faith, and even to God."
    },
    {
      "text": "(:18) We are a nation whose economy is collapsing into a cesspool of ruin and whose supply chain is broken, whose stores are not stocked, whose deliveries are not coming, and whose educational system is ranked at the very bottom of every single list. We are a nation that just sold a once great company, United States Steel, to Japan. We are a nation whose stock markets continued success, is continued and contingent on MAGA winning the next election."
    },
    {
      "text": "If MAGA doesn't win the next election, you will have a 1929 type depression. We are a nation where large packs of sadistic criminals and thieves are allowed to go into stores and openly rob them, beat up and kill their workers and customers and leave with arm loads of goods but with no retribution, where the authority of our great police has been taken, where their families and pensions have been threatened and their lives would be destroyed for the mere mention of the words law enforcement."
    },
    {
      "text": "(:27) We are a nation where fentanyl and all other forms of illegal drugs are easier to get than groceries to feed our beautiful families and babies. We have become a drug infested crime-ridden nation, which is incapable of solving even the simplest of problems. We will institute the powerful death penalty for drug dealers where each dealer is responsible for the death during their lives of 500 people or more. Mothers will never again be forced to watch their children overdosing and [inaudible :02]."
    },
    {
      "text": "And we will never allow mothers to watch their child hopelessly dying in their arms screaming, \"What can I do? What can I do? Help me God, what can I do?\" We are a nation who's once revered airports are a dirty, crowded mess. You sit and wait for hours and then are notified that the plane won't leave, that they have no idea when they will, where ticket prices have tripled. They don't have the pilots to fly the planes."
    },
    {
      "text": "They don't see qualified air traffic controllers and they just don't know what the hell they're doing. (:36) We are a nation that screens a citizens viciously at all ports, but if you are an illegal alien, you are allowed to flow through by the millions and millions right over our southern border. We are a nation that has lost its confidence, lost its willpower, and lost its strength. We are a nation that has lost its way, but we are not going to allow this horror to continue."
    },
    {
      "text": "Less than four years ago, we were a great nation and we will soon be a great nation again. With the right leadership, every disaster Joe Biden has created can be fixed and quickly. Every problem can be solved and every wrong can be rectified, and it will be rectified very quickly. (:31) By this time next year, America's borders will be strong, sealed and secure. Inflation will be in full retreat. Our economy will be at a level that will equal and even surpass what it was four years ago. Optimism will be surging."
    },
    {
      "text": "The American dream will be thriving again for citizens of every race, religion, color, and creed. Law and justice will reign all throughout our land. Freedom will be restored. The flame of liberty will be burning bright. Joe Biden, the worst president in the history of our country, will be a fading memory of the past. And our great silent majority, including the once forgotten men and women of our country, will be the one shaping America's magnificent future when I am the 47th President of the United States."
    },
    {
      "text": "Because we are all Americans and together we will show November 5th to be the most important day in the history of America. (:38) We are one movement, one people, one family, and one glorious nation under God. And together we will make America powerful again. We will make America wealthy again. We will make America strong again. We will make America proud again. We will make America safe again. We will make America free again, and we will make America great again. Thank you Florida. Thank you very much."
    }
  ]
}