{
  "speech_id": "181",
  "speaker": "Trump",
  "title": "Donald Trump Interview Transcript With Dave Portnoy of Barstool Sports",
  "date": "20200725",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-interview-transcript-with-david-portnoy-of-barstool-sports",
  "topics": "Economy, Foreign Policy, Government Policy",
  "num_segments": 31,
  "content": [
    {
      "text": "He's a big fan of you. We'll do that. Well, you're doing pretty well on that [crosstalk :53] . Yeah, we are. We have good numbers. You started very well, that's good. Were you involved with that show in some way? But you're right, I was the only one- All these guys, I said, \"Hey, this guy is a total fraud,\" and I left, and then I found out. You're the only one that's ever given me credit for that. Now I like this interview. No matter what he does it, I like this interview now, Mariano. That's right."
    },
    {
      "text": "I said, \"What's going on with this guy?\" I just felt it was a phony deal. He said he was from British Broadcasting Corporation. They called up with everything, beautiful, the voices, \"This is British Broadcast ...\" And then this guy shows up, I said, \"This is a ...\" like immediately. And thank you very much, you gave me credit. Because I never get credit for anything good. You're pretty good. I like you. Well, I mean, you can always say you run for office, right? You become successful."
    },
    {
      "text": "You could run for a lower office, you can do things, but there are ways. You get groups together and there can be very friendly ways of doing it, very successful. I mean, you're going to have negative rebounds if it keeps up the way it is. As an example of Portland, this is crazy. 51 days, we sent in very powerful, not military but very strong people. The police are good but they were told not to do anything by the radical left mayor. Now you have to go out and speak your mind."
    },
    {
      "text": "I think speaking your mind is good, but you have to do it fairly. We are for justice, but we're for law and order. It's got to be law and order, and there is law and order. I put something out when they were starting to rip down statues. I went out, I found an old law, an old bill, you couldn't get it passed today. You get 10 years in jail. 10 years and no games, and we have a lot of people in jail right now."
    },
    {
      "text": "If you ripped down a federal statue, because the states have to take care of their own, unfortunately, because I'd do that too, but you rip down a federal statue you get 10 years in jail. 10 years, no three months, and nothing's happened since then. It was amazing. I signed it. I had a news conference. I said, \"If you do it ...\" And we were supposed to have thousands of people march on Washington that day, nobody showed up. Sometimes for a purpose."
    },
    {
      "text": "I mean, but- I think it was happening, and then we got hit by the China Virus. I think it was happening, success. Our country never did better. The best employment numbers in the history of our country. Best unemployment numbers, African American, Asian, American, Hispanic American, everybody, best unemployment numbers in history, Best stock market we've ever had. Although I must tell you, as you know probably very well, the stock market is almost at the same level right now, which a great tribute."
    },
    {
      "text": "But the stock market has been absolutely great. A lot of things are happening. Great housing numbers the other day, great everything. We're doing really well. We're trying to get rid of the rest of this pandemic, but success does it, and we were ready to do it. Because if you look at, when you say Hispanic, or when you say African American, Asian American, they were all working. Everybody was making a lot of money."
    },
    {
      "text": "Everybody was doing good, and it was coming together, and then China sent us this horrible, bad present, a real bad present. They could have stopped it. They should've stopped it. We made a trade deal with China, and it was a great deal, but it means much less to me now than it did then, because I'm not happy with what they've done to the world. They stopped it going into China from Wuhan, but they didn't stop it going into Europe, the United States and the rest of the world."
    },
    {
      "text": "But we were ready to do it, and the word is success, and I think we're going to have that. I think we're going to have a great next year. You'll be able to see the results before the election, which is interesting because the election is November 3rd, at the beginning of November, the numbers are going to come out for the third quarter. I predict those numbers are going to be really great, despite the fact that Democrats want to keep their areas closed because they want the numbers to be bad."
    },
    {
      "text": "I mean, can you imagine? I know how you feel about that. I think a big part of the reason they do it is for politics. I don't like the kneeling. I must be honest with you, I don't like the kneeling. I didn't like it for the NFL. I think there are many ways of showing you're unhappy, because when the NFL was happening- I know, exactly. I know that. I've heard that actually. I don't know why he did it."
    },
    {
      "text": "In the middle of the summer, all of a sudden, sitting in a T-shirt in his basement, he came out with this thing that nobody was even thinking about it. I don't understand. He's talking in the middle of the summer, he comes out and he's sitting there and he looked nice, but I wouldn't say like Mariano. He looked nice in his T-shirt. I don't know if I'd look much worse than that to be honest with you. I wouldn't wear a T-shirt. I think he would've looked better in a suit and tie."
    },
    {
      "text": "No, he would have looked better in a suit and tie. If I had any advice, number one, he could have waited until at least the fall. But more importantly, I would have worn a suit or a tie or even an open shirt that's loose, not tight. Okay. So he came out with this thing, Dave, and everyone was saying, \"Where did this come from now?\" And the whole big thing started, and he's made a mistake. Well, he wanted no part of you, obviously. No, but I think it was a wise move. It was a very smart move he did."
    },
    {
      "text": "Look, he's working hard and everything, but it's a strange thing. Well, he makes a lot of money. Before COVID, right now I guess- He's the one, the only one I've shaken hands with in a long time. You, because you stuck your hand out, and I'm saying, \"What are we doing?\" But I shook your hand. You were tested? Otherwise they'd take you out right now. They'll end the interview. Did you notice that? He stuck his hand out and I said, \"What do I do here?\" Rather than insult him, I said fine."
    },
    {
      "text": "Hey, I immediately ran, washed my hands, no. In the days, like four months ago, I just ... People don't know that I get along really great with the world leaders. I'm tougher with the world leaders than any president's been. I've been tougher on Russia by far with the pipeline, with our military, with the oil. Now the number one energy producer in the world, and there's nobody even close. I've been very tough with Russia. I mean, China, nobody's been tough like me with China."
    },
    {
      "text": "And that's not to be tough, that's because for years they've taken advantage. So many countries, not those two only, the whole world, our allies, NATO, the whole world has taken advantage of our country. But despite that, I have a very good relationship with leaders. I mean- I shake their hand. I hug them. I have a lot of great ... Abe of Japan, look, they've been ripping us off for years and years. They send the cars in, there's no tax."
    },
    {
      "text": "We send a car to them, they say, \"We don't take your cars.\" This is the kind of thing that we've put up with. We defend these countries, we get nothing for it. I've ended a lot of the craziness that's gone on. There are times when I love it, too much sometimes, right? Where's Dan? I think we have- Speaker 5: () He's right there. Dan, what's our number now, total? Can you believe it? It's mine. I don't know if I'll ever use it again, but it certainly was good. It's a platform ... Look, we have fake news."
    },
    {
      "text": "You don't know about that, but we have fake news out there. And then, Dave, we have a very big voice. When you have the kind of numbers that we have, you're able to get the word out and an honest word, and it's important. So it's been very important for me. Too often. In the old days, before this, you'd write a letter and you'd say, \"This letter is really bad,\" you put it on your desk and then you go back tomorrow and you say, \"Oh, I'm glad I didn't send it,\" right? But we don't do that with Twitter."
    },
    {
      "text": "We put it out instantaneously. We feel great, and then you start getting phone calls, \"Did you really say this?\" I say, \"What's wrong with that?\" And you find a lot of things. You know what I find? It's not the tweets, it's the retweets that get you in trouble. You see something that looks good and you don't investigate it, and you don't look at what's on the helmet exactly, which is in miniature and you don't blow it up, and sometimes it's ..."
    },
    {
      "text": "I have found almost always, it's the retweets that get you in trouble. Good. Well, they say he was a good basketball player, and he is a very nice guy. Well, he was not tall, but he was a fast little guard, and they say he was a good basketball player. He's actually a very nice guy. We don't always agree on everything. He'd like to do things that I don't like to do, but ultimately I make the decision, but we make it all a group of people."
    },
    {
      "text": "And he's been here for like 45 years, for many, many years, and he's a nice man actually. Well, he'd like to see it closed up for a couple of years, but that's okay because I'm president, so I say, \"Well, I appreciate your opinion, now give me another opinion, somebody please.\" Well, you have to. Now we're open and we're doing well, and I just had a press conference about opening the schools. You've got to open the schools. They have a stronger immune system even than you have, or I have, the kids."
    },
    {
      "text": "That's not saying much? But they do. They have it. It's amazing. You look at the percentage, it's a tiny percentage of 1%. And in that one case, I mean, I looked at a couple of cases, if you have diabetes, if you have problems with something, but the kids are in great shape. So we want to open the schools and we're opening the country. We had great numbers announced the other day. And two weeks ago, we had the biggest number of jobs we've ever had. And the month before that, we had the same thing."
    },
    {
      "text": "A lot of good things are happening, and I think it looks like a V. We have a lot of people that would like to see their states closed. I have a feeling on November 4th, they'll open them up. I think they want to do it for political reasons, but we're doing well. The polls are starting to really shape up. Dave, we were doing great. We were sailing. George Washington would have had a hard time beating us. And then when the China virus came in, all of a sudden, it's a dampener, it really is."
    },
    {
      "text": "Well, it's a downer, though, psychologically. It went down, and now we're really starting to do well. We're looking really good at a lot of different places. I was in so many rap songs, like 79 or something. I was in every rap. This is before I did this, right? It's a very interesting thing that you say, because the best day in my life in terms of business and life and everything was the day before I announced I'm running for president. Everything was good. The company was good."
    },
    {
      "text": "I had finished up a lot of jobs that were very successful, and then I said, \"I want to do this.\" Now, I'm really glad I did, but I was treated very unfairly with fake Russia. Russia, Russia, Russia. Ukraine, Ukraine, all fake stuff. It's a very vicious business. Somebody said, \"Who's the toughest in the world to deal with? Is it Russia? Is it China? Could it be North Korea?\" I said, \"No, the toughest is the United States."
    },
    {
      "text": "It's the toughest to deal with.\" When you look at what I have to do, I have to focus on the big picture, but I also have to focus ... I have so many people on the left or call them Democrats, call them whatever you want, and then you look at what they're doing with cities. Every city is run by a liberal Democrat and they're going to hell, and we have to do something. We just sent people into Chicago. We sent people into Portland, as we said. We're sending people into New York to help out."
    },
    {
      "text": "It's incredible, but I love doing it. There was this phony deal that I was devastated when I won, because I couldn't have my life. I had a great life, I did. One thing that happened, I was going into a thing called the Robin Hood Foundation. I'll never forget it. It was just about the night I announced or whatever. And my wife looked at me, she said, \"I hear people booing.\" And she was with me for a long time. We've been together a long time."
    },
    {
      "text": "She said, \"Some people are booing.\" I said, \"Yeah, but some people were also clapping wildly.\" She said, \"You know what, I've been with you a long time, I've never heard anyone boo you.\" This was right after I started being the politician. It meant something because I said it's the first time in my life I was ever booed. You know this. I'd go to Yankee stadium, people would go ... Who is a 100%? But it was pretty close."
    },
    {
      "text": "And now, I would say this, I have more fervor on the one side, and I have far more animosity on the other side. I mean, I don't know that such a person exists. And I should say yes, absolutely, I would. So let me say it that way, because that's a much more politically correct? Absolutely. But it doesn't work that way, because it just doesn't, unfortunately. I really believe success. We were there. Everybody was working. Nobody's ..."
    },
    {
      "text": "Probably you, I don't know how you're doing now, but you were probably doing better four months ago. Okay. Well, you got in at the right time, but a lot of people with the 401(k), I mean, they're doing phenomenally. But a lot of people sold stock, and now they're saying, \"I missed it.\" I said to people, \"Don't sell. Just don't sell. Because the foundation is so strong, don't sell.\" But the people that really lost in terms of economic are the people that got out."
    },
    {
      "text": "The people that stayed in, they stayed with me, they're doing great, and we're almost at record highs. Go ahead. You can do it quickly, right? Oh, he does, that's bad. That's too bad. Is he a good dad? Good. Don't worry about socially distancing. And you have a very talented son, good guy. Speaker 7: () Really? He's honest. You have an honest father. Speaker 7: () I was wondering why you were pinning me down. Mr. President, he never calls me. That's no good. It's great to see you."
    },
    {
      "text": "Speaker 7: () Can you get him to call me a little more. I'm going to put a lot of pressure on him. He'll call you today in a little while. Thank you very much. Great to meet you. Speaker 7: () Thank you, sir. He was really good. I was really worried about that. He was nice. He was nice. Dave, thank you very much. A great honor."
    }
  ]
}