{
  "speech_id": "182",
  "speaker": "Trump",
  "title": "Donald Trump Hannity Interview Transcript: Trump Calls Russia Investigation \"Treason\"",
  "date": "20190726",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-hannity-interview-transcript-trump-calls-russia-investigation-treason",
  "topics": "Economy, Foreign Policy, Government Policy",
  "num_segments": 31,
  "content": [
    {
      "text": "Well, I think people learned a lot yesterday watching a very poor performance and watching things that they couldn't believe when they saw what was going on. And hopefully we're going to be able to find out how a thing like this started. It was a disgrace to our country. It was a disgrace from every standpoint, and I would say that most people have never seen anything like it. Then, on top of it, you watched that performance, it was shocking and very sad. Say it, Sean?"
    },
    {
      "text": "So, I wasn't going to watch at all, and then I started thinking about it, and then I watched a little bit at the very beginning and I couldn't believe what I was seeing. I ended up watching more than I wanted to. Then I watched the afternoon, because it was such a big crater at the beginning and I said, \"Now I have to watch Shifty Schiff,\" because he just went through three hours and now he has to go through Schiff and I said, \"This is going to be very interesting.\" I've never seen anything like it, actually."
    },
    {
      "text": "It was sort of good television. I couldn't watch it all. I had meetings, I had economic development meetings that I was saying \"Fellas, maybe we could move it to another time,\" but I didn't want to do that. I got to watch enough and it was shocking. I thought the Republicans represented themselves brilliantly, actually. John Ratcliffe and Jim Jordan and all of them, Louie Gohmert. I could mention 15 names or however many they have that spoke. It got fairly close to that number."
    },
    {
      "text": "I guess maybe it was a little bit less than that, but I will tell you that everybody representing the Republicans I thought was really good and I thought the other side was typically biased, but they were stuck with a situation that they couldn't believe. Well, based on the fact that we've just become fairly recently, a little while ago, the number one oil and gas producer and energy producer in the world by far, Russia, Saudi Arabia, now second and third."
    },
    {
      "text": "Based on the fact that we will soon have the most modern military we have ever had with the best equipment, the best newest planes, and all of the things that we've done and so many other things. Sean. Based on all of that, the last person they should want is me. But I have heard the same thing about the fake dossier. I've heard it came out of Russia. I think a lot of it also was made up."
    },
    {
      "text": "It was just made up out of like you'd write a novel, but it was a fake, and it was paid for by the Democrats and paid for by Hillary Clinton and the DNC. And it's incredible. These are incredible stories. Nobody would write a novel like this cause people wouldn't believe it. It wouldn't be believable. Because this should never happen to another president of the United States again. This is a absolute catastrophe for our county."
    },
    {
      "text": "This was a fake witch hunt and it should never be allowed to happen to another president again. This was treason. This was high crimes. This was everything as bad a definition as you want to come up with, this should never be allowed to happen to our country again. Well, I think the press has lost all credibility, much of it, but it's lost a big part of it, though. I mean, a very substantial part of it, lost all credibility."
    },
    {
      "text": "I watch it as people scream at these poor Democrats, the Congressmen scream like I've never seen. \"You must do this. You must do that.\" These are supposed to be journalists, show hosts, all sorts of people. I cannot believe it. And they're actually trying to force them to do what they want to be done. I've never seen anything like it. They use the word unhinged. They are unhinged. The media has become totally unhinged. They're very dishonest."
    },
    {
      "text": "And when I say enemy of the people, when people give purposely false stories and when they try and get politicians to do things that are wrong and they know they're wrong, that really is the enemy of the people. It's fake news, but it's the enemy of the people, more importantly. So I had the absolute right to fire him, but I didn't. And I never suggested to do it, but I had the absolute right to fire him under Article II and perhaps for other reasons, but I didn't do it. I didn't do any of the..."
    },
    {
      "text": "When they say he said he was going to do this or said he was going to do, I didn't do any of it. It's really incredible when I hear this and the whole concept of obstruction. First of all, they create a phony crime, which was just a terrible thing to say about somebody, especially somebody that loves the country as much as I do. So they create this phony crime and then they say he obstructed. They said there was no collusion but he obstructed. There has never been anything like this ever before in our country."
    },
    {
      "text": "The crime was committed on the other side, and we'll find out about that. We have a great attorney general who's looking at it. I'm not involved in that. He's looking at it.I've been hearing a lot of the media actually is talking about investigate the investigators and a lot more than that. And I think that things are... I just see it. I feel it. I think a lot of good is going to come out of it. We went through hell. A lot of people went through hell."
    },
    {
      "text": "They came down to Washington wanting to do a phenomenal job for the people and they get served with papers to come and testify and go before grand jurors. And by the way, nothing affected the... Because all of these things like the Russian bloggers, they had nothing to do with us and everybody knew it. In fact, there is a little sentence in there saying that it had nothing to do with the Trump Administration. But it was a lot of people, 24 people or something."
    },
    {
      "text": "A lot of bloggers, bloggers in Russia, they'll never see these people. They know that. They sent out papers to these people. They'll never ever see them. The people probably never even got the papers. But all of these people, none of them had... They went through people with old tax cases, old cases, cases that were not even going forward, just went after them viciously and violently. General Flynn, who's a good man, what they did to General Flynn and so many others. Hope Hicks, this wonderful young woman."
    },
    {
      "text": "And she spent much of her time in Washington fighting off horrible stories and things. She's just a high quality person. So many, I could name almost everybody, what they went through, and still to this day, I mean I heard people saying that... I heard some of the media saying that they thought Mueller performed okay. In other words, they let a day go by and then they'll try and spin it. These are very dishonest people. These are very bad people."
    },
    {
      "text": "Well, I don't want to comment on that as far as the pardons are concerned. Yes, it is absolute and it's a beautiful thing. I've had people, Jack Johnson, the heavyweight champion of the world in the early 1900s and he went to jail for no reason, and so many other things. And Alice Johnson's another good example, and I really feel good about giving it where people have been treated unfairly and abused actually. But I haven't talked about it with respect to what's going on now."
    },
    {
      "text": "I mean it's in a way I think there's a whole new day starting. I used to use and I still use drain the swamp. We have some very, very bad people in government that would be willing to do very bad things and for bad reasons. So I don't mention pardon, but I don't say what's going to happen in the future. I just don't comment on it. Well, Comey is a liar and a leaker, and that's obvious and all you have to do is just follow him along and see what he said to Congress."
    },
    {
      "text": "Clapper and Brennan and all of these people, McCabe, these are bad people. My opinion, they are very bad people. They've been very bad for the country. They were, I used to think incompetent, but they're really I guess competent at other things and maybe bad things. But you we'll see what happens. I mean I guess a lot of things are coming out and it's going to be very interesting and it will be great to clean up a real big mess, because again, it can never happen. This can never be allowed to happen again, Sean."
    },
    {
      "text": "Well, we have a very respected gentleman, a very high quality person named William Barr. I can tell you, he's working so hard. Rather than just doing a total release, I gave him a total release. In other words, he's got everything. Anything he needs, he's got. He's the Attorney General of the United States. He's got a lot of very good people under him that I guess are involved and I gave them a total release. So all of it's been released and he has all of it."
    },
    {
      "text": "I've also given him authorization to release it to whoever he wants, whether it's his people or frankly perhaps people like Devin Nunes who is a star, what he's done and the amount of suffering he's gone through. You know what they did with him, where they tried to drive him right out of politics and probably worse than that. He's done an incredible job. And so many others. They're warriors."
    },
    {
      "text": "I'll tell you the good side of all of this is the level of intelligence and strength and goodness that we've had on the Republican Party. A lot of them, not everybody of course, but we've had tremendous, and when I say we, I'm talking about the country. The country's had tremendous support from Meadows and Jordan and Devin Nunes. And so many of the names that you saw yesterday performed so well. I mean, they performed so well and they worked so hard because they saw this was a scam."
    },
    {
      "text": "This was an illegal takeover, as you'd say in the business world. I mean, this was a coup attempt in my opinion. This is the United States and we wouldn't stand for it and I wouldn't stand for it. We have some very great people, but we also have some very bad people. And I think we caught then. Well, it's very interesting because I haven't seen it at all for the last four or five days. They're not talking about the Democrats. They're talking about Mueller and how bad he performed, how badly he performed."
    },
    {
      "text": "And they're talking about everything that happened over the last few days, but in particular yesterday. You're not seeing much about the Democrats. But look, you've got a few of them that are doing a little bit better than others. It'll be interesting. Whoever it is, I'm okay with it. We have the best economy we've ever had. As you know, we have the best stock market numbers we've ever had in the history of our country. If you look at 401Ks, if you look at the kind of money that people are making."
    },
    {
      "text": "I'm not talking about rich people or just rich people. I'm talking about everybody. Blue collar workers went up proportionately more than anybody. You saw that poll that just came out. Things are doing great. The best unemployment numbers, the best employment numbers. I'll tell you what, more people working in the United States today than at any time in the history of our country. And then we have the lowest unemployment numbers, especially for African-Americans, for Hispanics, for Asians."
    },
    {
      "text": "Women are almost 70 years the best numbers, and soon to be historic meaning forever., meaning from the beginning. I think we'll be in great shape. Then you have the AOC. I call it AOC plus three. The three hangers. I really believe they're going to hurt the Democrats. But who knows? I mean, we'll see. But I think we're going to do very well, Sean. I think we're going to do very well. We have tremendous spirit. You've never seen an empty seat."
    },
    {
      "text": "We go into these massive arenas and they're packed and there's thousands of people outside. You've never seen an empty seat. So I think we're going to do very well. Well, I could say that obviously the top three or four look like they had doing better than the rest. So Sleepy Joe is okay, but he's fading. I think he's fading fast. The only good thing about Mueller is it made Joe Biden look like a dynamo. When you watched Mueller's performance yesterday. I think probably Biden is the one that asked him to go on."
    },
    {
      "text": "You have him and he's sort of a little bit leading and then you have a whole group. You Have Elizabeth Warren formerly known as Pocahontas, and I'm sure that'll come out because that's a tough thing for her to withstand, I believe, because her whole life was a fake. She used that very, very adeptly and it was not good. And you have Harris and Bernie looks like he's fading to me. Bernie looks like he missed his time. I think what Hillary did a few years ago was pretty tough frankly for Bernie."
    },
    {
      "text": "But that was his time. I don't think it's Bernie's time. I see him flailing. He's flailing all over the place. He's going crazy. I call him Crazy Bernie. But the fact is that I think those would be probably the three or four. Maybe there's another one or two. I don't necessarily see anybody else gaining traction. Well, I think that in the case of Iran, they know that better than even you do and probably even stronger than you said it. I think they understand that very well."
    },
    {
      "text": "And in the case of North Korea, I'm actually getting along very well with him, but we'll see what happens. I mean, the sanctions are on, the hostages are back. We're getting the remains back. They haven't done nuclear testing. They really haven't tested missiles other than smaller ones, which is something that lots tests. But I think with North Korea we've been doing very well, but that doesn't mean it's going to continue. We have a relationship. President Obama had no relationship. You would have been at war."
    },
    {
      "text": "Had Hillary Clinton won this election, you'd be at war right now with North Korea. I have no doubt about that. That's where it was heading. It was heading there very rapidly. We'll see what happens. But I think what you said might be somewhat of an understatement. Well, it's a bad mayor. Probably the worst mayor in the history of New York City. He's done a bad job and now he's running for president, and people can't even believe it. He's a horrible mayor. The policemen and women cannot stand him."
    },
    {
      "text": "They don't respect him. They don't like him. Remember they turned their back on him a couple of years ago when he got up to speak. Everybody turned their back and they kept it that way and still they want to do it, but they still have respect for the office if not him. But I feel like that was tragic watching that scene a couple of days ago when I first saw it, I couldn't believe it. I said, \"Let me see that again."
    },
    {
      "text": "I don't believe what I'm seeing,\" I know New York's finest and New York's finest, in fact, we were in touch with them today. They are devastated that frankly, that that could happen, and also that those two offices would allow that to happen. That was a terrible thing. Thank you, Sean. Thank you very much. Thank you."
    }
  ]
}