{
  "speech_id": "189",
  "title": "Donald Trump Roundtable Transcript on Donating Plasma July 30",
  "date": "20200730",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-roundtable-transcript-on-donating-plasma-july-30",
  "topics": "Healthcare",
  "num_segments": 15,
  "content": [
    {
      "text": "... is to help treat those battling the current infection that we all know so well. Plasma is one of the more delicate ways of doing things. It's had tremendous response so far we've had, and it's an effort to really accelerate new therapies and further reduce mortality. We've been able to show some tremendous things. If you notice today, it was covered very well. A lot of countries where they thought they were doing well, they're not doing well at all. They've had explosions. Explosions, unfortunately."
    },
    {
      "text": "We're joined by secretary of health and human services who's doing a terrific job, Alex Azar, Alex, hi Alex. FDA commissioner, Stephen Hahn. Hi, Steve. Surgeon General, Jerome Adams. And I hope your wife is okay, Jerome. I know she had a little difficulty, but I'm sure she's going to be fine. Right? Please give her my regards. Thank you, Jerome. Dr. Francis Collins, who everyone knows. Francis, thank you very much. NIH. And Dr. Anthony Fauci. Anthony, hi. And Deborah. Where's Deborah? Deborah. Hi, Deborah. Good job."
    },
    {
      "text": "Everybody's doing a good job. Everybody's working very hard. I want to also thank to the CEO of American Red Cross. Somebody who's done outstanding work. I've known about it for a long time, Gail McGovern. Thank you, Gail. She's done really an outstanding job too. CEO of America's Blood Centers, Kate Fry. Hi, Kate. Thank you very much. CEO of CSL Limited, Paul Perreault. Paul, thank you very much. Great job. And CEO of LabCorp, Adam Schechter. Thank you, Adam, very much."
    },
    {
      "text": "We've taken bold actions to give Americans access to plasma therapies. The FDA made the treatment available to patients with life-threatening infections beginning in March. We provided 48 million dollars to the Mayo Clinic to support their expanded access program for plasma. We're providing up to 270 million dollars to the Red Cross and America's Blood Centers for the collection of up to 360,000 units of plasma."
    },
    {
      "text": "My administration is partnering with commercial labs, insurers and healthcare providers to encourage those who have had the virus who donate plasma. So if you've had the virus, if you donate, it would be a terrific thing. We really need donations of the plasma. To those that have had the virus, you've gotten through it, and I guess that means you have something very special there, right? Yeah. So we would appreciate that. It would help a lot of people."
    },
    {
      "text": "We're grateful to LabCorp for offering free antibody testing to identify people who can donate. And LabCorp has really been fantastic in a lot of ways, and other ways also. As a result of these initiatives, we've already treated nearly 50,000 patients with plasma. Roughly two million Americans have fully recovered from the virus. This afternoon, I'm asking you the citizens to go to the coronavirus.gov. It's coronavirus.gov, and volunteered to donate plasma as soon as she can."
    },
    {
      "text": "We have a lot of people that would heal, would get better. Soon as you can, please. In addition, I'm once again urging to all Americans to protect the elderly, socially distance, wear a mask when you cannot avoid the crowded places. And if you can, you have to avoid crowded places. It just seems like so many things are taking place in crowded places. We don't want that. And always wash your hands. Wash your hands as often as you can. Together we'll defeat the virus, we'll defeat the invisible enemy."
    },
    {
      "text": "I want to thank the American Red Cross. I've been a fan of the Red Cross for a long time, as you know, and we appreciate the great work that you do. Thank you very much, Gail. And now I'd like to ask Gail to say a few words, please. Thank you. Thank you, Gail. Great job. You're doing something very special. Thank you. Alex, please. It's a great idea thank you very much, appreciated. Dr. Haln, please."
    },
    {
      "text": "Stephen could you give a few words on the speed with which we're getting the vaccines out and hopefully approved and finalized and where we are with phase one two and three et cetera? And you're literally many, many months and even years ahead of schedule in terms of the problem. So we really appreciate the FDA. Please let everyone know how we feel all of us, thank you. Great job. Jerome please. Thank you Jerome. Please."
    },
    {
      "text": "And I hope you'll be able to do it even before the end of the year, and maybe substantially before that from what I'm hearing. Okay? Thank you very much. Would anybody have any questions of these very brilliant people having to do with plasma, antibodies? Any questions? Steve, go ahead. Well, I'd like to perhaps, Tony, do you want to discuss that, please? Dr. I can tell you, I only heard of goggles for the first time about one hour ago. Now I'm hearing about goggles. So I don't know."
    },
    {
      "text": "Deborah, do you want to discuss that? I think when you look at Miami, by the way, or Florida in particular, it looks like things are getting much better. Arizona getting much better, heading down, heading in the right direction. Some other areas getting much better. It could be catching on, unfortunately, in a couple of areas. We don't know quite yet, but we'll be able to report that soon. But some very big progress being made in some of the states that two weeks ago looked like they were going to be quite bad."
    },
    {
      "text": "Had some great progress made. All right. Any other questions please? So we're getting mostly now we're ordering as many of the immediate tests, which is five minutes to 15 minutes, even a little bit less than, in some cases, than five minutes. But we're trying to get those tests. We have pretty close to 50% I call them short term tests. But we're up to about a 50%, which is amazing. The other tests, while good, you have to send them, then they have to do the work, and they have to send them back."
    },
    {
      "text": "So the process takes long just in terms of delivery. We really are liking the short term tests where you find out immediately whether or not you have a problem. And that's what we're striving for, but we're already up to approximately 50%. Is that correct, Deborah? Good, thank you. And how is LabCorp doing about turnaround? So then for nursing homes, one day. And something more than that for everyone else. But three days looks like it's a pretty good target. Well, that's very good. Would be happy with those numbers."
    },
    {
      "text": "And numbers that we are happy with and we use a certain test around here that goes very quickly. And it's just been recently developed so we've done an amazing job. Everybody at this table has done really an amazing job in coming up with testing and testing that works. Steve, go ahead. Well, when we have the vaccine, we have the military all lined up. And the military is going to be doing it in a very powerful manner."
    },
    {
      "text": "These are people that don't usually do vaccines, they do soldiers, and they do lots of other things that frankly are more difficult, but we have a general. And logistically, he's all set. Tony, do you want to say something about that? Dr. And I think I could have Francis say that tremendous progress has been made on the vaccine beyond anything that we would have thought if you go back six months. What do you think? And Francis, we're working very well with other countries. Okay. Thank you very much, everybody."
    }
  ]
}