{
  "speech_id": "191",
  "speaker": "Trump",
  "title": "Donald Trump Meeting With NAPO Law Enforcement Leaders Transcript July 31",
  "date": "20200731",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-meeting-with-law-enforcement-leaders-transcript-july-31",
  "topics": "Government Policy, Social Justice",
  "num_segments": 83,
  "content": [
    {
      "text": "Police representatives in the country here, maybe the best, I would say. Pat, what do you think? The best. Representing more than 240,000 of our nation's courageous police officers. I want to thank the association president and a friend of mine, Mick McHale, who has been tremendous. Who I call on occasionally to say, what the hell is happening in a certain location and he gives me the advice and I was very honored to receive the endorsement. That was a great endorsement. We very much appreciate it Mick."
    },
    {
      "text": "The entire leadership team is here today, representing large portions. What would you say the percentage of police in the country are represented in this room? Big portion. Very big portion. I appreciate it. Also, I want to thank our Vice President, Mike Pence. He's been very involved in a lot of issues, but this issue is one of his very important ones. I think we can say Mike, right? VP."
    },
    {
      "text": "We're here to discuss the unwavering support of our nation's courageous police officers and our determination to defend the safety of all Americans. I just spoke on Portland. I just spoke with Chad Wolf who's doing a fantastic job at Homeland and the courthouse is totally secure. It has been ever since we've been there. We had to move in about a week and a half ago because they were going to take down the federal court house. This is not even believable. You tell these stories, it's not even believable."
    },
    {
      "text": "Homeland Security moved a team of very talented people, strong, tough people. And the courthouse has been in very good shape. They're not an offensive team, they're a defensive team. They're not allowed to be offensive, unfortunately. And you had radical anarchists. You had horrible people. You had agitators. There weren't protesters, they might've been protesters, but the ones that were the problem were absolute anarchists and in many cases, professionals."
    },
    {
      "text": "So a lot of people have been arrested and we've told the mayor, we told the governor, you better get in there and do your thing. And they finally, after... they should have done the 60 days ago, a lot of people have been hurt and a lot of law enforcement people have been hurt and they should have done this 60 days ago. So now they freed up the park, cleaned out the park and they're moving their way in. And if they have any other problems, we're going to take a very strong, offensive force."
    },
    {
      "text": "Nothing started because the federal government was there. In fact, if we weren't there, you would not have a courthouse right now. The media, some of the media, not all of it, but some of it, they are saying that because the federal government walked in, they became worse. No. Because the federal government walked in we saved the US courthouse, the federal courthouse, which was a magnificent, it will be shortly. But there's graffiti all over it and everything else."
    },
    {
      "text": "That's why we moved in because the local police were not protecting federal property. So Homeland Security has done a fantastic job. I appreciate it. Chad Wolf and the entire team have been fantastic. And it seems to be cleaning up. And if it doesn't clean up, we're going to do something very, very powerful because we have no choice. Not that I want to do it. I don't want to do it, but we have no choice. In recent weeks, law enforcement has become the target of a dangerous assault by the radical left."
    },
    {
      "text": "The left wing extremists have spread mayhem throughout the streets of different cities. In particular, Portland. If you look, Portland is one. Seattle, certainly would be another. And we were getting ready to go into Seattle. We would have solved that problem very quickly. When they heard that we were going in, they went in and by that time, the anarchist were exhausted and they just raised their hand. They were exhausted and tired and they had a lot of drugs and a lot of alcohol and they just gave up."
    },
    {
      "text": "They just raised their hands. They were sleeping there long enough. They took over actually a piece of Seattle, if you can believe that. Seattle being a major city and they took over a piece. So we were ready to go into Seattle, everyone knows that. We were going to go in with force and we didn't have to because the day before we were going in, and we let them know. The day before we were going in this is what happens. They went in and the anarchistic and agitators gave up and they gave it back."
    },
    {
      "text": "Joe Biden's pledge to cut police funding, you do know about that, Mick. You've heard [inaudible :36]. This guy has been dragged so far left. Biden has been taken further left than Bernie ever was. Bernie was never this. I mean, totally opened borders and the sanctuary city stuff that... he's approving things that Bernie never thought of. It was supposed to be they were going to take them right. They took Biden way left of where Bernie was because they have the manifesto. I don't know."
    },
    {
      "text": "Have you seen the manifest or they've got? Now I understand they can't get any police in Milwaukee because you're not allowed to use pepper spray or tear gas, because if you have cramps, but I don't think there's any other way, other than the obvious way, which would be horrible. And that's shooting itself, which would be horrible. But I don't know how you can control a crowd if the crowd is..."
    },
    {
      "text": "if that crowd's anything like what you have in Portland, there's no way you could possibly do it without your tear gas and pepper spray. Pat, would you say that's a correct statement? That's pretty amazing, right? So you have no police that want to go to Portland because they know they can't do their job. You have to give them the equipment to do the job. That's incredible. They're not going to go to Milwaukee. So what's going to happen in Milwaukee, Mick? What do you think? Thank you. That was very controversial."
    },
    {
      "text": "The previous administration didn't want to do that. We had hundreds of millions of dollars worth of equipment, really good military equipment, good stuff. And a lot of it was protective, was defensive equipment like vehicles that are very strong in terms of defense capability, where you wouldn't get hurt, where the windows are shatterproof, et cetera, and bulletproof. And we gave that out to our police departments. It was sitting there gaining dust. That was the only thing that it was gaining, was dust."
    },
    {
      "text": "And we gave that out to all of our police departments all over the country. And you have no idea. Every time I go someplace, the police thank me for that. This is stuff that was just getting less and less valuable. Much of it was brand new, but getting less and less valuable, sitting in warehouses, probably the government was paying a lot of rent to the warehouses. And it's been a great thing. So as a result of the outrageous attacks on law enforcement, violent crime has surged in certain Democrat run cities."
    },
    {
      "text": "Many of them, I mean, you look at New York, it's at 348%. Whoever heard of a number like that? Because you have a radical left mayor who doesn't know what he's doing. He doesn't know what he's doing. I don't understand even how the police can allow it to happen. That's the only thing. We talk about that. But you look at Chicago and Chicago more than 2,200 people have been shot. Think of that, shot. Now, that's far worse than Afghanistan."
    },
    {
      "text": "We are leaving Afghanistan fairly shortly, but we see things in Chicago and other places that you don't see in Afghanistan, it's unbelievable. 40% increase from 2019. And the hard thing is that crime is down nationwide. So I'm taking all of these Democrat run cities and we're putting them in with the well-run cities and Republican, largely Republican, well run cities and States."
    },
    {
      "text": "And with all of the shooting that you see in Chicago and New York, and well, Minneapolis had a bad period, but we sent in the National Guard. The National Guard did a fantastic job. And they stopped it. That place would have burned down. Minneapolis would have burned down if I didn't force the National Guard into that. And you saw them form, right? It's a beautiful thing. All of a sudden, you see a line of people. They walked through it like a knife through butter and that was the end of the problem in Minneapolis."
    },
    {
      "text": "So we have to do that. But in New York city, nearly 300 people have been shot in the last month alone. Murders are up 32% in Philadelphia and 80% in Minneapolis compared to last year. Minneapolis, great place too, and Philadelphia, you think of it. I went to school in Philadelphia. You look at these numbers. In cities across the nation. We've also seen police officers assaulted with bricks, rocks, bats, Molotov cocktails, frozen bottles of water."
    },
    {
      "text": "Somebody said last night, what are these protesters I saw it and he said, \"It's only water. How can water hurt you?\" They don't say it's frozen in a bottle the size of a football and they throw it at the police. It's unbelievable. It's water. And then they have cans of soup. Soup, and they throw the cans of soup. That's better than a brick because you can't throw a brick, it's too heavy. But a can of soup you can really put some power into that, right?"
    },
    {
      "text": "And then when they get caught, they say, \"No, this is soup for my family\" And they're so innocent. This is soup from my family. It's incredible. And you have people coming over with bags of soup, big bags of soup. And they lay it on the ground and the anarchists take it and they start throwing it at our cops, at our police. And if it hits you, that's worse than a brick because it's got force. It's the perfect size. It's made perfect."
    },
    {
      "text": "And when they get caught, they say, \"No, this is just soup for my family.\" And then the media says, \"This is just soup. These people are very, very innocent. They're innocent people. These are just protestors. Isn't it wonderful to allow protesting?\" No. And by the way, the media knows it better than we do. They know what's going on. I don't know what's wrong with them. They're doing our country a tremendous disservice, I'll say that."
    },
    {
      "text": "But in cities all across our nation, we've seen our police officers so badly assaulted. In Portland and the other cities, my administration is vigorously defending federal property from anarchists and criminals. We've also launched Operation Legend, surging federal law enforcement to communities flagged by violent crime. And we're willing to help Chicago. We're willing to help New York. We're willing to help Philadelphia, any city you want."
    },
    {
      "text": "But by law, unless we go a special route, which we have the right to do, but it's very rarely done. We have to be asked by the local government, by the mayors and by the governors. And they don't want to do it, I think for two reasons. Number one, they're embarrassed to do it. And number two, I actually think they're afraid of these people. If you want to know the truth. I actually think these are radical left maniacs. And I actually think, Pat, I think they're afraid of these people."
    },
    {
      "text": "I think they're afraid of those people that I see in Portland and to a lesser extent that I've seen in Seattle. The Portland is a tougher group. They've been doing that for years to Portland. They've been doing it for years and years to Portland and the police stepped down and I don't believe it's the police's fault. They're not allowed to do it. They're good police and they can do it. Let's see how they do tonight. Last night, it was a big step, but let's see how they do."
    },
    {
      "text": "So it's an honor to have the associations here. We have been with them. I've had endorsements from so many police. And I don't even say thank you anymore, I say what's your choice? Your choice is me or somebody that has no clue what they're doing. And I say that kiddingly, but I sort of mean it, right? I sort of mean it. So our relationship with law enforcement has been outstanding. And with firefighters. I mean, you have firefighters that go to put out a fire and people are shooting at them."
    },
    {
      "text": "They're literally shooting at them as they're putting out the fire. Guys are going up on ladders and people shoot at them. We have great support from firefighters. Usually just the top one or two people don't support us because they're used to something else. But everybody in there, we have tremendous support from the police, the firefighters and almost- ... support from the police, the firefighters, and almost every group of people that are associated with the things that we're doing and doing really well."
    },
    {
      "text": "But I want to thank you all very much from the bottom of my heart. I appreciate those endorsements. We really do. It's really great. And you will never be let down with me. I have tremendous respect for what you do. It's dangerous. It pays not as well as they could do elsewhere. Many of the people, but they're discouraged, many of the people, they do it, they love it, right? They love it. Nothing they'd rather do. This is what they want to do. But it's a very dangerous profession."
    },
    {
      "text": "And we are going to toughen it up a lot because the mayors and the governors aren't allowing you to do your job, and you got to be allowed to do your job. When you see the things that we've seen in St. Louis... By the way, you look at the last administration with Ferguson and all of the problems they've had, I mean, they had some problems that are doozies. People said, \"Oh, the last administration...\" That's what started a lot of this."
    },
    {
      "text": "If you look at some of the things that they had, I could name 10 of them right now. But we have to strengthen up because you're being told to do things that you know can't happen. In Seattle they're reducing the force by massive numbers. In Portland they're reducing their force. Can you imagine that? In Portland they're reducing that force by massive numbers. But then the governor, like in Oregon, the governor said things that are just unbelievable. She doesn't want it to get better."
    },
    {
      "text": "The mayor of Seattle, the things that she said. We're going to have a summer of love. There's something going on that is crazy. Remember this though. Most of our cities are doing really, really well. And despite the pandemic... And we're doing a good job on that. We have vaccines that are really getting close. We have therapeutics that are really getting close, but despite all of that, these cities are doing very well, and law enforcement's at an all time good. So most of it's good. We only talk about the bad."
    },
    {
      "text": "But most of it's good. Pat, would you like to say something in representing New York's finest? And we'll go around the room a little bit. So the mayor tells you you can't do that. Your job is to keep people safe, right? So is that a higher calling than listening to a mayor? Do they actually charge you criminally? Never been an event like it. Hey, look, I lived in New York and we never had a problem in New York. New York is... Once Rudy... Rudy did a great job as mayor, in all fairness, because before that..."
    },
    {
      "text": "But I think this is worse than the Dinkins era now. How do you compare this to the Dinkins era? And with Dinkins, if you go back to that period, everybody respected the police and the police were allowed to do their job, in all... It was never like we're going to cut our police force. It was always we're going to get more police, in all fairness. And then Rudy came in and did a great job. So it's one of those things. I think you have to do what you have to do. I mean, you have to keep people safe."
    },
    {
      "text": "You have to keep people safe. Go ahead, please. Speaker 1: () Mr. President, the level of attacks that are going at us, going after our qualified immunity, going after our due process rights, it's a complete assault on the people who are paid to protect the citizens. And if we can't do our job... In Massachusetts they want to file bills that we will not be able to put our hands on somebody unless we're arresting them."
    },
    {
      "text": "So we're dealing with disorderly people, intoxicated people, people with mental health issues, trying to get them into the ambulance, get them to a hospital. We could be sued. And you could be sued individually or as a force? Speaker 1: () Individually. So are they taking immunity away from you? Speaker 1: () They're trying very hard, Mr. President. Yeah, that's the next move. They want to take immunity away from police so that if you do what you have to do and you do it right, you can get sued."
    },
    {
      "text": "I mean, the whole thing is just crazy. So you're having a hard time in Massachusetts. Speaker 1: () Yes, Mr. President. We're working very hard in the means of sticking together, working really hard, and hopefully we can curve some of this- Is the governor trying to help? Speaker 1: () It hasn't gotten to his desk yet, Mr. President. We're hoping that we've made some very solid arguments on all these issues where he can slow the process down. You guys have to stick together. You got to do what you're doing."
    },
    {
      "text": "I mean, you can't let it happen. You know exactly... For instance, when you have a problem in Massachusetts, are you allowed to use pepper spray? Speaker 1: () Yes, Mr. President. So you are. Do you think they're going to end that? Are they thinking about it? Speaker 1: () That was one thing they have not gone at, Mr. President. Because it's impossible. Speaker 1: () They are going after our canines. They are going after tear gas. Our canine officers- How are the canines? Very effective, I would imagine."
    },
    {
      "text": "Speaker 1: () Yes, Mr. President, in multiple areas. Yeah, right. And they're going to stop with the canines? Speaker 1: () They are trying to limit their use. And how about you, my friend? Speaker 2: () We represent almost 33,000 law enforcement officers in the state of New Jersey. And I was talking this morning with these guys and I said that the defund the police has already... the experiment has already proven how poorly it is throughout the country."
    },
    {
      "text": "In New Jersey they're talking about the new use of force policy with proportional force. And my response is if you want to see a fair fight, go to a wrestling match where 185 fights 185. We want to end these resistant cases as quickly as possible. There's nothing pretty about somebody resisting arrest. And if you're going to use proportional force, you- So what does that mean? That means you can't put two on one? You can't put three on one? What does that all mean? You mean you have to give the criminal a chance?"
    },
    {
      "text": "Is that what they're saying? Speaker 2: () You have to fight fair, I think, to place them under arrest. We have- That's one I've never even heard of. Have you heard of that one, John? You know, what people don't understand is that the people, the voters, are with you guys 100%. I'll bet you if you looked it would be really... I don't want to say a number because then they'll say, \"Oh, he was wrong in the number. The number is two points lower.\" It's a tremendous number. The people of our country love you guys."
    },
    {
      "text": "The people of our country want protection. They want safety. And what they're doing is they're just stripping... This radical left movement is stripping you of everything. And we're not going to let that happen. How about you? Speaker 3: () Well, I work for the National Association, so I work for all these gentlemen and all their issues. So you see it all, right? Speaker 3: () Yes. And I just want to say thank you for giving us a seat at the table. Okay. Here's a question for you. So you work for all."
    },
    {
      "text": "What do you think is the worst? Where are they treated the worst, the police? Where are they treated the worst? And where is the biggest onus of problem? In other words, who here at this table, and this is just a small group of what we have, what area's treated the worst? Is it New York? Is it Massachusetts? You just said something. Although what I heard from New Jersey, I'm shocked because I know those great troopers on the highway. They pull me over on occasion for speeding. But for speeding."
    },
    {
      "text": "I haven't gotten one of them recently. But I'd get pulled over, and I'd look at those guys, I'd say, \"That guy, I'm not going to mess with that guy.\" But what area is treated the worst, meaning they've taken their power away? Speaker 3: () I don't think there's just one area. We hear from our membership across the country about various attempts to handcuff cops and their ability to do their job. I just think it depends on the area and what policies people are trying to push."
    },
    {
      "text": "I think cops across the country are having a very difficult time doing their job with very little public support. Obviously, most of Americans- Well, you had really public support, but it's sort of that silent majority that we talked... But it's not a silent majority. It's a massive majority. It's not anything about... The word majority is not a good enough word. You have tremendous public support. And these people feel they have to do this, the politicians, in order to stay relevant in this far left movement."
    },
    {
      "text": "John, what would you say about that? What would you say is treated the worst in terms of areas? New York? One of the worst, Pat. It can't be much worse than that. And you could solve that rather quickly if they gave you your power back, right? Yeah, I know. It's easy. I mean, for you guys, that's what you wanted it. This is hard. What you're doing now is hard. Pat, I remember two years ago, three years ago, when the police didn't respect the mayor."
    },
    {
      "text": "That never changed, in all fairness, but they would literally turn their back on their mayor, and he was really working hard to get them on his side. And now it's almost as though it's just the opposite. And why is that? And do you see it turning around? Do you see it going back where the politicians are going to get smart? Because the numbers will get bad and... But the communities like the police. The communities want protection. Incredible. John, go ahead. He's got your back."
    },
    {
      "text": "I think the cops in New York have to get tough again. You have to get tough again. Speaker 4: () We want to. We have to have the skill and the tools. They got to get tough. They got a big voice. You've got a lot of people. It's a great force and they have to get tough again. Speaker 4: () I absolutely agree. They're going to have to take it and just... they're going to have to... you just said they have to protect. You are sworn to protect the people."
    },
    {
      "text": "There's a point at which that's also an order of coming down, protect the people. And I think Florida is going to be in great shape with going and everything else. But you've got to always watch it, John. Speaker 5: () Yeah. No, we do. We really do. And listen, we're out there working it. And, like I said, we represent over 30,000. And we got a lot of retirees from New York and New Jersey. Speaker 6: () You're welcome. Speaker 5: () Thank you. Do they come into the force? Speaker 5: () Well, some of them."
    },
    {
      "text": "You train them in New York. They leave after 20 years and they go to Florida. Speaker 4: () They do. They go to- And they become police. They have a good life. Right? Speaker 7: () Yes, sir. You want to say something, Mick? Well, one of- Right. I am covering you. But what do you do when you have a radical left, crazy mayor and they're giving you orders that you know will lead to tremendous death and crime? Are you allowed to do your job? Or are you going to have to listen to this crazy man that got appointed?"
    },
    {
      "text": "Is there something you can do? Because I'll tell you, if you don't do your job, you're going to have certain cities in this country that are going to end up like Portland. The mayor goes into the crowd the other night. And I watched very carefully. And I saw exactly what happened. He was excoriated. They went after him. It was incredible. Right? And shouting at him, resign, get out of here. We don't want you. Horrible."
    },
    {
      "text": "And yet, I watched on NBC news, Lester Holt, on your news, Peter, if you watch that news cast, it was a big, beautiful thing that he went in with the people. They didn't show shouting and they get out of here. And they were rough. They would have ripped him apart. Peter, he had five bodyguards, five body guards. If didn't have those body guards, you'd be talking about a funeral right now because they were looking to do a bad thing on him. And he got out with his life. And yet, I watched NBC."
    },
    {
      "text": "I was watching for some reason, NBC Nightly News, not even MSDNC. I'm watching NBC Nightly News. And, you watch that, it looked like he was a man of the people, the mayor. They would have ripped him apart. It just shows you, you need some help from the media. You need a little fair help from the media. What would you say, Jim? And yet, they go after General Flynn who did nothing wrong. They go after General Flynn. I know. I would say, you look like his brother. Slightly different, John."
    },
    {
      "text": "But they'll go after General Flynn and these people that did nothing wrong. Well, it's true. It's true. They can do whatever they want. You to do one blue line and they make it like it's a mortal sin. That's terrible. Did you ever think you'd see that? And this has been happening there for a long time. And could stop it instantaneously if you had the orders. Right? Instantaneously. I saw that jumping on top, hitting them with sledgehammers. And they want to stop it. Yeah. Oh, they would stop it easily. Please, go ahead."
    },
    {
      "text": "Speaker 8: () Well, Greetings from the great state of Texas. Great. Speaker 8: () From the president of- Well, you're in pretty good shape in Texas. Speaker 8: () Some places. A couple of places are a little shaky. Speaker 8: () I actually serve in the state capitol, in Austin. Not such a good place there."
    },
    {
      "text": "The rhetoric that's being pushed by a set of people, certain population, they don't understand everyone that goes to work and takes the job as a police officer, or the vast, vast majority are there to make a difference and to protect their communities and to serve. You're going to get to a point in America, if this continues, where you're not going to be able to find people that are willing to take this job. We don't make the laws. It is a big problem. Yeah. Speaker 8: () We enforce them."
    },
    {
      "text": "Who is going to want to take a job where you don't have the backing of the people running the city, the elected people running the city. It's becoming a problem. Speaker 8: () Yes, sir. It is. It's becoming a major problem all across the nation. In New York- Speaker 8: () We don't write laws. We just enforce the laws that the politicians write. In New York, they fired some of the best policemen in the world. You are crime fighters. And they let them go. How many was that at? What group?"
    },
    {
      "text": "Speaker 4: () We're losing huge numbers. And we have a problem on both ends, sir, with losing members that are deciding to retire, upwards of 1,000. They're canceling classes of our young women and men that want to come on the job and serve. So, they're not even bothering hiring them. And then, of course, that's been a drop too because who would want to go into this profession at this time on this day? It's a problem, sir. We're going to get it changed."
    },
    {
      "text": "Speaker 8: () Sir, I heard you talk about the anti crime unit in New York. Yeah. Speaker 8: () That unit. The anti crime. Speaker 8: () That's what I did before I became on the board. Were you on the unit? Speaker 8: () Yes, sir. And patrols out there every day to answer of the radio. They're in uniform. And they respond from call to call. And calls are getting so much more increased. Those guys in plain clothes, they went out and they look for the bad guys. And they took the guns off the street."
    },
    {
      "text": "And Did they have more shootings? Of course. Because they're the ones going head to head with the guys with the guns. As soon as they canceled that unit, that weekend, that's when the shootings rose incredibly. Yeah. And the bad ones knew it too. Speaker 8: () Oh, yeah. Because they know the guys. And they say, hey, we're not going to mess around with these guys. And now, all of a sudden, they heard they were fired. Oh, boy. We have a free reign. That's what happened. Right?"
    },
    {
      "text": "Speaker 8: () Yes, sir> they went back on patrol. So simple to understand. It's so simple. If the media would be... the media is part of the problem because they don't report the news the way it is. They don't report it. They make it look like these are wonderful people. I watch New York. I watch them burning storefronts and going crazy. I watched, in Minneapolis, we have this guy from CNN with a camera. The city was burning behind him. And he's talking about what a lovely group of protestors. It's really disgraceful."
    },
    {
      "text": "The media is a big... I call it the opposition party. The media is a big part of the problem, really the fake news. It's a big part. They don't report it because it's common sense. It's so simple to understand. Hopefully, Texas will be in great shape. Okay? How about you down there? How are you? Okay. So, I'll ask you the same question. So, where are you having the worst time? Well, what about Wisconsin, where they take the pepper spray and the tear gas away? What about them?"
    },
    {
      "text": "They want to disband the whole police department? So- They want to dismantle. Right? Dismantle the whole police department. So, when you guys hear the term abolish, or use the word abolish the police, abolish the department, some of these people are actually serious about that. It's not just rhetoric. And funding, they're already doing. I mean, defunding they have started. New York took off a billion dollars. Right? So, defund and abolish. And that's it. That's their favorite of all phrases, defund and abolish."
    },
    {
      "text": "Who has gone the furthest of the cities in defund and abolish? And yet, the leaders have armed police around their house. Right? That's nice. Go ahead, please. Speaker 9: () Mr. President, thank you so much for taking us, and Mr. Vice President. My name Mark [inaudible :40] from New Jersey. I'm Pat's executive vice president. We're in trouble. Our governor turned a back on us about a year ago. Our attorney general has turned their back on us. The legislature is pretty much is throwing crazy bills at us."
    },
    {
      "text": "We're in a fight for our lives and our members for our lives. Our guys and girls are really in trouble in New Jersey right now. And we really need your help. So, surprised to hear about New Jersey. Speaker 9: () They really turned that lock down- Because I know the troopers so well, I know the whole group so well. Speaker 9: () The politicians turned their back on us overnight. And, if we had a problem, I'd be the first one to say, we have a problem here and we have to straighten it out."
    },
    {
      "text": "We are 47th in shootings and with a densely populated state. So, there's not a problem in New Jersey. And, if there was, I would be the first one at the table saying we have a problem. But they're coming out with some prison legislation and they're coming out with- But those numbers will go up. Those numbers will change with time. Speaker 9: () Absolutely. If they do what you're saying. Speaker 9: () No. In police shootings, we are 47th lowest. Yeah. No, that's what I meant. Speaker 9: () Yeah. That's what I meant."
    },
    {
      "text": "Speaker 9: () And another thing is, that they closed the mental institutions in New Jersey. They put all the homeless and the mental people on the streets. And we're supposed to deal with them. We're not trained psychologists and psychiatrists. When did they do that? Speaker 9: () So, it's been years already. So, now it's getting worse and worse. And, every time you go to an emotionally disturbed house, we're not supposed to go in."
    },
    {
      "text": "When mom in calling up screaming and yelling, my son just stabbed me and walk into the house with a butcher knife full of blood and you shoot the person, we're not supposed to know that he had problems and has emotional problems. Yeah. Right. Speaker 9: () So, we're supposed to deal with this in a matter of seconds, make that split decision. On TV, it's great. But, in reality, Mr. President, it's scary situations."
    },
    {
      "text": "And our guys go to jail for shooting somebody for protecting their own lives and their family's lives. That example is something that I- Speaker 9: () Yeah. And, Mr. President, I never understood what fake news was until you said it all the time. And I can't believe how bad fake news is, as you say, all the time. Yeah. Well, I've said it and I've learned. I thought it was fake before I got here, but not as bad as it is. Speaker 9: () Right. Yes, sir. It's really..."
    },
    {
      "text": "it's a tragedy what they're able to report or not report. What they don't report is, in many ways, even worse. Speaker 9: () Yes, sir. Mike, please. And we're working on additional support because you need that. We're the opposite of defund. And you're talking about peanuts by comparison to what they do and the damage they do and the lives that they destroy. You're talking about a very small amount of money. So we're with you all the way, 1000%. And I want to thank you all for being here."
    },
    {
      "text": "I really appreciate your support, [inaudible :49]. I support you. I mean, just by nature. It's natural. It's common sense. And you know what? If I thought you were doing a bad job, I'd let you know. You know that. You know that. I'd let know. And you're not allowed to do your job, that's the problem. You're not allowed. And you're dying to do your job. You could've stopped that New York stuff the first night. In 10 minutes, you could have stopped it."
    },
    {
      "text": "And you would have saved a lot of lives and a lot of anger and a lot of hardship. And a lot of COVID, by the way. You would have stopped because I saw them marching on top of each other. You would have saved a lot. And you wanted to do it and they wouldn't let you do it. I saw that. They wouldn't let you do it. They were going, actually, the opposite way, turn your back. And then people start getting hurt that had nothing to do with it, they were getting hurt. They just don't let you do your job. All right."
    },
    {
      "text": "Well, I want to thank- Speaker 11: () Mr. President. On the negotiations with Congress, I think the Democrats are hoping to hear directly from you on what you support. Would you be willing to- I think the Democrats don't care about the people of our country. I really don't. I tell my people, the Democrats do not care about the people of our country. They don't want to do what you should be doing for the people of our country, whether it's unemployment or anything else. And all they care about is the election."
    },
    {
      "text": "And they're going to lose the election. You see what's going on with the polls right now. I guess we just got one over 50%. Rasmussen just came out. You see what's going on because the people get it. The Democrats are playing for November 3rd and we're playing for the good of the people. It is a disgrace that they're not negotiating, but they're only looking to play a political game. I happen to think it's a bad political game, I think it hurts them."
    },
    {
      "text": "Speaker 11: () I know they look at you and what you say publicly different from what they hear from Mnuchin and Meadows. Are you willing to spell out exactly what you want right now? They know what I want. And what I want is I want our people to be able to live and live well because it wasn't their fault that China brought in this pandemic, that China brought in this plague. It's China's fault. You want another truth? China should be paying for it. And maybe they will. Maybe they will. You'll watch. You'll watch."
    },
    {
      "text": "What else? Peter, you know nothing about my energy. Okay? You know nothing about what I'm doing. Listen, you know nothing about what I do. So NBC, I just told you about the false report that NBC put out the other night about the mayor of Portland. And this is the kind of stuff you get. You'll see what happens. And it's common sense. Everyone knows mail in ballots are a disaster. You just have to take a look at the last recent ... Take a look at New York City. Look at New York, they're still counting your ballots, Pat."
    },
    {
      "text": "Do you know that? They had a race, a small race by comparison. By comparison, tiny. It's so messed up they have no idea. There are ballots missing, thousands and thousands of ballots are missing. They they're going to send hundreds of millions of ballots all over the United States and it's going to come out. You won't know the election result for weeks, months, maybe years after. Maybe you'll never know the election result. And that's what I'm concerned with. It'll be fixed. It'll be rigged. People ought to get smart."
    },
    {
      "text": "And I just hope our Republican voters, the people that are for you, are going to do what they have to do. Absentee ballots are great because absentee ballots, you have to go through a process to get them. And it's actually a great thing. Absentee ballots, I'm going to be voting absentee. An absentee ballot is one thing. A universal mail in ballot is a disaster. These governors are going to send out millions of ballots. They don't even know where they're sending them."
    },
    {
      "text": "I already have friends that got ballots for a son who died seven years ago. Oh, you don't even want to talk about it. But the media knows this. Actually, the Washington Post wrote a great article. Of all groups, a week ago, the Washington Post wrote a great article that this is a disaster. This is going to be the greatest election disaster in history. And by the way, you guys like to talk about Russia and China and other places, they'll be able to forge ballots, they'll forge them."
    },
    {
      "text": "They'll do whatever they have to do. People should go and they should vote or do an absentee ballot. Speaker 12: () The military- Say it. Say it. Speaker 12: () The military predominantly votes by mail or absentee. Absentee. Speaker 12: () And so- You didn't understand me. I said absentee ballots are actually a very good thing. Absentee ballots are secure and they're very good, but universal mail in are a disaster. You're going to see at election that, and we're going to do very well in the election."
    },
    {
      "text": "Nobody wants that date more than me. I wish we'd move it up. Okay. Move it up. But you're not prepared for what they're doing. And they're using COVID. They're using the China virus. China must be very happy about it because they hit us with a virus and now they screw up an election like you will never see. You watch what happens. I don't think you'll ever give me any statement, \"I guess Trump was right.\" But the people know I'm right. Watch what happens. New York City has a little election."
    },
    {
      "text": "We just talk, they're never going to have the result of that election. Never the correct result. They'll probably announce something at some point. But when did that take place? Like five, six weeks ago. Absentee ballots, great. Going to the polls, great. If you do universal mail ins with millions and millions of ballots, you're never going to know what the real result of an election is. It's going to be a very, very sad day for our country. Go ahead. Oh, we're doing, we're putting in all the resources you can."
    },
    {
      "text": "But as a couple of the radical left people said, who actually agree with me, they said, \"No matter what you do, we're not prepared for this.\" They're not prepared for an onslaught of millions of ballots pouring in. They're not prepared. They're not prepared. You watch. They're not going to announce anything on November 3rd. They're not going to announce it on the fourth or the fifth of the sixth. It'll go on forever. People should go. They voted during World War I, they voted during World War II."
    },
    {
      "text": "They went to the polls, they voted. They went to their booth and they voted proudly. But now with COVID, they don't want to vote. It's not they don't want to vote. This will be catastrophic for our nation. And you'll see it. I'm always right about things like this. I guess I must be. Or I wouldn't be sitting here. Yes, Jennifer, go ahead. You want something? Jennifer, do you want- Please, in the back. Speaker 13: () [inaudible :41] decision to the delay the election in Hong Kong."
    },
    {
      "text": "What is your- I want to right now focus on this election. I'll have a statement about that soon. I heard that, that they did the delay in Hong Kong and we'll have a statement about that. But I want to focus on [crosstalk :57]. Okay, thank you very much. Thank you very much."
    }
  ]
}