{
  "speech_id": "195",
  "speaker": "Trump",
  "title": "Donald Trump Speech Transcript: Safely Reopening Schools Amid COVID-19 Pandemic",
  "date": "20200707",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-speech-transcript-safely-reopening-schools-amid-covid-19-pandemic",
  "topics": "Economy, Healthcare, Education",
  "num_segments": 43,
  "content": [
    {
      "text": "Thank you. [inaudible :08]. Well, thank you very much. It's an honor to be with everybody, and very importantly, we're at the White House. There's no place like the White House, and for those of you that this is the first time, I know exactly what you're thinking, because I was here a first time, and it was still something I'll never forget."
    },
    {
      "text": "So it's great to have you, and our First Lady and I pleased to welcome everybody to this wonderful place and discuss the vital importance of safety and reopening America's schools. We want to reopen the schools. Everybody wants it. The moms want it. The dads want it. The kids want it. It's time to do it. Our mortality rate is right now at a level that people don't talk about, but it's down tenfold, tenfold. So you look at deaths are way down from this horrible China virus, and it's a disgrace that had happened."
    },
    {
      "text": "Shouldn't have happened, but it did. The economy is coming back, and it's coming back strongly. Jobs are setting records for ... Two months ago, they set the record, and then again, almost five million new jobs last month, which is a record. It broke our last record of a month before. So the numbers are happening much faster than anybody anticipated."
    },
    {
      "text": "The stock market, NASDAQ just had another record today, and the market's generally just really a very small amount below where they were at the height of the market when we first had to do this about four and a half, five months ago. It's incredible what's happened. When you look at education, my administration has approved $13 billion for state and local education. We've approved over $6 billion to support colleges and another $6 billion in emergency grants to students, very importantly."
    },
    {
      "text": "We waived standardized testing requirements, deferred federal student loan and interest payments. So you take a look at the student loan program. We've waived student loan and interest payments, and that is something that people haven't been hearing about and nobody talks about, but it's a big deal. We've pioneered new treatments that are dramatically improving the health outcomes. Vaccines are doing very well. Therapeutics are doing very well."
    },
    {
      "text": "The therapeutic research has been incredible, and I think you're going to have a lot of big things happening long before the end of the year on both vaccines and therapeutics. Therapeutics, I guess, is a little bit of a word we can use for on the way to a cure. But they make you better. I mean, to me, the therapeutic is even more important than the vaccine at this point, because people will get better. But the numbers, the testing numbers are the highest they've ever been."
    },
    {
      "text": "We're almost up to 40 million in testing and 40 million people, which is unheard of, far more than any other country, many times what any other country has, and therefore we have more cases. Because we're doing more testing, we have more cases. If we did half the testing, we'd have far fewer cases. But people don't view it that way. What they have to view, though, is if you look at the chart, and maybe Mike has it, but we looked at it before. If you look at the chart of deaths, deaths are way down."
    },
    {
      "text": "So what we want to do is we want to get our schools open. We want to get them open quickly, beautifully in the fall. As you know, this is a disease. It's a horrible disease, but young people do extraordinarily well. I was with the governor of New Jersey. We were talking, and he said out of ... and he mentioned a number, which is a very high number, but it's a number nevertheless, thousands of people."
    },
    {
      "text": "There was only one person that died that was under 18 years old in the state of New Jersey, and that was somebody I guess had a problem with perhaps diabetes or something else. But one person out of thousands of people, one person died who was under 18 years old. So that's a pretty amazing stat when you think of it. But I'd like to now just give the mic to our First Lady. She's going to say a few words, and then we're going to go with Mike and Karen Pence."
    },
    {
      "text": "Then we'll go around the room a little bit, say a few words, and Kelly Anne, you did a great job this morning. Thank you. Really great. So if I might, First Lady, please. Thank you very much. Governor, thank you. I see you sitting over there. What a job you're doing. Thank you very much for being here. I appreciate it. Thank you, Melania, very much. We just heard Mike was telling me that Governor DeSantis is doing a terrific job."
    },
    {
      "text": "He just announced that the schools will be open in the fall, and we hope that most schools are going to be open. We don't want people to make political statements or do it for political reasons. I think it's going to be good for them politically. So they keep the schools closed, no way. So we're very much going to put pressure on governors and everybody else to open the schools, to get them open. It's very important. It's very important for our country."
    },
    {
      "text": "It's very important for the wellbeing of the student and the parents. So we're going to be putting a lot of pressure on open your schools in the fall. Mike, please. Well, thank you very much, Karen. I appreciate it, and I see Dr. Redfield over in the audience. I appreciate it, and I know you'd like to see everybody coming back and getting back to school in the fall. I've read everything you've written, and I appreciate that very much, Doctor. Thank you very much. Appreciate it. Governor, please."
    },
    {
      "text": "Maybe we'll go around the room real quickly. We'll go quickly, and we'll get everybody to say a few words. We'll start with our governor. Thank you. You won't be changing the name St. Louis, will you? Thank you. Thank you very much. That's very important. Thank you very much. Dr. Thank you very much. Please. Thank you very much. Great. Thank you. Alex. Thank you Alex. Good luck with all of the therapeutics. I know you're getting very close. Very close, that would be incredible. What are your chances early, like in September?"
    },
    {
      "text": "It seems to be just working. It's sort of the ABCs of what we're doing and it seems to be working. Do you have tests right now that say it does work? That's exciting, very exciting, all right. We'll hold you to it, September. You too doctor. Please, thank you. Well good luck with your plan and getting them open and hopefully you could do five days instead of the two and back and forth. I know you want to be able to do that, so you'll try. Thank you very much. Great job."
    },
    {
      "text": "[inaudible :59] good looking person, this is, huh? Great job. Really great. Thank you very much. We'll get you back, okay? We'll get you back soon. Thank you. Kellyanne, please. Thank you. Thank you very much Kellyanne. Thank you very much. Great job. Looks like you're doing a good job. Is your mother doing a good job? She good, right? You said the right thing. Okay, great job, thank you very much. Dr. Yeah, thank you and say hello to Bill, please. Thank you. Doctor? Dr. Thank you very much. Thanks [inaudible :31]."
    },
    {
      "text": "Speaker 2: () Thank you Mr. President so much for including me in today's event. I think I'm on now. Thank you for including me so much in today's event. I want to thank you, I want to thank the Vice President, the First Lady and the Second Lady for your comments and for all the concern you've head for the education of our children. I come today as a parent, as an OB-GYN physician, and as the managing partner of my practice."
    },
    {
      "text": "This has been a very scary but also a very Speaker 3: () And a very scary, but also a very enlightening experience to have walked through. It's been quite the challenge, and I will say quite the challenge. But the first thing I want to say is it's so important to get our children back in school, our higher education students, our high school students and our middle school students are so embedded in social media already."
    },
    {
      "text": "Speaker 3: () I also saw the anxiety of my youngest child, who's here today with me, Macy, back on that side, I saw her anxiety when she came home from college, the anxiety of not knowing how her education would continue, and then trying to set up the zoom meetings and make it happen. But more importantly, not having the opportunity for those in-person tutorials or that interpersonal relationship with a professor to complete her courses. And I think her courses did suffer because of that."
    },
    {
      "text": "She's a good student and it wasn't dramatic, but I can only imagine what it was like for other students. Speaker 3: () My eldest child had a learning disability. To try to bring him home, and do this education online, without that in-person benefit, without the tutors being there present, would have been a disaster to his now very good career in Richmond. And I just fear for that student, especially."
    },
    {
      "text": "As we go back to school, I think it's very important that we also educate these kids because they sometimes do rise above it and feel as though they don't have the mortality or the morbidities or that problem of interaction with each other. They will have new family units. My daughter will be in an apartment with three other girls. They will be the new family unit."
    },
    {
      "text": "And it's important that we educate them for that for when they come home that they realize that their elders, their grandparents, and all are now vulnerable to him, that family unit has changed, but we can do this and we can teach them. And masking, they've learned this it's important, but we have to reinforce this at the college level to keep it ongoing as a priority. And I know that we can do it. Speaker 3: () The other thing that I, as a physician and a strong believer in, is herd immunity."
    },
    {
      "text": "We need to get out, we need to have the vaccines to help us, we need to have the interaction that helps to get that immunity, so that we can protect our vulnerable, and we can protect our elderly, and we can protect those younger folks with comorbidities because we've got a society that is immune to the virus, and we can put the virus back in its place."
    },
    {
      "text": "Speaker 3: () Finally, I just want to, again, thank you for being here, thank you for hearing me out, and thank you for putting education of our children in the utmost, and for putting our economy in that place too, because as a business owner, when I have parents who have to come late or leave early in order to educate their children and yet run a business at the same time, as this lady stated, it is incredibly difficult, if not impossible, and we want to maintain their jobs, we want to maintain their work ethic, but we also want to maintain the intelligence of their children and of our future."
    },
    {
      "text": "And so I thank you again for your interest in this and for letting us be here. Thank you. Thank you. I think it's very important to note that we've done it right. We closed up, we were amazing the way our great citizens adhered to what we wanted to do. And we saved, I think, millions of lives. Now, we want to be open. We understand the disease much better. Nobody knew what this was, nobody had ever seen it before. There's been nothing like this since 1917. That's more than a hundred years ago."
    },
    {
      "text": "But we saved tens of thousands of lives, hundreds of thousands of lives. And now we're opening and we want to stay open, and we will stay open, we're not closing. We'll put out the fires as they come out. I call them embers and fires and whatever you want to call them. But I think it's very important to note what we've done, we've saved literally hundreds of thousands of lives."
    },
    {
      "text": "I was going over numbers before with the Vice President, and if you looked at a million, 2 million, two and a half million, those are all reasonable numbers to what we could have had. Right now we're at a number, as you know, far lower than that. And where would you say we are today Mike? V.P. About 130. So we're at 130, and we could be at a way over a million right now, and I think it could have been two and a half or 3 million people."
    },
    {
      "text": "But now we're open, and now we understand the vulnerable, we understand who has the biggest problem with it, and we watch that group, and that age group, and also people that aren't feeling so well with respect to, in particular, [inaudible :32] certain diseases, the diabetes is bad, the heart is bad, and we watch very closely and we've done it right. When you look at what happened with Sweden, I kept hearing about Sweden with the herd, with the pure herd."
    },
    {
      "text": "The herd concept of opening up and keeping open, all of a sudden, it exploded. You look at what's going on in Brazil and a couple other places. So we've really done it right, but now it's time to be open, it's time to stay open, and we will put out the fires as they come up, but we have to open our schools. It's so important to open our schools. And when you said from a psychological standpoint, with respect to staying home any longer, you can't do it. You can't do it. That has great dangers also."
    },
    {
      "text": "So that's where we are, we're not closing, we'll never close. You'll have certain areas that will have difficulty, and they'll do what they have to do. And that'll be up largely to the governors, but it's also, they're in very strong consultation with us. We're supplying them with tremendous materials and gowns and masks and anything else they need, and they should be doing it themselves. But we've made a lot of governors look very, very good."
    },
    {
      "text": "We've made a lot of governors look very smart that weren't so smart, and some have just done a good job right from the beginning. I could give you a list. I could grade them. I could grade them out from one to 50, and you'd be amazed. You might be surprised at some of them, both good and bad, but I thank you very much for your remarks. I think it's very important, what you said, I think it's very important. Please. Thank you very much. Thank you. Chancellor Finis St. Well, thank you very much."
    },
    {
      "text": "It's a great place, a great State. And you're right about one thing, there's nothing like the campus. If we've learned anything, the computer will never replace the campus. They thought it would for a while, didn't they? But it didn't. After about two weeks, we figured out that it's much better to have it the old fashioned way. That's great. Great statement actually. Thank you. Speaker 4: () Thank you Mr. President, Mrs. Trump, Mr. Vice President and Mrs. Pence."
    },
    {
      "text": "I'm a third grade teacher at Blessed Sacrament Catholic School right here in Washington. I believe Mr. Vice President you mentioned some heroes shortly a go. I certainly agree with you, the parents, I couldn't have done this for the past few months at home without the community of parents that we have at Blessed Sacrament School. And I guess the teachers are heroes in their own way. I really believe that the real heroes here are the students. The students that plugged along, that rose to the occasion."
    },
    {
      "text": "In fact, one of my students is here today, Rory stand up, and that's why I'm here. They showed incredible resilience in spirit, and all of the gifts that God has given them. I really believe that the children are our future, as I know that you do, and I think that they are what is truly going to make America great again. So I want them to be back in school in the fall. Thank you. Great. We agree. Thank you. Please. Speaker 5: () Mr. Trump, Mr. President and First Lady, Vice President Pence and Mrs. Pence."
    },
    {
      "text": "First, I just would like you to know that I personally pray for you daily, all four of you. I cannot imagine the burdens on your shoulders. And I know that it's only through God that you can handle that. It's not easy. Speaker 5: () I so appreciate all that you've done. I am the President of our school board in the Great State of Ohio in Cincinnati Indian Hill. And we are very actively working to get our children back in school, full time, all together, as safe as possible."
    },
    {
      "text": "We are fortunate that we have a lot of resources and we're able to do that. My biggest concern, and I hope through your leadership we will not have overregulation at the local level that would keep us from being able to accomplish that goal. My biggest fear is that we will get everybody back, we'll get into a routine, and then because of regulations and mandates that we would have to close back down, or to send children home, and that is a very big concern."
    },
    {
      "text": "That would be just such a disruption on top of a disruption. So that is probably my biggest concern. Speaker 5: () I'm also very happy to hear that University of Alabama has made the statement to go back to school. I have two college athletes and we've been waiting all summer to know what's happening at that higher education level. And it's disruptive, they're going into their senior years, and internships were canceled, and it's a scary time. That's a scary time anyway, on a good day, for a young person."
    },
    {
      "text": "So I really hope that our higher education institutes will make some decisions soon. And really I'm just honored to be here. I appreciate so much what all of you have done, and however we can help please don't ever hesitate to reach out. Thank you very much. And will Alabama be playing some great football? What's going on with Alabama? Chancellor Finis St. It's true. And say hello to the coach. Great coach. Chancellor Finis St. Thatnk you. Thank you Johnny. And you're doing a great job."
    },
    {
      "text": "The only thing is I don't think people know how much we've done for Historically Black Colleges and Universities. Nobody knows that. ... Done for historically black colleges and universities, nobody knows that we've done more than any administration in history, and nobody knows that, but maybe they'll find out eventually. They'll find out. But thank you very much, appreciate it. Please. Thank you. You're right. Thank you very much. Brooke. Thank you, Brooke. Thank you very much. Please. Speaker 6: (:18) Mr."
    },
    {
      "text": "President, Mrs. Trump, Mr. Vice President, Mrs. Pence, it's an honor to be here representing Forsyth County Schools and Forsyth County, Georgia. We're about 30 miles north of Atlanta, serve 52,000 students in our school system. We're ready to go. We're going to open our doors on August 6. We've been planning and preparing all summer. We will have guidelines in place. I'm really proud of our teachers and our students, how well they perform last spring."
    },
    {
      "text": "But as everyone has said this morning, this afternoon, our students need to be back in school and we will be prepared on August 6. Speaker 6: (:50) I will assure you of that. That's great. That's great. Thank you very much. Thank you very much, Betsy. I appreciate it. Very nice. Please. Thank you very much. Thank you. Please. Thank you very much. Sidney A. Thank you very much. Thank you very much. Great job too. So I want to thank everybody. And I want to just say, get open in the fall. We want your schools open."
    },
    {
      "text": "It's going to be a much better climate than it is right now. We're on the right side of things. Deborah, I think we can say that. A lot of work has been done. We understand what we're doing very, very well. Again, mortality rate, the lowest anywhere in the world, and we want to get this done and we want to get our country going again. Economically, we're doing well. We want to do well with the education. I see where Harvard announced that they're closing for the season or for the year. I think it's ridiculous."
    },
    {
      "text": "I think it's an easy way out. And I think they ought to be ashamed of themselves, you want to know the truth, but I noticed that today and probably others are doing that. That's called the easy way out. I don't know if people are helping them. I guess their endowment's plenty big. They don't have any problem with that, but that's not what we want to do because it's very important as so many of the parents and instructors said today."
    },
    {
      "text": "It's so important that the children at this age, especially, that they're together, they're together on campus and that's what we're striving for and we're going to be very strong in that. We're going to be very, very powerful in that view. We want our schools open in the fall. Tomorrow, I'm meeting with the president of Mexico. I say that to the media because it's going to be quite a meeting. He's a good man. He's a friend of mine and we have a great relationship with Mexico. So we'll be meeting tomorrow."
    }
  ]
}