{
  "speech_id": "209",
  "title": "Donald Trump Speech Transcript Announcing Task Force on Veteran Suicide Prevention",
  "date": "20200617",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-speech-transcript-announcing-task-force-on-veteran-suicide-prevention",
  "topics": "Veterans Affairs",
  "num_segments": 26,
  "content": [
    {
      "text": "Thank you very much. Please, thank you. Good afternoon. And before we begin, five years ago, nine innocent parishioners of a historically black church, you all remember this horrible event, were tragically killed during an evening Bible study in Charleston, South Carolina. That was a despicable act of evil. [inaudible :02] Somber day, as our hearts still break for the victims and our prayers go with all that was a terrible event, it was a terrible day."
    },
    {
      "text": "Terrible, terrible day for our country, for the world to witness. Thank you very much for being with us at the White House. As we reaffirm our sacred promise to support and protect our great veterans. We love our veterans. And great, they are. With honor and courage, these incredible patriots perform their duty to America, and now we must fulfill our duty to them, and that's what we're doing. We're doing it beyond what anyone's ever done as president or as an administration."
    },
    {
      "text": "They've been through so much and it's such a deep-seated problem, and we're doing tremendous research and everything you can do, but it is something that nobody quite understands, and they're gaining knowledge, but they don't quite understand it. I want to thank our vice president for being with us. And I especially want to thank frankly, wonderful Karen Pence, who is so committed to the veterans and this particular problem. And thank you very much, Karen. We appreciate it. Thank you."
    },
    {
      "text": "Here as well are several members of Prevents Taskforce. Prevents, it's called. Prevents. Secretary of Veterans Affairs, Robert Wilkie. Robert great job. 90% approval rating. The VA it's way, way up, 90%. That's a number that has never, not even come close to attaining that number. So it's a tremendous job you're doing. Thank you very much. Secretary of Labor, Jean Scalia. Jean, thank you very much. Secretary of Health and Human Services, Alex Azar. Alex, thank you."
    },
    {
      "text": "Secretary of Housing and Urban Development, the great Ben Carson. Thank you, Ben. Secretary of Education, Betsy DeVos. Thanks, Betsy. And Acting Director of OMB, Russ Vote. Thank you, Russ, very much. Also with us are Surgeon General Jerome Adams. Where's Jerome? Jerome, hi, Jerome. And he got a standing ovation the other day. Introduced him. He got the only standing of ovation. Jerome, what was that all about. And the Executive Director of Prevents Taskforce, Dr. Barbara van Dalan. Thank you very much. Appreciate it."
    },
    {
      "text": "Thank you. Thank you, Barbara. And representatives from several of our nation's leading veterans groups. We have tremendous people in this room. People that worked so hard for the veterans and they love our military. They love our country. They love our veterans. Thank you all for being here very much. Very much appreciated. From day one, my administration has been on a mission of historic scope and scale to deliver results for our great veterans."
    },
    {
      "text": "After years of shameful scandal and neglect under the Obama Biden administration. And scandal and neglect it was. We have fundamentally reorganized the VA from top to bottom. And we've re-established a crucial principle. American veterans deserve the highest standard of care anywhere in the world. And that's what they're getting. Great leadership. To help veterans get the care they need when they need it, we approved Veterans Choice and made it permanent. And that was a big deal."
    },
    {
      "text": "They've been trying to get it for decades and decades and decades. And we got it. We got it done. And basically that means if you have a problem and you can't get to a doctor, it doesn't work. You end up going outside, you get your doctor. We pay the bill. And they get immediate service. Some of the veterans were forced in past administrations, for a time beyond the Obama administration, even, but for a long time, they were expected to wait a week and two weeks and three weeks just to get to see a doctor."
    },
    {
      "text": "It was a terrible situation. Now we have Veteran's Choice. They've been trying to get it so long. And it works incredibly well. And I would say that's a reason why when I say 90% approval rating, that's probably one of the big reasons. Before I took office every month seemed to bring a new story of crisis at the VA, by our friends from the media. But the days of endless and deadly wait lists are over and they are never going to come back. Never going to let them, nobody can allow that to come back."
    },
    {
      "text": "What our vets had to put up with. I signed the VA Accountability Act into law, and we've removed more than 9,000 VA workers who were not giving our veterans the care, respect, attention that they've earned. And now that we have accountability... It's accountability, very nice word. If an employee of government mistreats our veterans in any way, does something wrong, isn't good for the VA, the secretary looks at them and says, you're fired, get out. Before you couldn't do that. We had people for years and years."
    },
    {
      "text": "We had stories. I could tell you story after story, how bad it was. You had sadists. You had thieves. You had some bad, bad people. So 9,000 have been fired and they should've been fired a long time ago, but we got accountability. VA Accountability passed. We secured record funding for the VA, including $9.6 billion for mental health services in 2020. $9.6 billion. Every VA medical facility now offers same day emergency mental health. Something we didn't have, or even come close to having."
    },
    {
      "text": "It was not picking up until COVID came along, and now it's one of the hottest things you have going in the medical world, allowing people to consult with doctors from the comfort of their homes and not having to go out and not having to make long trips, and they get tremendous advice. I hope. The promised White House VA Hotline that I've been talking about has fielded more than 400,000 calls, right in the White House, successfully resolving 98% of veterans' concerns. It's a great thing."
    },
    {
      "text": "We have substantially cut the wait time for veteran appeals, ensuring all issues are resolved in a swift and timely fashion. It goes very quickly now. Very, very quickly. We're modernizing medical records to begin a seamless transition from the Department of Defense to the VA, something others have tried and failed to do. They've tried it for decades. Long time, they wanted to do it. It's actually not as easy as it sounds, getting it done, but we got it done."
    },
    {
      "text": "The VA has also cut opioid prescriptions by 35% since 2017, and we're committed to defeating the opioid epidemic in America. We've brought it down by as much as 17% in some areas, 19, 20% in other areas, but that still means you have a lot left. But a lot of good things are happening. I have to say, our border, where much of this comes in, drugs come in, we have a drug problem. We have an opioid problem. It's all the same big problem. But our border now is as secure as it's been in many, many years."
    },
    {
      "text": "The wall is now up to mile 212, and wherever we have the wall that takes care of that area completely. But we're now down to among the lowest numbers we've ever had on the border. And I want to thank the president of Mexico because we have 17,000 troops right now on the border, Mexican troops, and really helping us a lot. The number of veterans who say they trust the VA services has increased 19% under this administration. That's a tremendous increase, but I'm still more impressed."
    },
    {
      "text": "It's an all-time high, by the way, but I'm still more impressed by the 90 to 91% number. That's the number I'm going to use from now on. All right? Can I do that, Robert? I like that, 91%. Can you imagine if you were a politician, you had a 91% approval rating? That would be pretty good. But there's more work to do. Ending the tragedy of veteran suicide demands bold action at every level of society. Twenty veterans and service members take their own lives every single day."
    },
    {
      "text": "The loss of our heroes breaks our hearts and pains our souls. One year ago, I signed an executive order establishing PREVENTS Task Force to develop a nationwide strategy to support our veterans in distress and stop the grave tragedy of veteran suicide. Today, thanks to the leadership of Secretary Wilkie, he's been outstanding, I'm proud to announce that we are taking this critical initiative to the next level."
    },
    {
      "text": "Following the ambitious roadmap the task force has developed over the last year, you'll see things happening that nobody would have ever thought even possible. To lead this effort, Mrs. Pence and a team of ambassadors that she was very much involved with in choosing, including the Surgeon General, Jerome Adams. You're only there, Jerome, because Mrs. Pence wanted you there. Okay? It's a nice compliment. She's tough. That's a nice compliment. We'll launch a national public awareness campaign in the coming months."
    },
    {
      "text": "This historic campaign will mobilize every sector of American society to encourage heroes in need, empower them with the best prevention practices, and help every veteran thrive in their lives after service. They come home from these active battlefields and left sometimes alone, and then you have a hard time with it. They fought our battles overseas, and now we must join them in winning this new battle at home. There's no single solution to this issue. Every resource must be brought to bear."
    },
    {
      "text": "We're expanding our partnerships with military and veteran organizations, universities, faith-based leaders, businesses, nonprofits, and all levels of government to establish specialized support systems for our veterans. The task force has already partnered with 30 large corporations to help them prioritize the mental health of their employees, and we will continue adding to that number, and the number's growing very rapidly. Very, very rapidly. We're also launching a national research strategy."
    },
    {
      "text": "The PREVENTS office will work with the greatest scientific minds across our nation to evaluate research to better understand the trauma service members face. They face tremendous, tremendous trauma. Identify effective treatments and communicate their findings to the public. The PREVENTS office is currently reviewing the $1.5 billion of federal funding committed to suicide prevention to make sure research goes where it is most needed in order to save lives and to make lives better."
    },
    {
      "text": "Here with us today is former Marine and Coastguardsmen, Chad Hiser, who can share with us his personal testimony about the importance of the steps we're taking today. And Chad, if I could please, would you say a few words? Thank you. Thank you sir. That's fantastic, Chad. Thank you very much. I thought because she is so important to what we're doing. I could just, prior to Secretary Wilkie, ask Karen Pence to say a few words and she's going to be leading us into the promised land on this very tough subject."
    },
    {
      "text": "Do you mind? Please. Either one, Karen. Thank you, very much. That's good. Thank you very much. So she had no idea I was going to do that, but I have to say that I did it about two months ago. I said, \"Beth, maybe Karen wants to say a few words.\" And she got up and she spoke for five minutes. She blew everybody away. She was the star, right, Mike? And I said, \"Come on, Karen, you got to go.\" Great. Great. Really appreciate it. You're going to do a fantastic job. Thank you very much. Mr. Secretary, let's go."
    },
    {
      "text": "Thank you, Robert. Great job you're doing. So Karen Pence has stated beautifully just a little while ago that the two words, anxiety and stress, and all I can say, Mike, is thank goodness we don't have any anxiety or stress in this job, with these people back there. But I will tell you, we're working very hard on this problem, and I think we've made a tremendous amount of progress. I even noticed your number, 20. 20 is different than 24. You know what that means. Each day. Hard to believe."
    },
    {
      "text": "Each day, but 20 is a big difference, and we're getting it way down, and with some of the treatments that we're talking about, I think it'll go a lot lower than that. And Barbara, I want to thank you very much. I want to thank Chad. I want to thank you very much. That was a beautiful, beautiful statement. You've done such a fantastic job. I see General Kellogg. He's one of our great generals. He's done a fantastic job for me, and he's doing some very important things for me right now."
    },
    {
      "text": "So General, thank you very much. Really fantastic job. And we will have another meeting soon, and that meeting will be a meeting of progress, because I know with Karen in charge and with the Surgeon General working along with Karen, and the group that you have, I know every one of them, you're going to make big, big progress, very, very fast. So thank you very much. Thank you, Karen. Thank you very much, Mike. Thank you."
    }
  ]
}