{
  "speech_id": "211",
  "title": "Donald Trump Roundtable Transcript with Governors on Reopening Small Businesses",
  "date": "20200618",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-roundtable-transcript-with-governors-on-reopening-small-businesses-june-18",
  "topics": "Economy, Healthcare, Government Policy, Social Justice",
  "num_segments": 16,
  "content": [
    {
      "text": "Governor Pete Ricketts of Nebraska. Pete, thank you very much. And a man that I'm going to see a little bit over the weekend, and this was really by coincidence that you happen to be here today because it was for a different reason. It has to do with small business, Governor Kevin Stitt of Oklahoma. We're going to be in Oklahoma and it's a crowd like I guess nobody's seen before. We have a tremendous, tremendous request for tickets. I think probably has never happened politically before."
    },
    {
      "text": "One of the reasons we chose your state as you know, Kevin was that you've done so, so well with the COVID. You've handled it incredibly well. We appreciate... You both have actually. You both have, so congratulations. Along with several extraordinary small business owners from their state. Also with us, our Secretary of the Treasury Steven Mnuchin and small business administrator Jovita. Thank you Jovita. Very good. Small business is no longer small businesses, it's big business. It's one of the biggest businesses."
    },
    {
      "text": "As a result of the virus 22% of small businesses were forced to close earlier this year, including 41% of black owned businesses. But under my administration strategy to vanquish the virus and restart our economy, small businesses across the nation are now safely reopening. All over the nation they're reopening at levels like nobody's seen before. We're sheltering individuals at the highest risk."
    },
    {
      "text": "If you look at really high risk individuals, we are really watching them and we're taking care of them and we know what the high risk means, but largely it means older people, especially older people, senior citizens that have a tremendous... They have a problem. If they have a heart problem, if they have diabetes, if they have any kind of a problem, they're much more susceptible. We're all watching that very closely. We've learned a lot over the last number of months."
    },
    {
      "text": "In the past four months, we've conducted over 25 million coronavirus tests and distributed over 1.5 billion pieces of personal protective equipment. America's better supplied and more prepared to reenter then I would say just about any other place. You look at what we've done with ventilators. We're now making thousands a week of ventilators, very big, expensive, complex equipment, and we're sending them to other countries and we're all stocked up. Our country is totally stocked up."
    },
    {
      "text": "Everybody has their ventilators at maximum they can use, but we are sending them to other countries. The nice part, and I say it a lot because I think it's pretty amazing, when we came here you had very few ventilators in this country. By the time we started not one person that needed a ventilator, didn't get it. Everybody that needed a ventilator got a ventilator. There wasn't one instance anywhere in our country. We stocked up those shelves. The cupboard was empty and we filled up the cupboards."
    },
    {
      "text": "In the past four months tremendous things have happened, but I think probably the biggest thing of all is the knowledge that we've gained of this disease, of this plague, of this virus. Call it what you want. To help small businesses survive the shutdown I approved over $670 billion for the Paycheck Protection Program. And Steve that's been a tremendous success. And we're talking with Democrats about doing something further now, but the numbers, the way they're coming in, it's been really incredible."
    },
    {
      "text": "So we're able to spot it, but we're here to help businesses and to help people. To date we've processed over 4.6 million small business loans saving and supporting an estimated 50 million American jobs. Jovita, that's incredible. The small business owners that we have with us this afternoon all received the PPP loans and now their businesses are under the road to recovery and they're doing really well. We have a lot of businesses that are doing really well."
    },
    {
      "text": "We're talking about a V-shape, we're almost like an eye shape, I is straight up and down, but I talked about V-shape and a lot of people disagreed with me, not everybody, but a lot of very smart Wall Streeters were disagreeing. Now they're pretty much coming on board saying it looks like it could be a V. So, a V is the thing we were shooting for and it looks like that's what we've got. I want to thank our people and my representatives for their decisive actions. Last month we added a record 2.5 million jobs."
    },
    {
      "text": "It's the highest in the history of our country in one month. That's the highest number of jobs. 2.5 million, the Dow rose above 26,000 points. We saw the largest surge in retail sales ever recorded. Next year is shaping up to be one of the greatest years in the history of our country from an economic standpoint. I truly believe that. I think we're going to have a great third quarter. We're going to have a great fourth quarter. And next year is going to be a phenomenal year."
    },
    {
      "text": "I believe that NASDAQ actually set the record during a pandemic. NASDAQ just said they broke their record. Larry, is that a correct statement? So it was higher than even before. it's an amazing achievement. After I was elected president our country added more than seven million jobs, 12,000 factories and trillions of dollars of wealth. We created nearly 9,000 opportunity zones and African American, Asian American and Hispanic American unemployment, and poverty reached all time lows."
    },
    {
      "text": "We had the greatest employment numbers we've ever had. Then we had to turn it off. We saved millions of people by doing it. We did the right thing and now we're turning it back on and the numbers are going up much, much faster than anybody would have thought. It's a great honor to see it. And these two governors, by the way have done a fantastic job. Two very extraordinary men, Nebraska and Oklahoma. We built the strongest economy the world has ever seen before the virus and together we're doing it again."
    },
    {
      "text": "So we did it before the virus. We had to turn it off and now we're doing it again and that's what's happening. So now I'd like to maybe we'll start off with Governor Ricketts and then we'll get to my friend over here. I'll be seeing so much of you in the next couple of days. I'll take you a second. Thank you very much, please. That's called the Super V, right? It's called the V plus. Well, that's where we're headed. But we were headed to great things and then we got hit by the Chinese plague. So that happens too."
    },
    {
      "text": "And things happen that you don't expect sometimes. But we built it once, we're now building it again and it's going to be even more successful in my opinion. Kayleigh, please. So most people have never built a positive economy. We're going to do it twice and the second time it's going to be better than the first. I think Steve, we have a shot at it, right? Okay, please go ahead."
    },
    {
      "text": "When you mention rural broadband, and we're doing that very big for the Middle West and for our farmers and that's a very big factor and as you know, we've started the process already. And I think you're going to be very happy with it. Thank you so much. Appreciate it. Thank you very much. Great job. Thank you very much. Please. That's very nice and we're going to try and get deductions back for your restaurant industry and you can look at that man right over there."
    },
    {
      "text": "He'll be carrying the message, but we're looking for the deductions for entertainment restaurants and you'll get it right back, bigger than before. Okay? Working very hard on that, please. I'm impressed by your 20% number. If that was your low point, you're better than any hotel company that I've seen. We had Hilton and they were at 1%, right? And we had all of the big ones and they were from one to four or 5%. So if you're at 20%, congratulations, that's pretty good. That's great. Great job, thank you."
    }
  ]
}