{
  "speech_id": "217",
  "title": "Donald Trump & Polish President Duda Press Conference Transcript",
  "date": "20200624",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-polish-president-duda-press-conference-transcript",
  "topics": "Foreign Policy",
  "num_segments": 43,
  "content": [
    {
      "text": "Duda of Poland, who has done an incredible job. And I do believe he has an election coming up, and I do believe he'll be very successful. So thank you very much. And all of your representatives, thank you very much for being here. This is the third time that we've hosted President Duda. The First Lady and I also cherish our remarkable visit to Poland three years ago. That was an amazing event. We had an event, because it was a speech, and a lot of people watched that speech."
    },
    {
      "text": "But it was a very historic moment, and an important moment for our two countries. The American and Polish people enjoy one of the world's oldest, strongest, and most enduring friendships. Polish patriots battled by our side to secure American independence. American and Polish warriors fought and died together to defeat the Nazis in World War II. The United States stood shoulder to shoulder with Poland in its courageous struggle against communist oppression."
    },
    {
      "text": "Our bond has been forged in battle, sealed in blood, and strengthened by our shared cultural values. The United States and Poland are united by our firm conviction. That Western civilization has advanced, really and very much advanced I think I have to add, the cause of human progress beyond measure. And that it must be strongly defended, and will at all times be strongly defended. And we will defend it together. In our meeting today, President Duda and I reaffirmed the vital alliance between our nations."
    },
    {
      "text": "Last year, we signed two joint declarations to increase our security collaboration. And we look forward to signing a defense cooperation agreement. Poland recently purchased 32 brand new, state-of-the-art F-35 fighter jets. The best in the world. And Poland is one of only eight NATO members... The others, some of them haven't done so well in terms of what they're supposed to be paying to NATO. I tell them all the time. And we've gotten them up a lot, but not enough."
    },
    {
      "text": "But Poland is one of only eight that is current with the money that they are supposed to be paying. That's the two percent. Two percent is very low number. But we have a large number of countries that haven't paid. They're delinquent. Let's put it that way. They're delinquent with respect to their dues, the money they're supposed to be paying for defense. So the United States is defending a lot of countries. They're delinquent on what they're supposed to be paying. And I never feel too good about that."
    },
    {
      "text": "But I will say, I spoke with the Secretary General. And he said we've done a great job. But I said we haven't done good enough. We haven't done a good enough job. We have secured though, over $400 billion in new pledged defense spending from NATO members, which is something that no other administration has come even close to. I would say they were off by many hundreds of billions of dollars, something the newspaper doesn't like writing about, that the media doesn't like talking about."
    },
    {
      "text": "But we will be only satisfied when all members are paying their fair share. Again, only eight members, plus the United States is paying what is considered a fair share. I also applaud Poland and the Polish people for its devotion to safeguarding their country's borders, very strong borders. And I just left our border, by the way. The wall is moving along rapidly. And our border is about as strong as it's ever been, our southern border. Last year, we were able to add Poland to the visa waiver program."
    },
    {
      "text": "And they wanted that very badly. And we gave it to them because they really deserve it. It's a testament to Poland's vigilant efforts to uphold the rule of law. The United States and Poland have recently signed several longterm contracts for US liquefied natural gas, they're a big purchaser of our energy, to enhance Poland's energy security. And we're working to conclude an agreement that would facilitate Poland's development of nuclear energy plants."
    },
    {
      "text": "Throughout the purchase they are going to be purchasing with one of our very big, very good companies, technology to do civilian nuclear energy. I want to congratulate Poland for its leadership in the Three Seas Initiative, a crucial energy partnership that will provide a reliable source of energy for Eastern Europe. And it will be free from the threat of foreign extortion. Poland understands foreign extortion very well. The Three Seas Initiative relies on fairness, transparency, and mutual benefit."
    },
    {
      "text": "Our nations have also collaborated on protecting our critical infrastructure and technology. That's why we've signed a 5G joint declaration. And Poland is leading the way in Europe by using trusted providers, and provider equipment, and supply chains for its 5G network. And we're working along with them, and they using our companies. The United States and Poland cooperate across the truly wide range of fronts that we're both very much involved in."
    },
    {
      "text": "Here today, is the head of a Polish medical team, very advanced team, very brilliant team fighting the coronavirus alongside of American doctors, Captain Siewiera. Captain. Thank you very much for being here, captain. And we're making great progress. I hear we're making great progress, and we're working together. But we are making great progress on therapeutics and vaccines. Thank you very much. Appreciate you being here."
    },
    {
      "text": "The American and Polish people have been true friends and trusted partners for almost 250 years. We're forever united by our shared belief in family, faith, law, liberty, democracy, and justice. As the old Polish motto goes, we will stand together in the name of God for our freedom and for yours. President Duda, let me express once again, our gratitude for your visit and friendship. We have had a very special relationship."
    },
    {
      "text": "Our alliance is powerful, and a very powerful testament to what free people can achieve together. And I believe that the greatness of our relationship lies ahead. Thank you very much. President, please. Thank you. Ask one to me and one to the President, and that would be great. Steve Holland, go ahead. Well, just to start, as you know, Poland as I've said, many times, Poland is one of the few countries that are fulfilling their obligations under NATO, the particular, their monetary obligations."
    },
    {
      "text": "And they asked us if we would send some additional troops, they're going to pay for that. There'll be paying for the sending of additional troops and we'll probably be moving them from Germany to Poland. We're going to be reducing Germany very substantially down to about 25,000 troops. We actually had 52,000, but we'll be moving it down to about 25,000. Germany's paying a very small fraction of what they're supposed to be paying."
    },
    {
      "text": "They should be paying 2% and they're paying a little bit more than 1%, depending on how you calculate. You could also calculate that they're paying less than 1%, but if you assume that paying 1%, that's a tremendous delinquency. Let's use that word, delinquency. So we're going to be reducing our forces in Germany. Some will be coming home and some will be going to other places, but Poland would be one of those other places, other places in Europe."
    },
    {
      "text": "I think it sends a very strong signal to Russia, but I think a stronger signal sent to Russia is the fact that Germany is paying Russia billions of dollars to purchase energy from Russia and through the pipeline. And I'm saying, \"What's that all about? You're spending billions of dollars to Russia then we're supposed to defend you from Russia?\" So I think it's a very bad, I think the people of Germany are very unhappy about it."
    },
    {
      "text": "I have many friends from Germany and the people in Germany are very unhappy about it. They don't like it, but that's what they chose to do. So they're spending billions of dollars to buy Russian energy and then we're supposed to defend them from Russia. So that doesn't work too well. But Poland has been very, very terrific. In fact, I don't believe Poland is actually accepting any of the energy from the pipeline from Russia. So that sends a signal right there."
    },
    {
      "text": "With all of that being said, we expect to get along with Russia. We expect to get along with everybody, but Germany, they really owe a lot of money in NATO. And this has been going on for many years. When you add it all up, you're probably getting close to a trillion dollars and that's not treating NATO fairly, but it really isn't treating the United States fairly. You know, the United States is a very, is the major participant in NATO. We pay more than anybody else by far, have for many, many years."
    },
    {
      "text": "So we defend Europe. Anybody else by far have for many, many years. So we defend Europe, but Europe also takes tremendous advantage of the United States on trade. Advantage like you wouldn't believe. So we're trying to work that out. And I would imagine they'd like to wait until after the election so that maybe they could deal with somebody other than President Trump. But after the election, they'll just have to pay more. But that's the way it is. Okay? Thank you very much. Please. Speaker 1: () [inaudible :28]."
    },
    {
      "text": "President Duda (Interpreter): () Sir, first of all, I do respect very much both Mr. President Donald Trump and the United States of America. A wonderful, great state, which today is the largest military and economic superpower in the world. And I wouldn't dare say to the President of the United States of America where he should send his soldiers, because this is the decision which is always taken by the United States. This is a very responsible decision. However, I do not deny that I requested Mr."
    },
    {
      "text": "President that he would not withdraw US forces from Europe because the security of Europe is very important to me. From Europe as such, I'm talking about the United Europe, for which the American persons, since the end of the second world war is a huge security guarantee. However, if I'm asked by anybody if I am ready, that Poland receives more US troops in our country, of course I am ready. In 2014, Russia attacked Ukraine, it annexed Crimea, it occupies Luhansk and Donetsk."
    },
    {
      "text": "Before that, it had attacked Georgia. 2014 was a year of huge fears, huge fears, the Baltic States, and very big ones, very considerable ones among the Polish society. President Duda (Interpreter): () Today, the presence of native troops and first and foremost of US troops in Poland demonstrates that Article 5 of the North Atlantic Treaty is treated seriously. And it shows that if anyone wanted to attack Poland, it won't be a soft landing for that entity."
    },
    {
      "text": "That won't pay off for such an aggressor because the strongest army of the world is present and they would help Polish soldiers to defend our borders if such a case arises. 100 years ago, we repelled Russians from Warsaw. In a great battle in 1920, we defeated the [inaudible :23] army Bolsheviks and we drove them back to the east. That was a great victory, but we managed to stop them only very near to war. So at the outskirts of our capital city, we would never want to see that situation repeated again."
    },
    {
      "text": "That is why the [inaudible :38] presence is crucially important to us today and it is a very important security guarantee to us. President Duda (Interpreter): () So I'm very pleased that both within NATO, as well as in the United States and today, that President of the United States understands the history of Europe and he understands the realities in Europe, and that he also understands the situation as it is developing in Europe. So today, this generates peace to my country, it brings security."
    },
    {
      "text": "And thanks to that, Russia, unfortunately, the very strong Imperial ambitions, which have been revived over the last tens of years, I can say, because Georgia was attacked in 2008, thanks to this, those ambitions have been stopped for the time being, at least in this part of the world. And I have no doubt whatsoever that this is also a huge merit of the policy of the United States. I'm grateful for that just like all my compatriots are."
    },
    {
      "text": "I want to add 2014, which the President was talking about, that was a year where Russia had a good time with the United States. To the best of my knowledge, President Obama and sleepy Joe Biden, they were in power. They were the ones that were doing it. This was before us. Hasn't happened with us. And it won't happen with us either. Please go ahead. Speaker 1: () [foreign language :02] President Duda (Interpreter): () [foreign language :]."
    },
    {
      "text": "Speaker 2: () President, you had to cancel your last trip, your last visit to Poland because of the hurricane. Are you planning a new visit to Poland in the near future? And the second question is on COVID. Is there a chance for Poland to participate in the development and early access, both to the vaccine and to the therapeutics? [foreign language :21]. President Duda (Interpreter): () Mr."
    },
    {
      "text": "President, is there a chance that during this cooperation with the United States we'll get an fast access, both to the vaccine as well as to concrete drugs against coronavirus? And we'd like to do it again, as soon as we can. We have an election happening in this country, as you probably have heard. And so I probably won't be able to do it until after the election. But assuming things go well, the answer is a very definite yes, actually."
    },
    {
      "text": "As far as the joining with us on the vaccines and therapeutics, by the way, because the therapeutics to me, if you gave me a choice right now, probably therapeutically, maybe I'd like that even better, but we're working very well on both. I think we're coming up with some great answers. I think you're going to have a big surprise, a beautiful surprise, sooner than anybody would think."
    },
    {
      "text": "But the answer is yes, we will be getting Poland involved, both in terms of helping, but also in terms of taking care of the Polish people once we have the vaccine. But I think we're going to have it very soon. Okay? Thank you. Speaker 1: () [foreign language :27]. President Duda (Interpreter): () Sir, we got involved as a state in the cooperation and also in supporting allies, be it in a symbolic dimension, of the United States in the fight against coronavirus."
    },
    {
      "text": "That is why we have here with us today a Captain medical doctor from Poland. I want to say yes, of course. I'm working on this obvious assumption that by taking part in the research and also by being, in a certain sense, co-creators of the vaccines and therapeutics, Poles will be able to count on these vaccines and therapeutics to be available for it at Poles as soon as possible."
    },
    {
      "text": "So speaking openly, this is also the intention I have in my cooperation with the United States of America, to make sure that these vaccines are available to Poles and to other nations, wherever they will be applied as soon as possible. Okay. Thank you very much. John, please. Well, the Senate Republicans want very much to pass a bill on police reform. We have total cooperation with many different communities, including the police community."
    },
    {
      "text": "They want it very much to happen themselves because there are things that they agree to, that they would like to agree to, and they would love to have it agreed to formally. The Democrats don't want to do it because they want to weaken our police, they want to take away immunity, they want to do other things that you know about as well as anybody in this beautiful field that we set. They want to take away a lot of the strength from our police and from law enforcement generally. And we can't live with that."
    },
    {
      "text": "We can't live with it. This is a great bill, strongly endorsed by, as you know, Tim Scott, who's terrific, who is a terrific man, great Senator, South Carolina. And Mitch wants it to happen, I would like to see it happen. But we won't sacrifice, we won't do that. We won't do anything that's going to hurt our police. The police, we have a record this year on crime, a record positive rating on crime this year, the best."
    },
    {
      "text": "And you hear about certain places like Chicago, and you hear about what's going on in Detroit and other cities, all Democrat run. Every one of them is Democrat run. 20 out of 20. The 20 worst, the 20 most dangerous are Democrat run. We have one city or two cities in particular, worse than Honduras, worse than Afghanistan, worse than Afghanistan. And these are cities within the United States. Democrat run, radical left run. You see what's going on in Seattle, you see what's going on in other places."
    },
    {
      "text": "Seattle, of all places, who would even think that's possible? 20 out of 20. The Democrats want to weaken very substantially our law enforcement and our police. And frankly, they want to defund largely, at least largely. There are some that want to defund and abolish our police, if you can believe that. And we're not letting that happen. So if nothing happens with it, it's one of those things. We have different philosophies. They want open borders, they want sanctuary cities, we don't."
    },
    {
      "text": "As far as your number, your second question, I think that we're going to have a very strong executive order, but we already have very strong. We have the monuments act already, which means 10 years in jail. But I think we're going to consolidate various things. We're going to come out with a very strong executive order. And I should have that by the end of the week, which is fast approaching. We're going to have a very, very, very powerful statement."
    },
    {
      "text": "We've arrested numerous people, as you know, for what took place outside of Washington. In addition, the FBI is investigating hundreds of people throughout the country for what they've done to monument statues and even buildings. So we have very strong laws already on the books and we have a law that's 10 years. It's 10 years. That's a long time. To have fun one- ...years. It's 10 years, that's a long time, to have fun one night."
    },
    {
      "text": "I think many of the people that are knocking down these statues don't even have any idea what the statue is, what it means, who it is. When they knocked down Grant, when they want to knock down Grant, but when they look at certain... Now they're looking at Jesus Christ, they're looking at George Washington, they're looking at Abraham Lincoln, Thomas Jefferson: not going to happen, not going to happen. Not as long as I'm here."
    },
    {
      "text": "As far as Democrats are concerned, I think they could care less whether or not it happens. And I think the American people get it. So we're going to have a very strong executive order and it'll happen very quickly before the end of the week. He's doing very well in Poland, he's doing a terrific job. The people of Poland think the world of him. And, by the way, Mrs. Duda, Who is a terrific woman, terrific woman who we've gotten to know also through our various travels and meetings."
    },
    {
      "text": "But they think the world of him and I don't think he needs my help. I'm honored that this is a day that's, I guess, just before your election, I'm honored but he will do very well with or without us. He's going to have a great success and Poland is going to continue on. They're doing incredibly well as a country. Okay, please. Thank you. President Duda (Interpreter): () Thank you very much Mr. President. Best regards to your wife."
    },
    {
      "text": "[foreign language :56] Well, I think you can and we also are working with Russia right now on an arms treaty which is a very big thing, nuclear arms specifically, but we're working very much and I think I can say, Mike, we're doing very well on that. We're two countries that want to see it happen and we're working on other things with Russia. We have a very good relationship, we have our ambassador over there right now who will be attending certain festivities and that's a good thing."
    },
    {
      "text": "And I think that's frankly a good thing for Poland also. Likewise, we're going to be having very important dignitaries at your parade. You're going to be having a very big event soon and we're going to be in August and we're going to have people representing the United States at a very high level. And that's very important to us also. Okay. Please. Thank you all very much. We will see you soon. Thank you. Thank you very much. [crosstalk :52]"
    }
  ]
}