{
  "speech_id": "222",
  "speaker": "Trump",
  "title": "Donald Trump Speech to American Workforce Policy Advisory Board June 26",
  "date": "20200626",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-speech-to-american-workforce-policy-advisory-board-june-26",
  "topics": "Economy, Education, Social Justice, Government Policy",
  "num_segments": 18,
  "content": [
    {
      "text": "We're making a lot of progress with the whole situation that came in from a place called China as you probably know, you probably see, but we have a little work to do and we'll get it done. We're having some very good numbers coming out in terms of the comeback, the comeback of our nation and I think it's going very rapidly and it's going to be very good but right now we're in that process of building and it's an honor that you're with us today, we very much appreciate it."
    },
    {
      "text": "I'm delighted to welcome members of the Workforce Policy Advisory Board and I want to thank Ivanka she works very hard on this Board. She works very hard to get jobs and it's made in the USA and jobs in the USA. I saw a group of your people yesterday having to do with ships, you're involved in that partnership and it's fantastic what they're doing in Wisconsin. It was really a great day."
    },
    {
      "text": "The Secretary of Treasury is with us and he's worked very hard and I think he's got some very good things to say and some pretty big news and Commerce Secretary Wilbur Ross, Secretary of Labor Gene Scalia, Secretary of Education Betsy DeVos and Small Business Administrator who has definitely kept busy, Jovita, where's Jovita? Jovita? Good. Jovita Carranza. Thanks also to Iowa Governor Kim Reynolds who has done terrifically. Kim? Hi Kim, nice to see you."
    },
    {
      "text": "Thank you very much and Eric Holcomb, governor of Indiana and we always recognize Eric because he's ... How tall are you Eric? [inaudible :45] pretty tall guy, right? But we have one that's a little taller. You know where that is, Alaska? You know that, right? You're doing a great job, we appreciate it as well as the CEOs who have signed our pledge to American workers, Marillyn Hewson, thank you very much of Lockheed-Martin. Sebastian Thrun of Udacity and Ginni Rometty of IBM."
    },
    {
      "text": "I want to thank you all, you've been really here from the beginning. Very much from the beginning and we appreciate it very much. Together we built the greatest economy in history and literally in the history of the world, the greatest we've ever had, the greatest the world has ever seen and now we have to bring it back because we had a close in order to save millions of lives."
    },
    {
      "text": "We added 2.5 million jobs last month which was incredible number, the largest monthly increase in history and more than double the previous record, so we're bringing it back. We had the greatest ever and we had to close it and now we bring it back and we start off with 2.5 million jobs in one month. I would say that's pretty good Marillyn, right? That's the highest ever done and then likewise retail sales surge by nearly 18% last month. That was the biggest jump ever recorded, so that's great."
    },
    {
      "text": "The stock market has seen you go back a week, one week. So the best 50 days in its history, best 50 day increase in the history of the stock markets. Our pledge to America's workers has secured commitments to over 16 million job and training opportunities from employers nationwide and some of the employers are with us and they've been fantastic. I want to thank the American people for doing such an incredible job. They understand what's happening and they see how fast we're turning it around."
    },
    {
      "text": "I want to just state that this is Americans of all backgrounds that we're talking about, to have the chance we want to get them the chance to learn and to build a successful career. We want to train Americans and we want to hire Americans so we're training American and we're hiring American."
    },
    {
      "text": "Before the pledge and this is a very big factor, we have a problem that has about 22 different names, but I'll just call it the plague but before the plague struck, we had the lowest African-American and Hispanic-American, Asian-American unemployment ever. We've had the most jobs we've ever had, almost 160 million jobs. We've never been in a position like that. Women were thriving."
    },
    {
      "text": "Best numbers ever and since my election, more than half of those jobs, more than half, first time that's ever happened went to women but now we want to get that all back, the African-American group got hit very hard. The Hispanic-American group got hit very hard. Essentially all groups got hit hard but now it's all coming back. To further expand opportunity I'm taking a bold action to reform the federal workforce today."
    },
    {
      "text": "I'll sign an executive order that directs the federal government to replace outdated and really outdated ... It's called degree-based hiring with skill-based hiring so we want it based on skill. The federal government will no longer be narrowly focused on where you went to school but the skills and the talents that you bring to the job."
    },
    {
      "text": "We want that skill to be there, we want it based on merit, we've looked at merit for a long time and we've been able to get that done and today's signing is a very, very important one. I think maybe before I sign I'll ask Ivanka to say a few words and then we'll go around a little bit. We'll pick a few people and then we'll sign and we go back to work. Thank you very much, Ivanka. Thank you very much honey. Great job. Really has been. It's been a labor of love. Ivanka loves helping people. It's a wonderful thing."
    },
    {
      "text": "Marillyn, how about starting with you? Well you've done a great job and I got to see it again. I mentioned it was so impressive what I saw, the whole group yesterday. It was really great to be there and I didn't know you had a big chunk of that one but you've done very well with it so we appreciate it. Please Sebastian. That's a great story. It's a great story, amazing story. Ginni, please. Thank you. Thank you. Thank you very much Ginni. Good job. Eric? Go ahead please. And Indiana's doing very well I'm hearing?"
    },
    {
      "text": "Good things. That's great. That's great. Great job. Thank you very much. Kim? All right, and we see it now Kim. Next year is going to be we think amazing actually. It's going to be an amazing year. Larry? Would you like to say something? That's a great number. Good. Good taste. That's great. That's great, and I'm very happy, what you said about early next year. I think next year is going to be an incredible year. Thank you very much Larry. Wilbur, would you like to say something? Thank you very much. Thank you. Gene, please."
    },
    {
      "text": "Thank you Gene very much. Appreciate it. Steve, please. That's great Steve. Thank you very much. Anybody else would like to say something? Anybody? Anybody? This is your chance, go ahead please. Speaker 13: () Mr. President I just want to say as your domestic policy chief what an extraordinary day today is and here's why. It's not just the work of this council and the leadership of Ivanka, it is the executive order that you are about to sign that completely resets the playing field."
    },
    {
      "text": "Your signature that is recalibrating the work force away from being degree only to skill set is transformational and the opportunity for you to fight for all Americans, I think about Tony that Ivanka talked about, that Sebastian talked about from Udacity, from a truck driver to a software engineer, next potentially into the federal government because of this executive order that is focusing on skills rather than degrees. Congratulations and thank you for your leadership. It's extraordinary. Thank you."
    },
    {
      "text": "Thank you very much. Anybody? Jovita. Thank you very much Jovita. Thank you very much. Speaker 15: () Mr. President. Please. Speaker 15: () I just appreciate your unrelenting focus on creating opportunity for all Americans and that begins with opportunities in education and I so appreciate your leadership there and it's been a privilege to be part of this Ivanka and Secretary Ross, thank you for your work here in policy and action as Governor Reynolds said and thank you for your leadership. Choice."
    },
    {
      "text": "How is that going, choice, right? Speaker 15: () Yes. That's what we want. Please. I agree with you 100% I must say. I do. Okay? Why don't we sign and this is a big deal. Congratulations to everybody in the room. This means a lot. Okay. We'll do that for Marillyn and we'll take this. Thank you very much. Okay. That's very good. We have pens for everybody. All right, Page Two. Thank you very much. Well thank you all very much. We appreciate it. This is really an important day for a lot of reasons but this is one of them."
    }
  ]
}