{
  "speech_id": "226",
  "title": "Donald Trump Radio Interview Transcript: Admits Going to Bunker During Protests, But Was for an ‘Inspection’",
  "date": "20200603",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-radio-interview-transcript-admits-going-to-bunker-during-protests-but-was-for-an-inspection",
  "topics": "Economy, Social Justice, Healthcare, Foreign Policy",
  "num_segments": 38,
  "content": [
    {
      "text": "Well, thank you very much, and congratulations on 10 years on radio. Wow, that's pretty good. I remember when you were one day on radio. It's been a long time, but that's great job. You're doing a great job, Brian. That's right. That's right. No. Not at all. If you look at what happened in Minnesota, they were getting decimated, and after three days of watching it, I demanded that the National Guard be utilized, and in one day, it was over."
    },
    {
      "text": "In fact, they got there at a certain time in the late afternoon, and by the time they finished, it was, I always say a somewhat sarcastically, but the safest place on earth to... and Minnesota was really, really having a hard time, and we took care of it. The governor is a nice man, and he was not using enough, and he was... You saw the police were running in Minneapolis, and they were running away from their precinct, which is something I've never seen before."
    },
    {
      "text": "Do you notice that all of these places that have problems are not run by Republicans, they're run by Liberal Democrats, so there is something into that philosophy, and yet they're also the ones keeping everybody locked up in their apartments and their homes for too long a period of time, so it's very interesting how that changes, but no, the National Guard, we could solve that problem in New York, and in fact, if they don't get their act straightened out, I will solve it. I'll solve it fast."
    },
    {
      "text": "Well, you may, but you still had a lot of people, and they're violent people in many cases. You have protesters, but you also have anarchists and looters. A lot of people that are bad people. A lot of bad people. We have a lot of proof and information and proof. You'll be seeing it in time to come where they're delivering rocks and stones to certain locations and dumping them, so they have... That's their ammunition, and that hurts people very badly, including National Guard people or even military people."
    },
    {
      "text": "But Washington is in great shape. We called out the National Guard after the first night, which was a little bit rougher, but then after that, we called up, and we have, I jokingly said, a little bit jokingly maybe, it's one of the safest places on earth. We had no problem all last night. We had substantial dominant force, and we have to have a dominant force. Maybe it doesn't sound good to say it, but you have to have a dominant force. We need law and order. Well, it was a false report. I wasn't down."
    },
    {
      "text": "I went down during the day, and I was there for a tiny little short period of time, and it was much more for an inspection. There was no problem during the day. The problem, I saw Leland got whacked pretty good, but that was during the night. This problem, these problems are during the night, not during the day. I go down, I've gone down two or three times all for inspection. You go there... Someday you may need it, but you go there, and I went down, I looked at it, it was during the day. It was not a problem."
    },
    {
      "text": "I read about it like a big thing. There was never a problem. We never had a problem. Nobody ever came close to giving us a problem. The Secret Service does an unbelievable job of maintaining control in the White House, and beyond the Secret Service, we have a lot of other great people out there, including the DC Police, and then of course, on top of that, after I saw the one evening, which was a little rough, and it was certainly a rough on Leland I think more so than anybody else, we brought in the troops."
    },
    {
      "text": "Nope. They didn't tell me that at all, but they said, \"It would be a good time to go down, take a look because maybe sometime you're going to need it.\" I've been down, let's see, that would be number two, two and a half sort of because I've done different things, but two and a half, but I looked, I was down for a very, very short period of time, very, very short period of time. I can't tell you who went with me, but a whole group of people went with me as a inspecting factor."
    },
    {
      "text": "I was back up, and Brian, it was during the day. It wasn't during the night. I think they reported during the night. During the night, maybe someday it makes sense. During the day, you have tremendous numbers of people. We didn't even have protesters, or if they did, it was a small crowd. There's so much fake news going around, Brian, you have no idea. Maybe you do actually have an idea. Well, my response is simple: Most religious leaders loved it. I heard Franklin Graham this morning thought it was great."
    },
    {
      "text": "I heard many other people think it was great. It's only the other side that didn't like it, the opposition party as the expression goes. They burned down the church the day before. I heard how nice and wonderful the protesters were over there. Really? Then why did they burn down the church today before... They burned down a big section of it. Fortunately, they were able to catch it in time. This is a church built at a similar time as the White House. Madison was your president. He was number six, I believe."
    },
    {
      "text": "Madison was your president, and he was the first president to enter and go to that church. Now, when I said go to the church, I didn't know protesters or not. Nobody tells me that. They say, \"Yes, sir, we'll go to the church.\" We walked over to the church. It was very fast. I think it was very symbolic. I did hold up a Bible. I think that's a good thing, not a bad thing, and many religious leaders loved it. As to..."
    },
    {
      "text": "If you read Mollie Hemingway, who I know you're a fan of and I'm a big fan of, she wrote a piece that it was all fake news. There's so much fake news. Most news is fake. They're corrupt, and they're fake, the lamestream media. If you read the story and if you read what Mollie Hemingway said, who's a real reporter, a great journalist, you'll see that that story was fake. They didn't use tear gas. They didn't use... They moved them out. Now, when I went, I didn't say, \"Oh, move them out.\" I didn't know who was there."
    },
    {
      "text": "I figured I was going to walk over the church very nearby. If you read the Mollie Hemingway piece, you'll get the real story, but most religious leaders loved it. Why wouldn't they love it? I'm standing in front of a church that went through trauma, to put it mildly. I mean, the whole basement, a big part of the basement was burning. It's very lucky that church didn't burn down. That's a very important church, so I haven't heard- I haven't heard what you told me."
    },
    {
      "text": "No, they told me it was boarded up, and I said, \"That's all right. We'll stand by the church. We won't go inside.\" It had received a very bad burning. I would have been able to go inside if I wanted to, but it was boarded up. The whole building was just about boarded up, but I would have been able to go in, but there's no reason for it. It was smoke, a lot of smoke and a lot of damage, actually, a lot of damage, but it was confined to one area. The fire itself was confined to one area."
    },
    {
      "text": "But Brian, the church leaders loved that I went there with a Bible. I mean, take a look at Franklin Graham, so respected, and so many others. Take a look at Robert Jeffress. These are all people you know. They thought it was a great- ... symbol, and I thought it was a great symbol, but the fake news makes everything look bad, no matter what you do. We did a great job on ventilators. We're giving them now to countries all over the world, we're making them. When I started, we had practically none."
    },
    {
      "text": "The cupboards were bare. The Obama administration left us practically nothing. You don't hear those stories. They don't write about that. We tested number 16 million yesterday, much more than anybody else. You don't hear that we've done well in testing. They always say, \"Well, why not more?\" and yet Germany is at 3 million. We're 16 million. We have incredible testing now. We've done a great job, but we don't get credit for it, but hopefully, the people understand."
    },
    {
      "text": "[crosstalk :21]- Well, I think it's a very sad problem. As you know, as a Republican, I'm doing very well with African Americans and with the vote, in polls and everything, especially I've been... I haven't seen one very recently because you had the plague come in from China, so that changed things up, but we had the best economy ever, we have the best numbers for African American on employment and unemployment in history, best home ownership, best everything."
    },
    {
      "text": "We had the best numbers in everything, not only African-American, but the African American numbers were great. Well, I think you have to- ... get better than what they've been doing. I mean, obviously, that was a terrible thing. I've spoken about it numerous times in various speeches. It's interesting."
    },
    {
      "text": "I spoke about it when we launched a very successful rocket, a tremendous program that culminated on that day, and now, obviously, it goes on from there, but I then made a speech, and it was a speech about the rocket, and I devoted at 25% of the speech, probably, to what happened, or more, to what happened with respect to George, George Floyd, and it was... Then you... Listen to this. \"He doesn't talk about George Floyd.\" The rocket went off."
    },
    {
      "text": "I then made a speech, and I talked about George Floyd, but they said, \"He didn't talk about George Floyd.\" Half, maybe even almost half of the speech, but a large portion of the speech was devoted exactly to that. With the media, basically, no matter what you do, it's never going to be good enough, but the people understand it, and that's one of the beauties to social media. I mean, I would love- ... not to even bother with social media, but I'm able to get my word out beautifully by social media."
    },
    {
      "text": "Fortunately, you use social media too. But we have to get- ... the word out. Look, we have to... Brian, we have get the police departments, everybody has to do better, has to do better. This is a longterm problem. This didn't happen today. This happened, I mean... A guy like Sleepy Joe Biden was in there for 43 years. Then he says, \"I think we should do this.\" I saw today he took his mask off for the first time in a while. I haven't seen his face for a long time."
    },
    {
      "text": "He said, \"I think we should do this,\" or, \"I think we should do that,\" and actually, then he started speaking through the mask again. He feels comfortable with a mask on, I think, even though there was nobody anywhere near him, which is interesting, but- ... he made a statement about what he should do. I said, \"He's been there for 43 years. He was vice president for eight years. He didn't do a thing.\" His crime bill was a- ... disaster. Well, you see, he was written... That speech was there. He didn't say that."
    },
    {
      "text": "He repeated the words. That's all. That speech was written for him because he doesn't speak like that. But here's the thing. He did a crime bill that was a disaster. What he did with Clarence Thomas was a disaster. It was a disaster, the way he treated Clarence Thomas, a black man, a great justice as it turns out, but go back to those horrible days the way he treated Clarence Thomas. They write books about it. There was nobody worse than Biden. Now, he's not the same Biden."
    },
    {
      "text": "He's about half, maybe less, but the fact is that he doesn't say that. They write. He's surrounded by... The Democrats have bad policy, in many ways, they're bad politicians because their policy, open borders, take away everybody's guns. They want to take your guns away, except now more people bought guns in the last three, four days than they have it a- ... long time because when they look- ... out on the streets- Well, they want- ... security, and they want- ... safety. That's right, and the- ..."
    },
    {
      "text": "Democrats want to take the guns away. Okay, and I have- ... other polls where I'm winning, and you've seen them too, I guess, but I have polls. Just like last time, I was losing to Hillary in every state, and I won every state. I won Michigan. I won Wisconsin. I won places that they didn't even think were pollable. They didn't even want to go bother. We have tremendous support. I've seen many polls. CNN, didn't CNN just to have a poll, which they didn't want to use, where I was winning every single swing state?"
    },
    {
      "text": "I think you've seen that. I had- ... another poll yesterday... Yeah. Two weeks back. I had another poll, and CNN didn't want to use it, so they used another poll where mostly Democrats were polled. Take a look at who they're polling if they poll anybody because I don't even think they go out and poll. I think they sit at a desk and say, \"Give this number, give that number.\" That's what happened the last time."
    },
    {
      "text": "The polling was ridiculous, other than two or three polls, which I do use and which I'm doing very well with. But I saw another poll where I'm winning every swing state, substantially. Why wouldn't I? I built the greatest economy we've ever had. I built the greatest economy in the world in a fairly short period of time, three and a half years. Then the plague came in from China. They shouldn't have let it happen. Not right. It came in from China."
    },
    {
      "text": "In fact, I see today, there's a big article that they weren't very transparent or forthcoming to put it mildly, the stall, they call it- ... but I built this great economy, and I'm building it again, Brian. By the time of election, I believe the economy will be doing phenomenal numbers, big job increases, big GDP increases, and that'll be before the election. I also think by the end of the year, we'll have a vaccine. We're doing very well. I just had a meeting yesterday."
    },
    {
      "text": "I think we're going to have therapeutics, and I think we're going to have cures, so we're going to be in very good shape, but, you know... Right now, by the way, the numbers came out today, and they were much better than anybody would have thought. The stock market is booming. The stock market is at 26,000, almost 26,000 right now, the Dow, and who would think that because- ... people know, and we're going to have a great year next year. It's going to be a phenomenal year."
    },
    {
      "text": "We're going to have a very good third quarter. We're going to have a phenomenal fourth quarter. If I'm heading in that direction, I think we're going to be very hard to beat, frankly, because Sleepy- ... Joe turn- ... off immediately. I do. Yeah. Well, look, helped us with the oil industry, which was good for him too, but we got it up, and now we're going to save millions of jobs in Texas and North Dakota and other places, Oklahoma, with millions of jobs. I mean the oil now is sustainable."
    },
    {
      "text": "I've been, it was down to zero, which would have ruined... We would've lost 5 million jobs, but no, it's not a question of what's he done. It's a question of common sense. We have a G7. He's not there. Half of the meeting is devoted to Russia, and if he was there, it'd be much easier to solve. He used to be, it used to be the G8, and Obama got taken over to cleaners."
    },
    {
      "text": "I mean, Obama had his pockets picked, and as you know, Putin did something that he shouldn't have done because he didn't respect Obama perhaps, and Obama got upset, and the United States said, \"We don't want to be here. Putin's going to be there.\" The problem is many of the things that we talk about are about Putin, so we're just sitting around wasting time because then you have to finish your meeting and somebody has to call Putin or deal with Putin on different things. I say, \"Have him in the room."
    },
    {
      "text": "Have him in the room.\" It used to be the G8 from a... and I don't say deserving or non-deserving. I say, common sense. Get things done. I want to have a nuclear pack, just a safe nuclear because nuclear is the single biggest problem the world has. Single biggest problem, the power, and we have- ... them, and we have more than anybody. We have more than anybody. China's a very big problem. We did very well with China- ... but then they sent us the plague. Excuse me? The trade deal is done- ..."
    },
    {
      "text": "but the trade deal got finished and the ink was in dry when the virus floated over from China and started killing everybody in the world, not just here, in the whole world. You look at Brazil, look at these countries, look at what Italy went through and Spain and France and all of them. I mean, the whole world, a 186 countries. When you say is the trade deal done, yeah, the trade deal's done. It was a great deal. China was having, before the plague, China was having the worst year they've had in 66 years."
    },
    {
      "text": "That's because of me, and I'm not proud of that. I'm just saying that these presidents let China pick our pockets, and I did a great trade deal, but you know what, I'm not excited about anything with respect to China right now because of what happened. They could have sealed it. They could have closed it off. I ask this. Why is it Wuhan... It came out of Wuhan. Why is it that it didn't go to China but it went to the rest of the world? It went to Europe. It went to the world. It went to the United States."
    },
    {
      "text": "Came out of it, but it didn't go to Beijing. It didn't go to other parts of China. What's that all about? How come they let it go out to the world, but they didn't let it go into China? That's a little strange deal going on there. I just do it. People hit me. I hit back. I fight. I've always felt that about Scarborough."
    },
    {
      "text": "A lot of people in Florida felt he got away with murder, I think, so I've always felt that that's not a uncommon story if you look at it, so we don't have to waste time on it, but I've always felt that he got away with murder. That was my feeling, a very strong feeling, and I do feel it. As far as Chris Cuomo, no, I just report on his ratings. His ratings are terrible, unlike your ratings at Fox & Friends where you're fantastically well. Thank you, Mr. President."
    },
    {
      "text": "I think I help you a lot, but you have three great people, including you. You used to be a- ... six. Then you got to be a seven or eight, and now you're approaching the nine territory, but those other two are great. They're great. That's right. That's right. There is. That's true. Thank you very much, Brian. You take care. Congratulations on 10 years. That's fantastic. Thanks a lot."
    }
  ]
}