{
  "speech_id": "231",
  "title": "Donald Trump Roundtable Press Conference with Law Enforcement",
  "date": "20200608",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-roundtable-press-conference-with-law-enforcement",
  "topics": "Social Justice, Government Policy",
  "num_segments": 23,
  "content": [
    {
      "text": "Thank you very much. It's a great honor to have some of the true leaders in our country of law enforcement. And that's what they've done. They've enforced the laws. They've done a fantastic job of it. We have among the best numbers we've ever had in terms of recorded history certainly, but this has been a very strong year for less crime. Let's put it that way, less crime. And there's a reason for less crime. That's because we have great law enforcement. I'm very proud of them. There won't be defunding."
    },
    {
      "text": "There won't be a dismantling of our police. And there's not going to be any disbanding of our police. Our police have been letting us live in peace. So we want to make sure we don't have any bad actors in there. And sometimes you'll see some horrible things like we witnessed recently. But 99, I say 99.9, but let's go with 99% of them are great, great people. And they've done jobs that are record setting. Record setting. So our crime statistics are at a level that they haven't been at."
    },
    {
      "text": "And I just want to go around the room and just ask each one of the folks to say hello and tell a little bit about themselves and the success they've had. And then we're going to go and have a meeting as to where we go from here. Okay. Thank you. Please. Press that button, yeah. Thank you, Patrick, very much. I appreciate it. Ashley, please. Well, thank you very much, Ashley. You're doing a great job in Florida. I get the word. You're doing a great job. Thank you. Thank you. Please. Thank you, Rob. Great job. Thank you."
    },
    {
      "text": "We've known each other a long time now. Really good. Jared, please. Thank you, Jared. Thank you. My star. Speaker 6: () Thanks so much, Mr. President, and thank you to all the law enforcement individuals in the room and for the work that you do on a daily basis. When I saw what happened with George Floyd, it really made my heart sunk. It hit me to my core, as well as a lot of the other lives that have been lost."
    },
    {
      "text": "As an African American, I live in Southeast DC and live in a paradox where my wife is sometimes scared to walk the streets by herself. But then in the same vein, as an individual, I've also had the fear of being in certain neighborhoods or driving certain types of cars as an African American, just because of my relationship with the police. And there's a lot of African American males across the country that have stories like that, that they can share."
    },
    {
      "text": "Speaker 6: () But I think law enforcement is there to kind of thread that needle and help us and protect us, and not to be demonized. And it's been very, very tough to see what happened and what's been impacting a lot of families across the country. But I think if we want real reform, like real reform that can change communities, it starts with law enforcement and partnering with them, not demonizing."
    },
    {
      "text": "Because I have a lot of law enforcement individuals in my life, and they're some of the greatest people I've ever met. And we can't let some bad apples represent something that's a core of any community. And so we look forward to continuing to partner with you all to find solutions because that's one thing I've learned working under president Trump's leadership, that we're not just about talk, we're about action, and communities leaning on your leadership, sir, for you to take action."
    },
    {
      "text": "And it's been a honor to serve, and I look forward to the discussion. Great to have you with us. Great job you're doing too. Thank you. Please. Speaker 7: () Good afternoon, Mr. President, Mr. Vice President. Again, thank you for putting this important meeting together. Probably one of the most important meetings in our profession in my 43 years as a law enforcement officer. And I won't echo some of the things that have been said about the horrific incident that brought us here today. But what I will say is this."
    },
    {
      "text": "What it's going to take to make the appropriate changes in law enforcement is courageous leadership. And there are countless courageous leaders in law enforcement across this nation that are willing to step up to the plate and look at new ideas to make our profession better in how we connect with our community. And I think one of the most important things, Mr. President, that you have done is you've listened to IECP and something we've wanted and asked for for two decades."
    },
    {
      "text": "And that's a national commission on law enforcement in the administration of justice. And I want to thank you for establishing that because now more than ever, that commission is incredibly important. So thank you. That's great. Thank you very much. Mr. VP, please. Thank you, Mike, very much. Speaker 9: () Mr. President, it's an honor to be here with you."
    },
    {
      "text": "Obviously I've been part of your team for now more than two years, taking over the Domestic Policy Council just about a month ago, but running the Office of American Innovation before that. What I want to say very briefly is this. Three months ago, on this side of the white house, we gathered almost 1,000 black leaders from around this country who were celebrating Black History Month. And in that celebration, you talked about having the lowest unemployment, the lowest poverty rate this country had ever seen."
    },
    {
      "text": "It was a remarkable feat that deserves such great celebration. But here we are three months later, and it is a different time for our country. But on Friday, we had another major announcement, two and a half plus million jobs created in a time of such darkness and destruction."
    },
    {
      "text": "Speaker 9: () And it reminded me that while we are in the midst of the great American comeback, while we are going to be renewing and rebuilding and restoring this country, that none of it is possible without our law enforcement, that none of it is possible without real safety and real security in this country. So really for the great American comeback, with your leadership, Mr."
    },
    {
      "text": "President, as we cut poverty rates again, and we slash unemployment again, and we build a country where every man, woman and child has a real shot at the American dream, it begins today. I believe it begins with the people in this room. It begins with a law enforcement that is supported, that is stood up and that I know you and the vice president, all of us stand beside as we move forward. So thank you so much. It's an honor to be here. Great job. Speaker 10: () Mr. President, thank you very much."
    },
    {
      "text": "I'm really pleased to work very closely with folks like Sheriff Childress and Attorny General Cameron and Attorney General Moody, who took their time to come up here to be a part of this very important conversation. As somebody who has law enforcement in my family as well, it's a very important conversation. And again, everybody that I've talked at the elected leader level, but also at the rank and file level, was just appalled by what happened in Minneapolis."
    },
    {
      "text": "But out of that comes a commitment, a redoubling to make improvement across the country at the state and local and federal level. And really pleased to have such strong partners in the Inner Governmental Affairs office to work with to help make that progress under your leadership, sir. Thank you. Thank you very much. Mark. Thank you, Mark, very much. Thank you very much. You're doing a great job too. Appreciate it. Bill. Thank you, Bill. Well said. Thank you very much. And Daniel, I got to know Daniel in Kentucky."
    },
    {
      "text": "He is a superstar in the making, if he's not already a superstar, but he had an incredible race and we watched it together. And congratulations on that. That was some evening, right? Thank you very much. Thank you, Dan. Proud of you. So it's a very interesting because, as you'll see in some of the papers, they want to end the police department quote, end the police department, in Minneapolis. End it. What does that mean? End it. They had a couple of very rough nights and they had a third night which was not good."
    },
    {
      "text": "They abandoned their police precinct, something I've never seen before. You had a mayor that asked them to abandon. Now, they've abandoned the mayor, it looks like. Very... The opposite of far thinking. You say far thinking. Is that far thinking? So they had three really bad nights. And then we, I insisted on bringing in the National Guard, and all of a sudden it was like magic. It was in good shape. They helped with the police, but the police were told to leave their post. Nobody's ever seen anything like that."
    },
    {
      "text": "But we insisted on having protection for that great city or that great state, great state, Minnesota. What a horrible thing. That's where it started. And we ended very strong there once we got involved. We got involved right from the white house, and we weren't going to let that happen to that city or that state. And I think a lot of people took notice. The police are doing an incredible job. As I said, their records are being broken in terms of lack of crime, lack of crime."
    },
    {
      "text": "We had a tremendous year, tremendous 12 months, tremendous 36 months, I think you can say during the term. Then you add six months to that. Three and a half years, it's gone by very quickly, but we've had a tremendous record on crime. And we're going to work and we're going to talk about ideas how we can do it better and how we can do it, if possible, in a much more gentle fashion. A thing like happened should never have happened. And plenty of things shouldn't have happened."
    },
    {
      "text": "But we can't give up the finest law enforcement anywhere in the world. There's nothing like it. Few people, few countries have our record, and I'm talking about the positive record. So we're going to be discussing some ideas and some concepts and some things, but we won't be defunding our police. We won't be dismantling our police. We won't be disbanding our police. We won't be ending our police force in a city."
    },
    {
      "text": "I guess you might have some cities that want to try, but it's got to be a very sad situation if they did, because people aren't going to be protected. These people do a tremendous job of protecting the citizens of our country. And that's what they're paid for. But whether they were paid or not, that's what they do. And somebody put it very beautifully before where they said they protect people, risk their own lives for people they've never seen before, people, in many cases, they don't know."
    },
    {
      "text": "You're protecting the lives of people you don't know. And it's an incredible thing. It's a great honor to be with you all. And we'll have a little discussion now. Thank you all very much for being here. Speaker 15: () President. Mr. President, can we just ask you a question? Mr. President, do you believe that kneeling is peaceful protest? Speaker 16: () Let's go. Kevin, let's go. We're leaving. Kevin, we're done. Let's go."
    }
  ]
}