{
  "speech_id": "233",
  "speaker": "Trump",
  "title": "Transcript: Donald Trump & Mike Pence Meet with Health Insurance Amid Coronavirus",
  "date": "20200310",
  "url": "https://www.rev.com/blog/transcripts/transcript-donald-trump-mike-pence-meet-with-health-insurance-amid-coronavirus",
  "topics": "Healthcare, Economy",
  "num_segments": 8,
  "content": [
    {
      "text": "... In our country, probably the biggest companies in the world. I can't imagine being much bigger, but these are the great health insurance companies and I think tremendous progress is being made. They're willing to do things for the people and their customers and probably in a true sense beyond their customers that normally I don't think they'd be doing. I want to thank them and they'll ask Vice President Pence maybe to give us a little update to see where we are. That's true, very true."
    },
    {
      "text": "We are working very closely with the cruise line industry and very, very closely. They're taking very strong steps in terms of people going on and going off, but they're spending a lot of money and they are working very hard and we're going to be helping that industry. Likewise, with the airline industry, they're taking very, very strong steps for people coming into our country, even getting off the planes, so we are working very closely with them. We're helping them."
    },
    {
      "text": "They're two great industries and we'll be helping them through this patch. So far, I think it's been going very well. You know all about the big ship that came in yesterday and that's going along incredibly well. Working with the state of California successfully, very successfully. We're also with Canada and with UK, so the UK is taking their people, their citizens back and Canada is about 600 people."
    },
    {
      "text": "They're coming back and they're being met and brought to planes and being brought up in a very, very dignified fashion back into Canada. We appreciate all the help we've had in that and that's working out very well. With that, I might just ask a couple of folks if you'd like to make a statement on behalf of the industry perhaps. Would you like to make a statement on behalf of your industry? Great job you're doing. Thank you very much. Anybody else? Would anybody else like to make a statement?"
    },
    {
      "text": "Even the ones over here, you're going to turn your head. Look at those cameras. Speaker 4: () Sure, I'll say on behalf of the industry, they represent the great companies around the table here, but then those that operate at a local level that we all have the same commitment to making sure that cost is not a barrier to people getting tested and treated."
    },
    {
      "text": "We want to make sure that we're focused on prevention, testing and treatment, and getting that information out as quickly as we can to make sure people know how to limit the spread of the disease. Very good. Thank you very much. Speaker 5: () Mr. President, on behalf of the 36 independent Blue Cross Blue Shield plans that insure one in three Americans, we're pleased to make sure that people have access to the test, to the coverage that they need."
    },
    {
      "text": "I also want you to know that the commitments we've made also apply to the Federal Employees Program where we can share over 5 million. That's great. Thank you. Thank you all. Please. Speaker 6: () Maybe. I would just like to say as a large servicer of Medicare, that we are very oriented to the aging population and most importantly, how do we make it as easy as possible for them to receive their tests, then being able to do it in the home is a very important part of that."
    },
    {
      "text": "When we think about telemedicine and home, it reduces great barriers that allow them to have the testing. A lot of people in there are taking advantage of that really strong advantage. Who else would you suggest? Dave, please. Right, thank you. Governor, [inaudible :48]. Nice to see you, by the way. Right. [inaudible :]. Thank you all very much. Thank you. Thank you very much, everybody."
    }
  ]
}