{
  "speech_id": "234",
  "title": "Transcript: Donald Trump, Bank CEO’s Announce Coronavirus Measures",
  "date": "20200311",
  "url": "https://www.rev.com/blog/transcripts/transcript-donald-trump-bank-ceos-announce-coronavirus-measures",
  "topics": "Economy, Healthcare",
  "num_segments": 25,
  "content": [
    {
      "text": "Well, thank you very much. And, we are having a meeting, a very important meeting with the, I would say, the greatest bankers in the world, the most important banks in the world, financial centers. And, having a good discussion. We're discussing the economy. We're discussing how it relates to jobs and all of the things that are happening right now with the virus that we've become so familiar with. I'll be making some decisions. I've already made some decisions, actually, today."
    },
    {
      "text": "But, I'll be making some, some other ones that are very important. And, I thought I'd let the press into here some of the wisdom from the folks in the room and maybe Brian, I'll start with you. And, Brian's the chairman and you said the man at Bank of America. Highly respected. Everybody in this room is at the highest level, highly respected. Brian, please. Thank you, Brian, very much. Well, thank you very much, Michael. That's good. And, I think prior to the coronavirus it was just all go."
    },
    {
      "text": "The numbers were fantastic. And, we don't even know what the numbers are now. We'll have to see. The numbers from a week ago were great. And, from two days ago were great. But, now, we're hitting a patch and we're going to have to do something with respect to getting rid of this virus as quickly as possible and as safely as possible. Our number one priority is the health of the people of our country. And, so, we'll be making, most likely, a statement..."
    },
    {
      "text": "I'll be making a statement later on tonight as to what I've decided to do and what our country will be doing. Charlie, please. That's great. I'm glad you saying that. That's great. Because, maybe some of that, frankly, more so than you've been used to for the last three years. Right? It could happen. David. That's right. You'll do it very well. And, we'll be doing a lot of additional work with small business, as you know."
    },
    {
      "text": "We're going to be betting many billions of dollars and we're going to be making lots of small business loans. The banks are, too. So, we'll be, do you have anything to say, doctor? Speaker 6: () Yes, of course. But, first I'd like to thank you for being so aggressive and very specific about protecting health and safety of employees. I'm very encouraged by the leaders in this industry that are thinking along the same lines about their employees. And, their community."
    },
    {
      "text": "Speaker 6: () I'd like to point out that S-B-A has the authority, currently, with $18 billion to provide loans with the support of all the members in this room. And, they also have the opportunity to extend some of the payment terms up to six months. Right. Speaker 6: () I'm looking forward to working with every one of them to leave no money on the table with those $18 billion dollars to provide support to small businesses."
    },
    {
      "text": "Yesterday's, as you know, we met with the insurance companies, the top companies, the top people in the top companies, like yourselves. And, they were very generous. You know what they did with copays and everything else. They're going all out. So, we appreciated that very much. Steve. Anything to say? Steve. Sorry, Steve. Yeah. They've made very good progress, the C-D-C and different places that are dealing with the problem. They've made really tremendous, tremendous strides. We'll be announcing that, also. Thank you."
    },
    {
      "text": "Anybody else have anything to say? Ken? Anybody? Anybody? Speaker 8: () Mr. president, I think you've done a fantastic job of putting the interests of our country first with your fast action on China and travel to and from China. Thank you. Speaker 8: () I think you're focused on fiscal stimulus is really important. Right. Speaker 8: () How do we help American that live, too often, paycheck to paycheck, get through this difficult time where they may lose their job or otherwise face more difficult circumstances."
    },
    {
      "text": "So, I think your leadership on fiscal stimulus is really thoughtful and appreciated. And, then, all of us in this room know that the financial markets are working to help America. Speaker 8: () The interest rates changes that we've seen both in the fed and in the bond markets create an odd precedent opportunity for Americans to refinance their mortgages- That's true. Speaker 8: () ... at a dramatically lower rate. Which is really good for American households. Or, to have the opportunity to buy their first house."
    },
    {
      "text": "Or, a new house for their growing families. Speaker 8: () So, the markets have worked as we would hope at this moment of time to help provide stimulus to the entire economy through me for lower interest rates. Great job you've done, too. Please. And, how is Jamie doing? Speaker 9: () Jamie's doing well. All right, say hello to him. All right? Speaker 9: () I will. I will. For sure. I hear he's doing fine. Speaker 9: () He's making great progress. So, thank you. Thank you very much for asking."
    },
    {
      "text": "So, the bank has very rigorous resiliency plans both in United States and around the world. All of those are on the way right now. All of our plans are designed, obviously, to protect and help our people. And, to protect consumers and small businesses. We'll be there with forbearance plans. We'll be there to waive fees for consumers and small businesses who are under stress. And, I think, a very fair question is are we still lending?"
    },
    {
      "text": "And, over the course of the last 40 days at J-P Morgan, we've extended $26 billion worth of loans to both consumers and small businesses. That's great. Speaker 9: () And, that's, as I said, the last 40 days. We looked a little bit at Seattle, which you know, has been, you know, a center of the virus. And, economic growth is still continuing. So, we see it's slowed down significantly, but, people are still going to restaurants, for example. We still see that."
    },
    {
      "text": "People are buying food to be delivered by the new [inaudible :55] services. And, interestingly, in the data we also see the pull back is much more about, from the older generation, my age, than it is from the millennial generation. Speaker 9: () So, millennial generation spend seems to be holding up very well. I think there'll be a pent up demand when this is gone. I think that everything that, maybe, where it's stamped down now, people are leaving their homes."
    },
    {
      "text": "I think you're going to see a tremendous pent up demand. Which, hopefully, won't be in the too distant future. Please. Great, Richard. Thank you. Thank you, very much. Anybody else? Anybody? Please. Thank you. Speaker 12: () I would echo all the sentiments that you just heard, Mr. President. And, thank you for convening the group."
    },
    {
      "text": "I would also add that, and, echoing on something Rebecca said, we're also helping not just all the large globally active banks, but, the 5,100 banks across the United States build continuity and resiliency programs so we can keep the banking system open to support our customers and clients who are, in many cases, are facing a time of need. Speaker 12: () That's what banks do, is stick by their customers in good times and the challenging times."
    },
    {
      "text": "And, that's what all the banks in the United States are doing today. All right. Speaker 13: () Very focused U-S bank, very focused on providing credit for small businesses. Right. Speaker 13: () They are the ones right now who are going to, perhaps, have a little bit of struggles. So, getting credit to them rapidly and also being very lenient on repaying terms. That's great. Thank you, very much. And, thank you all. Yes, please. Speaker 14: () Mr."
    },
    {
      "text": "president, you've heard that the financial system is strong and I start to echo that. But, for those listening, the country is really strong. You've done a fantastic job. Your administration. We're adding jobs. We need to all be more diligent on the terms of our health management. We're learning that out of this. This is a longterm lesson to learn. Right. Speaker 14: () But, at the end of the day, if you're not in Central America, my view and very strong."
    },
    {
      "text": "And, we need to remind ourselves that part of getting through a challenge like this is about confidence and supporting each other. And, having hope for the future. And, for myself, I believe our best days are ahead. And, working together, we'll make that happen. Thank you, very much. Thank you, very much. So, I'll be making a statement tonight probably at eight o'clock. And, we'll be starting some additional solutions. We made a great decision on China and Asia."
    },
    {
      "text": "And, they're healing and they're healing at a pretty good rate. And, happy about that. And, we could start to think about getting back involved in that part of the world. And, as you know, we have a another part of the world, Europe, that's in very tough shape. It's having a hard time right now with the virus. And, we'll be making various decisions. You'll be hearing about them at approximately eight o'clock tonight. Steve. Well, I'll be letting you know that a little bit later. Speaker 15: () Mr."
    },
    {
      "text": "president, are you going to be declaring a national disaster tonight? We'll be talking about that later. All those things. We're making a decision on. Speaker 16: () Mr. president, we've heard in the past of industries that are too big to fail. In your estimation, are the airlines, are the cruise lines, is the hotel industry to make them fail? I think they're going to be great. I think the folks around this table are the ones that finance that. And, they understand and they're great companies."
    },
    {
      "text": "But, we're having to fix a problem that four weeks ago nobody ever thought would be a problem. Nobody. You read about them. You read about him from 1917 and you read about him from lots of other times. But, nobody thought that we would be seeing. We were just discussing that this came out of nowhere. And, actually, came out of China, which is the way it works. But, we are going to get the problem solved and the country is so strong. The institutions are so strong."
    },
    {
      "text": "You know, in the past you had problems with institutions. These are powerful institutions. They're built up, they're ready to go. And, I know they'll be helping their customers during this short term period. We think it's going to be a short term period. Speaker 16: () Do you mind if we ask the C-E-Os what they think a sort of stimulus package or measures might need to be? I don't mind that. I mean, it's actually a very good question. I was going to ask it myself."
    },
    {
      "text": "If you've been hearing about the various forms, Brian, of stimulus. Different. Very different forms of stimulus. What would you say would be good appropriate under these circumstances? That's true. If we get rid of the problem quickly, everything solves itself. We don't need stimulus. So, that'd be good. But, we are talking about various forms of stimulus. What would you think, Michael? Right. All right. Thank you, very much. Ken, go ahead. Right. I agree with that 100%. Anybody? Anybody? I think so."
    },
    {
      "text": "I think the payroll tax would be great. Democrats are not in favor of it. I've tried to figure out why. Because, it would be something that would be very good for the citizens, for the people. And, even longer term, for the country. So, that's a tax that people have long been talking about either cutting or getting rid of entirely. So, Steve, what do you have? Thank you, very much. Speaker 18: () What do you say to Americans who are concerned that you're not taking this seriously enough?"
    },
    {
      "text": "And, that some of your statements don't match what your health experts are saying? That's C-N-N. Fake news. Go ahead. Thank you, very much, everybody. Thank you very much. Thank you. Thank you. Speaker 19: () We're done. We're finished. Guys, lets go. Speaker 20: () Open that door. Let's go. Let's go, guys. Let's go, guys. Thank you, very much. Eight o'clock tonight. Eight o'clock tonight. Speaker 20: () This way. Thanks, guys. All right, Jim. Thank you, Jim. We'll be another five, very shortly. But, around here."
    }
  ]
}