{
  "speech_id": "238",
  "speaker": "Trump",
  "title": "Donald Trump Speech Transcript: Declares Coronavirus National Emergency",
  "date": "20200313",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-speech-transcript-declares-coronavirus-national-emergency",
  "topics": "Healthcare, Government Policy, Technology",
  "num_segments": 79,
  "content": [
    {
      "text": "To unleash the full power of the federal government in this effort today, I am officially declaring a National Emergency. Two very big words. The action I am taking will open up access to up to 50 billion dollars of very important and a large amount of money for states and territories and localities in our shared fight against this disease. In furtherance of the order, I'm urging every state to set up emergency operation centers effective immediately."
    },
    {
      "text": "You're going to be hearing from some of the largest companies and greatest retailers and medical companies in the world. They're standing right behind me and the side of me. I'm also asking every hospital in this country to activate its emergency preparedness plan so that they can meet the needs of Americans everywhere. The hospitals are very engaged. New York and various other places are also various engaged. I just spoke with governor Cuomo."
    },
    {
      "text": "We had a very good conversation and we're working very strongly with the many states including New York. The urgency orders I'm issuing today will also confer broad new authority to the Secretary of Health and Human Services. The Secretary of HHS will be able to immediately wave revisions of applicable laws and regulations to give doctors, hospital all hospitals and healthcare providers, maximum flexibility to respond to the virus and care for patients."
    },
    {
      "text": "This includes the following critical authorities, the ability to waive laws to enable telehealth, a fairly new and incredible thing that's happened in the not so distant past. I tell you what they've done with telehealth has incredible. It gives remote doctors visits and hospital check-ins the power to waive certain federal license requirements so that doctors from other states can provide services in states with the greatest need."
    },
    {
      "text": "Number two, the ability to waive requirements that critical access hospitals limit the number of beds to 25 and the length of stay to 96 hours. The ability to waive the requirements of a three day hospital stay prior to admission to a nursing home; big thing. The authority to waive rules to hinder hospital's ability to bring additional physicians on board or obtain needed office space. They can do as they want. They can do what they have to do. They know what they have to do."
    },
    {
      "text": "Now they don't have any problem getting it done. The authority to waive rules that severely restrict where hospitals can care for patients within the hospital itself. Ensuring that the emergency capacity can be quickly established. We'll remove or eliminate every obstacle necessary to deliver our people the care that they need and that they're entitled to. No resource will be spared. Nothing whatsoever."
    },
    {
      "text": "10 days ago, I brought together the CEOs of commercial labs at the White House and directed them to immediately begin working on the solution to dramatically increase the availability of tests. Other countries have called us and worked with us and they're doing similar things or will be doing similar things as a result of that action. Today we are announcing a new partnership with private sector to vastly increase and accelerate our capacity to test for the Coronavirus."
    },
    {
      "text": "We want to make sure that those who need a test can get a test very safely, quickly and conveniently but we don't want people to take a test if we feel that they shouldn't be doing it and we don't want everyone running out and taking; only if you have certain symptoms. Using federal emergency authorities, the FDA approved a new test for the virus. We did this within hours after receiving the application from Roche, a process that would normally take weeks."
    },
    {
      "text": "We therefore expect up to a half a million additional tests will be available early next week. We'll be announcing locations probably on Sunday night. I want to thank Roche, great company for their incredible work. I'd also like to thank Thermo Fisher. The FDA's goal is to hopefully authorize your application within 24 hours. It'll go very quickly. It's going very quickly. Which will bring additionally 1.4 million tests on board next week and five million within a month. I doubt we'll need anywhere near that."
    },
    {
      "text": "At the same time, we've been in discussions with pharmacies and retailers to make drive-through tests available in the critical locations identified by public health professionals. The goal is for individuals to be able to drive up and be swabbed without having to leave your car. I want to thank Google. Google is helping to develop a website. It's going to be very quickly done, unlike websites of the past, to determine whether a test is warranted and to facilitate testing at a nearby convenient location."
    },
    {
      "text": "And we have many, many locations behind us, by the way. We cover this country and large parts of the world, by the way. We're not going to be talking about the world right now. But we cover very, very strongly our country. Stores in virtually every location. Google has 1,700 engineers working on this right now. They've made tremendous progress. Our overriding goal is to stop the spread of the virus and to help all Americans who have been impacted by this. Again, we don't want everybody taking this test."
    },
    {
      "text": "It's totally unnecessary. And this will pass. This will pass through and we're going to be even stronger for it. We've learned a lot, a tremendous amount has been learned. I want to thank Deborah Birx and I want to ask her maybe to come up and say a few words as to what's happening. Dr. Birx is a highly respected person."
    },
    {
      "text": "I've gotten to know her very well over the last six days and what we've done is we built something that was very old, very old fashioned, somewhat obsolete, certainly obsolete when it comes to the kind of numbers that we're talking about. Dr. Birx, please. Thank you, Deborah. Thank you very much. [inaudible :49]. I'd like to maybe have, Tony, do you want to come up? You've become a ..."
    },
    {
      "text": "I think everybody out here knows you pretty well, but Tony has been doing a tremendous job working long, long hours and you've seen a lot happen, but this has been ... It's been a great experience and working with you has been terrific. Tony, please. Thank you very much, Tony. If I could, some of these folks, we know they're celebrities in their own right."
    },
    {
      "text": "They're the biggest business people, the greatest retailers anywhere in the world, and one of them is Doug McMillon from Walmart and I'd like to have Doug, if you would say a few words wherever you may be. [inaudible :46] Doug, please. Thank you very much, Doug. Appreciate it very much. I'll just stay right over here, and Richard, if you could come up please. Richard, please. Walgreens. Thank you. Thank you very much. Great job. Thank you very much. Brian Cornell, Target. Thank you, Brian. Thank you. Please."
    },
    {
      "text": "Thank you very much. Great job. Is Tom here? Tom Polen. Tom? Tom Polen, please. Thank you very much, Tom. Great job you've done. [Steven Rakowski :], Quest Diagnostics. Please. Great job. Thank you very much. Thank you very much. I appreciate it. And Matt Sause, please, of Roche. Matt. Thank you, Matt. And you can do it. You can do it. You're a great company. David Pierre of Signify. Signify Health, please. Excellent. Thank you very much."
    },
    {
      "text": "And we'll be changing a lot of the rules, regulations for future should this happen in the future, which we hope it never does, but it will, I guess, somewhere out there. We had some bad ones over the years and I guess that'll continue to an extent, but we hope it never happens. But we are going to be changing a lot of the old rules and specifications and regulations. Adam Schechter, who's really been of tremendous help. LabCorp, please. Adam. Thank you very much. Great job. Thank you. Thomas Moriarty, CVS."
    },
    {
      "text": "We all know CVS. Thank you. Thank you, Thomas. Thank you very much. Thanks. Great job. And Bruce Greenstein, LHC Group. Tremendously talented people. Thank you very much. Thanks very much. [crosstalk :02]. Okay. I like that. That's good. We're also announcing the following emergency executive actions today. To help our students and their families, I've waived interest in all student loans held by the federal government agencies and that will be until further notice."
    },
    {
      "text": "That's a big thing for a lot of students that are left in the middle right now. Many of those schools have been closed. Based on the price of oil, I've also instructed the Secretary of Energy to purchase, at a very good price, large quantities of crude oil for storage in the US, strategic reserve."
    },
    {
      "text": "We're going to fill it right up to the top, saving the American taxpayer billions and billions of dollars, helping our oil industry and making us even further toward that wonderful goal which we've achieved, which nobody thought was possible of energy independence. It puts us in a position that's very strong and we're buying it at the right price. And that's something that would have not even been possible a week ago. The price of oil went down quite a bit, so we're going to fill it up."
    },
    {
      "text": "It's a good time to fill it up. I'd like to ask Mike Pence to say a few words please. VP. Thank you. Seema? Where's Seema? I'd like you to maybe take that a step further please on nursing homes. Thanks. Thank you very much. As I said in my address to the nation the other night, all Americans have a role to play in defeating this virus. Our most effective weapon right now is to limit the damage to our people and our country and slow the spread of the virus itself. The choice we make- ... spread of the virus itself."
    },
    {
      "text": "The choice we make, the precautions we put into place, are critical to overcoming the virus, reducing its spread and shortening the duration of the pandemic which is what it is. The CDC has published guidelines on the coronavirus.gov to enable... It's coronavirus.gov. It's very heavily used right now, I will say, to enable every American to respond to this epidemic and to protect themselves, their families and their communities."
    },
    {
      "text": "While the risks to young and healthy Americans remains very low, we've learned a lot about this over the last two weeks. Anyone can be a carrier for the virus and risk transmission to older Americans and those with underlying health conditions. And those who are most at risk, they have not done very well. Older Americans, especially if they have a health problem, they have not done well. We must take all precautions and be responsible for the actions that we take, and that we see other people take."
    },
    {
      "text": "We want to prevent the spread and transmission of the disease. It's incredible what's happening with the sporting world, where so many of the great sports that we've gotten so used to at this time of the year, they're not going to be meeting. They've done a great service, actually. But that would be another way that problems could be caused. But this is why I outlined on Wednesday night, my administration's... The fact that we've issued a requirement suspending all medically unnecessary visits to various places."
    },
    {
      "text": "But in particular, nursing homes. We should all be working off the same playbook when it comes to protecting Americans. We have to. We need to be consistent in adopting measures to limit the spread of the virus. The virus is the same whether it's spreading in cities, towns, or rural communities. The tools and tactics for attacking it are similar, no matter where you go."
    },
    {
      "text": "No matter where you go, you have some hotspots throughout the world right now that people would have never thought possible, and they're being very seriously affected. Key among these efforts, are breaking chains of transmission between people. These measures have been adopted by many companies, universities and schools. We want to protect the safety and the health of their employees and their students. I encourage everyone to follow the guidelines we've issued by CDC, and these common sense measures."
    },
    {
      "text": "A lot of it is common sense. For the areas where the virus is spreading, the CDC is advising communities to postpone large gatherings, postpone assemblies, social functions and sporting events, stagger recess and lunch for schools that aren't canceled, limit in-person meetings, increase scheduled cleanings, and cancel work-sponsored travel, among numerous other steps that can be taken. Americans are the strongest and most resilient people on Earth."
    },
    {
      "text": "And in the coming weeks, we will all have to make changes and sacrifices. But these short term sacrifices will produce long term gain. Again, I've said we're learning a lot for the future and future problems like this, or worse. Or worse, it could get worse. The next eight weeks are critical. We can learn, and we will turn a corner on this virus. Some of the doctors say it will wash through and will flow through, in interesting terms, very accurate."
    },
    {
      "text": "I think you're going to find in a number of weeks, it's going to be a very accurate term. In times of hardship. The true character of America always shines through. We live in the company of the greatest heroes and the most inspiring citizens anywhere in the world. We want to take care of our people. We want to draw on the strength of our history, draw on the strength of our people. Then we will get through this. All together, we will just get through it. So much progress has already been made."
    },
    {
      "text": "And frankly, the numbers because the steps that have been taken, are at a level that a lot of people are surprised... especially when you compare them with other places with far smaller populations. The spirit and the will of our nation is unbreakable. We will defeat this threat. When America is tested, America rises to the occasion."
    },
    {
      "text": "And to those families and citizens who are worried and concerned for themselves and their loved ones, I want you to know that your federal government will unleash every authority, resource and tool at its disposal, to safeguard the lives and health of our people. So we're with you every step of the way. No nation is more prepared or more equipped to face down this crisis. As you know, we are rated number one in the world. We're also helping other nations. Many of the nations, we're helping them a lot."
    },
    {
      "text": "And they are doing okay in some cases. In some cases, they are not doing well at all. But we're working with a lot of groups of people and a lot of other nations. With faith and heart and hope and love and determination, we will succeed. We will prevail. We will be very, very successful. And we'll learn for the future. Thank you all very much. If you have any questions, we can take some. Go ahead, John, please. And if you'd like to ask some of the folks up here, it would be fine. Please."
    },
    {
      "text": "Well, we just don't think they're giving enough. We don't think the Democrats are giving enough. We're negotiating. We thought we had something. But all of a sudden, they didn't agree to certain things that they agreed to. So we could have something, but we don't think they're giving enough. They're not doing what's right for the country. Go ahead, please. Speaker 1: () Thank you, Mr. President. You just mentioned waiving interest for student loans. Yeah."
    },
    {
      "text": "Speaker 1: () You talked about buying oil from the SPR, or adding to the SPR. What other specific targeted measures is your administration thinking about taking? The Treasury Secretary, Steve Mnuchin, said today that you're just in the second inning of things that you might be undergoing. Yeah. Well, that's true. We are looking at many different things, as you know. Some of them, they've been written about very widely."
    },
    {
      "text": "But we're going to be releasing a paper in about two hours stating quite a few other steps, very important ones. Please, go ahead. Speaker 1: () One more sir, if you wouldn't mind. Please, go ahead. Speaker 2: () Thank you so much, Mr. President. I want to know if you are in contact with the Brazilian President, Bolsonaro, after a member of his delegation who was with you Saturday, was tested positive. And also, I want to ask another question if you'll let me."
    },
    {
      "text": "Senators Lindsey Graham and also Senator Scott, Rick Scott, are self-isolating. Are you planning to take any kind of precautionary measure to protect you, and also your staff who was there? No. We have a no symptoms, whatsoever. We had a great meeting with the President of Brazil, Bolsonaro. Great guy, a very tremendous... He's doing a fantastic job for Brazil. As you know, he tested negative. Meaning, nothing wrong this morning, and we got that word too. Because we did have dinner with him."
    },
    {
      "text": "We were sitting next to each other for a long period of time. Speaker 2: () But are you in contact with him over the coronavirus crisis? We're talking about it, country to country. But we did discuss if he had a problem. It was reported that he may have it, and he doesn't, fortunately. Yeah. Speaker 3: () Thank you so much, Mr. President. Dr. Fauci said earlier this week that the lag in testing was in fact, failing. Do you take responsibility for that?"
    },
    {
      "text": "And when can you guarantee that every single American who needs a test will be able to have a test? What's the date of that? Yeah. No, I don't take responsibility at all because we were given a set of circumstances, and we were given rules, regulations and specifications from a different time. It wasn't meant for this kind of an event with the kind of numbers that we're talking about. And what we've done is, redesigned it very quickly with the help of the people behind me. We're now in very, very strong shape."
    },
    {
      "text": "I think we'll be announcing, as I said, Sunday night. This will start very quickly. We'll have the ability to do in the millions over a very, very quick period of time. So, no. What we have done and we are going to be leaving a very indelible print for the future in case something like this happens again. But it was a... And that's not the fault of anybody. Frankly, the old system worked very well for smaller numbers, much smaller numbers, but not for these kinds of numbers. Tony, maybe you'd like to say something."
    },
    {
      "text": "Speaker 3: () By Sunday night, will have... yes, please. By Sunday night, will every American be able to get a test? And interestingly, if you go back... Please. If you go back to the swine flu, it was nothing like this. They didn't do testing like this. And actually, they lost approximately 14,000 people. And they didn't do the testing. They started thinking about testing when it was far too late. What we've done and one of the reasons I think people are respecting what we've done, we've done it very early."
    },
    {
      "text": "We've gotten it very early, and we've also kept a lot of people out. Speaker 3: () Mr. President. Mr. President. Yes. Please, go ahead. Speaker 3: () The last administration that they had tested a million people at this point. You've been- Well, ask them how they did with the swine flu. It was a disaster. Speaker 3: () But with respect- Next, please. Next, please. They had a very big failure with swine flu, a very big failure. Speaker 4: () Mr."
    },
    {
      "text": "President, I want to ask you about the European travel ban that goes into effect at midnight tonight, and the exemption that you've offered to the U.K. There are 17 countries that are in the so-called Schengen Zone that have fewer coronavirus cases than the U.K. And just in the past 24 hours, the U.K. has added 208 coronavirus cases to their total. Why do they, Mr. President, deserve an exemption? And would you consider adding them to this travel ban list?"
    },
    {
      "text": "Well, that was recommended to me by a group of professionals. We are looking at it based on the new numbers that are coming out, and we may have to include them in the list of countries that we will... you could say ban or whatever it is, during this period of time. But yeah, their numbers have gone up fairly precipitously over the last 24 hours, so we may be adding that. And we may be adding a couple of others. And we may frankly, start thinking about taking some off. Go ahead."
    },
    {
      "text": "Speaker 5: () Thank you, Mr President. I'm a correspondent with Hong Kong Phoenix TV. You have mentioned that the number in China has been decreasing, and China has made tremendous progress in the past weeks. True. Speaker 5: () I'm wondering, how much confidence does this give you to control the virus in the United States? And do you think the data China has been sharing with the United States has been helpful? I think it has been helpful. We have been working very much with China."
    },
    {
      "text": "I've spoken, as you know, with President Xi. They went through hell. Their numbers are starting to look very good. They're really looking very good. We're very happy about that. We are sharing data, yes. In fact, we're sharing quite a bit of data, including the fact that some of our pharmaceutical companies are working over there right now with large groups of people. Yeah. Go ahead, please. Yes, sir. So we didn't discuss the border. We've had a very good relationship. Just about finished with the USMCA, as you know."
    },
    {
      "text": "He called. Actually, he called me to tell me that. I think that was the primary reason for the call. At the time, his wife had not been diagnosed. She's a lovely lady, wonderful lady, great lady. Since then, I've heard, read, that the result was that she has it. I was a little surprised. I think he was surprised also. We did discuss it prior, too. She's going to be fine. But he thought that she would not most likely have the virus. Unfortunately, she does. But we didn't discuss the border yesterday, no."
    },
    {
      "text": "Go ahead, please. If you have any questions for these great geniuses up here, you should, even a business question related to what we're talking about. Well, I don't know that I had exposure, but I don't have any of the symptoms. We do have a White House doctor. I should say, many White House doctors, frankly. I asked them that same question, and they said, \"You don't have any symptoms whatsoever.\" We don't want people without symptoms to go and do the test. The test is not insignificant."
    },
    {
      "text": "As far as the cruise line business, we're with them all the way. It's a great business. It's a great U.S. business, frankly. I know how important they are to the country. That includes airlines. But the cruise line business obviously, was hit very hard. We had a tremendous success out in Oakland, where moved... Vice President Pence did a fantastic job with that. We worked with U.K., we worked with Canada. They took their people back in. Canada's approximately 600 people. U.K."
    },
    {
      "text": "likewise, took a large number of people back to the United Kingdom. We have people quarantined. It was a big operation, and it worked out really... You don't hear about it anymore. It worked out really well. Mike, you may even want to say something about that, because that was really done properly. Go ahead, please. Speaker 6: () This question is for Drs. Fauci and Berks. Dr. Fauci, based on what you currently know, what is the trajectory for when this outbreak will peak?"
    },
    {
      "text": "How long will the American people have to remain on this emergency footing? And for Dr. Berks, as the administration tries to get its arms around this test kit shortage issue, the next glaring need could respirators and related hospital equipment. So what is the administration doing right now to ramp up production of respirators and that kind of equipment, should this outbreak persist?"
    },
    {
      "text": "I might add that we are in the process and in some cases have already done it, ordered a large number of respirators just in case. We hope we don't need them, but we've ordered a large number. Yeah. Go ahead, please. Speaker 7: () Thank you very much, Mr. President. In your speech to the nation, you mentioned the situation in China and South Korea have improved. And you are thinking about remove the restrictions, also the warning in place right now."
    },
    {
      "text": "When can we expect that announcement, and how do you see the overall progress that Asian countries made? Well, some were making progress. Some are not, as you know. But some are making progress. And as they make progress, as they get down to the number that we all think is right, that they know is right, we know is right, we'll be opening it up. Some are really moving along rapidly. We hope to be able to open things up as quickly as possible. Go ahead, please. Go ahead. Speaker 8: () Mr."
    },
    {
      "text": "President, I'd like to ask Secretary Azar and Dr. Fauci, just how... Dr. Fauci, okay. Right, better. Better. Not 100%, but 90%. Speaker 8: () Right. Go ahead. Speaker 8: () This affects the elderly, primarily. In that sense, it's an unusual disease. Is any specific research being done as to why it affects our senior citizens more than others? Okay. OAN please. OAN. No. We have our deal with China. They're going to be buying $250 billion worth of goods and 50 billion from our farmers, and it's a great deal for our country."
    },
    {
      "text": "It's about time somebody did that and, frankly, phase two, we'll start negotiating. I did read one article, but I don't think that article was representative, certainly not in my conversations with President Xi, and they know where it came from. We all know where it came from. Yamiche A.: () Thank you, Mr. President. Yamiche Alcindor from PBS News Hour. Yes."
    },
    {
      "text": "Yamiche A.: () My first question is, you said that you don't take responsibility, but you did disband the White House pandemic office and the officials that were working in that office left this administration abruptly, so what responsibility do you take to that? The officials that worked in that office said that the White House lost valuable time because that office wasn't disbanded. What do you make of that? I just think it's a nasty question, because what we've done is ..."
    },
    {
      "text": "and Tony had said numerous times that we've saved thousands of lives because of the quick closing. When you say 'me', I didn't do it. We have a group of people I could ask, perhaps in my administration, but I could perhaps ask Tony about that, because I don't know anything about it. You say we did that. I don't know anything about it. Yamiche A.: () You don't know about the reorganization that happened at the National Security Council? [crosstalk :30]. It's the administration. Perhaps they do that."
    },
    {
      "text": "People let people go. You used to be with a different newspaper than you are now. Things like that happen. Yamiche A.: () But this wasn't- Okay, please go ahead. We're doing a great job. Let me tell you, these professionals behind me and these great, incredible doctors and business people, the best in the world. I can say that whether it's retailers or labs or anything you want to say, these are the best in the world. We're doing a great job. We have 40 people right now. 40."
    },
    {
      "text": "Compare that with other countries that have many, many times that amount. One of the reasons we have 40 and others have ... and again, that number's going up, just so you understand, and a number of cases which are very small, relatively speaking, it's going up, but we've done a great job because we acted quickly, we acted early, and there's nothing we could have done that was better than closing our borders to highly infected areas. Please, go ahead."
    },
    {
      "text": "I hope not long, but it's there now and it gives tremendous powers for things that we need. Tremendous power actually, and the Stafford Act and various other things that we're involved with and have studied and memorized in so many different ways and forms. It gives the kind of power that we need to get rid of this virus, and we're going to do it very quickly, and I hope we won't need it very long, but whatever it takes. We're in touch with Italy, and it's a country that we love."
    },
    {
      "text": "We have millions and millions of people originally from Italy, and we're working with them. They're in, probably relatively speaking, the toughest position of all. We're in touch with everybody. When I say everybody, we're in touch with many of the countries that you know about that you're writing about, and they're calling us asking for advice. They're asking for the advice of the people behind me."
    },
    {
      "text": "Italy's got a tough situation, but they have really clamped down, and I think they're going to see some very good results. It's tough what they did. They really took their medicine, but they're going to see some much better results. Yeah, Jeff. Well, I'll tell you. First of all, I'm not coming back from someplace. There was somebody that they say has it. I have no idea who he is, but I take pictures and it lasts for literally seconds. I don't know the gentleman that we're talking about. I have no idea who he is."
    },
    {
      "text": "I haven't seen the picture. It's said there's a picture of somebody, but I take sometimes hundreds of pictures a day, and that night I was taking hundreds of pictures, so I just don't know. Now, I did sit with the President for probably two hours, but he's tested negative, so that's good. Please, go. Go ahead, please. I would say if you stay home, it's not bad. It's not bad. Now, there are certain parts of the country that essentially have zero problem."
    },
    {
      "text": "Washington's been very tough, in particular, nursing home, but the state of Washington's been very tough. When you talk about the 40 deaths, that's been a big percentage of the deaths, as you know very well, and they all came from a certain area, unfortunately. Please, go ahead. Go ahead. Okay. Cordelia L.: () Thank you very much, Mr. President. Cordelia Lynch, Sky News. You talk this week about the UK doing a good job in tackling Coronavirus. In light of the rise in cases, are you changing your mind about that?"
    },
    {
      "text": "You also just spoke about possible travel restrictions. Have you discussed when they might be put in place? As we discussed before, in light of the results, we're going to be looking at it and I know the task force is looking at it very strongly. Vice President, everybody. It was looking good, but the results have been building up pretty rapidly, so we'll be taking another look at that. Yes, absolutely. Go ahead, please. Speaker 9: () Mr. President, thank you."
    },
    {
      "text": "I want to first follow up on Jeff's question, because the person you were standing next to, whether you know who he is or not, tested positive for Coronavirus. Dr. Fauci said this morning, if you stand next to somebody who tested positive, you should self-isolate and get a test. You say your White House doctor is telling you something different. Who should Americans listen to?"
    },
    {
      "text": "My second question is- I think they have to listen to their doctors, and I think they shouldn't be jumping to get the tests unless it's necessary, but I think they have to listen to their doctors. I haven't seen the picture. Somebody said there's a picture of somebody taking a picture with me, but I haven't seen it, but I can tell you- Speaker 9: () Doctors have said you might have it even if you don't have symptoms."
    },
    {
      "text": "Are you being selfish by not getting tested and potentially exposing- I didn't say I wasn't going to be tested. Speaker 9: () Are you going to be? Most likely, yeah. Most likely. Speaker 9: () When do think that'll happen? Not for that reason, but because I think I will do it anyway. Speaker 9: () Will you let us know the results? Fairly soon. We're working on that. We're working out a schedule. Speaker 9: () My second question, Mr. President. That was a follow-up. You, go ahead please. Go ahead. Yeah."
    },
    {
      "text": "Speaker 10: () I know there's been a lot of talk about testing. I just want to make sure we're clear though, because we've been hearing from doctors who say, as of today, they still can't get patients tested who need a test. As of today, can everyone who a doctor wants to have tested get tested? If not, when? When will doctors- That's been true for a while, but I'll let Mike ... Why don't you answer that, Mike?"
    },
    {
      "text": "I think you have to remember though, we're working very closely with states and to those you have a smaller form and more targeted form of government going in and doing it, like in New York where the relationship is very good. Like Gavin Newsom, where he made some very complimentary ... that's California. He made some really complementary comments the other day about how we're working together."
    },
    {
      "text": "We worked on the ship together, but we worked on a lot of other things together having to do with this, and really, the relationship that we have, I can't think of a bad relationship. We're helping them, we're funding them, in some cases, depending on what it is you're talking about, and we're all working together very closely. So we've done really, I think, a tremendous job of teamwork with the different states. All right, one or two more, and if you have questions for these folks ..."
    },
    {
      "text": "Does anybody have a question for the folks up here? Who has a question up here? You have? Okay, go ahead. If you have a question, go ahead. Speaker 11: (:35) Thank you. I have one for you as well. I thought. I knew you would. Speaker 11: (:37) I do have one for them because I haven't heard this yet. I was waiting for that. Go ahead. Speaker 11: (:42) Because I haven't heard this yet. Ask them first please. Speaker 11: (:43) Yes, I will."
    },
    {
      "text": "Okay, with regards to the CEOs, can you please tell us when you expect to see items like hand sanitizer, that have been going out of stock very quickly, back on the shelves? There have been a lot of reports about that, and for you, Mr. President, could you talk about a potential bailout for the cruise industry? You had suggested that could happen. Is that something you're still looking at, and how much would that be?"
    },
    {
      "text": "Well, I didn't suggest that it could happen, but I could tell you it's an industry that was very badly impacted by what's going on with the virus. It's a great industry, it's a very important industry, and we will be helping them and we will be helping the airline industry if we have to, assuming we have to. So far people haven't been asking, but if they should be asking, we want to make sure our airlines are very strong, and then in one day all of a sudden wasn't looking so good."
    },
    {
      "text": "Interestingly, I was talking to Doug, and the numbers they're doing from the retailing standpoint I guess because of this, your business is like the opposite. All of you have been selling a lot of stuff. Do you want to answer the question as to the hand sanitizers? Please. Okay, one more. Go ahead. Go ahead. No, over you. Behind you. Behind you. Speaker 14: (:28) Thank you very much, Mr. President. You have a great team, of course. That's true. Thank you. Speaker 14: (:32) My question, Mr."
    },
    {
      "text": "President, are you happy from the Chinese response? What correctly really told you what really happened those days? Second, Prime Minister Modi of India have closed borders until April 15th, if you have spoken with the prime minister of India, and if they have needed any help? Finally, sir, any method for the small businesses, because they are losing some business because of this. Thank you, sir."
    },
    {
      "text": "On small businesses, the Small Business Administration is now stacked with money to help them, and we're going to make the money readily available if they need it, small businesses. We had a great time in India. It was an incredible two days, and he's a great friend of mine and he's a friend of his people, because he was greeted incredibly warmly, as was I in that stadium. It was an incredible event, and I loved being with him, so just to say \"hello\" to him. We talked about everything."
    },
    {
      "text": "We've talked about far more than just borders, and as far as President, he, likewise, he's a friend of mine. I believe that we are dealing in good faith, that we just worked, as you know and as I just said. We just worked an incredible deal, big deal, one of the biggest deals ever made of any kind. Big, even by the standards of some of the people here, the deal with China, but I think that they want to get to the bottom of things also."
    },
    {
      "text": "We're working, our drug companies, our pharmaceutical companies, are working very closely with China and with India, as you know, and with all over the world, and they're all over the world. These are magnificent companies that are very, very knowledgeable and we're very lucky to have them, because I think you're going to come up with, whether it's therapeutic or whether it's just help."
    },
    {
      "text": "Helping getting better, and then ultimately a vaccine, which takes a little bit longer because of the test periods and couple of other reasons. You're going to have it very quickly because of the great knowledge. They'll have it very quickly. They've made a tremendous amount of progress. Thank you all very much. We appreciate it. Thank you. Thank you very much."
    }
  ]
}