{
  "speech_id": "242",
  "speaker": "Trump",
  "title": "Donald Trump Coronavirus Task Force Update: March 16",
  "date": "20200316",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-coronavirus-task-force-update-march-16",
  "topics": "Healthcare, Education, Government Policy",
  "num_segments": 62,
  "content": [
    {
      "text": "I'm glad to see that you're practicing social distancing. That looks very nice. That's very good. I want to thank everybody for being here today. This morning I spoke with the leaders of the G seven, G seven nations and they really had a good meeting. I think it was a very, very productive meeting. I also spoke with our nation's governors, and this afternoon we're announcing new guidelines for every American to follow over the next 15 days."
    },
    {
      "text": "As we combat the virus, each and every one of us has a critical role to play in stopping the spread and transmission of the virus. We did this today. This was done by a lot of very talented people, some of whom were standing with me, and that's available. Dr. Birx will be speaking about that in just a few minutes."
    },
    {
      "text": "It's important for the young and healthy people to understand that while they may experience milder symptoms, they can easily spread this virus and they will spread it indeed, putting countless others in harm's way. We especially worry about our senior citizens. The White House task force meets every day and continually updates guidelines based on the fast evolving situation that this has become all over the world. It's all over the world. It's incredible what's happened in such a short period of time."
    },
    {
      "text": "On the guidelines of the task force, the new modeling conducted by Dr. Birx and our consultation with governors, we've made the decision to further toughen the guidelines and blunt the infection now. We'd much rather be ahead of the curve than behind it and that's what we are. Therefore, my administration is recommending that all Americans, including the young and healthy, work to engage in schooling from home when possible, avoid gathering in groups of more than 10 people."
    },
    {
      "text": "Avoid discretionary travel and avoid eating and drinking at bars, restaurants, and public food courts. If everyone makes this change or these critical changes and sacrifices now, we will rally together as one nation and we will defeat the virus and we're going to have a big celebration altogether. With several weeks of focused action, we can turn the corner and turn it quickly and a lot of progress has been made. I'm also pleased to report today that a vaccine candidate has begun the phase one clinical trial."
    },
    {
      "text": "This is one of the fastest vaccine development launches in history, not even close. We're also racing to develop antiviral therapies and other treatments and we've had some promising results, early results, but promising to reduce the severity and the duration of the symptoms. And I have to say that our government is prepared to do whatever it takes, whatever it takes we're doing, and we're doing it in every way. And with that I'd like to just introduce Dr."
    },
    {
      "text": "Birx, Who's going to discuss some of the things that we strongly recommend. Thank you. Dr. Okay, go ahead. Speaker 1: () [crosstalk :55]. Mr. President, a lot of people are concerned about how long all of this might last. Do you have any kind of estimate that if Americans really were to band together and do what the White House is suggesting, how quickly you could turn this corner? My favorite question, I ask it all the time, how many times Anthony?"
    },
    {
      "text": "I think I ask him that question every day and I speak to Debra, I speak to a lot of them. I get the opinion. So it seems to me that if we do a really good job, we'll not only hold the death down to a level that is a much lower than the other way had we not done a good job, but people are talking about July, August, something like that. So it could be right in that period of time where I say it washes through, other people don't like that term, but it washes through."
    },
    {
      "text": "Speaker 1: () Is the new normal until the height of the summer? We'll see what happens. But they think August, could be July. It could be longer than that. But I've asked that question many, many times. Yes? Speaker 2: () With that being said, Mr. President, Americans today and looking forward are living with so much anxiety and so much fear facing uncertainty right now. I'm curious, how are you talking to your own family about this? How are you talking to your youngest son?"
    },
    {
      "text": "Do you empathize with this sense of anxiety? People are really scared. I think they are very scared. I think they see that we're doing a very professional job. We've been working with the governors and the frankly, the mayors, local government at every level. We have FEMA totally involved. FEMA has been ... Usually we see FEMA for the hurricanes and the tornadoes. Now we have FEMA involved in this."
    },
    {
      "text": "They've been doing a fantastic job locally, working with people that they know because they work, like as an example, in California, in the state of Washington, they work with them a lot on other things and they're very familiar, so they're working on it. What you can do and all you can do is professional, totally competent. We have the best people in the world. We have really the greatest experts in the world and someday soon hopefully it'll end and we'll be back to where it was, but this came up ..."
    },
    {
      "text": "We came up so suddenly look, you were surprised. We were all surprised. We heard about it. We heard about reports from China that something was happening and all of a sudden we did make a good decision. We closed our borders to China very quickly, very rapidly. That was ... Otherwise we'd be in a very, as Tony has said numerous times, we'd be in a very bad position, much worse than we would be right now. You're looking at what's happening in other countries."
    },
    {
      "text": "Italy is having a very hard time, but I think that what we do, and I've spoken actually with my son, he says, \"How bad is this?\" It's bad. It's bad, but we're going to, we're going to be hopefully a case not a worst case and that's what we're working for. Yes? Speaker 3: () You can clear up some confusion on two key fronts. One is about your own tests. The other was about containment efforts."
    },
    {
      "text": "Is the administration considering more aggressive containment options like a quarantine, a national curfew [crosstalk :03]? Well, we have that very much. Yeah, we have that very much and we are ... We've been pretty aggressive. We were early with Europe but we were very, very early with China and other places and fortunately we were. And as far as containment here, we are. We're coming out with strong suggestions and it's becoming a little bit automatic. You look at people, they're not doing certain things."
    },
    {
      "text": "For instance, obviously not ... I wouldn't say the restaurant business is booming and bars and grills and all. People are self- containing for to a large extent. We look forward to the day when we can get back to normal. What's your second question? Speaker 1: () Are you considering instituting a nationwide lockdown, a nationwide quarantine? The NSC knocked that down, but there's still some questions about how it all [crosstalk :47]. At this point, not nationwide, but, well, there was some point ..."
    },
    {
      "text": "Some places in our nation that are not very effected at all, but we may look at certain areas, certain hotspots, as they call them. We'll be looking at that, but at this moment, no, we're not. ... call them. We'll be looking at that. But at this moment, no, we're not. Speaker 4: () The second question is you said you had your coronavirus test Friday night. The White House doctor's office put out a statement around midnight Friday saying that no test was indicated. When exactly was your test administered to you?"
    },
    {
      "text": "I had my test. It was late Friday night. The reason I did it was because the ... I had no symptoms whatsoever. The doctor said, \"You have no symptoms so we don't see any reason.\" But when I did the press conference on Friday, everybody was going crazy. \"Did you do the test? Did you do the test?\" Very late on Friday night I did the test. The doctor may have put out something. I don't know what time the letter went out. Maybe it was put out by somebody else, but the results came back I believe the following day."
    },
    {
      "text": "We tested negative. Speaker 4: () But the question is, how could the White House doctor's office say a test wasn't indicated implying that you hadn't had one when in fact you had tested? I told them that and I went totally by what they said, the doctors, more than one. They said you don't have any of the symptoms. They checked what you're supposed to check and that I didn't have symptoms, but I did a test late on Friday night. It came back probably 24 hours later or something. They sent it to the labs."
    },
    {
      "text": "It came back later. Yeah, please. Speaker 5: () Mr. President, you had a teleconference with the nation's governors today. In that teleconference you told them if they need things like respirators or masks to try to get it on their own. What did you mean by that? What will the federal government do to help them? If they can get them faster by getting them on their own, in other words, go through a supply chain that they may have."
    },
    {
      "text": "Because the governors during normal times, the governors buy a lot of things, not necessarily through federal government. If they're able to get ventilators, respirators, if they're able to get certain things without having to go through the longer process of federal government. We have stockpiles now where we're ordering tremendous numbers of ventilators, respirators, masks, and they're ordered. They're coming. We have quite a few at this point. I think, Mike, we have a lot."
    },
    {
      "text": "But if they can get them directly, it's always going to be faster if they could get them directly if they need them. I've given them authorization to order directly. Speaker 6: () Mr. President, one of the big weaknesses in our healthcare system is surge capacity for medical facilities. That's right. Speaker 6: () I wanted to ask what precautions, what planning is being done to get ... China was able to build hospitals in a matter of days."
    },
    {
      "text": "Are you prepared to use the Corps of Engineers or FEMA to start building the surge capacity that we may need in a couple of weeks? First of all, we hope we don't get there. That's what we're doing. That's why we're taking a very strict look at this. But we also are looking at areas and not only looking, we're expanding certain areas. We're taking over buildings that aren't used. We're doing a lot in that regard. We hope we don't have to get there, but we are doing a lot in that regard. Speaker 7: () Mr."
    },
    {
      "text": "President, can you clarify something? These guidelines say, \"Stay home if you're sick.\" Yesterday the Vice President said, \"No one should worry about losing a paycheck if they stay home when they're sick.\" But the House bill exempts companies of 500 employees or more from the paid sick leave requirement. That's 54% of the American workplace. Why is it a good idea to only require small businesses to provide paid sick leave? We're looking at that and we may be expanding that. We are looking at that."
    },
    {
      "text": "Speaker 7: () Do you then want to add big companies? We want fairness. We want it for everybody. No, we're looking at that through the Senate, because as you know the Senate is now digesting that bill. Speaker 7: () Do you then want them to add big companies? We may very well be adding something on that. Good question. Speaker 8: () Two questions here, Mr. President. One going off of what he was asking. How many ventilators and how many ICU beds do we have right now and will it be enough?"
    },
    {
      "text": "I could get back to you with that number. We've ordered a lot. We have quite a few, but it may not be enough. If it's not enough, we will have it by the time we need it. Hopefully we won't need them. Speaker 8: () And you'll give us the exact number? Yeah, we'll be able to give you- Speaker 8: () Because so far they have not given us an exact number. We can give you a number. If it's important, we'll give you a number. Go ahead."
    },
    {
      "text": "Speaker 8: () Yesterday you said that this was, \"Under tremendous control.\" Do you want to revisit that statement if we are going to be experiencing this until July or August, five more months ahead of right where we are now? When I'm talking about control, I'm saying we are doing a very good job within the confines of what we're dealing with. We're doing a very good job. There's been a tremendous amount of the way they're working together. They're working hand-in-hand. I think they're doing really a great job."
    },
    {
      "text": "From that standpoint, that's what I was referring to yesterday. Yeah, Steve, go ahead. Speaker 8: () You not saying, \"It's under control,\" right? I'm not referring to it. Meaning the- Speaker 8: () Coronavirus. Yeah, if you're talking about the virus, no. That's not under control for any place in the world. I think I read- Speaker 8: () Yesterday you had said it was. I think I read ... no, I didn't. I was talking about what we're doing is under control, but I'm not talking about the virus. Yes, please. Well, it may be."
    },
    {
      "text": "We're not thinking in terms of recession. We're thinking in terms of the virus. Once we stop I think there's a tremendous pent-up demand both in terms of the stock market, in terms of the economy. Once this goes away, once it goes through and we're done with it, I think you're going to see a tremendous, a tremendous surge. We're not really. We hope we don't have to, Steve. We think that hopefully we won't have to do that. But it's certainly something that we talk about every day. We haven't made that decision."
    },
    {
      "text": "Speaker 9: () Mr. President, can I ask you, doctors and nurses in this country are telling us across the board that they're terrified of this virus, of the fact that they can get it, or the fact that they might take it home to their families. What can you say to assure healthcare providers in this country that the federal government is doing something today to ensure that they get personal protective equipment to protect themselves and their family?"
    },
    {
      "text": "I think the federal government's doing everything that we can possibly do. We made some very good early decisions by keeping people out, by keeping countries out, certain countries where the infection was very immense. I noticed a lot of people are talking about South Korea because they've a good job on one side, but on the other side, tremendous problems at the beginning. They had tremendous problems and great numbers of death. I think that we've done a fantastic job from just about every standpoint."
    },
    {
      "text": "With that being said, no matter where you look, this is something. It's an invisible enemy. But we are speaking all the time, not only with the people, but also the professional people, the nurses, the doctors, they have been doing a fantastic job. We are also working very much on getting them the kind of equipment that they need. For the most part, they either have it or they will be getting it."
    },
    {
      "text": "But remember this, we want the governors, we want the mayors, we want them locally, from a local standpoint because it can go quicker, we want them to work. We had a great talk with the governors today. I think it was a really great talk. There's a tremendous coordination. There's a tremendous spirit that we have together with the governors. That's pretty much for the most part, bipartisan. Yeah. Speaker 10: () Mr. President, you told John that you think this could wash through, as you said, July, August."
    },
    {
      "text": "You just told Steve when he asked you about the possibility of a recession, you said, \"It may be.\" I'm curious if there is a recession, when do you think that might hit? I don't number one determine recession. I just say this. We have an invisible enemy. We have a problem that a month ago nobody ever thought about. I've read about it. I read about many years ago, 1917, 1918. I've seen all of the different problems similar to this that we've had. This is a bad one. This is a very bad one."
    },
    {
      "text": "This is bad in the sense that it's so contagious. It's just so contagious, sort of a record setting-type contagion. The good part is the young people they do very well and healthy people do very well. Very, very bad for older people, especially older people with problems. My focus is really on getting rid of this problem, this virus problem. Once we do that, everything else is going to fall into place. Yes, please. Speaker 11: () Mr."
    },
    {
      "text": "President, there were a lot of rumors last night that you were going to put in a national curfew or some kind of texting stuff. I've been watching. Speaker 11: () Right, exactly. Me too. Your people were saying this is a foreign disinformation campaign, is that what's going on? Are people messing with us on the internet? I don't know. That I can't tell you if they are or not. I think a lot of the media actually has been very fair. I think people are pulling together on this."
    },
    {
      "text": "I really think the media has been very fair. I think it could be that you have some foreign groups that are playing games, but it doesn't matter. We haven't really determined to do that at all and hopefully we won't have to. That's a very big step. It's a step we can take, but we have not decided to do it. Jennifer, go. I've heard that's true. I don't know that for a fact, but I know that some of my people have, as I understand it, have been dealing with them or with him. That's nice."
    },
    {
      "text": "We've had tremendous support from a lot of people that can help. I believe he was one of them. As far as the airlines are concerned, were going to back the airlines 100%. it's not their fault. It's nobody's fault unless you go to the original source, but it's nobody's fault. We're going to be in a position to help the airlines very much. We've told the airlines we're going to help them. We're going to be helping. We're going to be backstopping the airlines. We're going to be helping them very much, John."
    },
    {
      "text": "It's very important. Speaker 12: () What will you do about the stock market, sir? We're going to be looking at it very strongly. We have to back the airlines. It's not their fault. In fact, they were having a record season. Everybody was. They were having record seasons. Then this came out and it came out from nowhere. Not their fault, but we're going to be back the airline. Yeah. Speaker 13: () Stocks continue to fall today. Would the White House support negative rates?"
    },
    {
      "text": "Best thing I can do for the stock market is we have to get through this crisis. That's what I can do. That's the best thing we can do. That's what I think about. Once this virus has gone, I think you're going to have a stock market like nobody's ever seen before. Oh, okay. Speaker 14: () Thank you, Mr. President. Speaker 15: () Will people be voting tomorrow, Mr. President? Speaker 14: () Mr. President, the other day- Dr. Yeah. That would be the outside number. Speaker 14: () Mr. President- Hold on one second."
    },
    {
      "text": "Please, go ahead. Speaker 16: () To follow up. Do you want Senate Republicans to change the package that had passed the House last week even though you [crosstalk :11]- I think they may make it even better. Look, they're working together very well with the House. They are working very much in unison, like the question before. They're working to only enhance it and make it better and make it fair for everybody. That's what we're looking to do."
    },
    {
      "text": "We may go back and forth with the House a little bit, but both will be in a very positive fashion. Please. Speaker 17: () Mr. President, these new guidelines say avoid social gatherings and groups of more than 10 people. The CDC's recommendations yesterday were for people to avoid gatherings of more than 50 people. What's evolved in you and your team's thinking in just the past 24 hours. Also, what exactly do you need to see in a stimulus bill? Let me just have the professionals answer that."
    },
    {
      "text": "Would you like to do that? Please. Dr. Go ahead, Yes, Mike. Admiral, perhaps you could- Speaker 19: () Mr. Vice President, how many test kits have been sent out and how many people can actually be tested? I think the admiral can answer that and you might want to talk about the roving also. I think just to put it a different way, a lot of testing has been going on. I don't believe anybody has been able to do what we're doing and what we will be doing. This has never been done before."
    },
    {
      "text": "That's never been done and certainly not on a level like that. I will say that I think I can speak for the professionals that if you don't have the symptoms, if your doctor doesn't think you need it, don't get the test. Don't get the test. I think that's very important. Not everybody should run out and get the test, but we're able to handle tremendous numbers of people. John? We're looking into it. We've heard that. We've heard it from really two places."
    },
    {
      "text": "There are two places that have specifically, New York being one. We are looking into it very strongly. Yeah. Steve, go ahead please. I've always washed my hands a lot. I wash my hands a lot. Maybe, if anything, more, certainly not less. Speaker 20: () What was it like taking the test? Not something I want to do every day. I can tell you that. It's a little bit of ... good doctors in the White House, but it's a test. It's a test. It's a medical test. Nothing pleasant about it."
    },
    {
      "text": "Speaker 21: () You said that in a Tweet that Governor Cuomo should be doing more. I think he can do more. Speaker 21: () What specifically should he be doing if he can? I think he can do more. It's an area of the country that's very hot right now. I think New Rochelle, a place I know very well. I grew up right near New Rochelle. Place I know very well. I grew up right near New Rochelle. I think it's a very, no I think it's an area that has to be tamped down even more. Because it's a hotbed."
    },
    {
      "text": "There's no question about it. So I think they could look at doing it. But we're getting along very well. We've had a very, in fact, I noticed he made some statements just now that the relationship with the federal government has been good. That federal government has done everything they've wanted us to do. But we can, I think it's very important that all of the governors get along very well with us. And that we get along with the governors and I think that's happening. Well, we haven't thought of it."
    },
    {
      "text": "But you know, I will say this, we're very careful. We're very careful with being together. Even the people behind me they've been very strongly tested. I've been very strongly tested and we have to be very careful. But everybody should be very vigilant. We have to be vigilant. Yeah please. Go ahead please. Speaker 23: () Two simple questions for you Mr. President. Hold it, hold it. Before you. Speaker 24: () Okay. I don't know if this is a question for you or Dr. Birx. But Dr."
    },
    {
      "text": "Birx said that it is the millennials who are going to lead us through this and that now is the time to look out for the older people in our home. Older might be a state of mind, not necessarily an age. So for those millennials of us who have parents who are in their fifties, sixties, seventies what is older? What should we tell them at this point? Dr. I'd rate it a ten. I think we've done a great job."
    },
    {
      "text": "And it started with the fact that we kept a very highly infected country despite, even the professionals saying, \"No, it's too early to do that.\" We were very, very early with respect to China. And we would have a whole different situation in this country. If we didn't do that. I would rate ourselves and the professional. I think the professionals have done a fantastic job. As far as the testing. You heard the Admiral, I think the testing that we've done. We really took over an obsolete system."
    },
    {
      "text": "Or put it maybe in a different way, a system that wasn't meant to do anything like this. We took it over and we're doing something that's never been done in this country. And I think that we are doing very well. We took the system, we worked with the system we had and we broke down the system purposely. We broke it down in order to do what we're doing now. And within a short period of time and even now we're testing tremendous numbers of people. And ultimately you're saying, it will be what?"
    },
    {
      "text": "It will be up to how many people will be able to test? Yeah, normally. But I think when you hear the, \"This has never been done before in this country.\" If you look back take a look at some of the things that took place in '09 or '11 or whatever it may have been nobody's ever done anything like what we're doing. Now. I will also say Admiral, I think we can say that we're also getting this ready for the future. So that when we have a future problem, if and when, and hopefully we don't have anything like this."
    },
    {
      "text": "But if there is, we're going to be starting off from a much higher plateau. Because we were at a very, very low base. We had a system that was not meant for this. It was a smaller system. It was meant for a much different purpose and for that purpose it was fine. But not for this purpose. So we broke down the system and now we have something that's going to be and is very special and is ready for future problems. I think we can say that very strongly. Yeah. Go ahead please. Speaker 26: () Thank you Mr. President."
    },
    {
      "text": "How close are you to shutting down America's northern border with Canada? And could you also speak to the fact about the elections that are supposed to be taking place tomorrow? Is it your advice that those states postpone those elections? Well, I'd leave that up to the states. It's a big thing. Postponing an election. I think to me that really goes to the heart of what we're all about."
    },
    {
      "text": "I think postponing and elections is a very tough thing I know they're doing, because they've been in touch with us, they're doing it very carefully. They're spreading people out at great distances as you can see. And I think they'll do it very safely. I hope they do it very safely, but I think postponing elections is not a very good thing. They have lots of room and a lot of the electoral places. And I think that they will do it very well, but I think postponing is unnecessary."
    },
    {
      "text": "Speaker 26: () On the Norther border, sir? How close are you to shutting it down. [crosstalk :43] We think about it. We think about it. If we don't have to do it, that'll be good. We have very strong emergency powers when it comes to something like this, both on the Southern and the Northern borders. And we are talking about different things, but we'll see. Right now we have not decided to do that. Steve. Go ahead please. Speaker 29: () Dr."
    },
    {
      "text": "Fauci is there guidance for someone who may have felt sick but then feels better? So you had symptoms but you no longer do, your fever is gone away. How long would you stay home after that point? That's not clear from the guidelines. Dr. Yeah, no the marked will take care of itself. The market will be a very strong as soon as we get rid of the virus. Yes. I haven't heard that. I haven't heard that from Devin or anybody else. Speaker 31: () Should they stop saying that? Well I have to see what they said."
    },
    {
      "text": "But- Speaker 31: () They encouraged people to go to restaurants, if they felt okay with their families. Well, I would disagree with it. But right now we don't have an order one way or the other. We don't have an order, but I think it's probably better that you don't. Especially in certain areas, Oklahoma doesn't have a tremendous problem. You said the Governor of Oklahoma? Speaker 31: () Governor of Oklahoma, Devin Nunez- And Devin. Speaker 31: () ... was another. Yeah, well I had heard that."
    },
    {
      "text": "Speaker 31: () So should they be doing that or should they not be doing that in Oklahoma? [crosstalk :41] I would said verse to what the professionals are saying. Speaker 31: () And what you're saying in your guidelines. Yeah. Speaker 31: () Is that people shouldn't be going to restaurants. I'll take a look at it. Absolutely. Do you want to answer that? Dr. Well we haven't said that yet. Speaker 32: () Why not? We're recommending but- Speaker 32: () But if you think this would work. ... we're recommending things."
    },
    {
      "text": "No, we haven't gone to that step yet. That could happen, but we haven't gone there yet. Please. Speaker 33: () So on the election, you're saying it's a bad thing to postpone it. But if you've got the 10 person maximum guideline in a practical sense, can you have rallies? Primaries, surely gather more than ten people. Well hopefully it will pas through and hopefully everybody will be going to restaurants and flying and being on cruise ships and all of these different things that we do."
    },
    {
      "text": "And it will very, very hopefully be at a fairly quick period of time. But we're taking a tough stance. We may make certain other decisions, we may enhance those decisions. We're going to find out as per the question that you were asking, some of those decisions may be hence. How about one more? Jennifer. Yeah. One thing Mike just said, it's very important to get out that this is for the next, much of what we're talking about is for the next 15 days. Mike go ahead. Speaker 34: () Mr."
    },
    {
      "text": "Vice President have you been tested? Just one more. Steve go ahead please. Yeah. We had a G7. It was- It looks like it. Speaker 36: (:20) And are you confident in their responses? As you are with Europe? I am very confident. They're in a position that some of them are in a rough position. If you look at a couple of them. And some are heading toward pretty rough territory. We had a very good a conference. It was a teleconference. Everybody was on the phone, every leader."
    },
    {
      "text": "And almost a hundred percent was devoted to the subject that we're talking about today. And they are working very hard and they're very concerned obviously, but they're working very hard. But I would say just about all of it was Steve, all of it was devoted to what we're talking about. I think so. I mean so far it seems, we didn't even discuss that. It's still a ways off. But it was a very good discussion and there's a great comradery. There's a great togetherness. I think I can say that very, very strongly."
    }
  ]
}