{
  "speech_id": "243",
  "title": "Coronavirus Task Force Briefing Transcript March 17: Trump, Pence, Mnuchin Speak about COVID-19",
  "date": "20200317",
  "url": "https://www.rev.com/blog/transcripts/coronavirus-task-force-briefing-transcript-march-17-trump-pence-mnuchin-speak-about-covid-19",
  "topics": "Healthcare, Economy, Government Policy, Technology",
  "num_segments": 93,
  "content": [
    {
      "text": "Thank you very much everyone. Thank you. Progress being made and I appreciate you're all joining us. Last night the FDA announced groundbreaking new policies to further increase testing, very substantially so. All states can now authorize tests developed and used within their borders in addition to the FDA. So the states are very much involved."
    },
    {
      "text": "They have been involved from the beginning, but we're stepping it up as much as we can and the testing procedures are going well and within a short period of time, all of the private labs will kick in. This never been done before and it's going to be something very ... I think it's going to be incredible if it's done properly and these great companies. These are among the greatest companies in the world actually."
    },
    {
      "text": "So the state is going to be dealing through themselves and with local government, local physicians, local everybody. They're also dealing with us, but we have a tremendous testing capacity. Today we're also announcing a dramatic expansion of our Medicare Telehealth services. Medicare patients can now visit any doctor by phone or video conference at no additional costs, including with commonly used services like FaceTime and Skype, a historic breakthrough. This has not been done before either."
    },
    {
      "text": "In addition, states have the authority to recover Telehealth services for their medical patients and by doing this, the patient is not seeing the doctor per se, but they're seeing the doctor so there's no getting close. During this time, we will not enforce applicable HIPAA penalties so that doctors can greatly expand care for their patients using Telehealth. So the penalties won't be enforced. We encourage everyone to maximize use of Telehealth to limit exposure to the virus."
    },
    {
      "text": "It's been a very successful method of communication but never used on a scale like we're going to use the Telehealth. And you'll be able to also better maintain hospital capacity by doing this. Earlier this morning, I spoke with executives from America's fast food industry, Wendy's, McDonald's, all of the big ones, Burger King, and they were great. We were talking about the pickups in light of yesterday's guidance. You heard to avoid eating or drinking at bars, restaurants, or public food courts."
    },
    {
      "text": "We discussed the important role that the drive-through pickup and delivery service can play in the weeks ahead. So that's happening and they have been fantastic. They have been absolutely fantastic and they've been doing it already, but they're keeping it open and smaller staffs of very capable people and very capable companies and they're doing it, pickups. Our guidance yesterday urges Americans to take action for 15 days to help stem the outbreak, so it's a 15 day period."
    },
    {
      "text": "I guess now we'd say it's a 14 day period. It's 15 days from yesterday and we're asking everyone to work at home if possible, postpone unnecessary travel and limit social gatherings to no more than 10 people. By making shared sacrifices and temporary changes, we can protect the health of our people and we can protect our economy because I think our economy will come back very rapidly. So it's 15 days from yesterday. We'll see what happens after that."
    },
    {
      "text": "If we do this right, our country and the world frankly, but our country can be rolling again pretty quickly, pretty quickly. We have to fight that invisible enemy that I guess unknown, but we're getting to know it a lot better. Today, the Senate has taken up coronavirus legislation that includes free testing for those who need it, as well as paid sick leave and family medical leave for workers affected by the virus. We're also committed to getting small businesses the support that they need."
    },
    {
      "text": "In fact, one of the things we talked about with the fast food operations, we spoke to the chairman and CEOs of all of the companies, but one of the things we discussed is exactly that, getting small businesses' support and flexibility that they need for themselves and for their workers and that's being worked on right now. At my direction, Secretary Mnuchin is meeting today with senators on additional stimulus packages."
    },
    {
      "text": "I can tell you he's meeting with them late until the night last night and for a big part of the day yesterday and tremendous things are happening. There's great spirit, tremendous spirit, and I can say that for Republicans and Democrats. I can say that with respect to Governor Cuomo. We had a great talk this morning. We're both doing a really good job and we're coordinating it and we agree."
    },
    {
      "text": "Different states need different things and we agree on that 100%, but we had a very good talk and I think we're right down the same track and it's going to be very successful. New York has a pretty big problem I guess would be the number one hot spot. That's no fault of anybody's. It's just the way it is. But we're working very closely together. We're also getting FEMA very much involved. They've been involved but now we're getting them to a different level and we'll have everything ready."
    },
    {
      "text": "We're dealing with the Army Corps of engineers should that be necessary. We have them working in some cases, on standby in other cases, but my conversation with Andrew Cuomo was a very, very productive one and a very good one and I appreciate that. We're giving relief to affected industries and small businesses and we're ensuring that we emerge from this challenge with a prosperous and growing economy because that's what's going to happen. It's going to pop. One day we'll be standing possibly up here."
    },
    {
      "text": "We'll say, \"Well, we won,\" and we're going to say that. Sure as you're sitting there, we're going to say that, and we're going to win. I think we're going to win faster than people think, I hope. Later today, I'll meet with the leaders from the tourism industry as well as industrial supply retailers and wholesalers to discuss their critical roles. As you know, I met with the department store people, all of the retailers, the big ones including Walmart and others, and it was great meeting."
    },
    {
      "text": "They're stocking up their stores like they've never stocked them before. We're trying to get people to actually buy less, if that's possible. Buy less. Don't take everything, just buy what you need for a while. They're going to stay open all hours of the day and they've really been, they've been fantastic. We're taking aggressive action now as one nation and one family so that America can rebound stronger, frankly stronger than ever before."
    },
    {
      "text": "And we recognize that while many American workers can work from home, many others cannot. Many of our healthcare providers, first responders and men and women in the food service and manufacturing are showing that ... They're showing up and standing up to provide us with the goods and services we need."
    },
    {
      "text": "So we want people to stay home where they can, but many cases when you talk about food service and manufacturing certain items in particular, they're going in and they're practicing all of the safety rules and regulations that we talk about. So with that, I'd like to just introduce our great vice president, Mike Pence. He'll say a few words and then I'll make some other introductions. Thank you very much. I want to thank Chad Wolf and Homeland Security and the job they did at the airports was really incredible."
    },
    {
      "text": "They screened thousands and thousands of people. O'Hara got backed up a little bit, but they got them out but everybody was screened and screened very carefully. They didn't want to rush it. I think it was 13 airports and it was an incredible thing. Then they had a big surge also from the UK and Ireland and that went very smoothly, but they did a fantastic job. They work long hours and they did a fantastic job."
    },
    {
      "text": "I'd like to introduce Steven Mnuchin and then I'm going to ask Steve to leave because he's going to the Hill. He's been working very hard with the Senate and with actually with the House on a very, very big bold package. It's going to be big and it's going to be bold and the level again of enthusiasm to get something done, I don't think I've ever seen anything quite like it. So, Steve Mnuchin, please. Do you have any questions or the Secretary of the Treasury?"
    },
    {
      "text": "Speaker 47: () When you say a stimulus package for American workers, do you mean direct payments to Americans or are talking about a payroll tax holiday? Please, please wait please. Speaker 49: () What help are you going to give to airlines specifically? The airline industry will be in good shape. Yeah, go ahead please. Speaker 50: () There's been talk about a thousand dollar checks to every American increasing support among Republicans and some Democrats for that."
    },
    {
      "text": "Would you support that going to everyone or would you support some sort of income restriction on who gets a check? I think I think we're going to do something that gets money to them as quickly as possible. That may not be an accurate way of doing it because obviously some people shouldn't be getting checks for $1,000 and we'll have a pretty good idea by the end of the day what we're going to be doing. Speaker 51: () How would the mechanics of this work? I mean, we've been talking about a payroll tax holiday."
    },
    {
      "text": "Some $500 billion worth was floated today. So how would this idea of sending people a check work? Would that be sort of an advance on what they would pay in payroll checks? I have to say this, there are four different ways you can do it. You can hear me well enough, I imagine. People at home; those are very important people, especially your people. Look, we have four or five ways we can do it, four ways in particular."
    },
    {
      "text": "I think there's a fifth possibility but there are some very good ways of getting the money out and getting it out quickly. Payroll tax is one way, but it does come over a period of months, many months and we want to do something much faster than that. So I think we have ways of getting money out pretty quickly and very accurately. Speaker 52: () Can you talk about the timeline please? How quickly do you think you can get this done? We don't want to talk about it but it's a substantial number. We're going big."
    },
    {
      "text": "The expression, we could do it two ways. We could keep going back every day or every week. We're going big and that's where Mitch McConnell, that's the way he wants to go. That's the way I want to go. I think we want to get it done and have a big infusion as opposed to going through a little meetings every couple of days. We don't want to do it that way. We want to go big, go solid. The country is very strong. We've never been so strong and that's what we're going to be doing."
    },
    {
      "text": "We don't want with this invisible enemy, we don't want airlines going out of business. We don't want people losing their jobs or not having money to live when they were doing very well just four weeks ago. So we're going big and that's the way it'll be and that's the way everybody seems to like it on the Hill. Any other questions for Steve? Speaker 53: () In addition to airlines and hotels, you had a call with restaurants today. Was any type of emergency assistance discussed on that call?"
    },
    {
      "text": "A lot of restaurants have to close. Even if they are doing delivery, they're not making as much money as they would with a full house. Thanks, Steve. And the banks are record setting strong, so we have that, which is a much different event than what we had not so long ago. John, go ahead. Yes, we're starting to. We're starting the process and it's a process. We hope it's not going to be necessary, but it could be necessary."
    },
    {
      "text": "The state is working on it very hard themselves, but we'll probably supplement what they're doing. Speaker 55: () Given that many of the precursors for our pharmaceuticals come from China and there've been supply disruption, that supply chain has been broken to some degree. Do you expect that we could run into a shortage of prescription drugs? No, I don't see that at all and I think China has every incentive to make sure that things work well. China wants to make sure that things work very well."
    },
    {
      "text": "They have every incentive to do so. Jeff. Well, the Governor of Ohio is doing a great job. He called that off and we'll see what happens, is a court case and it hasn't been fully determined yet, but if he called it off I could understand that because you know he's definitely somebody that knows what he's doing. We'll be seeing very soon, they're going by the rule of 10 as opposed to 50 and it's pretty tough. I would say probably you could violate that if you wanted to for an election."
    },
    {
      "text": "I just think an election is a very special thing he's going to chose. He chose a different date, I think a date sometime in June but that would be a decision that would be made by him. He felt it was necessary. The courts are, somebody challenging it, so the courts will ultimately decide. What I'm doing? Yeah. What I'm doing John's, very simple. We're getting rid of this virus. That's what we're doing. That's the best thing we can do. By the way, for the markets, for everything. It's very simple, very simple solution."
    },
    {
      "text": "We want to get rid of it. We want to have very, as few deaths as possible. This is a horrible thing. You look at what's going on with Italy. We don't want to be in a position like that but a much larger because we're a much larger country. We don't want to be there and I think we've done really well. I think we've done well. I think the states have done well. We're all working together. The best thing we can do is get rid of the virus. Once that's gone, it's going to pop back like nobody's ever seen before."
    },
    {
      "text": "That's my opinion but I think it will pop back like nobody's ever seen before. Please. Speaker 56: () Just to follow up on John's question, specifically how many new hospital facilities could the Army Corps of Engineers build and also what specific measures are you taking to try to increase the number of ventilators in the stockpile? I ordered a massive numbers of ventilators. We have by any normal standards, we have a lot of respirators, ventilators."
    },
    {
      "text": "We have tremendous amounts of equipment but compared to what we're talking about here, this has never been done before. Yesterday I gave the governors the right to go order directly if they want, if they feel they can do it faster than going through the federal government. Now we've knocked out all of the bureaucracy. It's very direct, but it's still always faster to order directly and I gave them, that was totally misinterpreted by the New York Times on purpose unfortunately. But it's very important. Yes, Mike."
    },
    {
      "text": "Please. The Army Corps is very prepared to do, as we say, and we're looking at where it's going, and they do call them MASH hospitals, but the field hospitals go up very quickly there. We have them, we have all of this equipment in stock and we're looking at different sites in a few different locations and we're not going to need in West Virginia where so far I guess they have none. Still none. Still none. Right. West Virginia. Big Jim, the governors, he must be doing a good job. That's what's reported."
    },
    {
      "text": "Speaker 57: () Is that a reporting issue or is that they have no cases? Well, that's all.I just see. West Virginia is the only one that has no cases. So obviously that's being treated differently than a New Yorker or a California; different parts of California. I do say this though. The the Army Corps of Engineers is ready, willing and able. We have to give them the go ahead, if we find that it's going to be necessary. We think we can have quite a few units up very rapidly. I'm going to work with Governor Cuomo."
    },
    {
      "text": "I'm going to work with a number of the governors. Governor Newsome has been very generous in his words and I'm being generous to him too because we're all working together very well and I think a lot of very positive things have taken place. We're talking to California about different sites but we can, we can have a lot of units up fairly quickly if we think we need them. I think what I'll do is I might ask Sema to say a few words on the telehealth and then we can get back to this, please. Sema. Any questions?"
    },
    {
      "text": "Speaker 58: () Where do senior citizens go for instructions on how to do the telehealth? Will you be posting numbers also? That might be the easiest way to do it. If you post in ads, if you post some numbers. Thank you. Thank you very much. Admiral, if you'd say a few words about where we're going. Then I'd like to ask Dr. Birx to say a couple of words, but how the system's working? Thank you very much. Thank you, Admiral. This has never been done before."
    },
    {
      "text": "It sets a great roadmap for our future should we have something like this in the future. I hope we don't, but it's never been done before. They've done an incredible job. But again, we're working with the states and relying on the states. We have to because it's point of sale, its point of sight. We're in I think just about every instance getting along really well with the states. If I could, Dr. Birx, if you could say a couple of words, please? It's a big thing. Doctor, maybe a couple of questions?"
    },
    {
      "text": "Speaker 60: (:16) A question on the clinical data. We've had now roughly 5,000 people test positive. We've had 90 deaths or so. When are we going to know the data of who those people are? Who has been infected? What the ages are? What the preexisting conditions are? How serious it was both for those who have been tested positive but also those who have died? We've been very tough on those states. I know exactly who you're talking about. We've been very tough on them. Thank you. Please, go ahead."
    },
    {
      "text": "Speaker 62: (:35) Just a follow-up question on the testing. You've been telling us for days now that millions of tests have been sent out. Why have fewer than 60,000 people actually been tested? The states are actually doing a lot of it. The governors and the states are doing a lot of it with even our tests. Yeah, go ahead. Go ahead, please. Speaker 63: (:05) Thank you. Can you give us a sense of how long these tough new restrictions will need to be in place until we start to see the rate of this virus going down?"
    },
    {
      "text": "Also, can you speak to this study that as many as 2.2 million people in the United States could die if there weren't this type of action by the government taken? To what extent did that prompt what we saw yesterday? It's possible. It's possible. We'll see how it goes. There's been great cooperation with the local governments, states. We'll see how it goes. It's going right now pretty well. Yeah. Please, go ahead. Speaker 63: (:08) Can I have a follow on that, Mr. President, very quickly, just very quickly? Go ahead."
    },
    {
      "text": "Speaker 63: (:11) Do you need to invoke the Defense Production Act to get more of those medical supplies to different hospitals across- We're able to do that if we have to. Right now we haven't had to, but it's certainly ready if I want it. We can do it very quickly. We've studied it very closely over two weeks ago, actually. We'll make that decision pretty quickly if we need it. We hope we don't need it. It's a big step."
    },
    {
      "text": "Speaker 63: (:31) Because the states really need more help from the federal government when it comes to those supplies. When you say the states- Speaker 63: (:34) What do you say to those governors? In particular, three states need some help. Some states have two people, three people, no people. In the case of, again, West Virginia. We're looking at it very closely. We've taken it apart 15 different ways. It's a very difficult thing to do. It's a very big step. If we need that step, we'll take it. Okay."
    },
    {
      "text": "I would just say enjoy your home, stay. I would just say right now we have to get this problem fixed and then we'll get back into business really quick. We'll open up our country. We'll open up our society. The world will hopefully open up. We see areas of the world that haven't done well. We see areas that are doing very well. I would put us in the category of doing very well for a country so big. I think that I would recommend that they just enjoy their living room. Yeah, go ahead please."
    },
    {
      "text": "Speaker 64: (:40) What do you say to people who are not heeding these guidelines from the White House? Then also I have a question on asymptomatic people for Doctor Birx. I'm not happy with those people if they're not, but those people are being shouted down by other people. They know it. It's almost like self-policing. People went in. There were a couple of instances, I guess, probably more than a couple of where people are not happy when they see others doing what they're not supposed to be doing."
    },
    {
      "text": "We have to get rid of this. We have to win this war and ideally quickly, quickly. Because the longer it takes, it's not a good situation. I'm not even talking about the economy. I'm talking about the lives of a lot of people. Yeah, please. Did you have one? Speaker 65: (:20) Will the White House put any restrictions on corporate bonuses for companies that do get bailed out like airlines? I think I'm going to ask Mike, answer that question. We've had so much incredible ... I don't know."
    },
    {
      "text": "It's almost the word spirit is the best word. It's like a spirit. The banks have come in. The banks are doing things that they would've never done. They're working on extensions and lots of things that they wouldn't have done. Copays with regard to the insurance companies, I mean for them to be doing what they're doing. You know all about the copays. They would have never done that. They did it. They were in my office. I would say the 11 biggest in this country, I guess probably the 11 biggest of the world."
    },
    {
      "text": "The big ones, all the big ones. They did things on copay that nobody would be doing that they wouldn't have done in a million years, but they're doing it. There's a great spirit going on right now in the country. You want to ... yes, please. Speaker 66: (:56) Question for Dr. Fauci. Dr. Fauci, you've said you liked being accused of overreacting because that is an indication we may be doing things necessary to beat this, bend the curve. Dr. Go ahead, please."
    },
    {
      "text": "Speaker 69: (:58) When is the soonest that we'll know that these new guidelines are actually bending the curve and are actually working? Is there a point in time where in the next couple of weeks where you'll be able to tell the President more draconian measures are needed? Dr. Go ahead, please. Speaker 70: (:20) Dr. Fauci, I have a question regarding the 15-day guidelines which were announced yesterday. One of those guidelines was a recommendation against gatherings of 10 or more people."
    },
    {
      "text": "Today, the governor of Alabama issued her own guidelines. It was a recommendation against gatherings of 25 or more people. What is your recommendation for people of Alabama, people across all of the country as far as the guidelines that were announced yesterday by the federal government? Dr. We're looking at many ideas. That's one of them, frankly. We're looking at creating incentives for companies. Not only that type of company, but other companies."
    },
    {
      "text": "We're also looking to help companies such as the airline industry, within the airline industry. We'll be doing that. We will be doing that. This is not their fault. They've been very understanding actually. We're going to be helping them. We will have a very powerful airline industry. It'll start up as soon as this is over. We'll have those planes ready to go. We have to help them during the short term. It's very important. Yeah, please. Speaker 72: (:46) Thank you, Mr. President."
    },
    {
      "text": "I wanted to know, have you taken a look at some of these models such as the Imperial College London model? That kind of poses a very difficult choice, whether it's shutting down society or overwhelming the healthcare system? Is that something that you been considering? We've looked at every model. We've relied on the very talented people and there's no better team than the people behind me. I will say that all of the people that have done those models are all in constant touch with Dr."
    },
    {
      "text": "Birx and Tony and everybody that you've been hearing so much from over the last couple of weeks. We've looked at many different models. The model we have is we want to save a lot of lives. We want to save a lot of lives. If we get too steep on that curve, you're going to lose a lot of lives, perhaps unnecessarily. Now we're going to find out, everything has a risk. We're going to see. But if people do what we're telling them to do, what we're asking them to do, you're going to see the saving of a lot of lives."
    },
    {
      "text": "Now, Boris, in UK yesterday, you saw what happened. It looked like they were going a different way, but then he went away of similar, I guess similar, I don't know exactly. But I would say we had a conversation yesterday similar to what we're doing. A lot of people seem to think this is going to be ... we are looking to save the maximum number of lives. We are looking to save the maximum number of lives. Everything else is going to come back."
    },
    {
      "text": "A life is never going to come back, but everything else, our economy is going to come roaring back. You're going to know. We're going to know. We're going to all know that day. Somebody was asking about the day. When will you know? When will you know? We're going to know. All of a sudden we're going to say, \"Wow, that's looking good. That's looking good. That's looking good.\" We're going to be on the other side of the curve, and that's a day that we look forward to. Okay?"
    },
    {
      "text": "Speaker 73: (:25) Is there something, sir, that you saw this week though that that made you decide that, yes, now is the time to implement these much more stringent social-distancing measures? This week [crosstalk :37] No, I don't think so. This is where we're going. I really think from the beginning, this is where we were going. This is what we had in mind. We're just going step by step. That was the next step. The next logical step as Dr."
    },
    {
      "text": "Fauci said and I think very importantly, one of the most important things when you write the history of this was the fact that we closed it down to China and Europe, but in particular China, we closed it down to China, the source very, very early, very, very early, far earlier than even the great professionals wanted to do. I think in the end that's going to be, that will have saved a tremendous number of lives."
    },
    {
      "text": "Speaker 74: (:14) A quick follow-up, one on the economy and the other on the broader picture here, but just to follow up on my colleague, some people did note that your tone seemed more somber yesterday. You talked about that August timeline. Did you see a projection? Some people thought perhaps that two million potentially that could die, maybe prompted part of that. Was there a shift in tone? I mean I have seen that where people actually liked it, but I didn't feel different."
    },
    {
      "text": "I've always known this is a pandemic. I felt it was a pandemic long before it was called a pandemic. All you had to do is look at other countries. I think now it's in almost 120 countries all over the world. No, I've always viewed it as very series. There was no difference yesterday from days before. I feel the tone is similar, but some people said it wasn't. Speaker 74: (:03) Last one of the economy. Your former economic advisor said almost a 100% chance of a recession. Do you see it that way? It could be."
    },
    {
      "text": "I mean, I don't think in terms of recession. I think in terms of getting it out, because when we're finished with the virus, we will win. We will win, and when that victory takes place, our economy's going to go through the roof. It is so pent up. It is so built up. It is so ready to go in an upward direction, but we have to knock out this enemy. This is a really tough enemy, but we have to knock out, all of us. That's all of us. I don't think in terms of recession, not recession, it's words."
    },
    {
      "text": "We have to knock out this and we will have an economy. I actually think we'll have an economy like we've never had before. It's all pent up. Did you have something say Mike? Yes. In other words, reduce the number of people that die. That's what we're trying to do. When you do the steep curve, a lot of people are going to die. A lot of people. The worst ever, they say 1918, and I don't have to go into the numbers, but they were unbelievable numbers."
    },
    {
      "text": "Had they known and had they done what we had now, it would've been a very much different story. It would still be tragic, but it would have been a very much different. But that was the one that people write about. That was an incredible pandemic like we haven't seen, but we have done something that, I hope, hopefully we will all have made the right moves. We're all in this together including you and we want to see fair press."
    },
    {
      "text": "I'll tell you what it's been, generally speaking, I think it's been a great thing to see. Getting along with Democrats getting along with Republicans for the Democrats themselves. There's been a lot of spirit. There's been a lot of things happening that I haven't seen happen in the first almost now three and a half years. It's been very nice to see. That's one of the good things, but really the good thing is we have to knock it out."
    },
    {
      "text": "We have to win and we want to keep that slope as low as possible because that's a lot of lives in there. Let's go back there for somebody that didn't get one, please. Go ahead. Speaker 75: (:34) Mr. President, this is had a huge impact on China's economy as well. Have you received any indication from officials there that they're going to have trouble meeting the purchase agreements part of the phase-one deal, particularly the agricultural buy? Well, they need our product very badly. No, I haven't received any."
    },
    {
      "text": "Good relationship with China. I have not received anything to that. No, we have a signed agreement. They're going to be buying and they have been buying a lot of product. Yeah, please. Speaker 76: (:00) Earlier today Dr. Burks was talking about the possibility of our hospital system being overburdened, overtaxed and she talked about the certain options that are available to the United States if that happens, including VA hospitals, Department of Defense, medical treatment facilities, and even hospitals shifts."
    },
    {
      "text": "At what point do you tap into those options? Well, I'll know the point by speaking with Governor Cuomo and other governors, we're going to know the points. It's going to be different for New York then it's going to be for Iowa or from Idaho or from West Virginia, frankly, or for any. It's different. New York has got a big problem. The state of Washington has a big problem. California has some big problems. Everyone's doing a good job, but we're going to know when it will be."
    },
    {
      "text": "I believe it'll be more spot that it will be, it's not going to be the whole thing. It's going to be spots. There are some hotspots that are in trouble, big trouble, and there are other areas that are in no trouble at all. They watch it on television. They don't know. It's just not affecting them. They're lucky. They're lucky. But there are areas of the country that don't have much of a problem and some that don't have any problem, they're not going to have a problem with hospitals."
    },
    {
      "text": "But some areas like New York, California, state of Washington, they're going to have some difficulty. When we see that coming, we're going to be in there. We're already making preparation for it. Well, we're looking at different things, John. I don't want to say exactly right now. China has been sending us everything we need but we're looking at some alternatives. Yes, we are looking for alternatives. And we have other places. Ireland does a lot of work for us. You know that. In that world, in the pharma world."
    },
    {
      "text": "A very tremendous producer and we are looking to bring a lot more back home. Excuse me, you know me for a long time, I've been talking about this for many years, long before I decided to run for president, I've been talking about this. We have to be able to take care of our country and that was one of the many things on the list, so we'll be talking about it. But we are discussing it and Marco is very much involved and Peter is very much involved. A lot of people are involved. A lot of people feel that way."
    },
    {
      "text": "But we'll be discussing. Let's go, please. Speaker 77: (:32) Thank you, sir. Canada has closed its borders to non-citizens, are you considering- Not to the United States. Speaker 77: (:39) Not to the United States, of course. Are you considering closing the land borders in the United States? Also you've discussed- Well, Canada has not closed it to the United States. Speaker 77: (:45) Right, right. We're working very closely with Canada. But they have not closed it."
    },
    {
      "text": "They have closed it to the world, but they have not closed it to the United States. Speaker 77: (:52) Are considering closing the US land borders? I don't want to say that, but we are discussing things with Canada and we're discussing things with Mexico, quite honestly. Again, the relationship is outstanding with both. Outstanding. We just signed our deal, USMCA, and the relationship is very strong. Go ahead, please."
    },
    {
      "text": "Speaker 78: (:13) China and others have criticized you for using the phrase \"Chinese virus.\" How do you feel about that? Are you going to continue using that phrase? Well, China was putting out information, which was false, that our military gave this to them. That was false. Rather than having an argument, I said I have to call it where it came from. It did come from China. I think it's a very accurate term. But no, I didn't appreciate the fact that China was saying that our military gave it to them."
    },
    {
      "text": "Our military did not give it to anybody. Speaker 78: (:45) Critics say using that phrase creates a stigma. No, I don't think so. No. I think saying that our military gave it to them creates a stigma. Please. Speaker 79: (:56) When you speak to travel and tourism executives today, what specific help are you going to offer to them if at all? Or is it still vague? Well, we're going to help. They need help. Look, let's face it. You know they go from having record-breaking years."
    },
    {
      "text": "This is the third year of record-breaking years. Travel and tourism, airlines, everything. They were doing record numbers, ordering new planes, building new hotels. Everything was really a hunky dory. Then one day we hear about this rumor in China and then we find out it's much more than a rumor and then all of a sudden we make a great decision to close it up early. It would be a whole different world. It would be a whole different world, but we make a decision to close it up to China and all of a sudden tourism."
    },
    {
      "text": "Then we close it up to Europe, which people never heard of this before. I'm not sure that that's ever been done. I know that when I made the decision to close it China people told me that's never been done before, but it was a great decision. We make good decisions. I'll tell you my best decision. The people behind me are total pros. All over the world, they're respected. Dr. Burks, Anthony, who's become a ... Where's Anthony. He's become a major television star for all the right reasons."
    },
    {
      "text": "No, he's just so professional, so good. The people that we have working here have been incredible. They're totally respected. The admiral has been incredible having to do with the testing. Incredible. He's viewing this as testing also for the future. We're building a platform. When we took over this platform, first thing the admiral said was \"This was not designed for what we're talking about. Millions of people.\" It wasn't. It's nobody's fault. It's not like who could have ever predicted a thing like this?"
    },
    {
      "text": "But we broke it down and it's really going to be an incredible system. It is now a great system. I just want to say these are incredible people standing behind me. They're the most respected in the world. Every country that you've mentioned today so far has called them and they call them all the time for advice. There's nobody better than what we have. Speaker 80: (:04) Why haven't we seen Dr. Redfield the last couple of days? I don't know. I can't imagine. Speaker 81: (:08) He's in Atlanta running the CDC."
    },
    {
      "text": "[crosstalk :10] I can tell you he's doing a good job. We're very happy with him. Please, you have it. Go ahead. Speaker 82: (:16) Mr. President, yesterday we were being told that the payroll tax was going to comprise the lion's share of the fiscal stimulus. Right. Speaker 82: (:24) We also had the markets fall quite dramatically yesterday. Did that inform your- It wasn't about the payroll tax. Speaker 82: (:34) Did that inform your decision? What made you make that change and when did you make that change?"
    },
    {
      "text": "Well, I didn't make a change. We're looking at payroll tax and we're looking at various other forms of getting money to people. The payroll tax is something that I've always liked. The problem is, it does take a period of time, months before they really see something. We don't really have months in terms of people living. You have people that work on tips. It's a large number of people. Who would think this, right? And they do nicely. They work very hard, but they work on tips. We have to take care of our people."
    },
    {
      "text": "We don't want to have people suffering during this period. It wasn't their fault that this thing all of a sudden was upon us. We're looking at various, we're also looking at payroll tax. It's possible. It's also possible we'll do a percentage of payroll tax and then other things. But we'd like to be able to get money to people. We're very lucky. Our country's doing so well. We can do this and we can do it easily, but we have to do it."
    },
    {
      "text": "I have to say Mitch McConnell, if you look at Mitch and Kevin and the whole group and it's been incredible how they're reacting, how Congress is reacting, whether it's the House or Senate, how they're moving. I'm talking about Democrats and Republicans, but we've had a tremendous leadership meetings and they want to see it done right, and they do want to go big. I think going big is important. I don't think we want to go up there every day with a different idea, a different concept."
    },
    {
      "text": "Oh gee, let's worry about the airlines. Let's do this one. You have a big problem with the cruise ship industry. It's an industry that we're setting all sorts of records two months ago. Then all of a sudden there's nobody on the ships. Okay? We have to help these. These are great industry. These are going to be taking care of people and passengers and for years to come and paying tremendous taxes, tremendous taxes for years to come. We have to make sure that this is done. Yes, John?"
    },
    {
      "text": "I only do that when I have to respond. I watched her on television. She said something that was false and therefore I did do that and I will continue to do that. If they're not going to play fair because you know they have the media on their side. I don't. I just have me. If they're not going to play fair, I'm going to do that. If they are going to play fair, there's going to be nobody. There's going to be nobody better than Donald Trump in terms of a bipartisanship."
    },
    {
      "text": "But if they're going to say things that are false, like the story that was written yesterday. A lot of people, I don't know somebody, I think I know who, but they taped the conference call that I had with the governors. It was a good call. It was fine. I assume somebody's going to tape it. They handed it to various people and one of them was the New York Times and the New York Times chose to write totally inaccurately about it. It was a disgraceful thing. It was bad journalism, but they do a lot of bad journalism."
    },
    {
      "text": "But we respond to that, and actually people get it. People get it. No, I want it to be bipartisan and nobody's going to be better than me, but when they attack me or the people, these incredible people behind me, I'm not going to let them get away with that. I can't do that. Okay. How about one or two more questions? Go ahead, please. Please. Speaker 74: (:09) You said that the 15-day guidelines was the next natural step."
    },
    {
      "text": "Is the next natural step after that a national lockdown, similar to what San Francisco is doing? Well, you can do a national lockdown. Hopefully, we're not going to need that. We think of everything. I mean we have every idea that you mentioned we've thought of. It's a very big step. That's a step that, I mean in one sense it would work. It's a very big step. It's something we talk about, but we haven't decided to do that. Please, go ahead. Speaker 83: (:34) Mr."
    },
    {
      "text": "President, what would be the determining factors for you to take that action? I just don't think it's going to be an action that we're going to take. I don't think I'll talk, but Anthony, all of the people standing behind me, we'd get together in a room plus some additionals and we would make a decision, but I don't think that's a step that we're going to be taking. One more question. You didn't have one, did you? Come on."
    },
    {
      "text": "Speaker 84: (:59) Will the US government provide financial assistance to Boeing and airplane suppliers like GE? We're looking at that. We're certainly looking at Boeing. Boeing got hit hard in many different ways. Boeing never had a problem for years. It was unthinkable what happened with respect to Boeing. Unthinkable. Probably I would consider it the greatest company in the world prior to a year ago. Now they get hit in 15 different ways and they have different management. I've met the new people running Boeing."
    },
    {
      "text": "I think it's going to be outstanding. But yeah, we have to protect Boeing. We have to absolutely help Boeing. They were doing a job. It was coming along well and then all of a sudden this hits. Obviously, when the airlines aren't doing well, Boeing's not going to be doing well, so we'll helping Boeing. Yeah. Speaker 85: (:50) Mr. President, before you leave, on what John was saying, you've called for people to leave politics out of this."
    },
    {
      "text": "Joe Biden said the World Health Organization offered testing kits that they had available to the United States and they'd give it to us now. We refused it. We didn't want to buy them. PolitiFact says the WHO never made that offer. Can you tell us what actually happened? That's what I heard. I'm going to let Tony answer that question or whoever's best at answering that."
    },
    {
      "text": "But I do have to say, when you talk about politics, I watched the debate, not too exciting, but what they said about me, and we've done a great job when you talk about not being bipartisan, what they said about me. If you look at a swine flu, the whole thing in I guess it was 2009 and what they did and the mistakes they've made, they were terrible. They were horrific mistakes. 17,000 people died. I'll be honest, they shouldn't be criticizing because we've done a fantastic job."
    },
    {
      "text": "The only thing we haven't done well is to get good press. We've done a fantastic job, but it hasn't been appreciated. Even the closing down of the borders, which had never been done, and not only did we close them, but we'd close them early. The press doesn't like writing about it. We've done a poor job on press relationships. I guess I don't know who to blame for that. I don't know. Maybe I can blame ourselves for that? I will blame ourselves. But I think we've done a great job."
    },
    {
      "text": "I think we've done a poor job in terms of press relationship. But let me have somebody answer your question. Please. Good answer. That's a good answer. Would you have something on that? Speaker 86: (:42) I'm just going to emphasize a little bit more on that. When I became involved in the testing world, I called as senior officials at the WHO as I could find to understand what the situation was. As far as I can tell from sources that should know, no one ever offered a test that we refused. That's what I heard too."
    },
    {
      "text": "Speaker 86: (:04) This is a research-grade test, right? Research-grade test that was never submit- Speaker 81: (:09) Not approved. Speaker 86: (:09) Not approved, not submitted to the FDA, that was supplied in tens of thousands of quantities to a hundred countries in the world. Okay? I think there's a lot that people are saying about this. This is based on rumor and myth. Nothing was offered that we refused. It was a research test that was not approved."
    },
    {
      "text": "Again, there was a small number that we have greatly surpassed in a very short period of time. Number one, nothing was offered. Number two, it was a bad test. Otherwise, it was wonderful. Listen, thank you very much. No, he made a mistake. I assume that he'll apologize for that mistake. Thank you all very much. We'll be back."
    }
  ]
}