{
  "speech_id": "244",
  "title": "Donald Trump Meeting Transcript with Tourism Industry Reps Amid Coronavirus Pandemic",
  "date": "20200317",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-meeting-transcript-with-tourism-industry-reps-amid-coronavirus-pandemic",
  "topics": "Economy, Healthcare, Government Policy",
  "num_segments": 20,
  "content": [
    {
      "text": "Well, thank you very much. We have the tourism industry executives, the biggest anywhere in the world. These are the great ones, and they're going to say a couple of little words pretty soon, I think, we'll talk about their company quickly and the number of employees, and what's happened since the Chinese virus came about, and they'll be discussing that. So we're join this afternoon by the true leaders of our nation's travel, hospitality and tourism industries, and I want to thank you all for being here."
    },
    {
      "text": "I've known many of you for a long time. Great people. I want to thank vice president Pence for his tremendous leadership on the task force. He's done a great job, and thanks also to secretary Mnuchin over at the Hill. They've been working and Wilbur Ross, and everybody basically, they're all working. We're all working very hard. We're profoundly grateful to all of the companies and organizations here today representing tens of thousands of American workers, and really representing something so important."
    },
    {
      "text": "It's a place to stay when they come to our country. Such a big business. One of the biggest businesses. And thank you for adopting additional protocols to keep Americans healthy, including enhanced cleaning processes throughout your hotels and buildings. We know that your industry is among the hardest hit by the economic impact of the virus."
    },
    {
      "text": "Our goal is to beat the virus, and we will, we call it the hidden virus, the hidden enemy, with aggressive action now, so that we can rebound stronger than ever before, and that's what we're doing. And everyone's cooperating. We're really getting tremendous spirit, the Republicans are getting along with Democrats, and a lot of good things are happening. Yesterday we issued new guidelines for how all Americans can minimize their risk of exposure, and stop the transmission of the virus."
    },
    {
      "text": "My administration has taken decisive action to support American workers, and businesses. We love our workers. We love those workers. They're incredible. And we're going to come out stronger than ever before, and it's not going to be so long. The IRS will defer tax payments for effected individuals and businesses."
    },
    {
      "text": "Today, the Senate has taken up legislation to provide for free testing, and that'll happen, paid sick and family medical leave and nutritional assistance for the vulnerable, we're announcing, and we will be announcing again later on, that we're working with Congress to provide rapid relief for affected workers in industries. And this will allow us to emerge from the strongest economy on earth, because we had literally the strongest economy on earth."
    },
    {
      "text": "And now this is in, as of last count, over 124 countries, I understand. 124 countries, unbelievable. But we'll emerge, I really believe we'll emerge stronger, because we'll be doing things differently than this country's done them in the past for many, many decades. And we're deeply committed to ensuring that small businesses have the support they require, the Small Business Administration announced disaster loans, which provide impacted businesses with up to $2 million."
    },
    {
      "text": "And we've asked Congress to increase the SBA lending authority. We're going to be going up to 50 billion, and actually much more than that for small businesses. So there'll be help. In your cases, they're very big businesses, but it's a lot of employees, and so we appreciate it very much. We appreciate your being here, and maybe in front of the media, you could say a couple of words about your companies, and the number of people that you employ. I pretty much know every one of you in that respect."
    },
    {
      "text": "It's a lot of people, and they're great companies. Please. And tell me, so you're in many countries, and how are you doing in other countries? Some are in very, very bad shape. And that's pretty much all over the world. Well, we'll get it open soon and we're doing a Yeoman's effort. I think we're going to be very successful. You'll be back in business soon. But we have to keep your employees going. And the businesses going. And we will be able to do that, Chris, thank you. But all over the world it's a disaster. Yep."
    },
    {
      "text": "Thank you very much. Please. Thank you very much. With the banks. Yeah. We're dealing with the banks too. The banks have been very accommodating. They will be. I think they will be. Thank you David. Appreciate it. Please. How many hotel rooms now, worldwide? And this all started in China. That's where you first saw the problem, and it's where you first got hit. Hope you all heard that. Is China doing better now? 2%. In Macau? So that means it's coming. We're in the process. We haven't hit that top yet, we're in the process."
    },
    {
      "text": "Thank you Arne. Thank you. Yep, we will. Okay, give us those suggestions. Yeah. To what? Okay. So it's individual properties instead of accumulated primaries. Okay, I got it. Thank you very much. Thank you Patrick. Mark H.: () Thank you. Mark Hoplamazian, CEO of Hyatt Hotels. We have 950 hotels around the world, and we have 600 in the United States. Over 70,000 employees. And I'm not going to repeat a lot of the things that were said. We've been tracking..."
    },
    {
      "text": "we have a large base of group business in the United States, big meetings and conventions. And we've been tracking major cancellations. We now have tracked in the US alone, canceled events. And I'm not talking about major sports leagues that have shut down, or universities and those kinds of things, but actual convenings, conventions, big meetings. You have some of the sports leagues right? Mark H.: () As customers. You have quite a few. Yeah, I would think so."
    },
    {
      "text": "Mark H.: () But when we look at just the other meetings that have been canceled, they involve attendees of over one and a half million people. So when you think about the ecosystem impact, it's major convention markets where those attendees are not showing up. So they're not traveling on airplanes, but they're not staying in our hotels. They're also not going out to restaurants. And so the collective impact is quite significant."
    },
    {
      "text": "I think the key issue that I would leave you with is that the urgency is very high, because day-by-day, the occupancy rates have dropped precipitously. So now we are seeing occupancies below 10% in the single digits, for the vast majority of our hotels. Whereas a week ago, they were 20, 30 points higher than that. It's happened very rapidly. When this ends, do you see a quick buildup? Mark H.: () I think that all depends on how confident people are to get back on planes and start traveling again."
    },
    {
      "text": "So I think that's really the key issue. We've got to also position ourselves to get people back into their jobs, either retain them, or rehire them. One of those two things are critical, because we all are proud of the people that we employ, and we want to retain them. So whether we can retain them, or have some assistance and get them and rehired early.So that we can spool back up. Hopefully you can retain them. Mark H.: () Hopefully we can. That's what we're shooting for. You want to retain them."
    },
    {
      "text": "What kind of a fund would that be? In terms of dollars. I got it. I think so too. I think so too. Thank you very much. Hi Jim. We couldn't get you a chair? What happened? I think so. Okay, we'll get it done here. We'll get it done. Is that what you like the best of the various scenarios? Most direct, not as quick, but most direct. Thank you. Let me ask you, the parks outside of the United States- Closed? You closed all of the parks, everything. Closed. That's a real worldwide problem, isn't it? That's incredible."
    },
    {
      "text": "You guys okay? Yes, please. But they'll come back as we age a little bit, right? Yeah, I think so. May come back fast. Thank you very much. Okay, thank you all very much. Thank you. Please. Speaker 12: () Press, come on guys let's go. Speaker 13: () How much money are you talking, if you're sending checks to everybody, how much money are you talking about? That's all being figured now, and we're also helping industries like Boeing, we have to help Boeing, we have to help the airline industry. It wasn't their fault."
    },
    {
      "text": "This wasn't their fault, and we will do that. We'll be doing that. So we're adding it up. It'll be fine. It'll come back very quickly once we're finished with our war with the virus. Speaker 14: () Mr. President, this idea of the payroll tax holiday, nothing as big as 12.4% has ever been tried. They did 2% in 2010. They've done it in smaller amounts, yeah. Speaker 14: () They've done it in smaller amounts. Can the country afford something that big? Well, it can definitely afford it."
    },
    {
      "text": "The question is, do we want to go through payroll, and do what we want to do. There are four other ways of doing it, and that's what we're determining, along with the Senate right now. Senate and House, we're all working on this together. Thank you all very much. Speaker 12: () Press, let's go, we're finished. Come on guys. Press, we're done. Let's go."
    },
    {
      "text": "Speaker 15: () What is your message to the tens of thousands of employees, of all of these companies, who've been furloughed, they live paycheck to paycheck in many cases. What is your message to them Mr. President? Well, the message is that this was something that happened. It's nobody's fault. It happened. And we're going to take care of it. We'll be bigger, stronger, better than ever before, and it won't take that long. Thank you very much. Speaker 12: () All right press, let's go."
    }
  ]
}