{
  "speech_id": "250",
  "title": "Transcript: Trump Holds Coronavirus Meeting with Pharmaceutical Executives",
  "date": "20200302",
  "url": "https://www.rev.com/blog/transcripts/transcript-trump-holds-coronavirus-meeting-with-pharmaceutical-executives",
  "topics": "Healthcare, Government Policy, Economy",
  "num_segments": 60,
  "content": [
    {
      "text": "Discuss how the federal government can accelerate the development of vaccines and therapeutic treatments for the coronavirus. We want to welcome Dr. Deborah Birx. And Dr. Birx has been to the White House a lot over her career, and she's now going to be here working with Mike Pence and everybody full-time. And we appreciate it. We appreciate it very much, Dr. Birx, and a real expert in her field. And if you'd like, you can ask her a couple of questions when we're finished."
    },
    {
      "text": "We're working very hard to expedite the longer process of developing a vaccine. We're also moving with maximum speed to develop therapies so that we can help people recover as quickly as possible. We have a lot of recovery going on. We want to see if we can advance that. It's likely that therapies will be available before a vaccine is actually ready and we'll seek to bring all effective treatments to market as soon as possible. Some very good work has been done on the vaccine."
    },
    {
      "text": "Since the start of the outbreak, my administration has taken the most aggressive action in history to protect our citizens, including closing our borders very early, a lot earlier than people wanted us to do and that turned out to be a good decision. I ordered sweeping travel restrictions, increased travel advisory levels, established screening measures and opposed historic quarantines. We have quarantines all over the country."
    },
    {
      "text": "A lot of the Coronavirus shows the importance of bringing manufacturing back to America so that we are producing at home, the medicines and equipment and everything else that we need to protect the public's health. And I've been talking about this for a long time. That process has already started. It started long before we ever knew about this. We want to make certain things at home. We want to be doing our manufacturing at home."
    },
    {
      "text": "It's not only done in China, it's done in many other places, including Ireland and a lot of places make our different drugs and things that we need so badly. And it's not good to be dealing with one or two or three countries and we do very little at home and we're going to start doing it at home. And we've been talking about that for long time. And a lot of the drug companies, because of what we've done in terms of incentives and taxes, they're heading back here anyway."
    },
    {
      "text": "The Coronavirus shows the importance of bringing all of that manufacturing back to America, and we will have that started. It's already started, frankly. It started about a year ago. The White House Coronavirus Task Force led by Vice President Mike Pence has been meeting daily and coordinating closely with the state and local governments."
    },
    {
      "text": "Mike had a call today with 53 governors and I heard it was a very good call and everybody's very well coordinated and the Governors and the States, all of them, I can't think of an exception, they've been really working closely with us. It's been a very good relationship. We will confront this challenge together and we will continue to do exactly what we're doing and we're going to be very successful. A lot of things are happening, a lot of very exciting things are happening and they're happening very rapidly."
    },
    {
      "text": "So with that, I'd like to introduce Mike and you can say a little bit as to your calls and some of the things that are happening today. And Alex maybe you can give a little update and then we'll go around the room and people can introduce themselves, if that's okay? Go ahead, please. Supplemental is moving along very rapidly. Everyone wants to get that done. Moving along quickly, Emma, please. Thank you, Emma. Beautiful. Thank you very much. Please, Anthony, go ahead."
    },
    {
      "text": "I'd like you to say something anyway, I think [inaudible :31]. Thank you, Tony, very much. Bob? Thank you, Bob. Please. Thank you very much. Appreciate it. John, go ahead, please. When do you think you could have the vaccine? When do you think you'd be able to have it, start producing it? All right. Okay. Thank you very much. Lenny? That means you'd be able to use a vaccine that early? That process would be faster than John's?"
    },
    {
      "text": "So this would be a combination of a vaccine and also it will put it in a different way, make you better quicker. That's true. Thank you very much. Thanks, Lenny. Appreciate it. Please. And what is your timing then? What would you say? So you're talking over the next few months you think you can have a vaccine? Yeah. And how long would that take? So you're talking within a- Lenny's talking about two months. In a couple of months. I mean, I like the sound of a couple of months better. Let's be honest."
    },
    {
      "text": "Ready to use [crosstalk :33]- Ready to use when? Would you say. Ready to use? For next season. Go quickly. What do you say to that, Lenny? That's a good idea. Speaker 1: () So yeah. So that's, I think, why Dr. Fouchey is being a little bit cautious. I don't want to speak for him. We need to prove that. I think that with our technology, by knowing that we have neutralizing antibodies that we give, we know that this approach worked for Ebola. We know that it worked for MERS in animals."
    },
    {
      "text": "We'd have a greater degree of confidence that this would work sooner, I think. Okay. Speaker 1: () But that's just the way it is. Thank you very much. Daniel. Good. Let's talk about that. Right. Incredible what they done with HIV, incredible. So we're saying 10 years, but now we're into 9 years because it could have been started earlier and somebody else didn't start it earlier. But we started it right away. And I'm now saying, I started off saying 10 years, now I'm down to nine years."
    },
    {
      "text": "Do you think by the end of nine years, HIV is where? Can you imagine? We'll be eliminated in this country. That's such a great thing. If you remember back 10 years ago, horrible that was and a little beyond the 10 years and now, to think about what's happened. So Daniel, let's talk about this- So you have a medicine that's already involved with the coronaviruses and now you have to see if it's specifically for this. When? You can know that tomorrow, can't you? Any response yet? Anything here? Anything?"
    },
    {
      "text": "Would you go to Washington state where it seems to have the problem? I think it's a great idea. Yeah. You can go to specifically the nursing home where that outbreak? When will that take place? If Tony is involved, it'll be tomorrow morning. So when will you know of it works? I mean you already have this medicine. When will you know? That's good. And you've already built the facility to manufacture? This would be tremendous news if that works because you're there. I mean you're there. You have the plant."
    },
    {
      "text": "Do you have everything ready? That's very exciting. Get it done, Daniel. Don't disappoint us, Daniel. Do you understand that? Great company, really great company. Thank you. Doctor, perhaps you'd like to say a few words, please. Thank you. Thank you. You do a fantastic job. Please. Do you expect to be dealing with each other a little bit? You're competitors, but in this case it's different. This is something we want to get done very quickly. Do you expect to be sharing your own capabilities with Pfizer and everybody else?"
    },
    {
      "text": "Good. I agree. We would appreciate that. Do you see that happening because I noticed you have a few different variants of what we're talking about? Do you see that happening where maybe there are different either therapeutics, or vaccines, or both where you use combinations of each in different areas? I think that's fantastic. I love it. Yeah. I love the complimentary. If you can do that, I love the complementary. Yeah, that's fantastic. Thank you very much. That's really very exciting. Please."
    },
    {
      "text": "We can give you an area too where we. Now we can. I mean, you take a look at Seattle again, we can give you an area. If you don't mind, yeah. All right, thank you very much. You'll have our help. Thank you. Please. Did you have different concepts and methods than, you know, Pfizer and Johnson & Johnson? All great companies. Are you having different? Some seem to be faster than others, and others, they do seem to be different concepts. And that's different from the others?"
    },
    {
      "text": "So can you have it ready for next season, any of you? I mean would you say for next season? That would be your goal. It seems to be very seasonal, right? You've got to make sure it works. And doesn't hurt. Right. I agree. I agree. Thank you very much. Thank you. Great company. Thank you. Speaker 1: () Dr. [inaudible :09]. Would you like to say something? Thank you. Speaker 11 Louis?: () Mr. President, Mr. Vice President, thank you for saving the most exciting company for the last. So we're Novavax."
    },
    {
      "text": "We're down the street in Maryland. We're a vaccine company. We make recombinant nanoparticles. We make respiratory vaccines. We have two in phase three trials. We have an RSV vaccine where we vaccinated 4,600 pregnant women to protect infants from RSV disease and the youngest kids. We have a flu vaccine. We all know we need a better flu vaccine, and we have one in phase three trials we're going to unblind in four weeks, exciting time for the company."
    },
    {
      "text": "Speaker 11 Louis?: () But we actually are a company that is focused on emerging infectious diseases. We've made two coronavirus vaccines. We've made one for SARS. We made one for MERS. We tested MERS all the way through animal challenge trials and showed 100% infection protection. Speaker 11 Louis?: () We have an Ebola vaccine that with the NIH showed in four different nonhuman primate studies that we had 100% protection at extremely low doses. And we've made a pandemic flu vaccine for H7N9 and others."
    },
    {
      "text": "And we've twice now taken from the gene sequence to the first in human studies done in 90 days and published it in the New England Journal. And we're once again doing the same thing since the gene sequence was identified, I think it published on January 10th. We've taken our same recombinant nanoparticle platform and have been in animal studies for a couple of weeks. We expect data this week from one of them. Speaker 1: () And on this is on corona? Speaker 11 Louis?: () I'm sorry, on corona, yes."
    },
    {
      "text": "And we're going into nonhuman primates this week with a coronavirus vaccine candidate. So what do you think in terms of timing? What do you think? Speaker 11 Louis?: () Timing is what you hear around the table with this. We can get into humans in the May-June timetable, and in a phase one study also, but we'll have primate data. So those are unheard of speeds, I think, right? Pretty much. Well make it very easy for you, and we have to be very safe, but those are unheard of speeds. Go ahead, Louis."
    },
    {
      "text": "Speaker 11 Louis?: () No, and we're trying to identify scale so that we can get to the billion unit scale, both where we have a vaccine antigen and we also have an adjuvant. And we put those together and you get the most promising result we think. And so we desperately need and have good relationships with the FDA and to work with the FDA to see where, instead of waiting 30 days to get to an IND, you get it in 10 days or 20, whatever the number is."
    },
    {
      "text": "Speaker 11 Louis?: () But there are a lot of things that we could do with the FDA. And frankly, we need money. We're a biotech company. I am not one of the larger pharma companies, and so we need money to get scaled. You work with the other companies also? Speaker 11 Louis?: () We have worked with the other companies. In this particular instance, we have not yet, but can. Dr. Stephen Hahn, by the way, is the new head of the FDA for those of you that don't know."
    },
    {
      "text": "And he's one of the most respected people in the country, and this is the man we wanted, and this is the man we got. You didn't know you were going to be hit with this your first month. You've been here for a couple of months and this was a pretty big. Debra, would you like to say something? It is, very exciting, and the speed is very exciting, too. Anybody else have anything to say? Anybody at all? Speaker 3: () I've got something on the screening."
    },
    {
      "text": "So, we set up already an industry construction where everyone is now able to submit, biotech or pharmaceuticals, to submit to a screening, which is set up for everybody supported by Barda and supported by Europe. Yeah. That's fantastic. You'll move rapidly. Media, would you like to ask any questions of any of the geniuses around the table? Speaker 4: () Mr. President, what economic stimulus measures are you considering to boost the economy as a result of the virus? Well, I guess the market's up today."
    },
    {
      "text": "Our country is very strong economically, as you know. This was something that came out of China that was a big surprise to the world. It happened just a few weeks ago. I'm sure the Fed is looking at it. I hope the Fed is looking at it. They should be, but a lot of these central banks are looking at it for stimulus. One thing I want to add, we keep talking about for America, but really we're looking at for a cure for the whole world because this is a world cure, not just the United States."
    },
    {
      "text": "We want to take care of the United States, but whatever we do is going to inure it to the benefit of the world, so we want to do that. Fortunately, some of your companies are so large, you can handle that. But you work together, thereby making it even better, so we appreciate that. We would love to have you work together on this. Get it done and get it done safely and quickly. But I think, we're in very strong shape, very strong shape financially. I have to tell you."
    },
    {
      "text": "I came into the room not expecting to hear quite what I've heard, but a lot of work has already been done. We've been encouraging them for the last few weeks. I mean literally from the first day, when we shut down the border, so to speak, we shut it down to China, something we didn't like to do, but we made a good decision. But we also called some of the companies around the table, said, \"Get going. Just in case, get going.\" We're very proud of the work that some of them have done."
    },
    {
      "text": "Some are very advanced already on this particular coronavirus, so we appreciate it. That's tremendous news, and I think the speed is a lot greater than a lot of people would have thought. Speaker 4: () Do you see a need for federal dollars to go to some of these drug companies? I think two of the CEOs around the table- I don't know. I think you're so rich. I know the companies very well. Some of them are so rich, I think they can actually loan money to the federal government. They don't need money. They need time."
    },
    {
      "text": "I think what they need more than anything else, Dan, you might tell me, but I think what you need is FDA and Tony have to help you get through the process as quickly as possible, the bureaucratic stuff and we don't have bureaucrats here. We have people that really know how to get it done between Tony, and Bob, and Steven, they'll get you folks through very, very quickly. [crosstalk :17]."
    },
    {
      "text": "Speaker 4: () Do you think that they should have called an emergency meeting before the meeting in a couple of weeks that cooperates, is your administration- Well, I think they should have had a meeting already, so I think they should have, and the central banks are going to be talking about various things tomorrow, but we'll see what happens. But I think they should have had a meeting already. I don't know what takes them so long. [crosstalk :40]. I'll see what happens. Let's see what happens tomorrow."
    },
    {
      "text": "Speaker 5: () What would you say to Americans who are buying out all the hand sanitizers at CVS? Buying what? Speaker 5: () Buying out all the hand sanitizers at CVS, or stockpiling groceries and face masks. We're concerned about a long term situation. Speaker 6: () Listen, as the President has said and we've said from the outset, we're going to see more cases here in the United States, and we need to be prepared. We prepare for the worst case. We hope for the best case."
    },
    {
      "text": "Part of preparing is normal preparedness activities by individuals. Go to cdc.gov to get information about just sound preparedness at home like you would have for a hurricane or for the flu season. That's the same type of activity now, so having some food, having some hand sanitizer, but frankly soap and water are good, a good soap and water hand washing for an appropriate amount of time. If you look@cdc.gov for guidance, is as effective as that kind of sanitizer, but people should not be panicked."
    },
    {
      "text": "They shouldn't be. I know they may feel that. They may feel a sense of unease. They feel the uncertainty. We're trying to reveal all information we have, but there are steps people could take like that, just good everyday prepared us. Nothing different today than I would have advised six months ago to people. Speaker 7: () Mr. President, are you considering tightening any of the travel regulations that you said- Yes, we are to certain countries where they have more of a breakout. We are."
    },
    {
      "text": "You know what those countries are. I don't have to say, but we are doing that, and we've already done it, as you know, with three countries in addition to China. So, we will be doing it. Yes. Speaker 8: () Mr. President, you said supplementals here. What's the [inaudible :24], and are you also considering a national emergency declaration that would allow states and local governments [inaudible :32]? I don't think you'll need that because I really think we're in extremely good shape."
    },
    {
      "text": "We're prepared for anything and we could always do that at a later date if we need it. But I don't think we need that at this stage. Interestingly, we were discussing it. A question I get asked a lot by people is on average you lose from 26,000 to 70,000 or so and even some cases more from the flu. We have deaths of that per year, worldwide it's hundreds of thousands of deaths from the common flu. They ask what's the difference and how does this differ?"
    },
    {
      "text": "I guess there are things that are similar and things that are different. Every one of them is different. It might not be a bad question to ask because I get that all the time. So far we have six here. You have in other countries, I mean China obviously got hit the hardest. I noticed that South Korea is hit very hard. Italy is being hit very hard. But I would like to maybe now, because I am often times asked. We average, I suspect, Tony, I think you said from around 26, 27,000 up to 60 or 70,000 deaths per year."
    },
    {
      "text": "That's a lot of deaths. Here we're talking about a much smaller range. Now, hopefully it stays at a much smaller range. Again, we're prepared for anything. Could I ask you, or any of you, if you'd like to answer that question? What would the public think when you have so many? That's taken routinely, and I was shocked to hear this. Three, four weeks ago I said, \"Well, how many people die a year from the flu?\" Of this country, I think last year was 36 or 37,000 people."
    },
    {
      "text": "I'm saying, \"Wow, nobody knew that information worldwide.\" You just multiply it out times the world, right? So, what is the difference then? Speaker 9: () Well, I think there are people around the table that probably are more medically qualified, but I mean, clearly when we're bringing up represented around the table is the ability to prevent an endemic of sorts and the ability to treat. Those two things going together, I think, are really, really important as the best [inaudible :37] presented."
    },
    {
      "text": "We may have to up our research on the flu. Speaker 9: () Well, yeah, right. The common flu. Speaker 9: () We have treatments for the flu, and we have vaccinations for the flu, and we need to continue to improve upon. Doctor. Speaker 9: () We've actually taken on the challenge that you just mentioned."
    },
    {
      "text": "So, we are investing in what could be new technology to completely [inaudible :56] out from a flu, and you need to think about how you can move fast from the first cases to have the right type of vaccine, and how you can be able to manufacture it very fast, because I think you are right on to point that the numbers in flu are so large and we haven't come to that level yet."
    },
    {
      "text": "But I think it's also the fear that there is no experience yet with these survivors, and we don't have the feeling of going to CVS and get the flu vaccine, or use some of the drugs. But I think you've summarized it very well. These are challenges we should take on year by year that [inaudible :34] and protect lives. [crosstalk :]. Including, Tony, that maybe we have to step up our work on the flu because when you lose that many people, that's something. Dr."
    },
    {
      "text": "Because I notice every year they say a different vaccine, they have a little different, a little, and then you know, I hear numbers that are not great, 60%, 70% coverage success, and yet I hear numbers that are better than that with respect to corona. You think you can really knock it out and that's because you know specifically what it is, I suspect, so that's impressive. What do you think Lenny?"
    },
    {
      "text": "Speaker 10: () I think one thing we can be sure and we're going to be surprised about what happens over the next couple of months, and we've got to be prepared as you're trying to do for every surprise that'll come at us, because remember, maybe 100 million people, I was just checking, get vaccinated for the flu, even if there's 60% protection. We have nobody in this country vaccinated for coronavirus right now, so that if it goes through the- But the same vaccine could not work."
    },
    {
      "text": "You take a solid flu vaccine, you don't think that would have an impact or much of an impact on corona? Speaker 10: () No, probably none. So, that's why you have a difference when you have a population that is totally naked to this virus. That's why a vaccine approach getting out as quick as we can of course is paramount."
    },
    {
      "text": "The other thing is we have a group of people around this table, myself included, who are in an industry where optimism is an essential part of the toolkit, but realism is that 95% of what we all work on doesn't go too far. Speaker 10: () So, that's why it's so important to have so many different approaches. We can't- It seems to me just based on what you said and also what the other folks said from great companies, companies I know very well from just seeing what they do, and I find it very interesting."
    },
    {
      "text": "I have for a long time. It would seem to me that you already know pretty much where you're going, and where you're headed, and what the answer's going to be. It would seem that, Steve. Doesn't it seem? You seem to know what the answer is to this. You have to get it done, or is that too optimistic a statement? Speaker 9: () I think some of the new technologies that have come, that we heard today about [inaudible :08] MR 99, where you use completely new tools and technologies."
    },
    {
      "text": "They give us an opportunity to move fast, and that's why some of the companies that have been working under the CDC can quickly change priorities and need huge public health threat. Speaker 9: () But, I think we should take on as a team to do something with seasonal flu, and actually I think, Robert Redfield, that has been one of your key priorities, and we have certainly picked up on that. By the way, it'd be a great thing if you could do that."
    },
    {
      "text": "Just aside from this meeting, if you could do that, that would be a great thing. Does anybody else have anything to say, please? Well, I want to just thank you all very much for being here and it's a very optimistic meeting. I didn't realize you were that far advanced and you'll get together if you have to. You'll deal with Tony and Bob, and you'll deal with Steven and get it done. We need it. We want it fast. Okay? [crosstalk :02]. Speaker 11: () Mr."
    },
    {
      "text": "President, do you expect that this will take longer, probably than you would like? I don't know what the time will be. I don't think they know what the time would be. I've heard very quick numbers, a matter of months, and I've heard pretty much a year would be an outside number. So, I think that's not a bad range. But if you're talking about three to four months in a couple of cases, and a year in other cases. Wouldn't you say, doctor, would that be about right?"
    },
    {
      "text": "Speaker 11: () Is it realistic to think, really, that a vaccine could be ready- Well, you have the greatest companies in the world sitting around the table. I mean, Johnson and Johnson, and Pfizer, and all of the companies, Gilead, you have all of these great companies and that's what they're saying. So, I think that- Dr. Well, I think treatment, in many ways, it might be more exciting. Speaker 12: () Yeah. That's what I think."
    },
    {
      "text": "Ambassador Birx, I think, laid out a really nice framework as we think about managing expectations, which is be thinking antiviral therapeutics, transitioning to monoclonal antibodies, and eventually to vaccines, as we think about the continuum of research and development here. Is that fair for [inaudible :32]? Well, I think, Tony, I think that's interesting because the concept of treatment in a certain way, especially when you have people that are looking for treatment, they're beyond the vaccine stage."
    },
    {
      "text": "That would be very exciting. Dr. So, then what would be your timing for treatment therapeutics, commonly known as, I call it, what would be your number? Speaker 13: () For us, we can think about producing 20,000 doses by the end of the summer of a course of treatment, and as Doctor Fauci said, you're going to find out very quickly. It's not going to be a mystery whether these things work or not. We're pretty confident that ours is the monoclonal antibody approach."
    },
    {
      "text": "We think that that approach has a very high probability in the near term of delivering. So, treatment, I mean just for the media, so the treatment element of it goes faster than the vaccine element of it, which in my opinion in this case would be better. Go ahead, please sir. Speaker 14: () Mr. President, I mean, [inaudible :46] our medicine is in phase three trials right now and these trials are conducted very fast."
    },
    {
      "text": "I mean, we're talking about 30 day endpoints, so you recruit them, you know in 30 days, once you recruit, whether it works or not. Thankfully, so far the drug seems to be very safe, but we have to determine is its level of efficacy, it's clinical effectiveness, and that as I said, we'll know potentially as early as April. So, it could be used as a treatment. Somebody is sick, they have the problem, Tony, when do you think it could be used? Dr. How good is that? You hear that, Jeff?"
    },
    {
      "text": "That's good even by your standpoint, Jeff. Speaker 6: () Well, let me give you an example, for instance, with the Regeneron product with Ebola. So, Tony Fauci and his team, and the World Health Organization ran a historic forearm clinical trial in the war zone in eastern Congo, and two of the products, one of them developed by NIAID, and the other [crosstalk :55] one developed by Regeneron proved so effective that the ethical board said stop on the other two. I'm sorry, yeah."
    },
    {
      "text": "[crosstalk :03] They said, and start treating, and when I went to the Congo, I got to see people that even before FDA approval are being treated still in the extension of this clinical trial, and being cured of Ebola now, walking out where they would have had a death sentence before. That's what we would try to do. Speaker 15: () So, for us, that's an end of the summer type of an event. Speaker 6: () That's what we would try to do. He just got back from the Congo and that's dedication."
    },
    {
      "text": "That was not an easy trip, wasn't it? Speaker 15: () I mean, it wasn't easy to do that trail there, but kudos to Tony. I want to thank everybody in this room. Mike, go ahead. That's fantastic. Anybody delays you, please call me. They don't just call Tony and Bob. Speaker 16: () The DOW jumped 1300 points today. 1300? Speaker 16: () Yeah, 1293, 5%. They must have heard about this meeting. Who's talking outside? This is very optimistic."
    },
    {
      "text": "I know optimism, and not optimism, and the worst pessimism, and I will tell you, the whole thing with therapeutics to me is very exciting, and obviously vaccine, but therapeutics is very exciting, especially when you're so far advanced. That's great. That's really great. Thank you. Thank you very much. Say hello to everybody. [crosstalk :54] [inaudible :00]"
    }
  ]
}