{
  "speech_id": "262",
  "title": "Donald Trump Hosts First 2024 Presidential Campaign Rally in Waco, Texas Transcript",
  "date": "20230327",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-hosts-first-2024-presidential-campaign-rally-in-waco-texas-transcript",
  "topics": "Government Policy, Immigration",
  "num_segments": 58,
  "content": [
    {
      "text": "It's an honor to be here. I say hello Texas, a big hello to Texas. We had tremendous victories in Texas. It's great to be back in this beautiful and incredible state with thousands of proud, hardworking American patriots. () From deep in my heart, thank you for your prayers and thank you for your love, and thank you for that incredible overwhelming support that we've had. Mr. Lieutenant Governor, thank you very much. You've been my friend for a long time, Dan, thank you."
    },
    {
      "text": "() Before we begin, I also want to express our sadness and send our prayers who's been touched by the devastating tornadoes today. A lot of people were killed. We love you all for seven years. You know that we've all been fighting together. Those people were fighting with us too. No longer with us. Devastating. But for seven years, you and I have been taking on the corrupt, rotten and sinister forces trying to destroy America. They've been trying to destroy it."
    },
    {
      "text": "They're not going to do it, but they do get closer and closer with rigged elections. They get closer and closer. () We've been the ones in this fight standing up to the globalists and standing up to the Marxists and communists. That's what they are. We don't even talk about the socialists anymore. That train left that station a long time ago. Standing up to the war mongers, the stupid war mongers, and the neocons and the rhinos, the big money, special interests, the open border fanatics, crazy people."
    },
    {
      "text": "Standing up to the fake news media. Look at all of them there. That's a big group. Big group, but they don't want to tell the truth. That's why most of them are going down the tubes. You look at what's happening with media, they're going down the tubes because they don't want to tell the truth. They don't want to talk about what's happening with the laptop from hell. They don't want to talk about those things. That's what's happening to them."
    },
    {
      "text": "But the vultures of these sellouts who got rich bleeding America dry, our opponents have done everything they can to crush our spirit and to break our will, but they failed. They've only made us stronger. () 2024 is the final battle. That's going to be the big one. If you put me back in the White House, their rein will be over and America will be a free nation once again. Our enemies are desperate to stop us because they know that we are the only ones who can stop them. They know that."
    },
    {
      "text": "There's never been a movement like this in the history of our country, probably in the history of almost every country. MAGA, Make America Great Again, America First, call it whatever you want, but I will tell you there's never been in history... Look at this crowd, as far as the eye can see, we flew over. It was a beautiful sight, as far as the eye can see. I did tell your great lieutenant governor. I said, \"Dan, let's not do one of those 50/50 areas or an area we're a little behind."
    },
    {
      "text": "Let's go right into the heart of it. Come on, let's go. Let's go where we were close to a hundred percent.\" That's what we did. But as far as the eye can see, the abuses of power that we're currently witnessing at all levels of government will go down as among the most shameful, corrupt and depraved chapters in all of American history. It's happening right before your eyes, but we're going to end up winning."
    },
    {
      "text": "() The Biden regime's weaponization of law enforcement against their political opponent is something straight out of the Stalinist Russia Horror Show. We go, Stalinist Russia. That's what it was. This was where it seems to have begun from the standpoint of us watching it in semi-modern day history. You go back to communist China or look at a third world. Banana Republic, that's what we've become. Between our borders, our elections, and the weaponization of law enforcement, Banana Republic."
    },
    {
      "text": "That's what we have become. () Let there be no doubt the injustice is being done, not only to me, but to dozens across our country will not stand and we're not going to stand for it. When this election is over, I will be the President of the United States. You will be vindicated and proud and the thugs and criminals who are corrupting our justice system will be defeated, discredited, and totally disgraced. That's what's happening. That's what's happened."
    },
    {
      "text": "() From the beginning, it's been one witch hunt and phony investigation after another. Because of it, our country never talks about greatness anymore. You look at what China does, they go all over the world. They spend money. They take over governments, they do a lot of things, and we're always looking. We got crazy people like Schiff, shifty Schiff, and Hillary, and all of these people. These people, they don't want to talk about greatness for our country."
    },
    {
      "text": "All they want to do is investigate everybody, but they are the ones that are really under investigation. () I also want to thank the Republican Congress because people can be critical, but they are working so hard. Jim Jordan, James Comer, he's become a great star. These are great people putting themselves at risk because they take a lot of abuse, but they're doing something that we haven't seen in Washington in 25 years. I want to just thank those two and many people that are working with them."
    },
    {
      "text": "() In my case, every piece of my personal life, financial life, business life and public life has been turned upside down and dissected like no one in the history of our country, Marjorie, I think we can say, right? I don't think we can find anybody. They even got the Supreme Court of the United States to give them by tax returns, something that was never supposed to happen. Legal scholars say that's a shocker."
    },
    {
      "text": "Everything they wanted about me, they got every single thing they wanted about me, the Supreme Court said, \"Give it to the prosecutors. That's okay. He only appointed three of them.\" Not a lot of... We don't want loyalty. We want what's right, but sort of strange, isn't it? Give them everything they want. They actually came down with one ruling that no, no, you can't do that to presidents, but to Trump, you can. To Trump, you can. () We've been a special administration and we have special people."
    },
    {
      "text": "There's nobody like the people we have. They're the smartest. They're the best. These are the most... Look at all the money they're sitting over here. They're all over because... And you know what? They've made that money the old fashioned way. Speaker 1 You're right. Front row Joe. The front row Joe's, we'll never forget them, and my friends from North Carolina who are unbelievable, beautiful, incredible women, incredible people. They travel all over. What is this? Number 93, I think, right? Number 93."
    },
    {
      "text": "They go, \"No, actually more,\" but we appreciate it. Speaker 1 101, front row Joe, 101. All the Joe's. But the Supreme Court is afraid, just like Republicans are afraid, to do something about what has happened and they have to fight. The Supreme Court didn't have the courage to right the wrong of the 2020 election. They knew what was going on. () Tax returns were always considered sacred. Lawyers, in their own way, if you can believe this, were considered sacred."
    },
    {
      "text": "Today, lawyers go before Grand jurors all over this place, if they happen to be lawyers representing Republicans and they treat lawyers like they're criminals. It used to be if you had a lawyer, the lawyer was somebody that was very much considered from the standpoint of what we are talking about above reproach. Now they get thrown in with everybody else. It's a very unusual situation that's taking place."
    },
    {
      "text": "Again, legal scholars can't believe what they're witnessing, and yet after going over 11 million pages of documents, I've built a great company, they've got nothing. They've got nothing. Think of it. 11 million pages, and my tax returns on top of it, and they're a big return. It probably makes me the most innocent man in the history of our country. () Friends of mine say that. A very successful friend of mine said, \"You know what? President...\" On page three, they got me."
    },
    {
      "text": "They got 11 million pages we gave over to various groups, including Congress. The new weapon being used by out of control unhinged Democrats to cheat on election is criminally investigating a candidate, bad publicity and all. You got bad publicity. It's the craziest thing. I got bad publicity and my poll numbers have gone through the roof. Would you explain this to me? Explain that to me, Dan, Mr. Congressman. You got to explain it to me because nobody else has ever heard of it. But you know what?"
    },
    {
      "text": "It gets so much publicity that the case actually gets adjudicated in the press. People see it's bullshit and they go and they say it's unfair, but it takes place by the Department of Injustice and their local henchman at the AG and DA's offices throughout the country. () They use the local offices like in New York City, like in Atlanta, like in Chicago and Los Angeles. They make lives miserable, destroy their families and friends, even though they know these people are innocent. In many cases, they're patriots."
    },
    {
      "text": "They're not guilty of anything, and yet they have to go through hell. If you're running for office, even Dan, but I don't think they'd ever go after him, but we have some great congressmen that probably they wouldn't go after because they're too clean. They're the cleanest people I've ever met. They come from Texas, they have to be clean. () But let's say they're not that well known. They're doing a good job and an investigation has started into one of these many great people. They're going to lose their race."
    },
    {
      "text": "They're going to lose their race. They do it all the time. They're using investigations now instead of... Because it's harder for them to stuff the ballot boxes of which they stuffed plenty. Marjorie is here, truth to vote, and they found at least 5 million instances on tape and the courts didn't want to even look at it."
    },
    {
      "text": "The district attorney of New York under the auspices and direction of the Department of Injustice in Washington, DC was investigating me for something that is not a crime, not a misdemeanor, not an affair. I never liked horse face. I never liked... I never... It's just not. That's a terrible thing. That wouldn't be the one. There is no one. () We have a great First Lady, who people really do love and she's done an incredible job. Not an error, not anything."
    },
    {
      "text": "They have nothing, and yet it went on and on and on and continues to. He stacked his office with DC operatives, a man named Matthew Colangelo, one of the top people in the Department of Justice was moved into the Manhattan DA's office to make sure that Trump got taken care of."
    },
    {
      "text": "They couldn't get it done in Washington, so they said, \"Let's use local offices.\" They have Colangelo, the top, just about the top, one of the top people under the Attorney General Garland, and they sent him into New York to be in the Manhattan office. Can you imagine that? In order to prosecute and do everything he could to get rid of Trump, because our poll numbers are through the roof. I guess you've seen that. They don't like it. They don't like it. We won in 2016."
    },
    {
      "text": "We won by much more in 2020, but it was rigged. () In 2020, I got the most votes of any sitting president in history. We won the most counties in the United States in the history of our country, many, many, many times more than Biden won, and yet they said we lost. What we have to do is swamp them this time. The one thing that really does prevail, I heard all of your different speakers talking about what to do."
    },
    {
      "text": "We used to like to hold out on Tuesday, till Tuesday, and everybody goes in and votes, and then in some cases you go in and vote and the machines are all broken. That's what they do to you. That's what they did to some very special people. You know that. They had a state, a certain state, everybody was so proud. Republicans like to vote on Tuesday. They went in and the machines, a lot of the machines were broken, so they had to stand line for 10 hours and more, and actually many of them never got to vote."
    },
    {
      "text": "() That's what they do. They always seemed to find an answer. It's what they're good at. They're good at stealing, lying. They're good at keeping borders open. They're good at no voter ID. Why don't they want voter ID? Think of it. 88% of the Democrats want voter ID, but not the leadership. There's only one reason you don't want voter ID, because you want to cheat on elections. The Republicans cannot take it any longer. They have to get tougher, but they cannot take it."
    },
    {
      "text": "These Washington Republicans like Mitch McConnell, who's the absolute worst. They've got to get tougher. They got to get like Marjorie Taylor Greene, you happen to be here. Would you like to run for the Senate? I will fight like hell for you, I tell you. Where's Matt Gates? I heard his speech. Oh, Matt, look at Matt. () Boy, he laid it out there, didn't he? I was watching. I said, \"Maybe he's gone a little too far,\" and then I realized, no, he hasn't. That's really... He's given some very good facts and people like it."
    },
    {
      "text": "That's why he wins his district by a tremendous amount. Well, they weaponized him too. They weaponized him. They made up phony charges, and he went through two years of hell and he turned out to be a brave guy. It is a good test. You have to say that, Matt. It's a hell of a test. We learn about people. It's almost like going to school, taking a test. He got an A plus of that test. () I mean it Matt. They took the word of a proven liar, a convicted felon, and a disbarred lawyer, all the same person, believe it or not."
    },
    {
      "text": "You wouldn't think that could go to one person. It would be 3, 4, 5, over some of the most respected and prestigious people in the country and in New York City, some of the most respected lawyers testifying against. They looked at all of these pages of documents. They went back to old cases that were summarily rejected by many prosecutors, highly respected prosecutors, Democrat prosecutors all, before including, and I will tell you, the existing prosecutor who said, \"This case doesn't make sense."
    },
    {
      "text": "It doesn't make sense.\" All of a sudden pressure got put on him by Washington DC and the case that didn't make sense, he said, \"Let's go get Trump.\" They even had numerous prosecutors who resigned because I was being treated unfairly. () That made me feel so good when I heard that. Think of it. People actually, in a Democrat area, Democrat office, they resigned. Did you know that? They resigned. A lot of them resigned the office because they said you can't treat a man like this. He didn't do anything wrong!"
    },
    {
      "text": "But the two lead prosecutors, absolute human scum, one, a Hillary Clinton lawyer from a Hillary Clinton law firm. Do you believe that? How about a guy who represents Hillary Clinton? He's in a law firm that represents Democrat. It's headed up by Chuck Schumer's brother, this law firm, Robert Schumer. Think of this. Now, think of this. He calls up the prosecutor. Think of this. He calls up the District Attorney of Manhattan. He said, \"I'd like to come and work for free. I'm going to leave. I represent Hillary Clinton."
    },
    {
      "text": "We represent the DNC, the Democrat Party.\" () I don't even know if you know this. He said, \"I want to work for free.\" He's a bad guy, known as a bad guy. \"I want to work for free to get Trump.\" They bring him into the office. He becomes the head prosecutor. Then you had another one similar. Then he goes out and he quits because the head of the office, who I respected, but then he went bad because he succumbed to pressure, but the head of the office said, \"No, we can't get him on anything."
    },
    {
      "text": "He didn't do anything wrong.\" It changed his mind a little bit on a couple of little things, but that's okay. But he was under a great deal of pressure. Now I understand that he's made up his mind and he agrees with his original feeling that we did nothing wrong. () But how about this? A guy leaves private practice representing Hillary Clinton, goes for no salary, no anything. He goes into the District Attorney's office to prosecute Donald Trump."
    },
    {
      "text": "He doesn't get what he wants, so he leaves the office in a huff and he writes a book. The book is published during the case ongoing. I will say this, he has been absolutely killed by the media, even the fake news media back there. A lot of them I see. () They say that in itself is enough reason that that should have stopped a long time ago. He goes in and he writes a book, and he makes money off a book telling what went on with the grand jury. What do you think of that, Mr. Lieutenant Governor?"
    },
    {
      "text": "Do you think that's fair? Sounds like a fair system. It's a rigged system. Like we had a rigged election, we have a rigged system. You almost have to say, what does our country come to? Review after review, even by the biggest, greatest legal scholars, some of whom don't like Trump, like Alan Dershowitz said, \"I don't want to vote for Trump. I never voted for Trump.\" I don't believe him actually. I think he does, but he does that to give himself a little credibility with his friends and Democrats."
    },
    {
      "text": "I think he votes for me, personally, but he even said, he said, \"In 60 years of practicing law, it's the worst abuse I've ever witnessed. I've never seen anything like that. There's no case here, but I've never...\" That's Alan Dershowitz, a Democrat. () Greg Jared, who's a great scholar, great scholar, great guy. He came out with reports that were so damning. It was so horrible to actually read it, but this is really prosecutorial misconduct. That's what it's called."
    },
    {
      "text": "The innocence of people makes no difference whatsoever to these radical left maniacs. It is worse actually, in my opinion, hard to believe anything could be worse than this, but I think it's worse than ballot stuffing, or media manipulation by the FBI working together with Twitter, Facebook, and the rest. () Remember when that came out four weeks ago that the FBI was working to make sure that nothing bad is said about Biden, but as much bad as possible is said about Trump?"
    },
    {
      "text": "That had more of an impact even than truth to vote with the ballot stuffing, where they caught ballots being stuffed on tape, all live, on tape. () We have to stop them from cheating in elections, because if we don't win this next election, 2024, I truly believe our country is doomed. I think it's doomed. () Prosecutorial misconduct is their new tool and they're willing to use it at levels never seen before in our country. We've had it, but we've never had it like this."
    },
    {
      "text": "We must stop them and we must not allow them to go through another election where they have yet another tool in their toolkit. Remember everything I've endured, all of the hits, all of the attacks, all of the assaults and pain of my loved ones. My loved ones have suffered far more than I have. I've almost... With me, it's almost become like I go through Russia, Russia, Russia, phony deal, impeachment hoax number one, phony deal, impeachment hoax number two, phony deal. The Mueller witch hunt, phony deal."
    },
    {
      "text": "() By the way, it's determination after two and a half years, no collusion. There was no collusion with Russia. I could have told them that very easily, but they knew that because they had the laptop. The laptop, the collusion, was with Biden and Hillary Clinton, who worked with them on the dossier paid for by Russia, but they don't do anything about it. I hear that, and you get a little bit hardened to it."
    },
    {
      "text": "You get a little bit immune, In conclusion, our MAGA movement is the greatest political movement in the history of our country. Together, we are taking on some of the most menacing forces and vicious opponents our people have ever seen, some of them from within. But no matter how hateful and corrupt the communists and criminals we're fighting against may be, you must never forget, this nation does not belong to them, this nation belongs to you, belongs to you."
    },
    {
      "text": "Speaker 5 This is your home, this is your heritage, and our American liberty is your God-given right. From Waco to El Paso, from Houston to Dallas, and from the Red River to the Rio Grande, the people of Texas live and breathe the fierce spirit of independence. You are great, great people. Great people. Pastor. Thank you, Robert. This is the state where William Travis, James Bowie, and Davy Crockett made their last stand at the Alamo."
    },
    {
      "text": "This is the state where a small band of patriots, the Battle of Gonzalez, you know all about the battle of Gonzalez, armed with a single cannon, stared down a foreign enemy and declared, \"Come and take it.\" They said, \"Come and take it.\" (:41) And Texas is the state where generations of farmers and ranches, sheriffs and lawmen, cowboys, cattle hands, prospectors, and pioneers help build America into the greatest nation in the history of the world, and we're going to bring it back to that level."
    },
    {
      "text": "It's not there now. We're going to bring it back. Speaker 2 But now, we are a nation in decline. We are a failing nation. We are a nation that has the highest inflation in 50 years, where banks are collapsing and interest rates are far too high. Likewise, we are a nation where energy costs have reached the highest in our history. We're no longer energy-independent or energy-dominant, as we were just three short years ago. We are a nation that is begging Venezuela and many others for oil."
    },
    {
      "text": "\"Please, please, please help us,\" Joe Biden says, and yet we have more liquid gold right under our feet than any other country. We are a nation that is consumed by the radical left's Green New Deal, yet everyone knows that the Green New Deal will lead to our destruction."
    },
    {
      "text": "(:34) We are a nation whose leaders are demanding all electric cars, even though they can't go far, cost too much, and whose batteries are produced in China with materials only available in China, when an unlimited amount of gasoline is available inexpensively in the United States of America, but is not available in China. We are a nation that ended oil exploration and production in the United States, just as the price of oil reached an all time high. What other country would do such a thing?"
    },
    {
      "text": "(:19) We are a nation that surrendered in Afghanistan, leaving behind dead soldiers, American citizens, and $85 billion worth of the finest military equipment anywhere in the world. We are a nation that allowed Russia to devastate a country, Ukraine, killing hundreds of thousands of people, and it will only get worse. It would never have happened with me as your commander in chief and, for four straight years, it didn't happen. (:58) China and Taiwan will be next."
    },
    {
      "text": "We've got a Federal Bureau of Investigation that won't allow bad election changing facts to be presented to the public and which offers $1 million to a writer of fiction about Donald Trump to lie and say it was actually fact, where Hunter Biden's laptop from hell was Russian disinformation and the FBI knew it wasn't, and the Department of Justice that refuses to investigate egregious acts of voting irregularities and fraud."
    },
    {
      "text": "(:49) And we have a man who is the worst president in the history of our country, who is cognitively impaired, in no condition to lead, and is now casually talking about nuclear war with Russia. He has no idea what he's even talking about. This war would be World War III and far more devastating than any of the previous world wars because of the weaponry that no one even wants to think about or discuss. (:27) We are a nation that no longer has a free and fair press."
    },
    {
      "text": "Fake news is all you get and they are the enemy of the people. We are a nation where free speech is no longer allowed, where crime is rampant and out of control, like never before. We are a nation that is allowing Iran to build a massive nuclear weapon, would've never happened, and China to use the trillions of dollars it has taken from us to build a military that will rival our own. And just two years ago, we had Iran, China, Russia, and North Korea in check."
    },
    {
      "text": "They weren't going to do a thing against us and everyone knows it. (:20) Now, Russia and China are united and holding summits to carve up the world and, perhaps most importantly, we are a nation that is no longer respected or listened to on the world stage. We are a nation that, in many ways has, become a joke and we are a nation that is hostile to liberty, freedom, and faith."
    },
    {
      "text": "(:04) We are a nation where large packs of sadistic criminals and thieves are allowed to go into stores and openly rob them, beat up and kill their workers and customers, and leave with armloads of goods, but with no retribution, where the authority of our great police has been taken, where their families and pensions have been threatened and their lives would be destroyed for the mere mention of the words law enforcement."
    },
    {
      "text": "(:39) We are a nation where fentanyl and all other forms of illegal drugs are easier to get than formula for our beautiful little babies, a nation where once revered airports are dirty, they're a crowded mess, you sit and wait for hours and then are notified that the plane won't leave and they have no idea when it will, where ticket prices have tripled, yhey don't have the pilots to fly the planes, they don't seek qualified air traffic controllers, and they just don't know what the hell they are doing."
    },
    {
      "text": "(:20) We are a nation that has lost its confidence, its willpower, and its strength. We are a nation that has lost its way, but we are not going to allow this horror to continue. Two years ago, we were a great nation and we will soon be a great nation again. It was hardworking patriots like you who built this country and it is hardworking patriots like you who are going to save our country. Together, we are going to finish what we started."
    },
    {
      "text": "With you at my side, we will totally obliterate the deep state, we will banish the war mongerers from our government, we will drive out the globalists, and we will cast out the communists and Marxists, we will throw off the corrupt political class, we will beat the Democrats, we will route the fake news media, we will stand up to the rhinos, and we will defeat Joe Biden and every single Democrat. (:47) We will liberate America from these villains and tyrants who are looking to destroy our country."
    },
    {
      "text": "No matter what they throw at us, no matter what they do to us, we will not bend, we will not break, we will not yield, we will never give in, we will never give up, we will never, ever back down, we will complete the mission, we will cross the finish line, we will demolish tyranny and we will rescue freedom, liberty, and justice, and we will restore the American republic to all of its greatness and glory greater than ever before."
    },
    {
      "text": "(:28) My fellow citizens, this incredible journey we are on together has only just begun. We are one movement, one people, one family, and one nation under God. With your help, your prayers, your vote, and your unwavering love for this country, we will make America powerful again, we will make America wealthy again, we will make America strong again, we will make America proud again, we will make America safe again, and we will make America great again. Thank you, Texas. Thank you. God bless you all."
    }
  ]
}