{
  "speech_id": "269",
  "title": "Donald Trump, Mike Pence Coronavirus Briefing Transcript: Briefing with Airline & Diagnostic Lab CEOs",
  "date": "20200304",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-mike-pence-coronavirus-briefing-transcript-briefing-with-airline-diagnostic-lab-ceos",
  "topics": "Economy, Healthcare, Government Policy",
  "num_segments": 32,
  "content": [
    {
      "text": "And we're talking about the effects of the virus on the air travel and what they see. In a certain way, you could say that the borders are automatically shut down without having to say shut down. To me, they're to a certain extent automatically shut down. But it's affecting the airline business as it would and a lot of people are staying in our country and they're shopping and using our hotels in this country."
    },
    {
      "text": "I just want to add and to go a little bit further, the Obama administration made a decision on testing that turned out to be very detrimental to what we're doing and we undid that decision a few days ago so that the testing can take place in a much more accurate and rapid fashion. That was a decision we disagreed with. I don't think we would've made it, but for some reason it was made. But we've undone that decision."
    },
    {
      "text": "Also, when people come in from certain areas we're doing checks, not only at the site of takeoff, but at the side of landing. So when they land in our country, we'll also do, that's if the planes are leaving from certain destinations. I might ask doctor, if you could, I'd like you to say a few words. You've been doing a fantastic job in just a short time. We haven't had much time, but you've really been doing a really fantastic time. Please. Dr. Good. Thank you. Thank you. Doug, do you have anything to say?"
    },
    {
      "text": "Doug is the head of American Airlines as you know. Maybe we'll go around the room, if you'd like to say something, please. Speaker 5: () Well, thank you Mr. President. And again, we appreciate the leadership, appreciate the collaboration and coordination and certainly the industry wants to do everything that we can to keep Americans safe and certainly our employees and our customers."
    },
    {
      "text": "We've stepped up our efforts to make sure the airplanes are cleaned and disinfected and we work very closely with the CDC and I think that's gone very, very well. So we've got the proper protocols in place whenever there is a suspected illness. And I think all that's working very well where I think everybody's doing a great job and doing all we can. We appreciate the job you're doing. Thank you very much. Please. Are you using different things for the cleaning, the fluids? Are you using different [crosstalk :28]?"
    },
    {
      "text": "Thank you very much. Great job. Peter. Good. Thank you very much. Thanks, Peter. Chad, did you have anything to say about all that? And Chad, anything different on the southern border where we're doing so well? We're setting records on the southern border in terms of allowing the people that are supposed to be here in but not allowing others in. Anything new on the southern border? Good job. Thank you. Speaker 10: () Mr. President, thank you for having us."
    },
    {
      "text": "We were delighted when you made the vice president the head of the Interagency Task Force. We believe in collaboration. We want to try to solve these problems both short and longterm. We've been sharing ideas with the vice president's staff and your staff. We think there are better ways to trace the passengers coming in. We've contracted to have a mobile app and a website developed that everyone would have to fill out that would go directly to CDC with that information. And we're moving forward with that."
    },
    {
      "text": "So there's been good progress. I think what we all need is the reassurance that you and the vice president and others have been providing the travel is safe and that we can go forward because right now the fear is almost worse than the virus. Yeah. And we're we're doing a good job. These professionals are really amazing, they've really stepped up like the airlines have stepped up very much so. Thank you. Thank you very much. Oscar. That's right. You are a heart transplant survivor."
    },
    {
      "text": "I was reading about that as one of the big executives, great executives of our country, of the world, and your heart transplant. I'll tell you, you look very good to me, Oscar. You have that one down. Don't recommend it, but you, that's fantastic story. Wow, that's great. Thank you very much, Oscar. Mike, why don't you finish it up? Great job, Mike. As a certain areas get to be more of a problem, we may close them up as we have done with numerous areas. At this moment, we think we have it very much in hand."
    },
    {
      "text": "We've closed certain areas down very strongly. In some cases, not whole countries, but certain areas within countries like in Italy. We are I think doing a very effective job in terms of that. It's very important. The one thing that we were discussing before is you really don't know what the percentage of some people will have this at a very light level and won't even go to a doctor or a hospital. They'll get better. There are many people like that."
    },
    {
      "text": "Young people seem to be, you can't say immune to it, but there's certainly, the numbers are very small. And it does affect the older people that, like the nursing home situation that we have on the west coast, a single nursing home where we have a pretty big percentage of people."
    },
    {
      "text": "But as things go along, so we're trying to adjust the number, we're trying to see what the number might be, but if you add many, many people that have it and don't know they have it or they think they have a cold and all of a sudden they're recovering from it. I think that number will probably be a lot different numbers than the twos and even the one and a halves that we're hearing. And I think that's an important thing for people to know. I'm very proud of the people in the administration."
    },
    {
      "text": "I'm very proud of the airline business. You said it very well when you said the airline business always seems to pull together and I've seen that over the years and this is a great case of it. And I want to thank you all, you're great executives and you love the country and you love what you do and thank you all very much. We appreciate it. Thank you. Speaker 13: () Mr."
    },
    {
      "text": "President, are you going to be giving any sort of financial support for the airlines to deal with that loss of business from overseas [inaudible :06]? Don't ask that question please because they haven't asked it. So I don't want you to give them any ideas or you'll end up heading an airline. He'll end up heading an airline. That's a pretty tough question. So I don't. We haven't discussed that yet. Speaker 14: () Is your message to Americans that it's safe to fly and can you convince the traveling [crosstalk :27]?"
    },
    {
      "text": "I think where these people are flying, it's safe to fly. In large portions of the world are very safe to fly. So we don't want to say anything other than that. And we have closed down certain sections of the world frankly. And they've sort of automatically closed them also. And if they'll understand that and they understand it better perhaps than anybody. Yes, it's safe."
    },
    {
      "text": "Speaker 15: () Are American businesses overreacting to cutting down domestic travel and they're telling people not to fly to [inaudible :52] inside the United States? Well, a lot of people are doing a lot of domestic business now. I can tell you they're staying in this country. They feel safe because we have a, if you look at a percentage, we have a very, very small percentage and a big percentage of what we have is when we brought in the 40 or so people from the ship."
    },
    {
      "text": "We brought them in, we immediately quarantined them. But you're adding that to the numbers that we had, which were very small. Now what we're going to do is as people get better, because most of these people are getting better. Some are already released, some are going home, some get a full 100% report. We're going to take them off the list. But we have a very small number of people in this country. We have a big country. The biggest impact we had was when we took the 40 plus people, they're Americans."
    },
    {
      "text": "I mean, I could say don't let them into the country, but these are Americans and they were literally stranded and it was very unfair. We brought them back. We immediately quarantined them. But you add that to the numbers, but if you don't add that to the numbers, we're talking about very small numbers in the United States. We've all done a very good job, all of us. And I think the news has been in the, for the most part, the media has really treated us very fairly, which I appreciate. I think it's very important."
    },
    {
      "text": "Speaker 16: () Mr. President, is there anything that they should be doing differently since you think it is safe to fly? Ask the head of American Airlines or United Airlines. Speaker 16: () Executives around the table that if you're a passenger you'd get on that plane. We've been told, wash your hands. Maybe Dr. Burks, Dr. Burks, you can maybe say something. Dr. And I haven't touched my face in weeks and weeks. It's been weeks. I miss it."
    },
    {
      "text": "Speaker 17: () Would you do anything to address some of the concerns of maybe travelers who booked their flights and they might be coming up on a trip and they might have to make rearrangements? Is that something... Doug, what would you say about that? I would think, Oscar, how would you handle that? You have a lot of people they've booked and now made a- I think people are going to be very impressed with what the airlines do. Speaker 18: () Mr."
    },
    {
      "text": "President, you mentioned the Obama era rule that you had changed regarding this virus. I didn't follow that. Well, let's talk about it. Go ahead. This was a very big move and it was something that we had to do and we did it very quickly and now we have tremendous flexibility, many, many more sites, many, many more people. And you couldn't have had that under the Obama rule and we ended that rule very quickly. Yes. Speaker 19: () Mr."
    },
    {
      "text": "President, on the contact tracing, can you explain what you're hoping to get from these folks? What more information do they need to track or share with the government? Go ahead, Chad. And much of that has been done already. Speaker 22: () All right. Thanks guys, let's go. Thank you very much everybody. Speaker 22: () Thanks, guys. No questions on the election? This has to be [crosstalk :59]. Speaker 22: () All right. Thanks, guys, let's go. Let's go. Come on, guys. [inaudible :07], let's go."
    },
    {
      "text": "I think the election was a great last night. I thought it was great. I thought the results were, it was a great comeback for Joe Biden. Incredible comeback when you think about it. But if you would've looked, if Elizabeth Warren would have done what she probably should have done from their point of view, he would've won. Right? He would have won a lot of States including Massachusetts, probably Texas, definitely Minnesota. So Bernie would've won states that he lost I think it was fairly easily."
    },
    {
      "text": "But in particular, Massachusetts, I would say Minnesota in particular. I would also say Texas and some others. So had she, I put something out on it this morning. She was really a spoiler because other people got out in those votes in order to Joe. And those people really helped Joe by getting out early. But the couple that got out as the endorsement. In the case of Elizabeth Warren, had she gotten out, it would've been a very different situation I think. It would have been a very different night."
    },
    {
      "text": "Just that one simple move. Had she left, you pick up Massachusetts, Minnesota and probably Texas and those are the three I check. I would imagine there are others that he would've picked up, too. So Elizabeth Warren was the single biggest factor in that election last night. It would have been a very different thing and not in a positive way for her, in a very selfish way for her. She was very selfish from that point of view. Now do I care? No, because we're just waiting to find out who we're running against."
    },
    {
      "text": "But when you look at it, pretty incredible. If she would've gotten out and endorsed, even if she didn't, she didn't even have to endorse. I think there's a lot of bad blood there, but had she gotten out and endorsed, he would've been a lot better off. Speaker 23: () What do you think happens now? Well now I think it's a very tough, I think it's tough. I think Joe has an easier path right now, believe it or not."
    },
    {
      "text": "I see Mini Mike just got out and he's going to try and save face by putting some money into Biden's campaign and we'll see what happens. I don't think that's going to have an impact. You got to look, money has to be spent wisely. One thing this whole thing has shown that you can't buy an election. It's a beautiful thing. Steyer put in $250, $300 million and now who knows where he is? He's home probably licking his wounds. And Bloomberg put in probably $1 billion and sometimes you just don't have what it takes."
    },
    {
      "text": "And I said to him, \"It's not easy doing what I did, is it?\" So it's one of those things, but it's going to be very interesting to think that this would have changed so much because if you go before Saturday, before South Carolina, I mean, Joe had absolutely no chance according to you people. But they used to say that about me, too. Not as much though. I think I always felt that I had a very good chance. But I'd watch and they'd say, \"Well, it can't happen.\" But it happened and it happened pretty easily."
    },
    {
      "text": "I think Joe actually would have the advantage now. If you look at the states he's going to with Florida and others, I think he's got an advantage in those states. But again, had Elizabeth Warren endorsed Bernie, you're talking about a whole different subject and that's not even a question. You're talking about a whole... because he would've gotten 80, 90 almost. I mean, he would've gotten most of those votes. So you're talking about a much different..."
    },
    {
      "text": "Speaker 24: () What do you think of the stock market's reaction today? It seems like there's been a sigh of relief that [crosstalk :53]. I think, well, I've said from the beginning, it's partially this, it's a big part of this, but it's also the fact that they didn't like seeing what they're seeing. But they don't like Joe either. Joe's become, a lot of people are with Joe. If you look at those people, they're worse than Bernie in terms of being radical left."
    },
    {
      "text": "I mean, some of Joe's handlers and that's what they are is handlers. I want to be nice, but they are handlers. Some of Joe's handlers are further left than Bernie. That's pretty scary. So it's going to be that way. Speaker 25: () Do you think Bloomberg's money will be more powerful without Bloomberg himself in the race? He said he's- Well, it couldn't be less powerful because look what $1 billion did. He won nothing. I mean he got so few delegates. It's incredible."
    },
    {
      "text": "I would say probably, well, now he's doing that because he's spiteful and he's a spiteful guy. I know him well, he's a very spiteful guy, he's very upset. He made a fool out of himself to be honest with you. And he's not too happy about that. I think the first thing he should do is fire his political consultants because I could have told, I know, I could have told him very easily, you can't win. You can put $2 billion in, you can't win. Okay. Thank you, everybody. Speaker 22: () Come on, let's go. Come on, let's go."
    }
  ]
}