{
  "speech_id": "281",
  "title": "Transcript: Donald Trump Presents Space Force Flag in Press Conference",
  "date": "20200515",
  "url": "https://www.rev.com/blog/transcripts/transcript-donald-trump-presents-space-force-flag-in-press-conference",
  "topics": "Foreign Policy, Technology, Government Policy",
  "num_segments": 12,
  "content": [
    {
      "text": "Well, thank you very much. This is a very special moment, because this is the presentation of the Space Force flag. So we've worked very hard on this, and it's so important from a defensive standpoint, from an offensive standpoint, from every standpoint there is. As you know, China, Russia, perhaps others started off a lot sooner than us. We should have started this a long time ago, but we've made up for it in spades."
    },
    {
      "text": "We have developed some of the most incredible weapons anyone's ever seen, and it's moving along very rapidly, and we have tremendous people in charge. What I'd like to do is I'd like to just start by asking some of those folks to say a few words on the importance strategically, militarily, and even from a pure civilian standpoint and from bringing our economy back, everything. It's going to help so much. All made right here in the USA, and it's going to be very special, very important, Space Force."
    },
    {
      "text": "First time in 72 years, plus that we've opened up a new branch of the United States military. Mark, maybe I'll start with you. You'll say a few words, please. Thank you very much, Mark. Great job you're doing too. General Milley, please. Thank you very much, General. Please. Congratulations by the way. Number one. That's good. Thank you. Thank you. Appreciate it. Secretary, please. Well, thank you very much. I appreciate it. We're building right now incredible military equipment at a level that nobody's ever seen before."
    },
    {
      "text": "We have no choice. We have to do it with the adversaries we have out there. We have, I call it the super duper missile, and I heard the other night, 17 times faster than what they have right now. Then you take the fastest missile we have right now. You've heard Russia has five times, and China's working on five or six times. We have one 17 times, and it's just gotten the go ahead. 17 times faster if you can believe that, General. That's something, right?"
    },
    {
      "text": "17 times faster than what we have right now, the fastest in the world by a factor of almost three. I just want to congratulate everybody and thank everybody. Space is going to be the future, both in terms of defense and offense and so many other things, and already from what I'm hearing and based on reports, we're now the leader in space. That took place. Don't forget, we're having a meeting today. This is really to unfurl the flag, but we've been doing this now for quite a while."
    },
    {
      "text": "I have to say that from my standpoint, having a force, a Space Force in this case, but to be adding to the joint chiefs of staff, which I've known about and read about and heard about all my life, just like General Millie, to be the head of the joint chiefs of staff is something that's a very special thing. Well, to add another force into the joint chiefs, and we're getting a four-star. In this case, we're getting a four-star general on your board, so we're doing something right here."
    },
    {
      "text": "So we're doing something that is such a monumental task, so it's been more than 72 years. The Air Force, I believe, was the last one. So we have Air Force and not since the Air Force has anything like this happened, and now we have Space Force added on with full honors, I must add. With full honors. So today we're here for a very important ... It's really an important occasion, because we're unfurling the flag. With us is Chief Master Sergeant Roger Towberman, and he is ..."
    },
    {
      "text": "I'd like you to say exactly, because his rank is a very special rank. Tell us about that rank. Chief Master Sgt. The highest Sergeant by far, correct? Chief Master Sgt. That's pretty good. Wow. That's beautiful. Wow. That's it. That's fantastic. I've heard tremendous things about you, Roger. Chief Master Sgt. It's a very important position. Thank you. You're with all these generals, but you know what? He's an important guy, right? So why don't we go ahead and do it. Let's do it. Yes, please. Chief Master Sgt."
    },
    {
      "text": "That's fantastic, Roger. I'll walk over there. That is great. Here, if you stay over there. Thank you. Speaker 8: () Hold it out too, so it's flat. That's fantastic. Isn't that great. Please, get in the picture. That's beautiful. Very, very great honor. It's a great honor. That's a beautiful flag too. Roger, hold that up so they can see. That's really beautiful. Wow. Speaker 7: () [inaudible :35] logo. That's a big day. That's a big day. Speaker 8: () Can someone explain the logo? That's good. I'm going to do this for Roger."
    },
    {
      "text": "That's for you. Okay, so let's do it. This is great stuff. Okay, let's see. I think we have no choice, right? General, come on over here. Good luck. Good luck. Good luck, okay? These are going for everybody, please. Okay? Thank you very much, Roger. Thank you very much, Mark. You're all set. General, come on over here. General Kellogg's been fantastic, done a great job. He's working on a special project now, aren't you? A very special project. Okay. Okay, got it? Thank you all very much. Thank you. [crosstalk :24]."
    },
    {
      "text": "I'll be going to Camp David tonight with a lot of different people. We have some big things happening, so I'll be at Camp David tonight with various people. Speaker 10: () Who's going? Various people including some of the folks from the Hill, and some of our great leaders. Speaker 11: () To talk about what? Different things. Different things. Speaker 11: () Phase four? No, not so much phase four. Phase four could happen, but it'll happen the right way."
    },
    {
      "text": "We have all the cards, because we have the cards for the American people. I know what they want, and I've always known what they want. That's why I'm sitting here. No, phase four is going to happen, but it's going to happen in a much better way for the American people. Okay, thank you all very much. [crosstalk :05]. Speaker 8: () Thank you, press. Thank you very much, press. Thank you very much. Thank you. Speaker 12: () Caitlyn, [inaudible :09], we're done. Caitlyn. Caitlyn, we're done. Let's go."
    }
  ]
}