{
  "speech_id": "284",
  "title": "Donald Trump Holds Rally in Wisconsin on 5/01/24",
  "date": "20240502",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-holds-rally-in-wisconsin-on-5-01-24",
  "topics": "Economy, Immigration, Education",
  "num_segments": 88,
  "content": [
    {
      "text": "Well, thank you very much. Thank you everybody. What a crowd, what a beautiful crowd. A lot of people outside. This is a beautiful arena, but a lot of people outside. We appreciate it very much. This is great. Hello Wisconsin. How are you, Wisconsin? It's great to be back in this beautiful state and it is indeed a beautiful state. It's beautiful with so many proud, hard-working American patriots, which is what you are."
    },
    {
      "text": "As you know, we'll be holding our convention in Milwaukee just a few months from now and we can't wait. That means you got to vote for us, because we are spending our money in your state to have the big convention. We had lots of options and we're coming here. You remember last time, did Biden even show up? I don't think he showed up, right? I don't know. Somebody said he did show up. He was wandering in the parking lot just to make an appearance."
    },
    {
      "text": "He said, \"Where am I?\" \"You're in Wisconsin.\" \"Where's that?\" () But we love Wisconsin. I want to thank Wisconsin GOP Chair Brian Schimming for doing a fantastic job. Where is Brian? Where's Brian? Hello, Brian. Good job. Great job you've done. I hear the numbers are very good, Brian, right? Because that's the only thing that matters at this point, right? Speaker 1 Okay, thank you, Brian. I think we will. I think we will. My former chief of staff, a really great guy who loves your state very much, Reince Priebus."
    },
    {
      "text": "Reince. Where is Reince? Reince Priebus. Everybody had a hard time with that name. We don't have a hard time with that name anymore. After years of that name, we have no problem with it. Thank you, Reince, very much. National Committeewoman, Maripat Krueger. Maripat, thank you. We just met backstage. Thank you, Maripat. And your county executive, if you take a look at Paul Farrow, a great person who's done a fantastic job. Eric Severson, your sheriff. Your sheriff. We're not going to mess... Where is Eric?"
    },
    {
      "text": "I saw him backstage. He's central casting. I'll tell you, every sheriff should look like Eric. And a special guy, the greatest purchaser of advertising in the history of the world, Mike Lindell. Nobody buys ads like him. Thank you, Mike. With your help, we're going to win Wisconsin this November. We're going to defeat crooked Joe Biden, the worst President in the history of our country, and we're going to Make America Great Again. And it ain't so great right now."
    },
    {
      "text": "It's a laughing stop all over the world, including our colleges, university. Look at what's happening to our country. And our border. You know what, some people say they do it at the colleges, so you get your eyes off the border. I said that last night. We're not talking about the border. Millions of people are coming in, millions of people, and we had it... We had the safest border in history. Now we have the worst border in the history of the world. But they're not talking about that now."
    },
    {
      "text": "They're talking about colleges and universities, people that have gone astray. Last week we saw numbers showing clearly that the economy is crashing with the GOP growth plunging by more than 50%, just in this quarter alone. Think of that. () We're plunging. We're now in a Biden stagflation. You know what stagflation is? Huh? You know what it is? It's the worst. It's worse than inflation. It's worse than deflation. It's the worst. And we're in stagflation right now. Congratulations everybody."
    },
    {
      "text": "It spells the death of the American dream, and that doesn't even include some of the horrible numbers that we're seeing flowing in from the poor and crime-ridden countries all over the world. They have people flowing in from the poorest and the heaviest crime countries all over the world. Congratulations. They come out of prisons. They come out of mental institutions, and they're coming in to be a neighbor right near you, so congratulations. I don't know how... I think Wisconsin probably..."
    },
    {
      "text": "You're very open-minded toward that, right Wisconsin? Are you open- Speaker 3 I don't think so. No, it's terrible. What's happening is terrible. On top of all that, Biden has just declared that if he gets four more years, he will drench the middle class in the largest tax increases in the history of our country, vowing repeatedly that he will ensure that the Trump Tax Cuts, the biggest tax cuts in history. And he says, \"Oh, it's not for the rich."
    },
    {
      "text": "It's for companies that employ people and it's for the middle class. And the people that benefit the most are lower-income people. They're the biggest...\" And he wants them to expire. He'll never be able to replace them. It'll mean that you had the biggest tax increase in the history of our country. So, I don't think we're going to let it happen. I don't see any way. If he wins... Well, they're trying this weaponization of the Justice Department stuff."
    },
    {
      "text": "So far that hasn't been working too well, because we have the highest poll numbers we've ever had. People get it. () But what it all means is under crooked Joe, a single individual earning $75,000 a year will pay almost $2,000 more in terms of just the tax hike alone and a family of four earning $165,000, that's a lot, a year will see at least 3000 more added onto your taxes, which are already high. 73% of Americans are now living paycheck to paycheck. That's the highest number ever recorded."
    },
    {
      "text": "Think of that, what that means though, paycheck to paycheck. So what does that mean? You get fired, you lose your job, you get sick and you can't live. This is the highest number ever. It's up at a number nobody ever thought they'd see. Yet crooked Joe Biden wants to raise taxes on top of that and raise business taxes, which will lead to the destruction of your jobs and, you know what, ultimately it's just going to lead to the destruction of the country. We have so many negative forces on this country."
    },
    {
      "text": "Uncle Sam is right here. Look at him. You are perfect. These guy's are the best. He's like a perfect Uncle Sam. Speaker 4 He goes, \"We need you.\" That's right. Thank you, Uncle Sam. Get up here for a second. Look at this guy. Man. Wow. He's in good shape. He's in good shape. Thank you, Uncle Sam. Look at this guy. Speaker 4 I'll sign this. Speaker 4 I'll sign it. I'll sign it for you later. Speaker 4 Yeah. He asked me to sign it. I said, \"I got to make a speech here, Uncle Sam.\" Good-looking. Uncle Sam though, huh?"
    },
    {
      "text": "Give me a pen, somebody. Let's get Uncle Sam taken care of. Come on, give me a pen. I got to get a pen. Let's go. Yeah, good. Just throw it up here. Speaker 5 Give me a pen here. You think Biden can bend down like that? I don't think so. Speaker 6 Where's Uncle Sam? Speaker 8 Here's your pen back. Thank you. Uncle Sam. You got it, man. Oh, that's nice. Secret Service- Speaker 2 Secret Service doesn't love that stuff. You understand? They're not in love. They're looking like, \"What's he's doing?"
    },
    {
      "text": "Don't do this.\" But it's Uncle Sam, right? He looked good to me. But with me in the White House, we will protect the Trump Tax Cuts for working families. We will make our middle class stronger, bigger, better, stronger, wealthier, and more prosperous than ever before. We're going to do it. We're going to do it quickly too. It's not going to take a long time. () One thing, I was there. I know the good people. I know the bad people. I know the smart ones, the dumb ones, the ones that think they're smart."
    },
    {
      "text": "The ones that don't think they're smart and are smart. I know them too. You got all different types, but I got to know them. In 2016, I didn't know anybody. I learned fast. I know everybody. I know them better than anybody. The Biden job numbers are fake. He's counting people coming back from work. Remember when we had the pandemic, people left and they'd say, \"Come back in two months, three months when this thing goes away, come back.\" He got those numbers and he tries to add them on. You call them..."
    },
    {
      "text": "You know what they call them, part-time? They call them fake numbers. They call them bounce-back numbers. It's a bounce-back, automatic. If this young gentleman right in front of me were president, he'd have a bounce-back. They'd say, \"Oh, they were just our numbers.\" It's an important thing to know, but a lot of the numbers that just came out on immigration and on employment were illegal immigrants. Almost all of the numbers were from illegal immigrants. Isn't that great? Isn't that great?"
    },
    {
      "text": "() The illegal immigration, they're being taken care of better than the people that have been in the country that are desperate for jobs. But when I'm in the White House, the Biden economic bust will quickly be replaced with the Trump economic boom. We're going to replace it. We're going to replace it quickly. When I left office, we handed crooked Joe the fastest economic recovery. It was the fastest recovery, think of this, economically ever recorded. The stock market was at a record high."
    },
    {
      "text": "The price of gasoline was $2 and even less than that a gallon. Think of that. We had periods of time where it was $1.57, $1.87. How does that sound to you? () But under $2 a gallon, the 30-year mortgage rate was at a record low, the lowest ever recorded $2... Think of this, 2.65%, that's what your mortgage rates were. Now you can't get a mortgage. If you want to pay 8 or 9%, you still can't get them. And we had no inflation. We had no inflation. We had the greatest economy in history. This is..."
    },
    {
      "text": "Everybody said, this isn't me. This is everybody. We had the greatest, we had no inflation. Today, your inflation so high, it doesn't matter if you make money, it doesn't matter. It eats you alive. Inflation is what they call a country buster. You go back 200 years, 300 years to countries with inflation, they got busted. Ask Germany, how was inflation many, many years ago? It destroyed the country. It is a country buster and we have record horrible inflation. And now, it's getting worse."
    },
    {
      "text": "And now they think they're not going to be able to cut interest rates, because it's getting worse. You don't hear that and they don't talk about it. And the fake news, these people right over here, they don't want to talk about it, but it's getting worse. () But then Biden came in and unleashed mayhem on our economy just like he unleashed mayhem on our border. The border, there's never been anything like this, a border like this. There's never been anything in the world."
    },
    {
      "text": "There's never been a border like this in the history of the world. Using COVID as an excuse, crooked Joe Biden launched the greatest confiscation of middle class wealth in the history of our country. It's middle class wealth, he confiscated it. In three years, Joe Biden and his party stole trillions of dollars from hardworking Americans and gave it... They're political, and he gave it all to their cronies in Washington there, their heirs to be. He gave so much money away."
    },
    {
      "text": "And the green new scam, it's the worst scam in the history of our country. They spent $2 trillion. The green new scam, the greatest scam in history. They spent $2 trillion on their so-called American Rescue Plan, which wasn't rescuing this country. How is the rescue plan doing? Speaker 9 Trillions of dollars wasted, which Obama's economic advisers called the original sin. They actually called it, his adviser, said, \"That was the original sin that led to rampant inflation.\" That's where it began."
    },
    {
      "text": "They spent another trillion dollars on their misnamed Inflation Reduction Act, and then they admitted it really wasn't meant to reduce inflation. They call it the Inflation Reduction Act. Remember when a certain senator said, \"I'll approve it,\" and that was the end of his career? I won't tell you his name was Manchin. Oh, I'm sorry. No, that was the end of his career. He was popular. He was getting more and more popular. He started out not so popular for many years."
    },
    {
      "text": "Then he became popular, because he was rejecting all of this madness. And then for some reason, he agreed to sign a couple of things that were not good. And it didn't work out too well. () $1.2 trillion for their fake infrastructure... He had a package of infrastructure. You take a look at it, it's fake. It's fake and it's horrible. And then all of that money, again, going over to the green new scam. Joe Biden's economic plan is to make China rich and America poor."
    },
    {
      "text": "My economic plan is to make America richer than ever before. And that's what we're going to do. That's what we're going to do. With your vote, we're going to save our economy and we're going to bring our country back from hell. We have a country that's in hell. Look at what's going on. Look at the crime. Look at the crime. I lost a tenant. They said, \"Sir, you lost a tenant.\" Big drug store. Big one in one of my buildings. And I said, \"What's the problem?\" This is in New York, but it's happening all over."
    },
    {
      "text": "I don't think it's happening here so much. Maybe it is actually. Speaker 10 Oh, in Chicago. Chicago, it's happening. They say, \"Sir, we can't keep product.\" I say, \"Well, that's a good thing.\" They said they can't keep product they tell me. I called the manager, nice guy. I said, \"What happened?\" He said, \"We can't keep product.\" I said, \"Oh, that's good, isn't it?\" \"No, that's bad.\" They're walking in with bags. They're taking it off the shelves."
    },
    {
      "text": "So now they put bars up and they put glass up and somebody wants to buy toothpaste and it takes a half an hour for the guy to come. They open up, they give him... How the hell can you make money doing that? Whoever heard of it? If somebody would've told you that two or three years ago that that's happening, you would've said, \"That's not possible.\" We knew about 3, 400 usually young people walking into department stores and just robbing the place, walking out with television sets."
    },
    {
      "text": "We're going to give our great police, they are great, their power back. And they're going to protect us again. () And you saw it last night, that's one good thing that really happened. You saw it last night, because New York was under siege last night. And these people, first, they were intense. And the person that heads up Columbia University... It was a great school. It's been badly damaged, I think, reputationally."
    },
    {
      "text": "But the person that heads it, up a woman, she waited so long, she was so weak, she was so afraid, she was so bad. They could have done this with the tents and it would've gone quickly and no problem. But they did an incredible job. They went into one of the big buildings, a beautiful landmark building. Boy, they got the hell beat out of it last night. You're supposed to take care of those buildings. It took a beating, but the police came in and in exactly two hours, everything was over."
    },
    {
      "text": "It was a beautiful thing to watch, New York's finest. () You saw them go up in ladders. You saw them go up in ladders to break in the windows and getting in, and that's dangerous, because you don't know what's on the other side of that window. And they went and they knocked it out and they were incredible. They did a great job, New York's finest. And it's like that throughout the country. Chicago, great police, L.A., great police. I know so many of them. I know so many of the top people and the middle people."
    },
    {
      "text": "I see them all over. They're great and they can do the job, but we have to give them their power back. Speaker 2 Where did he come from? All right. Thank you. Go home to mom, right? Go home to your mom. Thank you. Thank you very much. Say hello to mother. Oh, she's going to be angry, because she's watching right now on television. She's watching on television. She said, \"That's my son.\" () The Biden inflation... You know what's interesting when the fake news reports the story?"
    },
    {
      "text": "They'll say, \"There was pandemonium.\" One guy shouts something. I don't even know what the hell he's shouting. \"There was pandemonium.\" But look, front row Joe, he ran back there just to... Look at that guy, front row Joe. That's good. When he sees trouble, he runs right into it. Every country needs people like that. Anyway, thank you front row Joe. The Biden inflation disaster is a direct result of crooked Joe's trillions in wild spending and that's what's happened."
    },
    {
      "text": "The Biden price hike is a gigantic tax on the likes of which this country, we have never seen anything like it before. In the past three years, the average Wisconsin family has lost between 20 and $30,000 thanks to crooked Joe's inflation tax. Think of it, it's an inflation tax. It's a new tax. I just thought of it in the plane coming up here. I never used that expression."
    },
    {
      "text": "I call it Biden inflation tax, because if you add what inflation has done to you, that's about a 30% tax increase and I think even more than that. You could get a pay increase, but your pay increase doesn't nearly overcome what's happened with inflation. So I just came up with a name. I thought it was actually quite brilliant. It's called an inflation tax. We have a new tax, ladies and gentlemen, we have a new tax, it's called an inflation tax."
    },
    {
      "text": "And these price hikes are continuing to drain nearly $1,000 from the typical Wisconsin family every single month. Does that sound like a lot? I think it's a lot. Chicken, I love chicken, is up 24%. Baby food is up 30%. Eggs are up 59%. Gasoline is up 50%, but it's going way higher. Airfares are up 33% without the service that we used to get. And the 30-year mortgage rate just hit 7.6%, one of the highest averages ever. Other than that, we're doing quite well, do you agree?"
    },
    {
      "text": "And the country's going to hell, but then we're doing quite well. () We're honored to be joined today by Shana Gray, who owns a vegan restaurant, supposed to be really good. I'm not into the vegan stuff, I must say, but I'm going to have to try this. When we come here in a short period of time into Milwaukee, we're going to come and try that vegan food. I don't know if I'm going to like it. But she had a big business. Shana says her business is being brutalized by the soaring cost of food."
    },
    {
      "text": "She's never seen anything like it. And right now she says things just aren't working. She was doing great three and a half years ago. She was doing better than she ever did during the Trump year. She said, \"I was able to afford things. I wasn't worried about my future. I am now. I'm starting to really worry. The stress and the anxiety are really hurting me.\" So I'd like to have Shana come up for a second and say a few words. Thank you. Please, go ahead. Thank you. Thank you darling. Thank you very much, I appreciate it."
    },
    {
      "text": "Take care of mom, right? Speaker 11 We'll get a job for you. Cute. Thank you. How nice are those two? So that's Shana's daughter. And think of what it... I mean, it's just common sense. It's very dangerous to bring people up here from the standpoint you don't know what the hell they're going to say. We didn't rehearse that Shana, right? She could have said, \" Ladies and gentlemen, go vote for Biden.\" And everybody would just say, \"That's not a good thing he did."
    },
    {
      "text": "That's not too good.\" You never know what's going to say. So far, I've never had that problem, but that problem has been had before by others. But I want to thank Shana. We'll get out and we're going to go there during... You get ready for me. Maybe you can convince me with that vegan food, okay? You get a good healthy vegan food. But the choice for Wisconsin is simple, if you want lower costs, higher incomes and an affordable American Dream, then you have no choice but to vote for a gentleman named Donald J."
    },
    {
      "text": "Trump for president. Crooked Joe likes to talk about junk fees, but the biggest junk fee of all, think about it, is all of the 50% Biden inflation tax and that's what it is. And you just think of it, I mean, if you look at the real numbers of that, it's incredible. And we thought it was 30% and we were sure it was no more than that. It turns out to be actually 50%, the extra cost you're paying at the grocery counter and the gas pump and all of the other places that you have to go buy no matter what you buy."
    },
    {
      "text": "And that's all taken place within three and a half years, think of it. () But here's the good news, we have six months. Now with these stupid people running our country that's an eternity, because you could end up in World War Three with this group here. You don't know what's going to happen. But six months sounds very short. It's not frankly, with them it's an eternity."
    },
    {
      "text": "But it is not that long a period of time and will be here very quickly and we're going to have a good time and we're going to have a great convention. And I'm honored to have chosen your state. We had a lot to do with that, rights, rights. We're honored. We're honored. Biden has run the government like Robin Hood essentially in reverse, stealing from the poor and giving it to the rich. That's actually what he does. They talk the game, \"Oh, Trump, Trump, Trump.\" It's the opposite, it's the opposite."
    },
    {
      "text": "It's like I was saying the other day, the New York Times, every story they write is the exact opposite. They're so untruthful, they take something and make it the opposite. So when you're reading a story, you have to remember, you just do the opposite. It's a terrible thing. It's the same with the Democrats. They say many of the rich people are with Democrats. It's changed, we've become the party of the worker. We've become the party of the middle income. It's done a whole flip."
    },
    {
      "text": "Just listen, a few examples of what Biden's inflation taxes really bought. Crooked Joe is spending hundreds of billions of dollars to give $7,500 tax credits to rich people who buy electric cars. What do you think of electric cars? Well, I like Elon, but the car... And there's a place for electric cars, but you have to have other choices too."
    },
    {
      "text": "They want to have, by the end of I guess, five years from now, by 2030 they want to have, think of this, almost everybody having an electric car, but they don't want them and they're not selling. And one of the great things people don't know, \"Well, how come they keep getting made?\" You know why? Because our government subsidizes the hell out of them. So the car companies are doing okay. They're making cars that aren't selling. They're just not selling."
    },
    {
      "text": "They're giving billions and billions of dollars away in subsidy to create cars that people don't want. And again, I'm all for them if you want to go to the candy store, buy yourself a little candy and come back home. But if you want to take a trip to a place like Mar-a-Lago to say hello to me, you better get yourself a different mode of transportation."
    },
    {
      "text": "() And the scary part about that, they want trucks to be that way and the trucks have to stop six times going to California versus not stopping at all if you get the big diesels. And it's really crazy, it's really crazy when you think of what they do and they never change. You can explain this to them, six stops versus no stop. You don't have to know much more than that. There's one other thing the battery would take up almost the entire truck you wouldn't have any room for very much."
    },
    {
      "text": "They want to make our army tanks all electric. So that when we go into a foreign country, blazing hot, we're going in we keep their environment and their air nice and clean. Now how crazy is it? Are we crazy? They want to use a certain fuel in airplanes. I bought all brand-new beautiful jet fighters. I rebuilt the whole military."
    },
    {
      "text": "They want to use a certain fuel that brings the jets back down to 15% less efficient, that's a lot when you have somebody shooting at you on the other side, the 15% is the difference between winning and losing. So I said, \"It's 15%?\" \"That's right.\" Now think of it, we're fighting over enemy territory, we're worried about their carbon content. I'm not worried about it. I'm worried about bringing our people back and winning. We're worried about winning. It's amazing."
    },
    {
      "text": "() Even in South Carolina, I visited, where, by the way, we beat the governor by a record number, the governor, the former governor. They have a great governor there now, actually, but we did great. In the primaries we won every... Iowa, no matter where we went, we won New Hampshire. We go to New Hampshire. We get the most votes in the history of the state of New Hampshire in the primaries, Republican or Democrat. You know the Kennedy's, and they're right up in that territory and all."
    },
    {
      "text": "But Iowa, we won the largest... More different it's a caucus state. We won the largest margin ever by two. So we won the largest margin doubled. And then we went to Nevada. We went all over the place. When we got to South Carolina, we won in record fashion. But we won in Nevada in record fashion. Every state we went to we won in record fashion and it's really an honor. And then we won the quickest that anybody's ever won."
    },
    {
      "text": "() Right now, if this was a normal candidate that you're listening to, like a normal person, they'd still be campaigning. But we had this thing over with two months ago or something. So I just want to thank everybody. I just want to thank everybody. It's a great feeling because there's something in the air. Let's say, I haven't changed and you know what bugs me? When they say, \"We have two very unpopular candidates. Joe Biden, Donald Trump, they're very unpopular.\" He's unpopular, I'm not unpopular."
    },
    {
      "text": "I'm at 94% approval in the Republican Party. I'm not unpopular. The fake news, I hate that. It's terrible. We have two very unpopular people running for election. I'm not unpopular. I mean, look at the vote we're getting. We're winning virtually every state. We're winning every swing state. We're winning every national poll. We're not unpopular. () I'm unpopular in China. I'm unpopular in some other places where we've taken in hundreds of billions of dollars in taxes and tariffs. No other president's taken in 10 cents."
    },
    {
      "text": "They're not in love with me, but I love this country. President Xi loves China, and that's the way it's supposed to be, right? With Putin, interesting, I ended Nord Stream 2. Nord Stream 2 is the pipeline. Nobody ever heard of it before I came along. I ended the pipeline going all over Europe, going to Germany in particular, but all over Europe. I ended it, it was done. Biden came in and he approved it. The biggest deal ever done in Russia."
    },
    {
      "text": "() And Putin once told me, he said, \"If you are supposed to be like a nice guy, I'd hate like hell to see you as a bad guy. You have been brutal.\" To think of ending the biggest economic development job, the biggest thing they've ever done is a pipeline going through all of Europe. I ended it. Biden comes in almost from the first day, he let it go forward. And then they say, \"Trump is easy on Russia.\" No, I was very tough on Russia. I got along with Putin very well."
    },
    {
      "text": "I got along with President Xi of China very well. I got along with Kim Jong Un of North Korea very well. And you know what? Speaker 12 It's real... Take it easy. I'll tell you, there's a guy I wanted in the foxhole with me. Now, where is that guy? Where is he? He's a rough-looking guy. I want that guy in a foxhole. We could keep it down a little bit. Speaker 12 That's all right, man. That's all right. No, people are angry about it. People are angry, it's like stupid. You know what I say about the party?"
    },
    {
      "text": "It's become, with me running it, it's become the party of common sense, our party, the... It's the party of common sense. They say, \"Is it conservative?\" It is, it's conservative. It's just common sense. There are things that aren't so conservative. We want the party... We want to have a wall, which by the way, we built 571 miles of wall. We were going to put up another 200. () And they came along and they didn't want the 200 miles of wall, they didn't want wall."
    },
    {
      "text": "And that's when I realized they really meant they wanted open borders. Who could ever think? That's a lack of common sense. Why would somebody want to have people pouring into our country unvetted, unchecked? We know nothing about them. Even from a health standpoint, they're coming in and they have problems. It's sad, but those problems are contagious. Other people will get those problems. Why would anybody want this? It can't be great politically."
    },
    {
      "text": "There are those that say, two reasons, but you probably can add a third, they hate our country, they're stupid. But see, they're not stupid because anybody that can cheat that well is not stupid, okay? And the other thing is that they want those votes. And you wouldn't think they could do them that quickly, but they're trying to sign people up that just got here, that don't speak a word of English, that have lived in prisons and lived in mental institutions, they want the vote."
    },
    {
      "text": "But I think we're going to swamp them. Look, the way you win is to swamp. I think we're going to swamp. Crooked Joe is spending billions and billions of dollars on hotel rooms for illegal aliens. Think of it, hotel rooms, luxury hotel rooms in New York and other cities for illegal aliens. And our soldiers, our veterans are laying on streets and not being taken care of. I will say in the VA though, in the VA, we had the highest approval rating in the history of the VA, 92%. And now it's gone way down."
    },
    {
      "text": "Since I had something that if somebody had... They would take months and months to get a doctor sometimes. You'd get on there, you'd have a problem. Sometimes a very important problem that if you fix it fairly quickly, no problem. And if you don't fix it quickly, you become terminally ill and you die. And people are waiting in line for a week, two weeks, a month, three months. And I made a deal with Congress."
    },
    {
      "text": "I had to get it through Congress that anybody that has to wait more than 24 hours goes outside, goes to a local doctor, we pay the bill to get themselves fixed up and it worked. And they're making that impossible. () And then also with the veterans, and you have a lot of veterans in this state, it's a big veteran state, but also with the veterans, it's not prime time necessarily for them and they were getting beat up."
    },
    {
      "text": "We have sadists, we have thieves, sadists, but we had sadists that did bad things to our people, to our heroes, bad, bad things. And we couldn't fire them, because of civil service laws and various other reasons. Unions a little bit, but civil service. You couldn't fire them no matter what they did. They could kill somebody you couldn't fire them. And they'd beat the hell out of our people. And I was able to fire 9,000 sadists and bad people."
    },
    {
      "text": "Get them out and replace them with people that loved our veterans and it was a whole different place. But it's fairly rapidly morphing back into what... I've seen it. () Just the other day I was talking to somebody, they say, \"They don't like the policy where you go out and get a doctor.\" And we had negotiated fees with people, because I know doctors, they know how to charge as well as anybody. We had negotiated fees."
    },
    {
      "text": "We actually could save, I mean, there's a scenario under which we actually saved money, but we saved lives and we made their life better. Could you imagine? You're all rich, spoiled people, not necessarily. You're all rich, spoiled people, could you imagine wanting to see a doctor over something that you know is simple, but it's got to be fixed and they say, \"We can't see you for three months?\" Could you imagine having to wait around for three months? Now think of it, just put yourself in that position."
    },
    {
      "text": "So we took care of those things and we had the highest approval rating in the history of the Veterans Administration, which was a great tribute. Thank you. We had very good people there. () And Joe Biden got rejected last year by the United States Supreme Court on his student loan program. So that what he wanted to do is buy votes. He says to all these people, a lot of people, I mean honestly, I'm looking, I'm seeing that's billions of people. He wanted to buy votes."
    },
    {
      "text": "So he said, \"We're going to cut your student loan.\" Now the problem with that is many of the people here, but large numbers of people went through years and years to pay off the loan. All of a sudden, this guy comes along and in order to try and buy an election... I guess I don't blame him, but it's very unfair. But the Supreme Court rejected it. So then he goes in now again with a little smaller version of the same thing. He's going to get rejected."
    },
    {
      "text": "And I'm just saying, I will take care of our students far better than him. We're going to take care of our students. We're going to help our students. We're going to make their life good. But what he did is so terrible. () So he didn't obey the decision of the Supreme Court of the United States, and now he's doing another one, which is actually a smaller version, but it's even more becocked, okay? It's even worse. So it's a terrible thing, but he's going to be rejected there too. But that's what they do."
    },
    {
      "text": "And it's very bad for the country. But we're going to take care of our students better than they've ever been taken care of before, I promise you that. If Joe Biden wins his election, the middle-class loses, but if Trump wins, the middle-class wins. The low-income will start their journey toward the American Dream. Wisconsin will win, and the biggest winner of all is going to be America, America wins."
    },
    {
      "text": "On day one of my new administration, we're going to throw out Bidenomics and we are going to replace it with MAGAnomics, it's MAGAnomics. And upon taking office, I'll impose an immediate moratorium on all new spending grants and giveaways under the Joe Biden mammoth Socialist bills like the so-called Inflation Reduction Act. We're going to save all that money. It's not helping you at all. It's not doing a thing for you. It's just like a political game. We're going to stop the Biden spending spree."
    },
    {
      "text": "We're going to halt his inflation death spiral. We're going to terminate his green new scam. It's going to be terminated. And we're going to end this war on American energy. We're going to drill, baby, drill. We're going to bring down your energy costs. We're going to bring down your energy costs like you wouldn't believe. () And by the way, that's going to spiral everything else downward. That's what started inflation."
    },
    {
      "text": "You didn't have to be that good a student at the wonderful Wharton School of Finance to know that if your energy cost doubles and triples, it was going up like a level. Now he's gone more or less back to where I was in terms of drilling. He's approving. The day after the election he would end that immediately because they have to get some mo out of the ground. We have more liquid gold under our feet than any other nation in the world by far. We started off at number three and number four."
    },
    {
      "text": "We were down in threes and fours generally. And we ended up number one by a lot over Russia and over Saudi Arabia. And we were doing great, and we were going to use all that money we were making to start reducing debt and lowering taxes still further. But he ended it. () And then they did a crack course on let's do something. Remember, he took all the oil, it's at the lowest level it's ever been, the strategic reserves."
    },
    {
      "text": "He took all the oil out of the strategic reserves so that people could fill up their car with a tank of gas and not get totally destroyed, because it was just before the election. So he took all this oil, and it's meant for fighting wars, it's meant for major emergencies, catastrophic emergencies. It's not meant for helping to get the price down 15 cents a gallon so that you can try winning an election."
    },
    {
      "text": "And now with the strategic reserves at the lowest they've ever been, that tells you something about what's happening here. () To further crack down on rampant waste in the federal government, we're going to bring back presidential impoundment authority, which nobody knows what it is. But it allows the president to go out and cut things and save a fortune for our country. Things that make no sense. And there's so many of them. We have so much waste."
    },
    {
      "text": "We're also going to reclaim America's heritage as the great manufacturing nation. And we were doing that, we were doing that. I remember when Biden said, \"Well, this isn't a manufacturing nation.\" We became a great nation because of manufacturing. It is a manufacturing... But they' Thank you. But, isn't it nice to have a president who doesn't need a teleprompter? Not that he can read it, anyway. He can't read it. Now, think if I read my teleprompter and I'm going, \"Well, let's see there."
    },
    {
      "text": "Because of the weakness in the economy, I'd like to apologize. Pause.\" Pause. What was that? That's unbelievable. Pause. I was watching it. I said, \"That was weird.\" They actually don't have pause in my teleprompter. They have a blank space, like you see if there's a response. If there's no response, you just keep going, you don't have pause. Some speech writers saying pause. They're not going to know some of the things that people like the best, that get the biggest applause. You think of deadlines, right?"
    },
    {
      "text": "Like \"Drain the swamp.\" I hated it. I hated the line. I said, when I first started, because we did drain a lot. I got rid of Comey, I got rid of so many people. But, it is true. But, listen. Drain the swamp. I used to go, \"We will drain the swamp.\" I used to sort of like [inaudible :28]. (:28) The people used to go crazy and after a while I got to like it. Frank Sinatra never liked the song My Way, but after a while got to ... He told me."
    },
    {
      "text": "After a while, he got to love it, because it was just something that people reacted to well. So, there are things that when you do this stuff, you don't think it's going to necessarily be great. Like we had a lot of nicknames. I was the king of nicknames. Somehow, I was the king. It worked. I won't go over most of them, because many of them are friends of mine now. I can't really bring them back. I bring back bad memories. But, the nicknames are good. What do you like better? Sleepy Joe? They're both accurate."
    },
    {
      "text": "What do you like better? Speaker 13 He says criminal. Criminal. Okay. Wait a minute. Okay. We'll go Sleepy and then we'll ... Wait. Wait. You applaud if you like it. We'll go sleepy first and then we'll ... Sleepy Joe. Crooked Joe. Speaker 13 That Crooked Joe is a bad guy. I thought it was going to be a lot closer than that. Wow! Well, I used to call Hillary, I know it was accurate. But I used to call Hillary crooked and I changed. Moved it over. Well, that's very good. That's a cheap poll."
    },
    {
      "text": "Normally you'd spend 150,000 with these pollsters, some of which are good, but some of which are ... They'll take 150,000. They won't even go into the field. They'll just say, \"Let's see. Let's tell them it's about 40 to 30. And let's say that 30% are undecided,\" and they won't have left their office. And so, this way I get an accurate poll. That's a very accurate poll. That's more accurate than some pollsters that I get. Although like pollsters right now, because we're leading in all the polls."
    },
    {
      "text": "So, right now I like pollsters. The radical extremists and far-left agitators are terrorizing college campuses, as you possibly noticed and Biden's nowhere to be found. He hasn't said anything but there his political base. Do you think if he did say, \"Okay, look, let's not get ourselves ... \" Ladies and gentlemen, President Biden is coming to give you his words of inspiration. Now, does anybody think that it will be so inspiring that everybody will say, \"Oh, we have to go home. We love our country,\"? No."
    },
    {
      "text": "They'll say, \"Do you believe the guy that's the president of that country, this guy- Speaker 14 [inaudible :13] He needs something. No. Think of it. But, he hasn't been heard from. He is the president. When you have a problem like that, you should go out and talk about it and talk to the people. But, there's a big problem. There's a big fever in our country and he's not talking. But, if he did it wouldn't matter. In fact, I think it would actually make it worse."
    },
    {
      "text": "Vanquish the radicals and take back our campuses for all of the normal students who want a safe place from which to learn.\" (:58) But, when you see that video of raging lunatics and Hamas sympathizers at Columbia and other colleges- No. But when you look at it, I say, \"Where did these people come from?\" I don't know. People like that. I deal with a lot of people. Where do they come from? And they do come from other countries and they are paid. I said something last night. I did the great Sean Hannity."
    },
    {
      "text": "Has anyone ever heard of Sean Hannity? He had to do two hours last night instead of one. He went through it like it was nothing. He's a professional, he's a good guy too. But, I said the other day. I said, \"Do you ever notice the signs?\" Normally in the old days when you had a real protest, not financed by Soros or whoever might finance it. When you had a real protest where people meant it, they'd go down in their garage basement and they'd start making a sign and they'd all be different."
    },
    {
      "text": "(:50) Every sign was a perfect printed sign, green with a perfect beautiful post. Everything was the best money could buy. They all have the same. They were handed those signs by people. At least they should make them a little different. Different lettering, different colors. But, they don't. No. It's a whole big hoax going on. But, it's a shame. And Biden should speak out. He should speak out. He should say something, because. Nobody knows where he is. He's definitely against Israel. She said ..."
    },
    {
      "text": "She said, \"He has no idea where he is.\" Remember Chris Christie who liked me quite a bit, right? That's only because I was wise to him. (:35) And somebody screamed out, \"He's a fat pig.\" And I said, \"Sir ... \" and you're not allowed to use the fat word? If you use the fat word, you're essentially out of politics. Right? There are certain words. You can say \"obese,\" but you can't say \"fat.\" I think obese is probably worse, but you can't use [inaudible :53]."
    }
  ]
}