{
  "speech_id": "289",
  "title": "Donald Trump Tours the Ford Plant Without a Mask, Explains Why",
  "date": "20200521",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-tours-the-ford-plant-without-a-mask-explains-why",
  "topics": "Healthcare, Technology",
  "num_segments": 30,
  "content": [
    {
      "text": "Jim, how are you? Nice to see you. Speaker 3: () This is Mr. Lester from General Electric. Mr. How's our friend doing? Okay? Mr. He's doing well, right? They're all doing well. They're all doing well. Speaker 3: () So, they're going to tell you really quickly what they've built here. Okay, good. Speaker 3: () And the White House was superb [inaudible :21]. Vice President Pence- Well this is a very important project. Please, go ahead. Mr. Go ahead. Please."
    },
    {
      "text": "Speaker 5: () From the GE side, we've been involved from day one of on ventilators side. So, Jim and I have been partners here- How long have you been in GE? Speaker 5: () 17 and a half years. Very good. Speaker 5: () In the healthcare division the entire time. Very good. Great company. It's coming back? Speaker 5: () We're doing well. The engine thing has got to be tough though, right? Speaker 5: () The aircraft engines. The airplane engines. Speaker 5: () Very tough."
    },
    {
      "text": "That's got to be tough because that was your- Speaker 5: () We had a huge market share. That was your baby, right? Speaker 5: () It is. It is. Exactly making too many planes. Speaker 5: () Servicing them. But they're making these. Speaker 5: () They're making these. So, go ahead. Speaker 3: () Actually, it's all the stuff you see here, gowns, masks, face shields, face masks. All right. Good. Are you making it all there? Mr. Oh, yes. Mr. That's great. They're all volunteers. Please. Mr. Can I see this?"
    },
    {
      "text": "Anything unique about this? Mr. Go ahead. Mr. Is this any special kind of mask? Mr. That's fantastic. Will you keep doing that after the [inaudible :42]? You think it- Mr. There'll be a time when you'll have it. Yeah, that's great. You did really a good job quickly. Mr. Hello everybody. Hi. Yeah. Who are you with? Good, good. Very good. You know, we were just talking about it. We have a very big stockpile right now and we're building it bigger and we're helping a lot of other countries. Nigeria, we just sent a thousand."
    },
    {
      "text": "We have various, various countries, France, Spain. We have a lot going to Italy. We have a lot going to a different, probably 15, 18 countries. They're calling us. We had the capacity to do this. Nobody else did. So every state now has more than they need, and our stockpile is totally full. We have a tremendous amount. So now we're really helping other countries where they're losing a lot of people because they don't have ventilators."
    },
    {
      "text": "Ventilators are hard to do, and I want to say that Ford and General Electric have done an incredible job working together. And also the companies that work with you, they really did a great job. They do a great car and they really did a great job on the ventilators. And I hear that the quality of the ventilator has been really top of the line. William Ford, Jr.: () Thank you. Speaker 7: () Mr. President- We really appreciate it, fellas. Good job. Speaker 7: () Mr."
    },
    {
      "text": "President, there was a lot of interest about whether you would end up wearing a mask today. Could you just take us through your thought process of why you decided not to wear a mask? Well, I had one on before. I wore one in this back area, but I didn't want to give the press the pleasure of seeing it, but no, where I had it in the back area, I did put a mask on. Speaker 7: () Did you have the goggles on too, as well, sir? I did. I had goggles, goggles and a mask right back there."
    },
    {
      "text": "Speaker 7: () Why would you not be- And here's another one. Speaker 7: () Why would you not be wearing it- Because in this area... You take it. Speaker 7: () Why would you not be wearing it here, sir? Not necessary here. Everybody's been tested and I've been tested. In fact, I was tested this morning, so it's not necessary. Speaker 7: () But the [crosstalk :20] executives are wearing them. Well, that's their choice. I was given a choice and I had one on in an area where they preferred it."
    },
    {
      "text": "So I put it on and it was very nice. It looked very nice, but they said they're not necessary here. Yeah, please. Speaker 8: () What about the example that it would set for other Americans to see you wearing a mask? Well, I think it sets an example both ways. And as they say, I did have it on. Thank you. Yeah, please. I just liked your question so much. You know what, it was such a nice question. I'll take an extra question. Go ahead."
    },
    {
      "text": "This is the biggest mobilization since World War II, and these people were in charge of it. They did it. They did a fantastic job. They did a really fantastic job and we appreciate it. All of these companies, they came together and they used to make cars here. They used to make other things here. And now not only the ventilators, but you're saying the masks and all of the other... What other product do you make? It's the head of Ford, by the way. Not bad. Not a bad position. William Ford, Jr.: () Thank you."
    },
    {
      "text": "So, we've got- You know, she's a very nice woman. William Ford, Jr.: () I know. Hi Carol. How are you? Is he doing a good job? By the way, here is my mask right here [crosstalk :44], and I liked it very much. I actually, honestly, I think I look better in the mask. I really did. I look better in the mask, [crosstalk :53] but I'm making a speech so I won't have it now, but I did have it on right here. And I think some of you might've gotten a shot. Thank you very much. Speaker 7: () Mr."
    },
    {
      "text": "Ford, can you confirm that the President was told it's okay not to wear one in this area? William Ford, Jr.: () It's up to him. Mr. Oh, that's great. Mr. Is that like a seatbelt something there? Mr. I hear it's a very high grade ventilator. William Ford, Jr.: () Yeah, it's great. It is. They've done a great job. I mean, the ventilator and the respirator, they're really, really neat. What's also amazing is how many our team can make."
    },
    {
      "text": "I mean that's one thing the auto industry- So how many will you make a week, ventilators? Mr. So folks, that's 6,000 ventilators a week. Think of that. From a running start, which wasn't much of a run, actually. So we had very few in this country, almost none. We were not in that business and now they're making thousands a week. Great thing. What about this? Mr. Wow. Mr. Is that full proof, would you say? Mr. Maximum. Mr. We got to get back to the rallies. Do you agree with that, John? We got to have the rallies."
    },
    {
      "text": "I think we will. I think we're going to be helping people out. We're going to be getting some money for them during the artificial... Because it really is. It's an artificial closure and now we're going to be able to open it up. This isn't like for long term problems and it takes years and years to have it come back. The depression took 12 years, more, 14, 15 years. We're going to be back next year, maybe even in the fourth quarter, in a few months, we're going to be back. Because we closed it and now we open it."
    },
    {
      "text": "But I would say there could be one more nice shot, one more nice dose. Well, I'd let you know and I know exactly, but I'd rather do it at the appropriate time. Today we're celebrating these great companies doing ventilators and other equipment, but we have a very, very specific plan, and it'll be great for the American people, and our economy's going to be back soon, and Ford and General Electric and these great companies that helped us so much in a time of need, they're going to be very happy."
    },
    {
      "text": "And you're already gearing up. I know you're gearing up. Your lines are starting to roll making cars again. So a lot of things are happening. By the way, on our southern border, it's never been so secure. We're up to almost 200 miles of wall and we have never had, that whole area, nobody comes through that area. The area where the wall goes up, that's the end of that. So, as soon as you're able to have people get in."
    },
    {
      "text": "We've never had an empty seat since the day I came down the escalator with our future First Lady, we've never had an empty seat. You know that. And we'd have thousands of people we sent away. And I think the demand now from what we see is greater than ever before. We're going to have to go to certain states where we're able to... Look, I don't want to have a stadium where you're supposed to have a person and then seven empty seats and then another person."
    },
    {
      "text": "So we might do some outdoor big ones, and we may also just wait until the stadiums can open up. I think it's going to be soon. We'll go to a place like Florida. We'll go to a place like maybe Georgia, some other place where they're going to be opening up. Whoever opens up first. The demand has been incredible to get going with the rallies. I just hear the music in the background. I'm saying we've had rallies like nobody's ever had, and we would love to get back to that."
    },
    {
      "text": "I think it's going to be sooner rather than later. I think it holds tremendous promise, but we have many other companies who are just about as far along. We have many companies. We have the greatest pharmaceutical companies in the world. They're equally, you know what I mean? They're really in a position and I'm not only talking about vaccine. I'm talking about cures and therapeutics. Therapeutically, we have some things coming out which we think are going to be great, but they have to be tested quickly."
    },
    {
      "text": "And we're doing it very quickly. Right now, what we're doing is we're setting logistically with our military, our military is in gear so that we can give 150, 200 million shots quickly. The military is in gear. We can move a couple of hundred thousand soldiers immediately in time of emergency. So this is not nearly as big a deal is that it's equally as important perhaps, but it's not as tough logistically. I'll sit down with a lot of people and we'll figure it out."
    },
    {
      "text": "We're going to sit down with the military and we hope to be in that position fairly soon. So rather than having the vaccine, doing the tests and then starting to gear up, we're taking a risk. Because you know, it could be that if something happened, but I don't think that's going to be. But in addition to that company, we have other companies that are very far advanced. And also don't forget, therapeutics and cure. We're talking about a vaccine in this case, but therapeutics and cure."
    },
    {
      "text": "I mean, frankly, that's my first choice, because that would take care of people that are in trouble right now. Okay? Speaker 7: () Mr. President, on the issue of testing, there's been questions about whether you're satisfied or not with what the CDC is doing, the work they're doing, particularly the director, Dr. Redfield. Can you address that? Are you satisfied with the work CDC- I think they're doing a good job, a really good job in a very complex situation."
    },
    {
      "text": "You know, we started off, nobody knew what the virus was. It came in from China and nobody knew what it was. And frankly, I think they've done a really good job. I'm very happy about it. A lot of other people think they've done a lot of great work. We're now up to, and this is beyond even CDC, because we've done it between Jared Cushner and a lot of geniuses coming in from Silicon Valley, and a lot of people, these companies where they could make ventilators."
    },
    {
      "text": "Look, what we did with ventilators is incredible because we geared up in a short period of time through General Electric, Ford, they're represented here at the top level, through other companies. We were at Honeywell the other day. They make masks. Who would think Honeywell is making a mask? But that's what they're making now is a mask. It's a very high tech company. You know, they make the dashboards to an airplane and lots of other things. And now they're making masks. Our companies geared up so quickly, so fast."
    },
    {
      "text": "Honeywell opened a plant in three weeks from literally zero to open making masks in three weeks. It's been an incredible achievement. There's never been anything done like this since the end of World War II. That's true. I think I was the first one to say it. I don't know. Wouldn't you say that I was the first one? But you can't let the cure become worse than the problem itself. I think the governors have to start opening up. We now know the disease. We know the weaknesses and the strengths."
    },
    {
      "text": "We know that older people are affected gravely, and younger people are not affected gravely, frankly. You look at the statistics. It's incredible. And we know that we have to protect some people much more so. I think a lot of the governors have done a very, very poor job on nursing homes, but they've done a good job on other things. I know every governor. I can grade every governor. But we've made a lot of hero governors."
    },
    {
      "text": "We've done a great job for the governors and my relationship with them in almost all cases is very good. And remember this. One of the beauties we were just talking about, not one person who needed a ventilator didn't get a ventilator. I think that a lot of these states are going to, the ones that are sort of sticking to a certain very rigid pattern, I think they're going to stop. I don't think that people are going to stand for it. This is a country that's meant to be open, not closed."
    },
    {
      "text": "And we did the right thing, John. We saved millions of lives, millions and millions of lives. You would have had anywhere from a million five to two million, five, three million lives, think of it. So if we were at a hundred thousand, instead of a hundred thousand, multiply that times 15, 20 or 25, it wouldn't have been acceptable. It wouldn't have been sustainable. You couldn't have done it. So we've called it right, and now I want it open and we're going to open."
    },
    {
      "text": "And if there's a fire, an ember, a flame some place, we put it out. But the people have done a great job, and General Electric, Ford and all the other people that work with them have done fantastic work. And Honeywell, again, I was there last week. But Honeywell, they've done fantastically also. Okay? Thank you very much. Speaker 13: () Mr. President, you mentioned that embers, right, smaller fires, those pockets of the virus popping up. Are you concerned about a potential second wave of this virus?"
    },
    {
      "text": "People say that's a very distinct possibility. It's standard. And we're going to put out the fires. We're not going to close the country. We're going to put out the fires. There could be, whether it's an ember or a flame, we're going to put it out, but we're not closing our country. Thank you very much. Speaker 14: () Are you looking to replace Dr. Redfield or his [inaudible :43]? No."
    }
  ]
}