{
  "speech_id": "293",
  "speaker": "Trump",
  "title": "Transcript: Donald Trump Remarks on Protecting Seniors with Diabetes May 26",
  "date": "20200526",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-transcript-on-protecting-seniors-with-diabetes-may-26",
  "topics": "Healthcare, Government Policy",
  "num_segments": 69,
  "content": [
    {
      "text": "And welcome to the Rose Garden as we take powerful action to lower healthcare costs for America's seniors. Today, I'm proud to announce that we have reached a breakthrough agreement to dramatically slash the out-of-pocket costs of insulin. You know what's happened to insulin over the years, right? Through the roof. Insulin, so many people, so necessary. For hundreds and thousands of seniors enrolled in Medicare, that's a big deal, participating plans will cap costs at just $35 a month per type of insulin."
    },
    {
      "text": "And some plans may offer it free. So for everybody that was getting ripped off and paying tremendous prices as senior citizens... And Seema, I want to thank you because you brought this to my attention a long time ago. And you worked very hard on this day. And the press won't even cover it, but they'll cover things that are unimportant. But this is a big day for seniors. This is a tremendous saving, and it allows people that... If you don't take insulin... I just wrote this down."
    },
    {
      "text": "You go blind, stroke, amputation, kidney failure, and other things. So we're getting it down $35 per month. And it would be anywhere from 50 to 150 to over $200 a month. So it's a massive cut, I guess 60-70. Nobody's seen anything like this for a long time. Sleepy Joe, can't do this, that I can tell you. In fact, it was his problem with Obamacare that caused part of your problem. This will save impacted Americans am average of minimum $ 446 just on insulin costs a year."
    },
    {
      "text": "We're pleased to be joined by Vice President Mike Pence and Surgeon General Jerome Adams. I also want to thank Seema again. Thank you very much for the job you've done helping achieve the incredible victory for Medicare patients nationwide. In the past, Obamacare prevented insurance providers from competing to offer lower costs for seniors. There was no competition. There was no anything. And they ran away with what took place and the seniors were horribly hurt. Many people couldn't take insulin."
    },
    {
      "text": "They couldn't even think about it. As a result, Medicare beneficiaries with prescription drug coverage paid an average of $675 for a year's supply of insulin. And sometimes as high as $1500. Harmful laws also meant that seniors often paid a different amount almost every single month. They had no idea what they were paying. They were billed. Every month they were billed a different amount and it was a massive amount."
    },
    {
      "text": "One in every three, seniors on Medicare has diabetes and over 3.3 million beneficiaries use at least one type of insulin. Over the past 10 years, these seniors have seen their out-of-pocket cost for this life-saving treatment almost double. I don't use insulin. Should I be? Huh? I never thought about it. But I know a lot of people are very, very badly affected. Unbelievable. That's why my administration acted decisively."
    },
    {
      "text": "We slashed Obamacare's crippling requirements and opened up competition like they've never seen before. They've never seen competition like this. Between transparency and all of the other things we're doing, nobody's ever had a competitive situation created like we've done it. And the prices, you will see very soon, they're going to come tumbling down. Then we brought all the parties to the table, insurer, manufacturers, and other key players."
    },
    {
      "text": "And reached an agreement to deliver insulin at stable and drastically lower out-of-pocket costs for our seniors. I hope the seniors are going to remember it. Because Biden is the one that put us into the jam, because they didn't know what they were doing. They were incompetent. Soon, nearly half of all eligible Part D and Medicare Advantage Prescription Drug Plans will offer this low-cost option. And when you say low cost, you're really talking low cost."
    },
    {
      "text": "It's giving seniors the freedom and choice to pick the plan that's right for them. Nothing will ever stop me from fulfilling my solemn duty to America's seniors. I'll use every power at my disposal to lower drug prices. And my administration will always protect Medicare and social security, and, by the way, preexisting conditions. And we got rid of the individual mandate, which is a disaster. The worst part of Obamacare was the individual mandate."
    },
    {
      "text": "When we got rid of the individual mandate, essentially, we got rid of Obamacare. If you want to know the truth. You can say that in the truest form. But we got rid of a horrible, horrible condition called the individual mandate, but we'll always protect you on preexisting conditions. Much more so than the Democrats. Here with us today is Bruce Broussard, President and CEO of a big powerful healthcare company, Humana. And I'd like to have Bruce come up and say a few words, please. Bruce? Thank you."
    },
    {
      "text": "That's a big company. Look how young he is too. That's very young to be running such a big company. Thank you, Bruce. What a job you've done, too. Really an amazing job. You're also in the right business, right? That's good. Well, you've really helped. We appreciate it very much. Thank you, Bruce. We're also joined by Tracey Brown, the CEO of American Diabetes Association. A lot of bad things can happen without insulin in terms of diabetes and other things. Please, Tracey? Thank you very much. Hi, Tracey."
    },
    {
      "text": "Speaker 1: () Thank you, Mr. President. Thank you Administrator Verma for making this afternoon one that we can focus on. The 34 million Americans like myself, who's living with diabetes. 7 million of which need insulin to live. 25% of these individuals have told us that they ration or skip doses of their medicine because they simply cannot afford it."
    },
    {
      "text": "And so this effort, CMI MMI demonstration project that brings together the government, industry, and public health advocacy from the American Diabetes Association, is the right thing to do. And we're thrilled to take this challenge head on. Today, together, we are helping millions of seniors access insulin affordably. This is a very big deal. The American Diabetes Association is the nation's leading organization that fights for people living with diabetes."
    },
    {
      "text": "And we are committed to continue to partner to make sure every American, and especially our seniors, have access to the medicine that they need to live. So thank you Mr. President, and thank you Administrator Verma. So Tracey, are you surprised at how much we've gotten the price down? To what extent and to the level that we brought it down to? Speaker 1: () This is a very exciting day for people living with diabetes. And so, any step to bring this lower is good news."
    },
    {
      "text": "We know that we need to do more, but I'm so confident that, together, we are going to be able to help all people living with diabetes thrive. Good. Thank you much. Speaker 1: () Thank you. Appreciate it, Tracey. I'd like to also invite up David Ricks, Chairman CEO of Eli Lilly and Company, a very big and a very great company. Please. He's another young guy. Thank you very much, David. Yeah, and I think we will. Thank you very much. Thanks, David. Appreciate it. Really good job."
    },
    {
      "text": "I also want to thank the companies with us today for rising to the occasion in our fight against the invisible enemy. Humana and other insurers have agreed to waive copays, which is a very great thing to do. It's a big deal. Thank you very much. Co-insurance, deductibles, coronavirus treatments for most enrollees. People that aren't in the business or even in business period, they wouldn't realize how big a thing that is, but it's a very big thing and we appreciate it very much."
    },
    {
      "text": "Coronavirus treatment for most enrollees, we've been moving along and we're doing well. We're going to be reporting on it in just a second. Sanofi is working at breakneck speed to create a vaccine. Eli Lilly has been developing therapeutics for coronavirus and expanding a free drive-through testing operations. And thank you all for the work. It's been great. We're battling the virus on every front, speeding relief to our work workers and pursuing therapies and vaccines at record speed."
    },
    {
      "text": "We have many companies right now, I think we can say, very far down the line on vaccines and therapeutics... And cures frankly, I think cures are going to be in there very shortly... Manufacturing, vast quality quantities and medical equipment supplies. All of the different things that you need. We've energized our military. Our military is ready logistically to go out and distribute whatever it is we come up with. And I think we're going to come up with a lot."
    },
    {
      "text": "I think we're going to have therapeutic remedies and I think we're going to have vaccines very shortly. I've been saying it, \"very shortly\". I think I'll be proven correct. If I'm not, I'm sure the media will let us know about it. We're safely reopening our country while aggressively protecting the vulnerable, especially our seniors. We're telling our seniors to stay back a little bit. Stay back, let this thing pass."
    },
    {
      "text": "We're not only keeping older Americans safe from the virus, we're also ensuring that they have the best medical care on earth at a price that they can afford. That's what happened with insulin. Nobody can believe it when they hear the price of the insulin. It's been an amazing difference, and Seema's going to be talking about that. That's not just like a 10% drop or a 5% drop, which by itself would be good. That's a big drop. That's a really big drop."
    },
    {
      "text": "We approved a record number of generics and reversed the trend of soaring drug prices... A good number of generics and reverse the trend of soaring drug prices for the first time in over 50 years. First time we've ever had prices go down. Average basic part D premiums drop 13.5% the lowest level in seven years. And we're going down very substantially from that level."
    },
    {
      "text": "It's going down very, very substantial unless you have a new administration in which case it'll go up very substantially that I can guarantee you they've been doing it to you for years. Average Medicare advantage premiums have plummeted 28% to the lowest level in over a decade. And that's despite everything that's been happening, which would normally make things go up. And we have more than let's see 1200 more Medicare advantage plans today than we did think of that two years ago."
    },
    {
      "text": "So we have 1200 more Medicare advantage plans than we did two years ago. That's something. I signed an executive order to crack down on fraud in Medicare, and to give beneficiaries faster access to the latest medical devices and therapies and to take all of the fraud money. We're finding a lot of it, all of that money that we're finding in Florida reduced prices. We provided nearly $1 billion in grants to support home delivered meals and in home care for elderly patients and disabled people during the pandemic."
    },
    {
      "text": "We expanded tele-health, which has really turned out to be a very hot subject, right? People that never thought about it, people that didn't like the idea, right Tracy? They're loving telehealth, it's speedy and it's a lot less expensive. We expanded telehealth for Medicare beneficiaries and the number of patients using it has increased from roughly 11,000 a week to nearly 1.3 million. So we went from 11,000 people to 1.3 million people a week."
    },
    {
      "text": "But very big where you'll be seeing it price transparency, some people think it's bigger than healthcare. When you look at it, it's going to be bigger than healthcare price transparency. It was signed approximately nine months ago. It's going through the process and it'll be here by the first of the year. So I hope you're going to remember me just in case the unthinkable happens. But nobody else would've gotten it but this administration. Price transparency it's going to cut your costs tremendously."
    },
    {
      "text": "And that literally one of the biggest people in the field said it's going to be a bigger thing, price transparency, bigger than healthcare in a true sense. The cost of healthcare is going to come down very, very substantially. We're always working on preexisting conditions and saving your preexisting conditions. And as long as I'm president, you'll always be protected on preexisting conditions."
    },
    {
      "text": "And surprise medical billing is something people are surprised, never in a positive sense and we've written that out and that's going to be very quickly ended. So you're not going to be surprised, meaning badly surprised, very negatively surprised. It's a big thing, people go in they go for an operation they end up literally losing all of their money, losing everything over something that should not happen. Surprise medical billing."
    },
    {
      "text": "We provided states more resources to step up inspections, added shipments of personal protective equipment to all 15,400 Medicaid and Medicare certified nursing homes and issued a strict new guideline that every nursing home resident and staff are to be tested immediately and that all staff be tested weekly. So we're making it very, very tough. Every day of my administration we're fighting for our seniors like never before."
    },
    {
      "text": "Our seniors are very special people, all of our citizens are special, but our seniors we'd have to take care of our seniors. Our senior citizens have spent their entire lives working hard, supporting their communities and families and paying into the system. We will not rest until they get the kind of care and support that they have earned and that they deserve. Now I'd like to ask vice president Mike Pence to come up and say a few words, followed by administrator Verma."
    },
    {
      "text": "And I would just like to thank you again for the great job you've done. So we'll have Mike speak and then you'll speak and thank you very much. Go ahead, Mike. Thank you. Thank you Mike very much. And I think I'll just add on to what Mike said. If we didn't act quickly and smartly, we would have had in my opinion and in the opinion of others, anywhere from 10 to 20 and maybe even 25 times the number of deaths. We closed the border to China, meaning we put on the ban people coming in from China."
    },
    {
      "text": "That was a very big moment as Dr. Fauci said, we saved thousands and thousands of lives when we did that. And that's true, but I think we would have had anywhere from 10 to 20 or 25 times the number of deaths if we didn't act the way we did. And also if we didn't act swiftly. So we're very proud of our team and our taskforce and Mike, great job. ... Proud of our team and our task force and Mike, great job. Seema, please. Thank you, Seema. That's very nice. And many, many people feel the same way."
    },
    {
      "text": "They can't actually believe it. $35 and less. And less. And they were being ripped off at a level that nobody's seen before. But that's true with a lot of other things and we're taking care of them, too. So I want to thank everybody for being here. In particular, these great executives. Thank you very much. Thank you very much. You were very impressive in your speech by the way. Thank you very much. John, please. Your questions early. We're doing it now. We're doing something now."
    },
    {
      "text": "I think you'll find it very interesting, but I won't be talking about it today. I'll be talking about it over the next couple of days, John, okay? But it's a very important question. Yes, please. Anybody? Yeah, please. Speaker 2: () Mr. President two questions about a couple of things you've tweeted about in the last few days, were you meaning to criticize Vice President Biden for wearing a mask yesterday? And can you explain why you've been tweeting about a conspiracy theory that has been proven to not be true?"
    },
    {
      "text": "No, Biden can wear a mask, but he was standing outside with his wife, perfect conditions, perfect weather. They're inside, they don't wear masks. And so I thought it was very unusual that he had one on. But I thought that was fine. I wasn't criticizing them at all. Why would I ever do a thing like that? And your second question was? I couldn't hear you. Speaker 2: () The second- Can you take it off because I cannot hear you. Speaker 2: () I'll just speak louder, sir. Okay. Because you want to be politically correct."
    },
    {
      "text": "Go ahead. Speaker 2: () No, sir. I just want to wear the mask. Go ahead, go ahead, go ahead. Speaker 2: () The second question was about your tweets about the woman who died, who you're suggesting that Joe Scarborough was responsible. Yeah. A lot of people suggest that and hopefully someday people are going to find out. Certainly a very suspicious situation. Very sad. Very sad and very suspicious. Question, please? Speaker 2: () [inaudible :02] has asked you not to tweet about it anymore, sir. Go ahead, please go."
    },
    {
      "text": "Speaker 3: () Mr. President, though have you seen the letter that was written by her husband begging Twitter to delete your tweets? Talking about how hard it's been for his family, for him to deal with that. Yeah, I have, but I'm sure that ultimately they want to get to the bottom of it. And it's a very serious situation. I also saw a clip with Joe and Imus where they were having a lot of fun at her expense. And I thought it was totally inappropriate. Now it's a very suspicious thing."
    },
    {
      "text": "And I hope somebody gets to the bottom of it. It'll be a very good thing. As you know, there's no statute of limitations. So it would be a very good, very good thing to do. Okay. Who's next? Any questions on insulin? Yeah, please. Speaker 4: () Mr. President. There's a bill in Congress that's related to the [weakers :52]. It passed the Senate. It's going to be up to the house. Are you willing to sign that? We're taking a look at it very strongly. They're going to report this afternoon. I'll be looking at it this afternoon."
    },
    {
      "text": "Speaker 4: () Something special that you mentioned on China. Does that include sanctions? No, it's something you're going to be hearing about before the end of the week. Very powerfully, I think. Yeah please. Speaker 5: () Is there any reason why someone who does not have diabetes would take insulin? Is there any sort of medical reason for that? I could ask that question to anybody like to discuss that. Do you want to discuss it, please? Go ahead. Do you know the answer? Either one of you or both."
    },
    {
      "text": "Come on and let's get these highly paid executives up here to give the answer. Seema, please. Jerome. We picked a good one. We got it right. Thank you very much. And Tracy, do you agree with that? And the question I found to be a very interesting one, but is that an unusual question or an unusual circumstance? Right. Okay, good. I thought it was a very good question, actually. Please go ahead. Speaker 6: () Thank you, Mr."
    },
    {
      "text": "President, we see in Europe slowly from one country through the other, they are opening their borders and letting people moving from one country to another. Are you considering for the good of the US economy, are you considering lifting the flight ban from Europe in the next weeks? Well, we're just putting a ban on, as you know, going on immediately, essentially, almost immediately to Brazil and from Brazil into our country. So from Brazil to the United States, having a very hard time in Brazil."
    },
    {
      "text": "We'll be doing certain announcements on other countries, including Europe, as we move along and where they're making progress, we'll start to open it up. But only where they're making progress. They're making some good progress. I think we're making very good progress. We're making very good progress on the economy. The numbers are better than anybody would have anticipated. And certainly I think that's been reflected in the stock market, which had a very big day. And it's over 25,000."
    },
    {
      "text": "And when you think 25,000 is a very high number, when you think that it was at 29,000 and now it's at 25, that's a very big day. It's up very substantially over the last six months. So we had a very big day. But people are seeing what's happening. And they're seeing there is a pent up demand as I was predicting and you're going to see it more and more. We call it the transition to greatness and it really is. We're going to have a third quarter that's going to be good."
    },
    {
      "text": "We're going to have a fourth quarter that has the potential to be really good. And we're going to have one of the best years we've ever had next year. That's what we see. Yeah. John, go ahead. Well, I think everyone knows we're down to less than 8,000 troops, we're with leadership in many different fields and in many different parts of that country, we're dealing with the Taliban, we're dealing with the president, the president now has gotten themselves straightened out with the two presidents."
    },
    {
      "text": "But we're dealing with because as yo know, they had competing factors in factions. Yeah. I think we want to get ... we're there 19 years. We're really not acting as soldiers. We're acting as police. And we're not set over there to be policemen, but we're there 19 years. And yeah, I think that's enough. And they understand we're having a very positive talks. We want to bring our soldiers back home. We want to bring them back home. And we're not only talking about there. We're talking about other countries, also."
    },
    {
      "text": "We bring our soldiers back home. We can always go back if we have to. We have to go back, we'll go back and we'll go back raging. And they will go back as warriors, fighters. But right now we're policing and we're not meant to be a police force. We're meant to be a fighting force. No. I have no target, but as soon as reasonable over a period of time. But as soon as reasonable. We're down to 7,000, some odd soldiers right now. And in Iraq, we're down to 4,000 soldiers. So we're making a lot of progress."
    },
    {
      "text": "In Syria, you remember John on the border when I took the soldiers out of the border, everyone said, \"Oh, that's so terrible. Well, I spoke to President [Erdogan :03] yesterday of Turkey. The border has been fine without us. They'd been policing that border for 2,000 years. All of a sudden we had thousands of soldiers there doing their work. For what? Guarding Syria and Turkey on a border, a very long border. No, we want our trips back home. We took them out. That was a year ago. I was criticized."
    },
    {
      "text": "Nothing happened except they're watching their own borders now. We kept the oil, but at some point we'll take care of the Kurds with respect to the oil and get out. Yeah, please go ahead. Speaker 4: () Mr. President, quickly on your meeting with Governor Cuomo tomorrow. Yeah, he's coming in. Speaker 4: () Can you say what you're going to be discussing? Do you have a particular agenda?"
    },
    {
      "text": "Do you think you'll discuss the gateway project that the Hudson river tunnel project- I would imagine we would, but he asked for the meeting, so we'll see what he wants. But he asked for the meeting, Governor Cuomo and will be coming in sometime tomorrow. Yeah. Please go ahead. Speaker 7: () What can you tell us about the documents reportedly declassified by Rick ... Speaker 8: () Can you tell us about the documents reportedly declassified by Rick Grenell just before he stepped down as DNI?"
    },
    {
      "text": "Are you prepared to release the transcripts of the Flynn Kislyak conversations? Yeah. I'd like to hear it too. I mean, I'd like to hear the FBI agent said that he didn't lie and certainly the conversation almost regardless, it was a good conversation. He was allowed to do it and the Mueller people who have been proven very bad, very bad things they did. A lot of bad things of being found out about the hoax."
    },
    {
      "text": "Greatest hoax in the history of our country and it was an illegal hoax and a very dangerous hoax and a lot of bad things have been found out about Mueller and the gang. So I would like to hear that conversation. Yeah. I would like to hear it personally, so whatever they want me to do, I'll do, I think Rick Grinell has done an incredible job and things are happening now that I always knew this was the answer. This was an attempted coup by a bunch of dirty cops and others."
    },
    {
      "text": "These are dirty cops, dishonest slime bags. All right. Yeah. Question. Go ahead, Jeff. I can absolutely do it if I want to and I don't think I'm going to have to because it's starting to open up. We need our churches and our synagogues and our mosques. We want them open. Churches, synagogues, mosques, and other, we want them open and we want them open as soon as possible. Now I can tell you, I know a lot of pastors, a lot of rabbis, Imams, and they want to take care of their people. They want to take care."
    },
    {
      "text": "They don't want anyone getting hurt or sick and they're going to take care of their people. We need these people. We need people that are going to be leading us in faith that we're opening them up and if I have to, I will override any governor that wants to play games. If they want to play games, that's okay, but we will win. We have many different ways where I can override them and if I have to I'll do that but we want our churches and our synagogues and our mosques, et cetera., we want them open."
    },
    {
      "text": "Now, there may be some areas by the way, where the pastor or whoever may feel that it's not quite ready and that's okay. That's okay but let that be the choice of the congregation and the pastor. John, go ahead, Well, as you know, we don't have much time because we have to know that if we're going to spend millions of dollars on an arena, we want to be in North Carolina. I love North Carolina. I won North Carolina."
    },
    {
      "text": "We just had a big two races that we won recently for Congress in North Carolina; two very big races that the press didn't want to report on. If we would have lost them, it would have been the biggest story in political history, but we just won two races. It's a very important place to me. I love North Carolina. In fact, my son, Eric and Laura named a baby Carolina and came from, I think both, but she was born in North Carolina as you know, Laura. So it's a very important place to me."
    },
    {
      "text": "But at the same time, and I think that people understand this, we have a governor that doesn't want to open up the state and we have a date of August, at the end of August, and we have to know before we spend millions and millions of dollars on an arena to make it magnificent for the convention and we have tremendous people. I mean the economic development consequences are tremendous for the state. We have to know that when the people come down, they're going to have the doors open."
    },
    {
      "text": "Now, if the governor can't tell us very soon, unfortunately, we'll have no choice. This has nothing to do with us. This is between the governor and North Carolina and the people of North Carolina. But the people want it and we'll have to see whether or not the governor... Now he's a Democrat and a lot of the Democrats for political reasons, don't want to open up their states. So we'll see if that works but I don't think it will. I'd love to have it in North Carolina."
    },
    {
      "text": "That was why I chose it, Charlotte, but we're going to see, we're going to see and at the end, we need a fast decision from the governor. He's going to have to get, because he's been acting very, very slowly and very suspiciously, but we'll find out. Question, please. Yeah. We're talking about a very short period of time. It's a massive expenditure and we have to know. Yeah, I would say within a week that certainly we have to know."
    },
    {
      "text": "Now if he can't do it, if he feels that he's not going to do it, all he has to do is tell us and then we'll have to pick another location. And I will tell you a lot of locations want it but I picked North Carolina because I do love that state and it would have been a perfect place for it and it still would be. But he's got to say that when thousands of people come to the arena that they'll be able to get in. Does that make sense?"
    },
    {
      "text": "I mean we'll spend millions and millions of dollars on this magnificent design, but in the end, they have to be able to get in. I don't want to have it where we get there and then they announced after all the money was spent, all the work was done, all the people travel in, guess what? You can't put anybody in the arena or you can put a tiny number of people in the arena. We can't do that, John. Yeah, please go ahead."
    },
    {
      "text": "Speaker 9: () There are now more than still more than a dozen states in this country where case numbers are rising. So why is it suspicious if a governor says, \"Look, we don't want to move that quickly. We still think we need to shut down.\" I think it's fine. Look, the governors in certain ways have to do what they want to do but they have to tell me what they're doing. When it comes to churches, et cetera, they will be overwritten by me. When it comes to other things and many other things they want."
    },
    {
      "text": "If I think some things being done incorrectly or wrong, I'm going to do it. But you have different governors and they have very different views on where they are and where they're going. So we'll see what happens. Please. Go ahead. Speaker 10: () I'm sorry. I'm sure you saw the images from over the weekend of people out on Memorial Day weekend. They were crowding pools, crowding boardwalks. Do you have any message for those people? Yeah. Always be safe. You want to be safe. We're opening up but you want to be safe?"
    },
    {
      "text": "Go ahead, please. Speaker 11: () Thank you about mail-in voting. You've been speaking out against that a lot. You mean mail-in voting? Speaker 11: () Yeah. You've been speaking a lot about that. Why should somebody who is afraid of getting coronavirus, going to public places, standing in a line, et cetera, why should they not be allowed to mail-in? Well, that's going to be in a long time from now, number one. It's quite a ways away, number one. But when you do a all mail-in voting ballots, you're asking for fraud."
    },
    {
      "text": "People steal them out of mailboxes. People print them and then they sign them and they give them in. People don't even know where the double counted. People take them away. They force people to vote. They harvest. You know what harvesting is? They take many, many ballots and they put them all together and then they just dump them and nobody has any idea whether they're crooked or not. Look, you do mail-in voting."
    },
    {
      "text": "Now it's another thing to do absentee voting or if somebody has a medical condition where they go through a process and they get an absentee ballot, that's okay. That's different. But in California, the governor sent, I hear or sending millions of ballots all over the state. Millions to anybody. To anybody. People that aren't citizens, illegals, anybody that walks in California is going to get a ballot. We're not going to destroy this country by allowing things like that to happen."
    },
    {
      "text": "We're not destroying our country. This has more to do with fairness and honesty and really our country itself because when that starts happening, you don't have a fare. You have a rigged system. You have a rigged system and that's what would happen. So mail-in ballots and the governor of California did better than any, that I could ever do in terms of explaining."
    },
    {
      "text": "When he sent out or will send out, and I don't know, I think it's maybe partially already done, millions and millions of ballots to anybody in California, that's walking or breathing, many of those people don't have the right to vote. Well, they'll be voting and you know what? We're not going to let it happen because you're subverting our process and you're making our country a joke and the Democrats are doing it because in theory, it's good for them. Although last week we two big races."
    },
    {
      "text": "We won in Wisconsin and one in California. California, 25. We won a tremendous race in California. That was interesting because at the end of the race, they brought in the Democrat governor, same governor. He brought in voting booths, not mail-in. Voting booths because they were losing. They saw that through the ballots. But no, you can't do that. You can't do the mail-in ballots because you're going to have tremendous fraud. Remember what I said, there'll be grabbing them from mailboxes."
    },
    {
      "text": "They'll even be printing them. They'll use the same paper, the same machines and they'll be printing ballots illegally and there'll be sending them in by the hundreds of thousands and nobody's going to know the difference. We can't do that. You want to vote. You really have to. Absentee is okay. You're sick. As an example, I have to do an absentee because I'm voting in Florida and I happened to be president. I live in that very beautiful house over there. That's painted white."
    },
    {
      "text": "So that's okay and it's okay for people that are sick and they can't get up something. But voting is a great honor. It's a great honor and people love to go out and vote and I want to keep it that way. If we don't keep it that way, we'll have nothing but a rigged system of this country. We can't do that. Thank you very much, everybody. Thank you. Speaker 12: () I was trying to advertise him for it. They got on TV."
    }
  ]
}