{
  "speech_id": "300",
  "speaker": "Trump",
  "title": "Trump Speaks to Press as Jury Deliberations Begin",
  "date": "20240529",
  "url": "https://www.rev.com/blog/transcripts/trump-speaks-to-press-as-jury-deliberations-begin",
  "topics": "Immigration, Government Policy",
  "num_segments": 9,
  "content": [
    {
      "text": "Thank you very much. I would say in listening to the charges from the judge, who's as you know, very conflicted and corrupt, because of the confliction, very, very corrupt. Mother Teresa could not beat these charges. These charges are rigged. The whole thing is rigged. The whole country's a mess between the borders and fake elections, and you have a trial like this where the judge is so conflicted, he can't breathe. He's got to do his job, and it's not for me that I can tell you. It's a disgrace. And I mean that."
    },
    {
      "text": "Mother Teresa could not beat those charges, but we'll see. We'll see how we do. It's a very disgraceful situation. Every single legal scholar and expert said this is no case. It shouldn't be brought. And it certainly could have been brought seven years ago, not in the middle of a presidential election. () It was all done by Joe Biden."
    },
    {
      "text": "This judge contributed to Joe Biden, and far worse than that, but I'm not allowed to talk about it because I have a gag order, far worse than that, by a thousand times worse than that, the worst I've ever heard. But I can't talk about it. It'll be talked about, but I'm not allowed to talk about it. But it'll be talked about in the history books. What's happening here is weaponization at a level that nobody's seen before ever, and it shouldn't be allowed to happen. So, I'll stay around here."
    },
    {
      "text": "This is five weeks, and five weeks have really essentially not campaigning, although I took a big lead in the polls over the last few weeks, something's going on, because I think the people of this country see that this is a rigged deal. It's a weaponized deal for the Democrats to hit their political opponent. () For Joe Biden, the worst president in the history of the United States, he's destroying our country."
    },
    {
      "text": "He's letting millions of people from jails, from prisons, from insane asylums, from mental institutions, drug dealers, pour in. Venezuela, if you look at their crime statistics, they've gone down 72% in crime because they're releasing all their criminals into our country because of this horrible president that we have. And then they have a protest with Robert De Niro yesterday. He's a fool. He's a broken-down fool standing out there. And he got MAGA'd. He got MAGA'd yesterday. He got a big dose of it."
    },
    {
      "text": "But I just want to say it's a very unfair trial. It should have never happened. If it was going to happen, it should have happened seven years ago. As you know, Bragg didn't want to bring it. The Southern District didn't bring it. The FEC didn't bring it. () This judge didn't let us use the number one election attorney. He's making the rules. He doesn't know anything about elections. He doesn't know anything about voting and vote counts. He doesn't know anything about this stuff. That's not his profession."
    },
    {
      "text": "We had the leading election expert in the country, Brad Smith, ready to testify. Wouldn't let him do it. They wouldn't let another gentleman who represented, and you know very well, you saw it. It was the worst I think I've ever seen the way they were treated on the stand. Bob Costello, wouldn't let him talk about all of the hundreds of emails that he was sent by a gentleman, another gentleman who I can't mention because I'm gagged. Every time I speak to you, you ask me simple questions."
    },
    {
      "text": "I'm not allowed to give you the answer because I'm gagged by this judge. But we have a very, very serious problem here. () I mean, our country's going bad. And remember, and let me just leave you with this. This is all because of Joe Biden, and I don't even think it's him. I don't think he's smart enough to think about it, but it's the people that surround him in the office. They're smart. They're fascists, they're communists, but they're smart, and they're ruining our country. But we're going to win this election."
    },
    {
      "text": "November 5th, going to be the most important day in the history of our country. We're going to take back our country from these fascists and these thugs that are destroying us with inflation and with everything they do, how stupid they are, allowing 15, 16, 17 million people into our country, totally unvetted, totally unchecked. We're going to bring back our nation, November 5th. Remember, most important day in the history of our country. In the meantime, this trial is rigged. Thank you. () [inaudible :51]"
    }
  ]
}