{
  "speech_id": "301",
  "speaker": "Trump",
  "title": "Donald Trump Virtual Town Hall Transcript May 3",
  "date": "20200503",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-virtual-town-hall-transcript-may-3",
  "topics": "Economy, Healthcare, Government Policy",
  "num_segments": 131,
  "content": [
    {
      "text": "Thank you both, very much. We never had a more beautiful set than this, did we? That's true, that was a beauty. Good. Well, I think you can satisfy both. If you're scared, you're going to stay back a little bit and you're going to watch it. I think anyone over 60, because we have a pretty good roadmap right now. Anybody over 60, you could say 65 but let's make it 60, we have to protect those people. And we have to watch it, and maybe they stay back longer? But no, I think you can really have it both ways."
    },
    {
      "text": "I think a lot of people want to go back. They just want to go back. You see it every day. You see demonstrations all over the country and those are meaningful demonstrations. It's big stuff. But you also have some people that are very scared. Probably everybody's scared when you get right down to it. It's a terrible thing. A terrible thing that happened to our country. It came from China, it should have been stopped. It could have been stopped on the spot. They chose not to do it, or something happened."
    },
    {
      "text": "Either there was incompetence or they didn't do it for some reason, and we're going to have to find out what that reason was. But people are absolutely scared. But there are other people that are scared about being locked in a room, and losing their job, and not having any income for the first time. These are workers, these are people that want to get back in work and make a living and they're afraid their job is not going to be there."
    },
    {
      "text": "And at a certain point, if you keep it going too long, that's going to happen. So, I understand that very well. Number one, there's more help coming. We have really no choice because incredible people like this are... It's not your fault. I mean just remember that, it's not your fault and there is more help coming. There has to be. And we want to get it to a point when we open we're not going to lose businesses. And therefore, more importantly frankly, we're not going to lose the jobs that run the businesses."
    },
    {
      "text": "So, a case like that, it's really, that's the reason why we have to do more. And we're going to do more, and everybody wants to do more. It's actually, on that aspect of it, it's very bipartisan. So the answer is, yes. We're going to do more and you're going to have your job. You're going to get another job, but you're going to get a better job. You'll get a job where you make more money, frankly. And I think that's going to happen. I think we're going to have an incredible following year."
    },
    {
      "text": "We're going to go into a transition in the third quarter, and we're going to see things happening that look good. I really believe that. I have a good feel for this stuff, I've done it for a long time. We built the greatest economy in the world, the greatest economy, frankly. Bret, you can correct me if you'd like. But you can't, because it's fact."
    },
    {
      "text": "The greatest economy that the world has ever seen, and then one day they said, \"Sir, we're going to have to close it.\" I said, \"What are you talking about, closing it?\" Nobody ever heard that, \"We're going to have to close it.\" And we did the right thing. I think we saved millions of lives. But now we have to get it back open, and we have to get it back open safely, but as quickly as possible. Excuse me, you're right, but now they're doing a massive shutdown because they've been hit very hard."
    },
    {
      "text": "And so you're right about- No, we did the right thing. I do look back on it because my attitude was, \"We're not going to shut it down.\" And look, we're going to lose anywhere from 75, 80 to 100 thousand people. That's a horrible thing, we shouldn't lose one person over this. This should have been stopped in China. It should have been stopped. But if we didn't do it, the minimum we would have lost is a million-two, a million-four, million-five that's the minimum."
    },
    {
      "text": "We would have lost probably higher, it's possible, higher than 2.2. You know the way you have to look at that? I've never seen death like this. I've never personally experienced anything like it. And they talk about the flu and all of that. Well, I've known people that had the flu all my life. I was lucky I never had the flu. Then I came here, they want to give a flu shot. And I say, \"I don't want a flu shot.\" But they have to give it. But you know what?"
    },
    {
      "text": "I've known people that had the flu all of my life, nobody ever died. I never had a friend, he had the flu and he died. I've lost three friends. One, a very good friend, a very successful man, New York guy, employed a lot of people that were all crying over his death. Stanley Chera. He went to the hospital, he calls me up. He goes, \"I tested positive.\" I said, \"Well, what are you going to do?\" He said, \"I'm going to the hospital. I'll call you tomorrow.\" He didn't call. I call the hospital, he's in a coma."
    },
    {
      "text": "Now, I know a lot of people that had the flu, they were never in a coma. This is a very horrible thing we're fighting. But with all of that said, we've learned a lot about it. It infects older people. If you have any problem, heart, diabetes, even a little weak heart, a little diabetes, this thing is vicious. It can take you out and it can take you out very strongly. But, children do very well. Young children do better than teens. Yeah. We'll put out the embers, we'll put out whatever it may be."
    },
    {
      "text": "We may have to put out a fire. I tell you one thing, we did the right thing and I really believe we could have saved a million and a half lives. And by the way, just to know what that means, we've seen death like Elmhurst Hospital in Queens. Right where I grew up, right near where I grew up. Know the building very well, know the hospital. They had body bags lined up in hallways. They had body bags sitting out on sidewalks. We've never seen that in this country. You saw the mass grave, it's called Harts Island."
    },
    {
      "text": "They built a mass grave, I've never seen anything like that. And that's with, let's say it's 100 thousand or 90, or 95. Now, multiply it out. Don't go 2.2 or 2.5 million, say it's half of that. So take the numbers that we looked at, that nobody in this country has ever witnessed, and now multiply it times 15 or 20. So, instead of having 10 or 12 body bags laying on a hallway, you'd have 15 times more than that? Okay. Thank you, very much. Look, it depends on where you're coming from."
    },
    {
      "text": "New York is a very much different place than Montana or many other states where it's not really too bad. It's always bad. They lose anybody, it's bad. And every state has lost significant numbers of people. Whether you're talking about 20 people or 25 people, that's a significant number of people. But it depends on where you come from. Certain states are going to have to take a little more time in getting open and they're doing that. Some states I think, frankly, aren't going fast enough."
    },
    {
      "text": "I mean you have some states that... Virginia, they want to close down till the middle of June and a lot of things that they're doing... I really believe you can go to parks, you can go to beaches. You keep the spread, you stay away a certain amount, and I really think the public has been incredible with what... That's one of the reasons we're successful, if you call losing 80 or 90 thousand people successful?"
    },
    {
      "text": "But it's one of the reasons that we're not at that high end of the plane as opposed to the low end of the plane. It's going up. I used to say 65 thousand and now I'm saying 80 or 90. And it goes up and it goes up rapidly. But it's still going to be, no matter how you look at it, at the very lower end of the plane if we did the shutdown. Not only coming, we've given him a lot of assistance. Which is good. It is."
    },
    {
      "text": "Well, it's too soon to say that really, I guess, because we're still in the middle of something, but certainly we would have lost a lot more people, Bret, if we would've done, as an example, you call it herd. If we would have done herd, in other words, everything's wonderful. Let's just keep going along. We would've lost two and a half million people, I think, or a million and a half or two million people. No, I think the American people have done a good job. This is a tragic situation."
    },
    {
      "text": "Everybody knows somebody that's been affected. That's a very rare thing. But everybody knows. Some states have done a better job than others. That's the way it is. But in some states you can do a lot less than in other states. In New York, I think you're going to have to go around with masks for a while. You're going to have to do separation. You're distancing. You're going to have to do that for a while. But some states are doing so well and others are ..."
    },
    {
      "text": "I have to tell you, I got to know the governors and, with a few exceptions to be honest, because they're just political machines and anything you say it's always going to be like what's good politically, because we shouldn't be in that position, I will say that they really have done, a lot of them, a great job. And we've worked with them. There were no ventilators, I said, we're the king of ventilators. You look at the testing. We tested now six and a half million people."
    },
    {
      "text": "The next highest is, I think it's two and a half million people, either Germany or South Korea. And South Korea thinks we've done an incredible job. He's a friend of mine, President Moon. He said, \"The job you've done on testing,\" and the job we've done on ventilators, it's one of the greatest buildups we've ever had in this country since certainly the Second World War."
    },
    {
      "text": "Speaker 1: () Well, speaking of that, Gretchen Whitmer, the governor in Michigan, she's saying this morning on TV, \"We don't have the reagents we need. We don't have the swabs we need.\" She's still saying that she can't get the testing that she wants. Look, look. We had a phone call five days ago with the governors. I was on the call with Vice President Mike Pence, who's done a great job. He's the head of the committee, the task force."
    },
    {
      "text": "Every governor there, we asked it, \"What do you need?\" Not one governor needed anything. Now all of a sudden you see her on the Sunday ... I watched it. \"Well, we should get this and we should get that.\" She ought to get back to running her state properly, because she should have brought it up on the phone call. I was on that call for an hour and a half. I stayed right till the end. And at the end I said, \"Does anybody need anything?\" We had one governor, Inslee, who's always wanting something."
    },
    {
      "text": "And frankly, he didn't do a very good job on nursing homes, as far as I'm concerned, state of Washington. And he said, \"We need swabs.\" I said, \"Why don't you get them yourself? But if you can't, we'll get them.\" And I could say the same thing about her. But here's the thing, why didn't they bring this up? I had a ... Bret, you know about the call. Every week or two weeks we'll have a call. All 50 governors, I believe, were on that call. The last statement, \"Okay, who needs something?\" None of them."
    },
    {
      "text": "Many of them spoke. Nobody needed, other than Washington wanted swabs, which are easy to get. Very easy to get. Speaker 1: () So let me ask you ... The man who you're about to hear from was told he had a 20% chance to live. He had COVID-19, he was in really bad shape, young. I think he's about 39 years old, actually. 39 years old. But he did recover. And here's Danny Lemos from Grand Island, Nebraska. Okay. So we're doing that."
    },
    {
      "text": "It's a great question because it's a very hard drug to make and it takes a period of time and is made by Gilead. And I know that Danny gave that drug a lot of credit for saving his life. I think that's correct, Danny. But Danny, I believe, gave a lot of credit to that drug for saving his life. We are pushing it really hard. We're also pushing something else, the vaccines. We are very confident that we're going to have a vaccine at the end of the year. By the end of the year, have a vaccine."
    },
    {
      "text": "We think we're going to have a vaccine by the end of this year and we're pushing very hard. We're building supply lines now, we don't even have the final vaccine. Johnson & Johnson. If you look at Johnson & Johnson is doing it. Many companies are, I think, close. Because I meet with the heads of them and I find it a very interesting subject because it's so important. But I think we'll have a vaccine by the end of the year. We're also pushing it ... Look, we're doing things at the FDA that's never happened before."
    },
    {
      "text": "We're getting approval so fast. Like as an example with Gilead on the new remdesivir, that's a game changer because it's a 31% step. It's a step. It's at 31% step and then they'll be at 50%. Like AIDS, what's happened with AIDS. We had AIDS, it was a scourge all over the world. You were dead, it was a death certificate. And then all of a sudden they came up with some ... And now we will be AIDS free within 10 years. Should've started in the previous administration. They did nothing. It started in my administration."
    },
    {
      "text": "10 years [crosstalk :35]. Yes. Well, he got it. I'll tell you, Danny got it, fortunately. And Danny gave it credit for saving his life. We are putting the full power and might behind this drug. With that being said, it's a very hard drug. There are others that are much easier to make. It takes a little period of time to make it. The company is a great company, done incredible work over the years. They are pushing absolutely as fast ..."
    },
    {
      "text": "This isn't something like, \"Let's build machines,\" or, \"Let's ...\" This is a very delicate balance, but we're pushing very, very hard on remdesivir. Speaker 1: () So our next question is from a teacher in Chesterfield, Virginia. Well, I agree with you- So when you go back, and you have one problem that is a bigger problem and that's teachers over 60 or 65 years old, the teachers. Because I think that Kristen or Rebecca are going to be in great shape."
    },
    {
      "text": "And they may wear masks for a while and they may be separated further than what they're used to, and I think they're going to be in great shape. But we have to get our schools back. This virtual teaching is wonderful and frankly it's taken a very positive step. I've had now essentially board meetings and meetings with governors and other people using, they call it tele, right? Tele. And it's not bad, but there's nothing like having a meeting. I still think you're never going to replace that."
    },
    {
      "text": "No, they're going to go back. We have to have our students go back to school. My biggest thing, because I really feel the students are in great shape. They're going to be ... All of the things we have to do. All of the things. But I do worry about teachers at a certain age. Rebecca's young and she's going to be fine. The students are going to be fine. But I really think that, if you take a look, Kristen is going to be fine."
    },
    {
      "text": "But if you have a teacher that's 65 or 70 years old and has diabetes, that one, I think they're going to have to sit it out for a little while. Speaker 1: () But Mr. President, overall- Unless we come up with the vaccine sooner. Speaker 1: () ... are you going to urge the nation's universities and schools to go back in September? I am. I want them to go back. We have to get our country back. Yeah. I don't want to do this forever."
    },
    {
      "text": "I watched a very good former governor of Indiana, he preceded Mike Pence, good governor, and he's the head of Purdue. It's a great school. And I saw him the other day. He wants to go back. He's going back. Purdue, big school. Fantastic. They're going back. We have to go back. We have to go back. Whatever it is. I would say with the exception of teachers at a certain age, maybe they should wait till this thing passes. It will pass. It's going to pass."
    },
    {
      "text": "And a lot of people say, \"We have to get the vaccine.\" Well certainly we do and we have to get therapeutics. I'd rather have right now therapeutics that make people better. That's where remdesivir is really good. I do. And I still do. One study, one study. But there were studies that came out that say it's very good, too. And I'll tell you what, I've had three calls in the last three days, four days of people that took it and they're giving it credit for saving their lives. And other countries are using it."
    },
    {
      "text": "They're bragging about it. You look at their numbers ... Here's what we've been reduced to in this country. The Democrats, the radical left, whatever you want to ... would rather see people ... I'm going to be very nice. I'm not going to say die. I'm going to say, would rather see people not get well, because they think I'm going to get- I'm going to get credit if Hydroxychloroquine works, and I don't care about it. I have nothing to do with it, by the way. Everyone said I owned the company."
    },
    {
      "text": "I have nothing to do with Hydroxychloroquine other than, if it worked, it would be great. It would be so good for our nation because it would save people. But you know, we've had some very good... You look at... There were certain countries that swear by it. They have a much lower number. You know the countries I'm talking about. I think we're going to have a vaccine by the end of the year. Now, the doctors would say, \"Well, you shouldn't say that.\" I'll say what I think."
    },
    {
      "text": "I've met with the heads of the big companies, these are great companies. Yeah, I think we're going to have a vaccine much sooner rather than later. I think it will be... I think that will be done. I would rather have, frankly therapeutic, meaning, something to make people better, if not a cure, at least a therapeutic. And, but look, we started the other day with Gilead. I really think so, but we're going to have other things. And it could be that Hydroxy is going to be... We don't lose anything with Hydroxy."
    },
    {
      "text": "Bret, it's been out there for so many years. Then the started doing the false reports, it's making people... It's been used for numerous things for many years. People aren't dying from it. But they would rather- Yeah. They don't want to see a good result, and that's very sad. Okay. Okay. I love the question, actually. Because, what I did, way early, I closed our country to China."
    },
    {
      "text": "Nancy Pelosi was a month later saying, \"It's going to pass.\" Everybody, even Tony Fauci was saying, \"It's going to pass, not gonna be a big deal.\" Schumer was talking about all sorts of things. This was long after I closed the country. They called me a racist. They said xenophobic. Biden said he was xenophobic. Biden has now written a letter of apology, because I did the right thing. I saved hundreds of thousands of lives. Okay. She's asking me the question about intelligence."
    },
    {
      "text": "I have the head of the intelligence agencies here today, and here's the exact thing. We have it, it's going to be released tomorrow, or the next day, but I released it today. On January 23, I was told that there could be a virus coming in, but it was of no real import. In other words, it wasn't, \"Oh, we got to do something. We got to do something.\" It was a brief conversation, and it was only on January 23. Shortly thereafter, I closed down the country to China. We had 21 people in the room."
    },
    {
      "text": "I was the only one that wanted to close it down. Very good people in room, very well meaning, but take a look. I think it was on February 26, Nancy Pelosi is, \"Let's dance in the streets of Chinatown,\" to show that it's not going to hurt us. In other words, I'm not blaming her for it, but nobody thought this was going to happen. But on January... It's such an important question to me because they think that months earlier we were told about this, that we should have done something about it."
    },
    {
      "text": "China didn't even know for a period of time. It got it. China should have stopped it, but China... They didn't know, and they wouldn't let us in. We wanted to go into China, they didn't want us to go in because they didn't want to have us see it. Maybe they were worried about competence, maybe they were worried about something else, but the question is good. Here's the final answer. The intelligence agencies told me on the 23rd."
    },
    {
      "text": "Shortly thereafter, I closed down the country, but I didn't do it because of what they said, because they said it very matter of factly, \"It was not a big deal,\" and the intelligence agencies, which are now... Now, because before they weren't, which are now very competently run, with some great people, and some great people coming. The intelligence agencies will tell you that tomorrow. I did. Right. They were American citizens, by the way. They were tested... Well, the different states. They were tested."
    },
    {
      "text": "They were quarantined when they were sick, and they came back... I spoke with Ron DeSantis, two days ago he called me. He said, \"You know, the 40,000 people that came back, the ones that went to Florida,\" he said, \"We put them through the grill. We had people quarantined, we had people tested.\" You could ask the governor. There's one example, but other governors did the same thing, if they were doing their job. But I had to let them come back."
    },
    {
      "text": "I actually said, \"Maybe we can keep them there for a while.\" These are American citizens. I had to let them come back, Martha. You had 40,000 people. Now, when the Democrats said it, you said, \"He closed the border, but he let 40,000 in.\" They don't say they were American citizens. I did the right thing, but when they came back, they were tested. Some were tested, probably, and not as good as they could have been."
    },
    {
      "text": "I can tell you, Florida tested the people very, very well, and look how low the numbers are in Florida. They've done a great job. Do you know I didn't know that it was creating criticism? And I did say this would be nice, but I thought it was your choice, not ours. I had not heard. What can you criticize? I don't think its ever been done, what we're doing tonight, here. I think it's great for the American people to see."
    },
    {
      "text": "This is a great work of art, aside from the fact that, that was a great man, this is a great work of art. It's one of the greatest sculptures, one of the greatest statutes, to me, anywhere in the world. You can go to Italy, you can go anywhere, that's, to me, one of the greats. I didn't know there was controversy. Why is there controversy? I think we're winning, very big, and then we had a horrible thing happen. We're winning bigger than we've ever won before. Right?"
    },
    {
      "text": "I think that winning ultimately is going to bring this country together. I'm shocked that during a crisis, it would be so partisan. When you see all this committees, seven or eight committees we haven't even started, and they have all these committees looking for trouble. Just looking for trouble. Every enemy I have is put on a Democrat committee, and I was surprised. They did the impeachment hoax, it was a total hoax, over a phone call that was a perfect call. We had tremendous..."
    },
    {
      "text": "When you look at the House, I think it was 196 to nothing, the Republicans. There was great unity and dissent at the same thing. With all of that unity we have, in one sense, we have great unity. In another sense, I think they're going to come along. I certainly hope so, but the main thing I have to do is bring our country back, and I want to get it back to where it was, or maybe beyond where it was. We have tremendous stimulus."
    },
    {
      "text": "All the money we've been talking about so far tonight, I think next year is going to be a phenomenal economic year. We can never forget all the people that have died. The souls that have been lost in this horrible thing that shouldn't have happened. Just shouldn't have happened. It was such a horrible thing. There's a lot going on about finding out the answer to that, because this is something that should never have happened. It's tragic. Yeah. Yeah. Right. Right. No. It'll be good. They're volunteers."
    },
    {
      "text": "They know what they're getting into. They're, in many cases, very good people. They want to help the process. Look, a vaccine has never gone like its gone now. We're so far ahead of any vaccine, ever, in history. These things would take two, four, five, six years, 10 years. I think we're going to have a vaccine. I'm telling you, by the end of the year, we... I think we're going to have a vaccine. I'm going to really say something that's not like me, and it's not like the two of you. I know you, and it's not like you."
    },
    {
      "text": "I don't care. I just want to get a vaccine that works. I really don't care. If it's another country, I'll take my hat off to them. We have to come up with a vaccine. We're working with other countries. We're working with Australia. We're working with U.K. I spoke with, the other day, your Prime Minister of U.K., all right. Boris, he is a victim of what happened. He thought it was over. He thought it was over. It was vicious, and he made it. He's a great guy, and he made it."
    },
    {
      "text": "But he had first-hand experience, the ultimate first-hand experience. Good. Right. The restaurant business is a tough business to start off with, not a easy business. We're doing a number of things. Number one, the supply chain is going to be in great shape. I did the Defense Production Act, we did things. The problem with the supply chain is, you have people- Defense Production Act. We did things. The problem with the supply chain is you have people that have gotten sick with the COVID- 19."
    },
    {
      "text": "You've had the people and they've gotten sick, they're getting better, and they're all getting better and you can't make them work. I don't want them to work, frankly, if they're not feeling great. But we did something the other day, which you read about, which was a great shock to the system in a positive way. We have tremendous supply. We have tremendous demand. We have to get it from supply to the people, to the restaurants, and we're doing that really very well. Two days ago, I signed this."
    },
    {
      "text": "It's coming along really good. Now the bigger problem is what's going to happen with the restaurant, so we're not going to have any chain problem. The bigger problem is what are you going to do with the restaurant, which was a nice little business, but all of a sudden they have half the number of seats. If they go, eventually we're going to have all those seats back. You're going to have all those seats. I want to sit next to people. I don't want to have all this spread out."
    },
    {
      "text": "Even the way we're doing this interview tonight, look how far away you are. Look how far away you are. Normally we would be sitting together and would have a nice interview. Of course, in this particular location, this isn't so bad. But no, we have to get our, our life back, we have to get our country back. We have to get the world back. If we have a stadium in Alabama that holds 110,000 people against LSU, I went there."
    },
    {
      "text": "We want to have 110,000 we don't want to have 25,000 people or 40,000 people, and that'll happen. Maybe it's going to be a vaccine or maybe it's going to be that this virus will pass. It will go. Will it come back? It might. It could. Some people say yes, but it will pass. The companies really wanted it and the employees have to want to work. Now, if they don't want to work, that's one thing, but they are all working and they need the money."
    },
    {
      "text": "And the companies are doing, the great companies, these are the biggest companies in the world in terms of delivery and in terms of all of the things they do to get it from literally the ranch or the farm, into the hands of the consuming public. But I think it's all working out. The numbers are heading in the right direction. The biggest thing we can do to solve every problem is get rid of the plague. I call it the plague. If we get rid of the plague, all of these problems go away very quickly."
    },
    {
      "text": "They are hotspots and they're moving them and they did put up plastic, but now they're going to move them in some cases further away. And certain plants don't have any problem at all. You have plants with no problem at all. Then you have somewhere it was a hotspot. Those people are tending to get better very quickly, I think Danny is an example. I hope his father is going to be okay too, but it's all working out. It's all working out. It's horrible that we have to go through it, but it's all working."
    },
    {
      "text": "So the nursing home problem, that's your ground zero, that really is ground zero. We first heard about it, I did, the state of Washington, where so many people died in a single nursing home, and you realized immediately there's a vulnerability there. What we're doing is legislation immediately as to how many people can be in. Some people made some terrible mistakes. They were putting other people into empty areas in nursing homes that were sick."
    },
    {
      "text": "And that affected the people in the nursing homes, because the one thing about this disease that everybody's learned very easily and very quickly is the way it's so contagious. It is the most contagious thing people have seen. So in 1917, we had a horrible, that case was the flu, you remember the Spanish flu? So much has been written about it, now of course it's the hottest... Everybody that writes a book about the Spanish flu of 1917, it killed between I guess 50 to a hundred million people."
    },
    {
      "text": "It probably ended the first world war because the soldiers were all getting sick. It was the worst the world has ever seen that we know of. We have something that's different. It's not as powerful, but it's far more contagious. So on that one, you have to ask the governor and in the case the governors, because all I can do is provide the space. They're running their state, as you understand, and that's the way it should be."
    },
    {
      "text": "They run their state through mayors and through this and that, bring it down to local and bring it down to a point. But we provided 2,900 beds in the convention center. On top of that, we brought in The Comfort. They did a phenomenal job and The Comfort wasn't meant for the COVID-19. The Comfort was meant for people that had car accidents, everything else. So we found out there were no accidents because nobody was driving, we had very few accidents. But it wasn't meant for that."
    },
    {
      "text": "What we did is we converted it to that, but still they didn't use it much. And I think the numbers now getting better, we just moved The Comfort, we're going to move it someplace else, probably perhaps for some other kind of problem. We had The Comfort there and we built in the Javits Center we built over 2000 beds. And by the way, built in like five days by the army Corps of engineers."
    },
    {
      "text": "The army Corps of engineers have done one of the greatest jobs anyone's ever seen, including the fact that we happen to be building a wall on the Southern border that's now up to 172 miles. We have to get \"elective surgery,\" it's called and we have to let them come back. It's okay with us. Again, that's up to the governors. You have some hospitals where they have almost no COVID and they have the hospital essentially you can't go and do elective surgery, meaning a surgery..."
    },
    {
      "text": "Well, in some cases it's cancer where they're waiting long, that's not a good thing to be waiting long. They have to get back, they have to let these hospitals, because the hospitals are legitimately... You think they're making a lot of money, they're losing a fortune. They have to let those hospitals re-open and get back to elective surgery. And there are many hospitals right now that could be doing that. That's up to the governors, that's not up to me."
    },
    {
      "text": "Well, first of all, I love your business and I can speak for Brett, we could both use a nice putter grip and it would be nice. But I don't know about you, Brett. I haven't played golf in a long time much. We haven't played too much lately, but I will say this. What we have to do is get it open. I see New Jersey is opening up their golf courses. Florida is now opening up their golf courses. Parks are opening, beaches are opening. At some point, we have to open our country and people are going to be safe."
    },
    {
      "text": "We've learned a lot. We've learned about the tremendous contagion, but we have no choice. We have to. We can't stay closed as a country. We're not going to have a country left. I understand. And all we can do in that case is we have to bring back the business. Now all of that's opening and their businesses is golf, which is a nice business. And we're opening up that whole golf sector, the sports sector, where I wish I could help them."
    },
    {
      "text": "I'd even help them personally because you know what, it's not a big business, but for them it's a big thing and they probably do a fantastic job. I can see they have such great spirit. What we do is we loan the money to small businesses. It's an unusual circumstance where they're each their own employee. I think what I'm going to do is I'm going to take a look at that. Maybe there is something we can do. The greatest thing we can do is get rid of the virus because then everything comes back together."
    },
    {
      "text": "You don't need stimulus once that's happening and what is happening we're talking about three trillion, not just two trillion, three trillion. It could even go to six and we're going to have a tremendous year next year because of what we're doing and laying the seeds. We're talking 30 million jobs that we've saved. 30 million jobs, that's unheard of. In addition, we saved the airlines, we saved others. One thing happened on Friday that was very big. Boeing, a great company."
    },
    {
      "text": "Then they had the problem that people know, a different problem, and then they end up with this where their sales are cut so badly because of this, which is, by the way, also happening in Europe, as you know, with their competitor, no airplanes. They floated a bond issue, borrowed money very, very successfully at a good rate on Friday. That's a big step. The markets are there, the markets are open. I believe it was $30 billion, so the markets are there. That's a big step."
    },
    {
      "text": "We didn't have to do anything with Boeing. They went out to the markets and they were able to borrow a lot of money and it's going to be a great company again. But we've done that with the airlines. The airlines, Brett, were having the best year they've ever had ever in their history. We had to turn off the airlines, we had to turn off everything. And we did the right thing, but we never want to have to do it again. Good. I think I like that question. I'm not sure, but I think I like that question. I appreciate it."
    },
    {
      "text": "I appreciate the prayers too very much. Look, I am greeted with a hostile press, the likes of which no President has ever seen. The closest would be that gentleman right up there. They always said, Lincoln, nobody had got treated worse than Lincoln. I believe I am treated worse. You're there, you see those press conferences. They come at me with questions that are disgraceful, to be honest, disgraceful, their manner of presentation and their words."
    },
    {
      "text": "And I feel that if I was kind to them, I'd be walked off the stage. I mean, they come at you with the most horrible, horrendous biased questions and you see it. 94 or 95% of the press is hostile. And yet, if you look in Florida today, we had hundreds and hundreds of boats going up and down the Intracoastal, Trump, Trump. We have tremendous support, but the media, they might as well be in the Democrat party. And why? I don't know. We fixed our military, we fixed the Vet."
    },
    {
      "text": "If you look at the VA, you take a look at what's going on with our vets. They have choice now and we have accountability. We're able to get rid of people that don't treat our vets well. They've been trying to do that for 44 years, and because of civil service and the unions, you couldn't do it. The biggest thing is choice. It's choice, where if a vet can't see a doctor quickly they go outside, they get a doctor, they get fixed up, we pay the bill instead of waiting for five weeks, seven weeks."
    },
    {
      "text": "Look at how well these things are running. We rebuilt our military. We had the greatest tax cut, biggest tax cut in history. All of the things we've done, and yet we have a very hostile press. And you understand. Maybe you're not going to say it or admit it and maybe you shouldn't, but nobody's ever seen anything like this."
    },
    {
      "text": "I really appreciate the question and I very much appreciate the sentiment behind the question, but I'm standing up there and instead of asking me a normal question, the level of anger and hatred, I'll look at them, I'll say, \"What's your problem? What is your problem?\" I believe we've done more than any President in the history of our country in the first three years, three and a half years. I really believe that when you look. Even if you look, space force, space force. Also, take a look at terrorism."
    },
    {
      "text": "al-Baghdadi, we killed him. Soleimani, we killed him. We killed the worst terrorists in the world. We got rid of ISIS. We took over 100% of the Caliphate. When I took it over the Califate was all over the place. Obama had [crosstalk :40] ... No. But it's going to be a factor. No. I think the election is going to come down to, I hope it does because we've done a great job. We had no ventilators. We had no testing. We had nothing. I inherited empty, no ammunition, our military was bad."
    },
    {
      "text": "We've rebuilt our military, $1.5 trillion. We have the best military by far in the world. It's rebuilt. It's either all new or the equipment's coming in, which is great. But you know what? Also medically, we had empty cupboards. The cupboards, I say, the cupboards were empty. We have an incredible testing. We have the best testing system right now in the world. We also make all the ventilators."
    },
    {
      "text": "I spent the weekend at Camp David speaking to, and a prior couple of days, speaking to heads of other countries that are desperate for ventilators. And we now have so many ventilators, a month ago that's all they were talking about was ventilators. The team of people that did this job was incredible. It was probably the biggest mobilization since World War II. First of all, Joe Biden didn't write that. That was written from a young man that got very good grades at a very good school. That was not written by him."
    },
    {
      "text": "I promise you that. Joe Biden, just so you know, when I closed our borders to China, I did the China ban, I didn't want to do that. I did something that nobody wanted to do. Joe Biden said, \"He's xenophobic. He's a racist.\" They called me a racist and I saved hundreds of thousands of lives and he actually apologized with a letter on a Friday night saying he made the right move. It wasn't well-played by the press, but he said, I made the right move."
    },
    {
      "text": "Now, if we would have listened to Joe Biden, look how badly they did on swine flu, the H1N1, which he calls the opposite, H1. It's H1N1, swine flu. Look how badly they did on that. Look how badly they've done on so many other things. I mean, the place, our military was a mess. Just about everything was amess. Look at what they did in the Middle East, what's gone on in the Middle East."
    },
    {
      "text": "And in all fairness in the Middle East, I look at the previous administration for getting us in because that was the single worst decision made in this country's history, the single worst, getting into the Middle East. Just so you understand, we've spent $8 trillion in the Middle East. What do we have for it? What do we have for for it? And things are moving very nicely in the other direction."
    },
    {
      "text": "So we are working on that very hard and you're right, 100%, that if you look at African American, by the way Asian American also and Hispanic American, they're very much more effected. People are not 100% sure. It could be because it's a certain segment that does work together, restaurants and different jobs, which are affected a lot, but we're coming out with a report in two weeks on it and I want to get to the bottom of it too because it's a totally disproportional effect."
    },
    {
      "text": "It really is and it's pretty amazing, actually. So we have billions of dollars coming in right now from other countries. We have money coming in. People are paying now for military protection. People are paying for other things. As you know, I'm putting taxes on other countries where they've taken advantage of us, especially by the way, China. China ... ... taken advantage of us, especially by the way China. China never gave 10 cents to our country. They ripped off our country for many..."
    },
    {
      "text": "And I've told this to President Xi directly in a nice manner and in a not so nice manner. I get along with him. Should have done something different on this, but we made an incredible trade deal. We have tens of billions of dollars pouring in. President Obama and Joe Biden didn't do anything. China just had a field day with our country. And then you look at his son walking out with a billion and a half dollars. Give me a break on that. And I can go back to President Bush and I can go back before president Bush too."
    },
    {
      "text": "China ripped this country off for many, many decades and I stopped it. Then of course you had this horror show coming in. The plague. It came in. So now it's a different story, but we've taken in billions and what have I done with it? I've given some of the monies, because they were targeted by China, to the farmers and to the ranchers. $12 billion two years ago, $ 16 billion last year, and we have a lot this year."
    },
    {
      "text": "And we, by the way, have many times those numbers leftover from all the money we're making from China. That never happened before. But we're going to cut... We're going to cut back very substantially, plus we're going to have great growth. This country is going to grow like crazy as soon as we get it going and we're going to start making our products here. Hey Brett, you've known me for a long time. I've been talking about this for a long time. It's one of the reasons..."
    },
    {
      "text": "I would say border security, the military, and trade. These are the three primary reasons I got elected. This is a very big thing for me. I made a deal... Japan is now paying us $40 billion. They weren't paying us, they weren't doing anything. They were selling us cars. We wouldn't do anything to tax them, but we couldn't sell cars in Japan. Japan, we did a deal for 40 billion. $40 billion a year. Look at South Korea. We redid the deal in South Korea. Mexico, Canada, USMCA. The NAFTA deal was so horrible."
    },
    {
      "text": "It was so horrible. But I said a word just now. NATO. My biggest fan in the whole world is the Secretary General of NATO, Stoltenberg. Very great man. Great gentlemen. He said, \"Nobody has ever done for NATO what I've done.\" We got $150 billion. The money that they're paying other countries, they weren't paying. We were paying for a 100% of NATO and now other countries are putting up."
    },
    {
      "text": "I went to them, I said, \"Listen, you can either pay or we're not going to be...\" Why would we be protecting all of these countries, 28 countries total, why would we be protecting? You're not even paying your bills. You're delinquent. Arthur, they're putting up $150 billion a year and it's going up to 400 billion and no other president has ever done anything like that."
    },
    {
      "text": "So the reason it took place is because other people that sat in this chair, maybe not right here, but this is a beautiful place, because they were foolish. You could even say because they were stupid. Because they allowed this to happen. And it's not only China. You take a look at Ireland, they make our drugs, everybody makes our drugs except us. And we've already done it. We're coming out with things... Numbers."
    },
    {
      "text": "You're seeing numbers of innovations that we've made in the past and things are being announced already. But we're bringing that whole supply chain back. Nobody has to tell me to do it. I've been talking about that for years. Now, the one that you see, you don't see. You see it with cars. You see it with other things. People never looked at medicine. But it's always been about medicine because we have at least 94, 95% of our medicines are made- Well, it's an incredible thing. There are American companies..."
    },
    {
      "text": "Well, I'd like to be able to do it here. I don't want to do it in China. That I can tell you. But I think we're going to do it here and if we do it someplace else, look, we have to get a vaccine. Whoever gets it, I'm going to be the best fan in it. I want it. I need the vaccine. We need, this country needs the vaccine. And you're going to have it by the end of the year. I firmly believe. I think we will have it done within two years."
    },
    {
      "text": "It doesn't go that quickly, and frankly you put me in a very bad negotiating position by asking me this question. We're talking about this now I'm supposed to call up my guys. I mean you put me in a very bad negotiating position. And I'm not blaming you. That's your job. But you're taking my cards away, because I don't want to be talking this way. I've done a lot, but it gets exposed when you answer... I assume the show is a big show. Right? It's going to do very well tonight."
    },
    {
      "text": "But you do take away a lot of my cards when you're asking me a question like that. You understand that? Here's the bottom line. I met with the drug companies six months ago. I said, \"You're going to start making the drugs here. You're going to start making them here.\" And they do it for two reasons. A cost reason, but it's no longer so much cost because we can do things here for the same price and in some cases less and then you don't have the transportation problems. We're taking care of our..."
    },
    {
      "text": "Look, another reason I got elected, and some people don't like the sound of it and other countries don't like it. But I said, I'm sorry, it's called America first and we're all about America first. That's what we're about. I'd love to have a both speak about it, but infrastructure is very important. It's also important to the Democrats, by the way. That's something we actually do get along. I want to see a payroll tax cut on both sides. A very strong one. Because that's going to really put people to work."
    },
    {
      "text": "But infrastructure is so important. Our country, our roads are, excuse me, they're going to hell. We can't get infrastructure approved. Now, we have a time, we have a period of time when we can get infrastructure done by both parties and we're looking at that. In addition, as you know, they want bailouts for the states, the Democrats. And really it's a number of states that frankly have not been managed well by Democrats over a long period of time. So we have to be very careful about that. Very careful."
    },
    {
      "text": "But we will be doing infrastructure. And I told Steve just today, \"We're not doing anything unless we get a payroll tax cut.\" That is so important to the success of our country and to the following year, because I think that the following year has a chance to be one of our best years. That'll be tremendous."
    },
    {
      "text": "So Phil, we're looking at different things, but you have to remember, I've taken those tariffs and given a lot of them to the farmers and farmers that would have been really forced out of business by China when they were targeted. Because China never had to target us because China was ripping our country off. We were losing $500 billion a year to China for years, and 300 billion, 200 billion, 544 billion. 544 billion a few years ago. And what I'm doing..."
    },
    {
      "text": "544 billion a few years ago and what I'm doing and what I've done is taken a lot of money out of China and I've given it back to Phil and other people because I've given it back to the... Not all of it because we had so much, so much money came in from China, but we gave, as I said, 12 billion two years ago, 16 billion and this year we have 19 billion that we're distributing to the farmers. Nobody's ever done that. No president's ever done that. He is, but you know what?"
    },
    {
      "text": "They're getting big payments, the farmers are getting big payments. And by the way, they are the most incredible people. They don't even want the payments. You know what they say to me? Something that almost no other group that I can say practically no other group, they want a level playing field. We had a meeting with them with Mike, and they came in and I said, \"We're going to give you this.\" They said, \"Sir, honestly, we don't want anything."
    },
    {
      "text": "We just want a level playing field.\" Because for 18 years, really it's longer than that, they've been taken advantage of not only by China, by everybody, including Canada, including many, many countries that you wouldn't even think. So the farmers now with the new USMCA and all of the other things, and as far as Phil, I understand it, but we're giving billions and billions of that money to the farmers and have a lot of money that goes back into the treasury."
    },
    {
      "text": "Steve is the proud recipient from the standpoint of the treasure. Well, it's the ultimate punishment, I will tell you that. I don't like to tell you what because we're all playing a very complicated game of chess or poker, name whatever you want to name, but it's not checkers, that I can tell you. We have a very complicated game going. Our country is being ripped off by every nation in the world and now we have made unbelievable strides. Unfortunately, then we get hit by this whole situation."
    },
    {
      "text": "But we have done so well. We have taken in so much money. Going before the virus, China had the worst year they had in 67 years. That's the reason. And I'm not happy about that, but what it does is it says they were taking us for a ride. Like nobody in history has ever done at any time. Look, tariffs at a minimum are the greatest negotiating tool that we have ever devised that were never used for negotiation."
    },
    {
      "text": "President Xi only made the deal with us, this is going to buy 250 billion, now we're going to have to see what's going on because of what happened. This was done months before the virus. But we're getting you by $250 billion worth of our product. 250 billion. They didn't want to buy from us. They took advantage of our country. Now they have to buy and if they don't buy, we'll terminate the deal, very simple. But by using the tariffs, that's the only reason. The one thing that he said, we must get rid of tariffs."
    },
    {
      "text": "I said, \"We're not going to get rid of tariffs. You got to treat our country with respect. You've been ripping off our country for many years.\" The world trade organization has ripped off this country. That's when China became an economic power. And by the way, you have world trade and you have world health. The World Health Organization has been a disaster. Everything they said was wrong and they're China centric. All they do is they agree with China, whatever China wants to do."
    },
    {
      "text": "So our country, perhaps foolishly in retrospect, has been paying $450 million a year to the World Health Organization and China has been paying $38 million a year, but they were more political than all of our leaders previous. So we'll see what I do with that. I'm going to have to make a decision on that, but we're not happy because what they did, what world health did, they missed every single call. I wouldn't want to put up with that. Well, I don't think there's any question about it."
    },
    {
      "text": "We wanted to go in, they didn't want us to go in early, very early. You'll see that because things are coming out that are pretty compelling now. So I don't think there's any question. Don't forget, China tried to blame it first on some of our soldiers that turned out to not go too far, and I really got very upset with that. That was not right."
    },
    {
      "text": "And then they tried to blame it on Europe, I said, \"How did Europe get involved all of a sudden.\" Italy suffered probably more than anybody per capita, but Italy, Spain, France now is on an additional lockdown. They've got tremendous problems. All of Europe, it's been a disaster. And you know, when I put a ban on those people went for the most part, not here. And I'm not happy about this. It's terrible because it's life, whether it's here or Europe."
    },
    {
      "text": "But we put a ban on very early on China coming in, they went to Europe. Most of those people went to Europe. That's why Italy was so badly affected. You just see what they're going through. China tried to blame Europe for this. It came from China - Yeah. We're going to be given a very strong report as to exactly what we think happened and I think it'll be very conclusive. Personally, I think they made a horrible mistake and they didn't want to admit it. We wanted to go in, they didn't want us there."
    },
    {
      "text": "Even World Health wanted to go in, they admitted, but much later, not immediately. And my opinion is they made a mistake, they tried to cover it, they tried to put it out just like a fire, it's really like trying to put out a fire. They couldn't put out the fire. What they really treated the world badly on, they stopped people going into China, but they didn't stop people going into the USA and all over the world."
    },
    {
      "text": "So you could fly out of Wu Han where the primary problem was, all of the problems essentially, also where the lab is, but you could fly out of Warhol and you could go to different parts of the world, but you couldn't go to Beijing and you couldn't go to any place in China. So what's that all about? In other words, they knew they had a problem. I think they were embarrassed by the problem, very embarrassed. And the case could be made."
    },
    {
      "text": "They said, \"Hey look, this is going to have a huge impact on China and we might as well let the rest of the world,\" because the last people they want... We've had a great year against China prior to the virus coming. I told you 67 or so years, the worst economy they've had, worst almost on record that they've ever had because of my negotiations and because I tax them on the product that they brought in. And by the way, they paid for that tax. It wasn't our people. They paid for that tax."
    },
    {
      "text": "They devalued their currency. But here's the thing, they allow this to go into our country. They allowed it to go into other countries. Look, I finished a trade deal that everybody said would be impossible to get and not only a trade deal, it was a great deal for this country, but that was done months before the virus came. I'm not going to say anything. I had a very good relationship. He's a strong man."
    },
    {
      "text": "He's a tough man, but I have very good relationship with him, but this should never have happened, this should never have happened. This virus should not have spread all over the world. They should have put it out. They should have let us and other people and other countries go in and put it out because people knew what was happening. I love that second question. I just love it."
    },
    {
      "text": "But your airline was probably saved us because Steve and all of the people we have, we chose the smartest people on wall street to help us. Who else is better than these people? That's what they do. And by the way, they're working for a very tiny fee because I said I don't want to pay him a lot of money for doing this. We're giving them money to save the airlines. I'm not looking to make them rich. They're rich enough."
    },
    {
      "text": "So I said, \"We're going to get the best people, pay them some cost but paying very little.\" I hope you kept doing that, Steve, right? I hope. I'm going to check you. Anyway, but we have the smartest people. We saved the airlines. We saved the airlines with 50, 25 and $25 billion, so it's $50 billion, which is a very small price to pay that we're having the best year ever. As far as your question of the future, we have to bring our product back home, we have to make our product in this country."
    },
    {
      "text": "We can't be hostage because that's what we are. We can't be hostage to other countries, China in particular, but also to other countries. We can't ever let that happen again. I hope it's going to be very soon because I'm seeing things that I don't like seeing. I see some churches, they are literally staying in their car with the window closed. I guess it comes out through the radio, the service, and they were getting arrested."
    },
    {
      "text": "Or they'll go in a field, some field, and they'll have a good minister, pastor, could be a rabbi, could be a person of faith, and what happens is in some places, not in all places, I would say in most places they really sympathize, but I do, and I've been listening to services over the last four or five weeks, some very, very good people, and everybody knows who I've been listening to and we go different person. Last week it was a Cardinal Dolan at St."
    },
    {
      "text": "Patrick's Cathedral, a place I'm very familiar with, but we've had pastors and ministers. I will say this, it's wonderful to watch people over a laptop, but it's not like being at a church, and we have to get our people back to churches and we're going to start doing it soon. Yeah, no, he's not doing... Well, there's not too many States that I know of that are going up. Almost everybody is headed in the right direction. I was with a man who got hit very, very hard in many ways over the last little while."
    },
    {
      "text": "Phil Murphy from New Jersey. People don't realize that's the single most dense State, and who would think that? But New Jersey is very dense. The Manhattan overflow, the New York overflow. And those numbers are now even coming, there's a very, I mean, not his fault, he's doing a really good job as governor, I'll say it. He's a Democrat and I'll say it. And he's been through a lot, even himself physically. You know, he just went through a very big problem as people know. I think he's done a really good job."
    },
    {
      "text": "And even those numbers are coming down. New Jersey was really hit hard. No, I think most of the numbers are coming down. We're on the right side of it, but we want to keep it that way. But we also want to get back to work. The people want to get back to work. You know, I've seen it more and more, people are saying that also causes death. It causes drug addiction, it causes suicides. It's a lot of deaths caused by that. There's no win here, just so we all understand. There is no win."
    },
    {
      "text": "This is not a situation with there's a win. But the job that this country has done, the people of this country, it's incredible, how they've endured, how they've suffered. That's why we are, in terms of deaths, it's a tremendous number. One is too many, right? I've say it all the time, but in terms of death, Brett, we're at the lower level, the lowest level predicted, and we might not even hit that. It may be lower than that, and sadly that's all we can do. Very different. Our country was sailing."
    },
    {
      "text": "I would tell people, I would say, \"You know, can this continue?\" The greatest ever, greatest economy in history of any country, blowing away everybody including China, and then we had to close it. And my ambition is very quickly to get us back to where we were, and I think we can do that very, very quickly. Not if a Democrat comes in and raises taxes. They want to raise everybody's taxes. We're doing the opposite. And the payroll tax cut is very important for getting people back to work."
    },
    {
      "text": "What I want to do is, number one, we're getting rid of the virus. We have to do it. We're working with the governors, we're getting rid of the virus, but we got to put our country back to work. All those people out there that are protesting, they're right. They want to go back to work. We want to go back to work quickly but safely. And that's what's happening. And then next year I think we're going to have a great economic year. We're going to get our jobs back, and I'll go a step further."
    },
    {
      "text": "We have a transition third quarter. We're going to have a very good fourth quarter. We're going to have a great next year. I don't know. I mean everybody wants the rallies. The rallies, we never had an empty seat. From the time I came down the escalator with a person that became our great first lady who people really love, and they love her at those rallies too, and she loves the people of this country. They're longing for the rallies. I get it all the time. But you can't have a rally."
    },
    {
      "text": "I don't think we can have a rally with an empty stadium, with nobody in there. In other words, you may be able to pull it off a baseball or football or boxing or basketball. You can't pull off a rally with a hundred [inaudible :03]. It wouldn't work out too well. So hopefully we'll be able to do rallies in the last couple of months. I mean, I would hope that within maybe the last couple of months we'll be able to do rallies in various States. A Democrat. A Democrat. There's no risk. Are you ready?"
    },
    {
      "text": "They wanted me to speak. I didn't want to speak. I love West Point. I grew up near, my school, where I went to high school was right near West Point. New York Military Academy. So it was many West Point, very many. But West Point's this incredible thing. Incredible place. I love it. I know it well because you know, I spent a lot of time at West point. They wanted me to come and speak. Then they changed the date, I believe it's June 13th. And it's my honor to speak, but I didn't want to necessarily do it."
    },
    {
      "text": "What they're doing is they're coming back a little bit early. They're going to be fully tested. They're going to be very, very spread apart. I said, \"I want their families to be there.\" You know, Mike made the commencement address. I did it last year at the Air Force Academy. Mike did it this year. There were no parents in a big stadium and they were very spread apart and it was fine, but they asked me to do it and I agreed."
    },
    {
      "text": "The Generals asked me, \"Would I please do it?\" You know, I'm the President of the United States, they wanted to have- ... they all wanted it. I sat down with my son. I sat down with my grandchildren. I said, \"A terrible thing has happened. It's a thing that we've never experienced.\" I said, \"I guess you could go back over a hundred years and you could go to 1917 and we experienced it, but Europe experienced that much worse."
    }
  ]
}