{
  "speech_id": "304",
  "title": "Donald Trump Press Conference & Speech Transcript at Arizona Mask Factory May 5",
  "date": "20200505",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-press-conference-speech-transcript-at-honeywell-plant-may-5",
  "topics": "Immigration, Infrastructure, Healthcare",
  "num_segments": 58,
  "content": [
    {
      "text": "Indian country. It's a very big problem in Alaska. Yeah? Yes. It is a vast, yeah, it's a vast land. I'm going to be signing something in a couple of moments and I hope it helps a lot, not just a little bit, a lot. And I think you'll do a fantastic job. I know you're going to be watching it personally and between the three of you and everyone else that I know so well, I think you're going to do a great job. So go get them. [inaudible :03] I'd like to maybe finish off with the Governor."
    },
    {
      "text": "Great governor, you're doing phenomenal job. What do you have to say, Doug? Well thank you so much. One of the other accomplishments we have is in Arizona and a lot of other states, we're building a wall and you're finally getting what you need. And interestingly, California's calling because in bordering towns, as you know, in Mexico they have a very big outbreak of the coronavirus, and California's calling saying, \"You got to help us.\" Those are not calls that the media knows about, but that's the facts."
    },
    {
      "text": "And in Tijuana, right along the border, they have a tremendous outbreak and we have just completed 172 miles of wall, and it's real wall, not the kind you were having built over the years that were scoffed at, right? And we've done a lot in Arizona and the people letting us know they're so happy, they're so thrilled about it."
    },
    {
      "text": "It's made a tremendous difference, and we've had one of the best months ever in the history of our country for not having people come in that we don't want, that we don't want in our country. We want to have the people that come in the right way. So you see the numbers, the numbers are about the best we've ever had in the history of the country. So it's good, but we're getting that done. I guess you see, do you see where they're doing it? It's a big thing."
    },
    {
      "text": "Up to 172 miles and we'll have it completed early next year. So it's been something. Okay, I'm going to sign this. I want to just congratulate you, Myron. I want to congratulate you. Second lady. That's so fantastic. And I want to congratulate you also, because I've been in that vicinity and it's one of the most beautiful places you can imagine. So congratulations very much. Thank you, Steven. One second, please. One second, please. I want to make sure everybody looks good except me."
    },
    {
      "text": "I'm going to hand this to the Second Lady, okay, if you don't mind. Go ahead, please. Please, sitting. Go ahead. Thank you very much, Steven. I appreciate it. I have to say, Myron Lizer and I have dealt and our people have dealt together very closely, and the Second Lady, and a lot of progress has been made and we'll continue to make a lot of progress. I think you'll see that, and I think you're going to see it not only here but in the future. Thank you very much, and I appreciate it very much. Thank you. Governor."
    },
    {
      "text": "And I don't have to thank you. You're with the administration. He has good genes, though, you know. He's got good genes, right? The Scalia genes. You don't get better than that, do you? Speaker 7: () No, pretty good. Well, I think we're looking at phase two and we're looking at other phases. The country's starting to open up. The taskforce has done a phenomenal job. We have a chart that I just showed somebody. We just got it this morning as I was getting off the plane. Governor Ducey can explain it better than anybody."
    },
    {
      "text": "When we came in, ventilators were a very, very big deal and very hard to produce. I say, but it is largely true, the complexity is sort of like building a car. We opened up operations all over the country to build them and there hasn't been one person that needed a ventilator that didn't get it, which is amazing and now we're helping other countries and we're stockpiling in case some tragedy like this happens again."
    },
    {
      "text": "But this just came out on testing, because I think we are at the point or maybe we'll soon be at the point where I can say the exact same thing on testing. These numbers we just released and this is the United States, the amount of testing, and our level of testing and the quality of testing. This is just from Abbott Laboratories. You know what this one is, Jim. It's a five-minute test. It's a great test. It's something people like because you don't have to go through a laboratory."
    },
    {
      "text": "Send it in and send it back, and it takes a couple of days if they do a good job. So this is the testing, and the line here is United States. We're over 7 million tests. Germany is at two and a half. Italy is less than that. Japan is down here and South Korea, which we talk about, and again, I'm very friendly with South Korea, and with the president of South Korea, and he calls to congratulate us on our great testing. South Korea is over here."
    },
    {
      "text": "They like to say we have more cases than anybody, but the fact is when you look at these numbers, and this is the official count, now I can't tell you whether or not other countries are giving us the straight deal, but I can say that I know one thing, it's only going to be on the high side, not going to be on the low side. So this is the other countries. These are the United States and it's incredible. Remember this, and I think it's important to say this, Jim, the quality of our test is also the best."
    },
    {
      "text": "I mean, it's acknowledged to be the best. So again, when we have cases, and we have more cases than anybody else, does anybody really believe that we have more cases than China, but they don't talk about numbers like this and other countries. But we report everything and ... ... I just want to say that we've done an incredible job on testing. With that being said, we have some additional, including antibody tests coming out, that will even blow these numbers away, but nobody's done the job we've done. Go ahead."
    },
    {
      "text": "We will have certain people, as an example, we have hospitals that we built, we have medical centers that we built, we have people on the taskforce that focused on that. We have people on the taskforce that's focused exclusively on ventilators. Well, we have more ventilators now than anybody in the world, and we're helping France, as you know, we're helping France, Italy, Spain, Nigeria. We're giving, I think, 250 to Nigeria."
    },
    {
      "text": "We have many countries that we're helping, but the ventilator problem is solved, so you don't need that. Now we're different. It's sort of a combination of safety and reopening, so we'll have something in a different form, but the taskforce for what we've done, I think everybody out there when they're being very honest, I think the job we've done on testing will shortly be, and maybe even supersede, the job that we've done on ventilators, which people can't even believe."
    },
    {
      "text": "We had a call the other day with the governors, Mike Pence took the call, and they had, I believe, all 50 governors, and it was, they say, the best call we've had thus far. We're working closely with the governors. They have everything they need and if they don't have it and if they don't need it or if they can't get it locally, then they know that we are stocked and we are ready. As an example, we won't need this, but we were ready for weeks."
    },
    {
      "text": "We had 10,000 ventilators sitting in various locations with people by the ventilators ready to have those ventilators roll if they needed them in, as an example, Detroit or various other places over the country. So I think that as far as the taskforce, Mike Pence and the taskforce have done a great job, but we're now looking at a little bit of a different form and that form is safety and opening and we'll have a different group probably set up for then. No. No, not at all."
    },
    {
      "text": "Their mission accomplished is when it's over. When it's over, Jim, mission accomplished. No, I wouldn't just say that at all. What? What does that mean? Go ahead. Repeat your question. Say it. We have great advice. We have great people. We have great people. Yeah, we have great doctors, we have great medical people, laboratory people. I have to say, I think tremendous progress is being made on vaccines, which everybody should be very happy to hear, and therapeutically I think we're making very good progress too."
    },
    {
      "text": "We're making tremendous progress. We have the greatest doctors in the world, the greatest laboratories in the world. I think therapeutically, and also from the standpoint of laboratories, laboratories as it pertains to vaccines, we're doing very well. I'd love to see a therapeutic answer even before the vaccine, because we could take care of people that have a current problem or dilemma. But therapeutically and for the vaccines, a tremendous amount of progress. Oxford, Johnson and Johnson, incredible places. ..."
    },
    {
      "text": "doing, I think, a really good job and they're very advanced, but we have to now see. ... and whoever gets it first, my hats off to them. We're not looking for first, second, or third. We're looking to get a vaccine that works and progress has been made. Well, because we can't keep our country closed for the next five years. You can say there might be a recurrence and there might be, and most doctors, or some doctors say that it will happen and it'll be a flame and we're going to put the flame out."
    },
    {
      "text": "We've learned a lot. We've learned a lot about the coronavirus. We've learned a lot about this hidden enemy. It's a dangerous enemy, it's a bad enemy. You see what it does, especially for people over a certain age and people that have an infirmity. If you have diabetes, if you have a bad heart, if you have a certain problem, it just, Myron, it just goes after you. It's vicious. And we're saying that people that are over 60, 65 but over 60 we're even saying, sort of stay back for a while."
    },
    {
      "text": "We recommend you staying back for a while. At the same time with young children and children we'd like to see the schools open early next season and on time. It's very unique how the children aren't affected but people that have problems and older people can be very badly hurt, injured, or die from this problem. Well they are looking at it very closely."
    },
    {
      "text": "They are looking at it very closely and I just said it today, I used the word for the first time, I think, in terms of what we're doing, I'm viewing our great citizens of this country to a certain extent and to a large extent as warriors. They're warriors. We can't keep our country closed. We have to open our country. Somebody said, \"Oh, we could keep it for the next 18 months, we could keep it for the next two years.\" Doug Ducey's done an incredible job as the governor of Arizona."
    },
    {
      "text": "The people aren't going to accept it. They won't accept it, and they shouldn't accept it. We have a great country. We can't keep it closed. I mean, I've had doctors say, \"Well, why don't we close it for a couple of years?\" This is the United States of America. I created, with a lot of other very talented people and the people of our country, the greatest economy in the history of the world, the greatest that we've ever had, the greatest employment numbers, the best numbers we've ever had, the best stock markets."
    },
    {
      "text": "I think we had 144 days of record stock markets, and then one day they said, \"We have to close our country.\" Well now it's time to open it up. And you know what? The people of our country are warriors and I'm looking at it. I'm not saying anything is perfect and yes, will some people be affected? Yes. Will some people be affected badly? Yes, but we have to get our country open and we have to get it open soon. Maybe I could ask, Doug, if you'd like to address that point? Oh, sure."
    },
    {
      "text": "Yeah, they will be and so will other doctors and so will other experts in the field, but we've learned a lot. As Doug said, we've learned a lot. You could probably have fires here, Doug. You'll put them out. You're going to put them out and you'll put them out fast. So yeah, we were bringing our country back and I think what is going to happen, and just said it a little while ago, you're going to have a third quarter where you're going to have transitions."
    },
    {
      "text": "You'll a big, beautiful, hopefully, a very good transition, a very successful transition back into the real world. And then you're going to have a fourth quarter that I think is going to do very well. And then I think next year I think we're going to have one of the best years we've ever had because we have stimulus and we have a pent-up demand like I have never seen before. Today's a very interesting day because it's my first day out, and Doug reminded me of something."
    },
    {
      "text": "I didn't do it for that reason, but you said, \"This is the first place you stopped when you ran,\" when I ran for something that turned out to be a very successful run. We had tremendous crowds, you remember at the convention center, in Phoenix and it was pretty incredible. I didn't do it for that reason, interestingly, but here we are and it was great that you remind us of that fact. But look, we're going to have a very interesting transition period into the fourth quarter."
    },
    {
      "text": "I think your fourth quarter is going to be very good and I think next year is going to be one of the best years economically we've ever had. With that said, for those people that have lost somebody, for the people that have lost a loved one, even a close friend, nothing can ever happen that's going to replace that. I don't care what kind of a year you have from an economic standpoint, nobody's ever going to replace that."
    },
    {
      "text": "But I think from an economic standpoint, purely an economic standpoint, I think next year's potentially going to be one of the best years we've had. There's tremendous stimulus out there and people want to get out. They want to go and they want to go to town. This country was founded on certain principles and those principles are at work like you've never seen before. So I want to thank you all very much. Thank you. And we'll see you perhaps at the next stop. Thank you. Speaker 8: () Thank you you guys."
    },
    {
      "text": "What about it? Will I take it? If they would like me to, I'd go the first one or I'd go the last one. I don't want to waste it, but he's just saying, if there's a vaccine, would you take it? And she might like it that it didn't work too well, okay? But that's okay. I would absolutely, Jim. If there's a vaccine and if they wanted me to be first on line, I'd be first on line, or it'd be last on line, or I wouldn't take it at all. Whatever's best for the country. Thanks guys. Okay? Thank you."
    },
    {
      "text": "In the fantastic state of Arizona. I love Arizona. With the incredible...I had some good moments here, especially on election day. It was a good moment, right? But they're incredible patriotic and hardworking men and women of Honeywell. Moments ago we saw the brand new production lines where you're making high quality N95 respirators and they are made to perfection, there's no bad masks like various countries have been sent some very bad mass from other places. There's nothing like that at Honeywell."
    },
    {
      "text": "Respirators are there to protect our heroic doctors and nurses as they fight the unseen enemy. More than 150 Honeywell employees are working around the clock. Three shifts a day, six days a week. You are the greatest industrial, and think of this, what you've done, you're part of this incredible industrial mobilization. The biggest since World War II, hard to believe for an invisible enemy, but it's a vicious enemy. Smart enemy."
    },
    {
      "text": "Like generations of Patriots before you, the workers of this factory are pouring their heart in this all in their blood into defending our nation and keeping our people healthy and safe. You make America proud. We really do and I want to thank you very much. That's why I'm here. I want to thank also the entire leadership team at Honeywell, including Darius, who's, again, fantastic man and Madden, Mike Mattson, John Waldron, Jim Carroll, Brian Roddick, William Lang, Tony Stallings, and Ramina Canon Shaw."
    },
    {
      "text": "In normal times, it would take nine months to stand up one facility like this, but Honeywell has built this in less than five weeks, creating 500 new jobs in Arizona and another 500 jobs in Rhode Island. Together, these new factories will student produced more than 20 million N95 respirators every single month. A truly miraculous achievement. We're grateful to be joined by secretary of labor, Jean Scalia and governor Doug Doosey. What a fantastic governor he is. Where is Doug? Where is Doug? Thank you Doug."
    },
    {
      "text": "Doing a fantastic job. He already won his election by like 17 points, so I don't have to praise him too much, but I will say that he has been a fantastic governor, and that's ... People recognize it. That's why he had what they say is a walk. It's very good. We're proud of you. Doug and anything we can do, you're going to call me. We don't have to worry about, he calls me plenty. He calls me plenty because he's doing his job, but I want to thank you both, and Jean, the job you're doing is fantastic."
    },
    {
      "text": "Thank you both very much. We appreciate it. Thank you Jean. I also want to express my appreciation to Senator Martha McSally. Fantastic person. Fantastic person. She's fighting to uncover the full truth about the China situation and how the World Health Organization handled the outbreak and what happened. There must be transparency and accountability."
    },
    {
      "text": "Martha's also somebody that is bringing tremendous amounts of dollars back to her state that she loves so much, the state of Arizona, and I know the governor appreciates it very much, Martha, and I appreciate it very much too. You're doing a fantastic job in good luck. Good luck. Thank you. As well to Betty and Jorge Revis at Sammie's Mexican Grill in Catalina. Where are they? They're around here someplace. They're great. Where's the ... Come on up here. Come on up here. Come on. Say a couple of words."
    },
    {
      "text": "Say these people ... I saw them on television, I saw them on television. They were being devastated by what happened. And I put out a simple tweet saying what wonderful people they are. And they became very rich. They had lines that went around the block. Say a few words, please. Come on. There's a mic right over here. I can't believe I have to socially distance myself from these two people. They're probably the ones that want it from me. Please say a few words. Speaker 2: () Mister president, we thank you very much."
    },
    {
      "text": "I think you're doing a great job. I think we represent a lot of the Latino community that is very proud of the job that you're doing. And I think most of us, all of us, all the Latinos are going to vote for you because we think you're doing, like I said, a very good job. And I thank you for all the support that you've given us. And my wife and I are very happy. And what else can I say? Thank you. I really appreciate it. That's brilliant. That's beautiful. Go ahead. You can pull that down."
    },
    {
      "text": "Speaker 3: () [foreign language :38]. Latinos love Trump. Wow, that's great. Thank you. That's fantastic. So today they took care of 150 health care workers at Davon Gables Assisted Living Facility in Tucson and they've been helping a lot of the people here get some good food and they're sending Donald Trump the bill. I can't write it off to the government because they wouldn't like that, but we're paying for it. So make sure you get me that bill. But we have ... They are just two terrific people."
    },
    {
      "text": "Again, I saw them on television and they were having a rough time and now they're doing great. Everybody knows who they are and they have lines of people wanting to get in. Food is supposed to be fantastic. To defeat the virus, we are harnessing the unrivaled power of American industry. We're using the Defense Production Act to manufacture over 100,000 additional ventilators on top of our fast growing national supply. We've mobilized our country."
    },
    {
      "text": "Ventilators are very hard to make, very complex, big, very expensive. We are now at a point where everybody in this country that's dated a ventilator, right Doug? Has gotten one, especially here in Arizona, everywhere. And Doug's had some extra ones and he sent them to other places where they needed some help."
    },
    {
      "text": "But we have gotten ventilators to everybody and now we're actually helping other nations and we're using them for stockpiles in case this horror show ever happens again, but not a single American who's needed it. I mean, I'm so proud of that. Because when people, when we started, we started with, I use the expression the cupboards were bare. That means ventilators, that means a lot of other things. So we're doing something very dramatic and there's never been ..."
    },
    {
      "text": "There hasn't been anything like what we've done since a mobilization since World War II. We've dramatically accelerated development of new therapies and potential vaccines. Johnson and Johnson, Oxford, great places, and we have 90 clinical trials underway and hundreds more on the way and something's going to happen. Tremendous progress is being made. I don't want to talk about it until it's there. We don't want to talk too soon, but I will say, Doug, they really are. They're really ..."
    },
    {
      "text": "Darius, they're really making progress. You know some of the companies that great companies, you know the Johnson and Johnson folks that have been really fantastic, they want to get to it fast, so we'll see how it all comes out and we'll all know very soon and I think it's going to be a very positive event."
    },
    {
      "text": "Through FEMA, HHS, and our private sector partners we're equipping our frontline medical workers with more than 70 million N95 respirators, 112 million surgical masks, seven million face shields, 18 million gowns, and nearly one billion gloves. Today we hear from a few of Honeywell's extraordinary workers who are leading the charge to equip our healthcare heroes and Marshall are manufacturing Mike. That's what it is. It's a manufacturing might that we haven't seen for a long time."
    },
    {
      "text": "Bruno Aguina worked at another company for 22 years, but he jumped at the chance to support America and America's war against the virus right here at Honeywell. He's wanted to work at Honeywell always, and he had his chance. Now is a first shift team leader. Bruno, please come up and say a few words. Bruno? Thanks Bruno. Thank you Bruno. Great job. Thank you very much, Bruno. And the next time I'm here I think we'll be ... We'll shake hands and we'll hug each other for the job he's doing. Okay, Bruno?"
    },
    {
      "text": "Thank you very much. Ursula Warner is a proud air force veteran who courageously served our nation in Afghanistan and all around the world. Now she is continuing her legacy of service right here in Phoenix. Ursula, please come up and tell us how you chose Honeywell and why did you do that. She was retired for about two days. Retired? Look how young you are. Retired. Thank you very much. Great job Ursula. Eric Parks is a Marine Corps veteran and the operations manager at Honeywell's new facility."
    },
    {
      "text": "This is a highly personal mission for Eric. His mother is a nurse. His mother-in-law's a nurse, his brother is a paramedic and his daughter is about to start our first year of medical school at the University of Arizona. That's one of the great schools. Eric, please come up. Please. Thank you. Thank you. As you know, this terrible plague has inflicted grave hardships on our people. We mourn for every life lost."
    },
    {
      "text": "We pray for every victim and we shoulder this burden together as one people, one family and one great American nation. Thanks to the profound commitment of our citizens, we've flattened the curve and countless American lives have been saved. Our country is now in the next stage of the battle, a very safe, phased and gradual reopening, so reopening of our country. Who would have ever thought we were going to be saying that? A reopening, reopening."
    },
    {
      "text": "One day they came to us and they said, \"Sir, we're going to have to close it down.\" We had the greatest economy in history. Darius tell you about that. Greatest economy we've ever had, best employment numbers, history of our country, best stock market in the history of our country, most number of jobs, almost 160 million jobs."
    },
    {
      "text": "We were never even close to that and they said, \"Sir, we have to close it down.\" It's a terrible thing, but we did what was right and now we're reopening our country and it's going to be something very special. I was saying before that we're going to have a transition period. Third quarter, it's going to transition. Fourth quarter is going to be very good."
    },
    {
      "text": "We think very good and I think next year we're going to have one of the strongest years we've had in a long time, and that's my ambition to get it back to not only where it was, but to beyond where it was, and I just want to thank all of the people at this incredible company and this incredible plant. This pandemic has underscored the vital importance of reshoring our supply chains and constructing a powerful domestic manufacturing base. I've been talking about that for a long time."
    },
    {
      "text": "Oftentimes you'd see a plant like this in a different country doing the work you could be doing and you'll do it better. The United States declared its independence nearly 250 years ago, but in recent decades, Washington politicians allowed our independence to be offshored, outsourced, and seated to foreign countries, but we're taking it back and we've been taking it back. Then you look at our job numbers, you knew that we were taking it back. When we got up to almost 160 million something had to be happening."
    },
    {
      "text": "One of the things that happened was we were taking it back. We know it matters where something is made and we want essential medicine supplies and equipment to be manufactured, produced, and made right here in the good old USA. My administration believes in two simple rules. Buy American and hire American. In the 20th century, Honeywell workers helped make America the world's greatest manufacturing super power. It is a great company and it played a very big role."
    },
    {
      "text": "Now in the 21st century right here in Phoenix, Arizona, you're reclaiming the noble heritage and writing the next chapter of this incredible American story, and you have a great governor to lead your way and you have a great Senator to lead your away. You have a lot of people that are leading your way. It was the men and women of Honeywell whose craftsmanship made it possible for Charles Lindbergh to fly across the Atlantic and for Amelia Earhart to break boundaries in the sky."
    },
    {
      "text": "It was the men and women of Honeywell who built the periscopes, mortar sites and autopilot systems that powered American warriors as they battle the forces of tyranny and fought to victory in the second world war, and it was the unstoppable workers right here at Honeywell that helped our brave astronauts plant our American flag on the face of the moon, and we're getting ready to do it again, but we're really using the moon as a landing pad for its journey and our journey together to Mars that's happening very soon."
    },
    {
      "text": "Now it is one more time for the men and women of Honeywell who are supplying the weapons, the armor, the sweat, and the skill in a war to defeat the new invisible enemy. A tough enemy, a smart enemy, but nobody's like us and nobody's tough like us. I said it before and I'll say it again. The people of our country are warriors. With your help, we will vanquish the virus and build a future of greatness and glory with American heart, American hands, American pride, and American soul."
    }
  ]
}