{
  "speech_id": "305",
  "title": "Donald Trump David Muir Interview Transcript on Coronavirus",
  "date": "20200505",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-david-muir-interview-transcript-covid-19",
  "topics": "Economy, Healthcare, Government Policy",
  "num_segments": 16,
  "content": [
    {
      "text": "Yes. Well, I think actually the decision to close the country was the biggest decision I've ever had to make and I've said that very loud and clear. I mean we had the greatest economy in history, in the history of the world, not only our economy, it was our greatest economy, best employment numbers, best numbers in every single way. And they said, sir, we have to close the country. I said, what are you talking about close the country? Because nobody's ever heard of such a thing."
    },
    {
      "text": "And we saved millions of lives by doing it. And by putting the ban on China very early was a big thing. But the biggest decision I've ever had to make is closing the country. And certainly this is now also a big decision, but the people want to go back to work. It's possible there will be some because you won't be locked into an apartment or a house or whatever it is. But at the same time, we're going to practice social distancing. We're going to be washing hands."
    },
    {
      "text": "We're going to be doing a lot of the things that we've learned to do over the last period of time and we have to get our country back. People are dying the other way too. When you look at what's happened with drugs, it goes up. When you look at suicides, I mean take a look at what's going on. People are losing their jobs. We have to bring it back and that's what we're doing. Yeah. Yeah. No they don't. They have to test if they want. Some people are strong believers in testing. They should have not problem."
    },
    {
      "text": "They should have no problem. And as good as this is, we're even getting better. We came up, don't forget the cupboard was bare. The other administration, the last administration left us nothing. We didn't have ventilators. We didn't have medical equipment. We didn't have testing. The tests were broken. You saw that. We had broken tests. They left us nothing and we've taken it and we have built an incredible stockpile, a stockpile like we've never had before. Well, I'll be honest, I have a lot of things going on."
    },
    {
      "text": "We had a lot of people that refuse to allow the country to be successful. They wasted a lot of time on Russia, Russia, Russia. That turned out to be a total hoax. Then they did Ukraine, Ukraine, and that was a total hoax. Then they impeached the president of the United States for absolutely no reason and we even had 197 to nothing vote by the Republicans. Sure. No, I don't know yet. I'd have to see this full statement. Look, we've gotten along very well."
    },
    {
      "text": "Don't forget Governor Cuomo last week said, the president and the federal government have done a phenomenal job. He said that, a phenomenal job. David, I can only tell you what he said last week. Our country has to go back to being our country again. You have people that are not going to stand for this and I understand them very well and we are going to put out little embers and little fires and maybe some big fires, but we still have to go back to work. A couple of things."
    },
    {
      "text": "First of all, these models have been so wrong from day one, both on the low side and the upside. They've been so wrong. They've been so out of whack and they keep making new models, new models and they're wrong. Those models that you're mentioning are talking about without mitigation. Well, we're mitigating and we've learned to mitigate, but we can be in place, work in place, and also mitigate. We've done it right, but now we have to get back to work. We have to do it. They have. They have."
    },
    {
      "text": "Well, the upper number was, as you know, 2.2 million people. And then there were some models or charts that showed higher than that. But 2.2 million people, I always felt 60, 65, 70, as horrible as that is. I mean, you're talking about filling up Yankee Stadium with death. So I thought it was horrible, but it's probably going to be somewhat higher than that. There'll be more death, but the virus will pass with or without a vaccine and I think we're doing very well in vaccines."
    },
    {
      "text": "But with or without a vaccine, it's going to pass and we're going to be back to normal, but it's been a rough process. There's no question about it. Yeah. You can never be convinced. When you say, am I convinced, I can say this. We're doing really great, Oxford, Johnson and Johnson, these companies and I get reports every single day. They're doing really great. Am I convinced? I can't be convinced of anything, but I think that we have a really good shot of having something very, very substantial."
    },
    {
      "text": "Well, that is what it is and it's very interesting. Even the Democrats aren't blaming me for that. We had to closed it up and we saved millions of lives and we did the right thing. Now we're getting back to work. The third quarter, I think, is going to be, I call it a transition quarter. A lot of people, you see it. I'll tell you what. I got on the plane today. There was such spirit. People are starting to feel. We land in Arizona. I leave from DC. I get calls from everybody all over the country."
    },
    {
      "text": "I just spoke to the governor of Florida. Florida is really active. Well, we've done a lot for that. We've done our small business, as you know, or PPP paycheck, if you want to call it that, where small businesses are given billions of dollars so that they can take care of their employees. We've done a lot of other, look, we, we've done $2 trillion and it's actually close to three if you really add it up, but $2 trillion has been approved and we'll probably do more. It's a stimulus."
    },
    {
      "text": "It's to keep people employed, to keep small businesses open. Let me, I said, even you would say, worse than that. I said one person one time and it's true. There was a time when we had one person in this country. We knew about it, we worked on it, but we had one person. It mushroomed to 15 people, mushroom. Other people were coming in also from Europe. Don't forget. But don't forget, in January. Okay, let's talk about cases. You know why you're at a million cases? Because we have more testing than anybody else."
    },
    {
      "text": "If we tested as much as these countries down here, okay, who don't do very much testing at all. Look at Japan, very little testing there at the bottom of the rung. Look at South Korea gets so much publicity. The president of South Korea is a friend of mine, President Moon. He called up. He said, what you're doing with testing is amazing. If I tested this number of people instead of this number of people, I'd have far fewer. See, this line goes all the way up over seven million tests."
    },
    {
      "text": "If I tested down here at one million tests, I would have a lot fewer cases too. But look at your question. Look, let me tell you this. I closed the border if you want to use that term. I banned people from coming into China. There were approximately 40,000 Americans. If you were in my position, you would let them come in. You could ask Ron DeSantis, great governor of Florida. Those people went through quarantine. They went through tests. They went through everything, but they were American citizens."
    },
    {
      "text": "I had to let them come back in. What I came in and what I did is I said against many people, including Anthony Fauci, who I like very much, including Deborah, who I liked very much, the doctors and many other people, they said, don't ban China. It's going to blow over, and they said this at the end of February. Now at the same time, I want to be optimistic. I don't want to be Mr. Gloom and Doom. It's a very bad subject."
    },
    {
      "text": "I'm not looking to tell the American people when nobody really knows what's happening yet, this is going to be so tragic. I want to be aside from everything else and I'm going to use a term and some people love it and some people hate it, but I love it. I want to be a cheerleader for our country."
    }
  ]
}