{
  "speech_id": "308",
  "speaker": "Trump",
  "title": "Donald Trump, Mike Pence, Melania Trump National Prayer Day Speech Transcript",
  "date": "20200507",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-mike-pence-melania-trump-national-prayer-day-speech-transcript",
  "topics": "Healthcare, Government Policy",
  "num_segments": 15,
  "content": [
    {
      "text": "Thank you very much. Please sit. Thank you, be seated please. And Melania, thank you very much. On the second anniversary of the Be Best initiative, you've done a fantastic job and everybody appreciates it, but I want to... Thank you, and I want to thank you on behalf of the entire nation for all that you do for America's children and on fighting the drug addiction problem that we have in this country. It's all over the world, but I want to thank you very much. Great job. You do your work so hard."
    },
    {
      "text": "On this national day of prayer, America is engaged in a fierce battle against a very terrible disease. Throughout our history, in times of challenge, our people have always called upon the gift of faith, the blessing of belief, the power of prayer and the eternal glory of God. I ask all Americans to join their voices and their hearts in spiritual union as we ask our Lord in heaven for strength and solace, for courage and comfort, for hope and healing, for recovery and for renewal."
    },
    {
      "text": "In recent days and weeks, our country has endured a grave hardship. We pray for every family stricken with grief and devastated with a tragic loss. We pray for the doctors, the nurses and first responders waging war against the invisible enemy. We pray for the scientists' and researchers' pioneer treatments, that they find therapies and vaccines and that they find them soon. We pray for the frontline workers keeping our nation fed, nourished and safe and secure. May God watch over them all."
    },
    {
      "text": "We're honored to have with us today our amazing vice president Mike Pence and his wonderful wife, Karen. Great friends of our nation and great friends of mine and Melania's, and somebody who's done an incredible job not only as vice president but as heading the task force which has come up with so many solutions and ideas and things that we didn't even think about two months ago. We're also profoundly grateful to be joined by many faith leaders who are helping to care for our neighbors in their hour of need."
    },
    {
      "text": "Thank you all for providing meals to families, medical supplies to hospitals, and for providing spiritual strength and encouragement to your communities. Very important people, very respected people, and very much loved people. In every part of our country, we've seen grace of God through the love and devotion of our fellow citizens as scripture assures us the Lord your God is not your midst, a mighty one who will save. And I think it's so true."
    },
    {
      "text": "Think of that, the Lord your God is in your midst, a mighty one who will save. We have been reminded once again- ... who will save. We have been reminded once again that God has blessed our land with heroes of faith. Here with us is Brittany Akinsola from Charlotte, North Carolina. Brittany is a nurse, a pastor, a wife, a mother. When she saw the dire situation in New York City, she volunteered to work at Samaritan's Purse Field Hospital in Central Park."
    },
    {
      "text": "There she worked 13-hour shifts in the intensive care unit for weeks praying for each patient while giving them the very best care. As Brittany said, \"We just keep sharing the love of Christ through our gifts of nursing.\" Brittany, America's forever indebted to you and the incredible job you have done. We very much appreciate it, Brittany. Please come up. Please come up, Brittany, and say a few words. Thank you. Brittany, that's great. Wow. Thank you very much. Brittany, no notes, no nothing."
    },
    {
      "text": "You know your stuff, don't you? Thank you very much. A fantastic person. Also with us is Mario Salerno, a landlord, auto shop owner in Brooklyn. Last month, Mario waived rent for all 200 of his tenants. I got to see you on television actually. I said, \"What kind of a landlord is that?\" That's a great landlord, right? That's very nice. I got to see that. He wanted to make sure that they could put food on the table and he wanted to take care of their families."
    },
    {
      "text": "Even though he's losing a lot of income, which he could always use. We can always use it. Right, Mario? But that was a big thing. Mario says, \"That's irrelevant compared to the value of human life.\" Fantastic thing, Mario. He also believes he has two callings in this wonderful world, usually wonderful world. We live in a world that's very complex. To do good to people and to keep his faith. As Mario puts it, \"Faith is a lot more powerful than fear.\" That's true."
    },
    {
      "text": "Mario, if you would, would you please step up and say a few words? Thank you very much. Wow, that's so great. Thank you, Mario. That's really nice. I appreciate it. By the way, I love your tie, but I love your words even more. Thank you very much. In every age and in every generation, the prayers of our people and the faith of our families has willed us on to victory. No obstacle, no enemy and no danger can overcome the mighty spirit and soul of our nation."
    },
    {
      "text": "In every battle against poverty, against disease, against tyranny and evil, we have placed our loyalty in each other and our trust in God and we have prevailed. We will continue to prevail. We will prevail again. We will vanquish the virus. We will defeat the enemy. We will not fail. Once more, we call upon our creator to guide us through these very complex steps, protect our people, rebuild our communities and restore a beloved nation to even greater heights."
    },
    {
      "text": "We will never forget, however, those that have been lost. Those incredible souls and the families of those souls that are going through so much, we will never forget you. We will be there for you. May God continue to strengthen our hearts and sustain ourselves. May God continue to shed his divine grace upon this land. May God forever bless the United States of America."
    },
    {
      "text": "Now, I'd like to ask the faith leaders of our country, some of the most important of our faith leaders, people respected by everybody, to say a few words. Please, Sister Anita Martinez, if you would perhaps begin? Sister, thank you very much. Thank you, Sister very much. Thank you. That's beautiful. Pujari Harish Brahmbhatt. Thank you very much. Thank you. Would Bishop Dwight Green please come up? Thank you very much. Thank you, Bishop, very much. Thank you. Pastor Paula White, please come up. Thank you, Paula."
    },
    {
      "text": "Thank you, very much, Paula. Incredible, Paula. Thank you. Next is Chaplain Abraham Rahim. Thank you, Chaplain. Thank you very much. Thank you very much. Sister Debbie Harrison. Sister Harrison, thank you very much. Thank you very much. Thank you. Rabbi Ariel Sadwin. Thank you Rabbi. Thank you Rabbi, very much. Now I'd like to ask the Spirit of Faith Christian Center choir to come up and conclude the event by leading us in the singing of God Bless America. Thank you. Well thank you very much. That was great, thank you."
    },
    {
      "text": "You know while you're up here... so this is totally unexpected, but you're so good, do you have one song that you'd like to sing for the group and for the whole world that's watching right now. You have a lot of cameras out there. Go ahead. We'll put a little pressure on you. You can handle it. Go ahead. That's fantastic. A lot of people were watching, thank you. Great talent, beautiful. Thank you all very much. Great day of prayer, thank you very much. (crosstalk)- Speaker 6: () When everything lifts, we'll get a hug."
    }
  ]
}