{
  "speech_id": "319",
  "speaker": "Trump",
  "title": "Former President Trump announces 2024 presidential bid Transcript",
  "date": "20221116",
  "url": "https://www.rev.com/blog/transcripts/former-president-trump-announces-2024-presidential-bid-transcript",
  "topics": "Economy, Immigration, Foreign Policy, Government Policy",
  "num_segments": 25,
  "content": [
    {
      "text": "Well, thank you very much, and on behalf of Melania, myself and our entire family, I want to thank you all for being here tonight. It's a very special occasion at a very special place. You and all of those watching are the heart and soul of this incredible movement and the greatest country in the history of the world. It's very simple. There has never been anything like it, this great movement of ours. Never been anything like it and perhaps there will never be anything like it again."
    },
    {
      "text": "There's never been anything to compete with what we have all done. () Ladies and gentlemen, distinguished guests and my fellow citizens. America's comeback starts right now. Two years ago when I left office, the United States stood ready for its golden age. Our nation was at the pinnacle of power, prosperity, and prestige, towering above all rivals, vanquishing all enemies and striding into the future confident and so strong. In four short years, everybody was doing great."
    },
    {
      "text": "Men, women, African Americans, Asian Americans, Hispanic Americans, everybody was thriving like never before. () There was never a time like this. We turned the page on decades of globalist sellouts and one-sided trade deals, lifted millions out of poverty, and together, we built the greatest economy in the history of the world."
    },
    {
      "text": "When the virus hit our shores, I took decisive action and saved lives and the US economy, and by October of the same year, America was roaring back with the number one fastest economic recovery ever recorded. How about that? () All of the incoming administration and all they had to do was just sit back and watch. Inflation was nonexistent, our southern border was by far the strongest ever, and because the border was so tight, drugs were coming into our country at the lowest level in many, many years."
    },
    {
      "text": "Importantly, after decades of rising energy costs, the United States had finally attained the impossible dream of American energy independence, which soon would've turned into energy dominance. () For the first time in memory, China was reeling and back on its heels. You've never seen that before because the United States was outdoing them on every single front, and China was paying billions and billions of dollars in taxes and tariffs. The farmers know that because they got 28 billion of it."
    },
    {
      "text": "No president had ever sought or received $1 for our country from China until I came along, and we were getting hundreds of billions of dollars. Many people think that because of this, China played a very active role in the 2020 election. Just saying, just saying. Sure that didn't happen. Instead of jobs and factories leaving America for China, they were for the first time ever leaving China for America."
    },
    {
      "text": "() Businesses were pouring back because of our historic tax and regulation cuts, the biggest in both categories in history, bigger even than what Ronald Reagan was able to produce and he produced a lot. China, Russia, Iran and North Korea were in check and they respected the United States, and quite honestly, they respected me. I knew them well. I knew them well."
    },
    {
      "text": "The vicious ISIS caliphate, which no president was able to conquer, was decimated by me and our great warriors in less than three weeks, and Al-Baghdadi, its founder, was hunted down and killed. North Korea had not launched a single long range missile since my summit with Chairman Kim Jong-un nearly three years before we developed a relationship, and that's a good thing, not a bad thing. It's a good thing. Very good thing actually, because look at what's happening today."
    },
    {
      "text": "() My opponents made me out to be a war monger and just a terrible person who would immediately go into war. They said during the 2016 campaign that if he becomes president, there will never be a war within weeks and we will have wars like you've never seen before. It will happen immediately, and yet, I've gone decades, decades without a war. The first president to do it for that long a period."
    },
    {
      "text": "The world was at peace, America was prospering, and our country was on track for an amazing future because I made big promises to the American people, and unlike other presidents, I kept my promises. I kept them. Speaker 1 Thank you very much. Under our leadership, we were a great and glorious nation, something you haven't heard for quite a long period of time. We were a strong nation, and importantly, we were a free nation. But now, we are a nation in decline. We are a failing nation."
    },
    {
      "text": "For millions of Americans, the past two years under Joe Biden have been a time of pain, hardship, anxiety and despair. As we speak, inflation is the highest in over 50 years, gas prices have reached the highest levels in history, and expect them to go much higher now that the strategic national reserves, which I filled up, have been virtually drained in order to keep gasoline prices lower just prior to the election. Joe Biden has intentionally surrendered our energy independence."
    },
    {
      "text": "There is no longer even a thought of dominance and we are now begging for energy help from foreign nations, many of whom find us detestable. () Our southern border has been erased and our country is being invaded by millions and millions of unknown people, many of whom are entering for a very bad and sinister reason, and you know what that reason is. We will be paying a big price for this invasion into our country for years to come."
    },
    {
      "text": "Hundreds of thousands of pounds of deadly drugs, including very lethal fentanyl, are flooding across the now open and totally porous southern border. The blood soaked streets of our once great cities are cesspools of violent crimes which are being watched all over the world as leadership of other countries explain that this is what America and democracy is really all about. How sad. The United States has been embarrassed, humiliated, and weakened for all to see."
    },
    {
      "text": "The disasters in Afghanistan, perhaps the most embarrassing moment in the history of our country, where we lost lives, left Americans behind and surrendered $85 billion worth of the finest military equipment anywhere in the world. And Ukraine, which would have never happened if I were your president, are something... () And even the Democrats admit that. That's something I've seen them admit over and over again."
    },
    {
      "text": "But our enemies are speaking of us with scorn and laughter and derision because of those two events, but there are many more. Even just today, a missile was sent in, probably by Russia to Poland, 50 miles into Poland, and people are going absolutely wild and crazy and they're not happy. They are very, very angry. Now, we have a president who falls asleep at global conferences, was held in contempt by the British parliament over Afghanistan."
    },
    {
      "text": "Thanks to the words of wisdom he said, thank you to the wrong country for inviting him to a major summit on the environment of all things. They fly for days to get there and then he calls the country a name that was actually a country on another continent, and he is leading us to the brink of nuclear war, a concept unimaginable just too short years ago. You cannot mention the nuclear word. It's too devastating."
    },
    {
      "text": "() The Green New Deal and the environment which they say may affect us in 300 years is all that is talked about. And yet, nuclear weapons which would destroy the world immediately are never even discussed as a major threat. Can you imagine? They say the ocean will rise one eighth of an inch over the next 200 to 300 years, but don't worry about nuclear weapons that can take out entire countries with one shot. Something is wrong with their thinking."
    },
    {
      "text": "Under Biden and the radical Democrats, America has been mocked, derided and brought to its knees perhaps like never before. But we are here tonight to declare that it does not have to be this way, it does not have to be this way. () Two years ago, we were a great nation, and soon, we will be a great nation again. The decline of America is being forced upon us by Biden and the radical left lunatics running our government right into the ground. This decline is not a fate we must accept."
    },
    {
      "text": "Exactly one week ago, our citizens voted in the important midterm elections, and despite a ridiculously long and unnecessary period of waiting, far longer in fact than any third world country, just a short time ago, the Republicans won back control of the House of Representatives. And it was with a great Trump endorsed candidate, Congressman Elect Kevin Kylie, who is a fantastic person, a fantastic person, and I'm very happy it was his vote that did it. So we now won back, this happened just an hour ago."
    },
    {
      "text": "() Much criticism is being placed on the fact that the Republican party should have done better, and frankly, much of this blame is correct, but the citizens of our country have not yet realized the full extent and gravity of the pain our nation is going through and the total effect of the suffering is just starting to take hold. They don't quite feel it yet but they will very soon."
    },
    {
      "text": "I have no doubt that by 2024, it will sadly be much worse and they will see much more clearly what happened and what is happening to our country and the voting will be much different. 2024. Are you getting ready? Speaker 1 And I am two. I am two. I do want to point out that in the midterms, my endorsement success rate was 232 wins and only 22 losses. You don't hear that from the media."
    },
    {
      "text": "And this is an elegant night and an elegant place and I'm not going to use the term fake news media, so we're going to keep it very elegant. But you don't hear that from the media, but I think you will because people are starting to see what happened. That's some score, and in the primaries, was 98.6%, but they were still trying to blame me."
    },
    {
      "text": "And the reason for the success and that unprecedented success rate is that the Trump administration changed our nation on trade, on securing the border with the strongest, safest border ever in the history of our country, on Islamic terrorism. We had practically just about, not that I can think of, no Islamic attacks, terrorist attacks during the Trump administration, and in fact, we got along very well with the various countries, including coming up with the Abraham Accords."
    },
    {
      "text": "That's a great thing, the Abraham Accords. () But it's because of cutting taxes and cutting regulations at the highest level ever and on building the greatest economy. Anytime in the history of the world, there's never been an economy like we had just two years ago. Despite the outcome in the Senate, we cannot lose hope and we must all work very hard for a gentleman and a great person named Herschel Walker, a fabulous human being who loves our country and will be a great United States senator."
    },
    {
      "text": "Herschel Walker, get out and vote for Herschel and he deserves it. He was an incredible athlete. He'll be an even better senator. Get out and vote for Herschel Walker. () We elected a group of incredibly talented America first leaders who will be stars of our party for many years to come. In the popular vote, another thing that's not discussed for the House, we must remember that Republicans won 5 million more votes, the largest margin in many, many years over the Democrats."
    }
  ]
}