{
  "speech_id": "346",
  "title": "Trump Speaks at Event in Detroit, Michigan",
  "date": "20241013",
  "url": "https://www.rev.com/blog/transcripts/trump-speaks-at-event-in-detroit-michigan",
  "topics": "Economy, Government Policy, Climate",
  "num_segments": 140,
  "content": [
    {
      "text": "Thank you very much, everybody. Thank you. Thank you very much. It's a great honor to be here and thank you, John. It's really wonderful to be back in Detroit and it's a true honor to be back at the Detroit Economic Club. Really terrific people. I was here in 2016, so maybe you brought a little luck. We're going to do it again. We're going to do it again. Before we begin, I want to send our love to everyone affected by the hurricane."
    },
    {
      "text": "As you know, it was a rough night and who would've thought a lot of things happening at one time, but that's just ripped through Florida and also the people of North Carolina, Georgia, Alabama, South Carolina, Florida again and Tennessee for what they went through with Hurricane Helene. We had quite a combination. () I'd like to congratulate Governors of Florida, Ron DeSantis, Governor Brian Kemp of Georgia and South Carolina, Henry McMaster. They were really hit hard and they've done really a fantastic job."
    },
    {
      "text": "The federal government, on the other hand, has not done what you're supposed to be doing, in particular with respect to North Carolina. They've let those people suffer unjustly, unjustly and we're praying for all of those who lost a house or much more importantly, a precious loved one. There were many, actually many, many in Georgia and North Carolina. Florida will rebuild and come back strong. It always does. I look forward to returning very soon."
    },
    {
      "text": "We'll be there very soon and okay, now let's get to the reason that I'm here today. () I think you're going to find some interesting things, both good and bad, but we make the bad into good. That's what we like to do. It was just announced that inflation came in substantially hotter than expected last month, double what was predicted, with much of the gain coming from food prices going up, rent and housing costs going up and car prices going up. Interest rates, as you know, are also a big factor."
    },
    {
      "text": "They're very high. They've gone from 2% when I was in office to 10% now and you can't get the money. That means it's much higher than 10%, which really kills the American dream for young people. We have a lot of young people here, a lot of college people here. The fact is that the Federal Reserve brought the interest rates down a little too quickly. It was too big a cut and everyone knows that was a political maneuver that they tried to do before the election, but they did the wrong thing."
    },
    {
      "text": "It was totally a political decision and inflation has started to rise. () Four years ago when I left office, we had no inflation. We had virtually, just think of it, we had virtually no inflation for the entire four years. When people made money, that was really their money. It wasn't money that they have to give back to a source that they know nothing about, including government."
    },
    {
      "text": "Under Biden and Harris because of inflation, the economy has been a total disaster, but Kamala says that she can't think of one thing that she would do differently. She said that two days ago in a very unfortunate interview for her and there are many people saying, in particular, highly respected analysts like Scott Besant, one of the top analysts on Wall Street, that the only reason that the stock market has gone up is because Donald Trump is doing very well in the polls and it looks like he's going to win."
    },
    {
      "text": "A lot of people are saying that, who knows, but a lot of people are saying that. The only way to end this suffering is to vote for change this November because what we're doing is our country is very bad. We're being scoffed at and laughed at all over the world. () The other big news is the fraud committed by 60 Minutes and CBS together with the Democrat party, working together with them, which will go down as the single biggest scandal in broadcast history, I predict. It's a big story."
    },
    {
      "text": "I don't know if you've seen it yet. They learned about it yesterday evening. The real answer of Kamala was very crazy or dumb. Nobody knows what, but it was bad, so they actually replaced it. Think of this. They've never done that for me. They actually replaced it with another answer, having nothing to do with what she said before. They took another thing that she said and they just lopped it in there. Nobody's ever seen anything like it, 60 Minutes."
    },
    {
      "text": "I mean, I've had a recent thing where, as an example, an Obama disciple named Peter Baker, he writes for the failing New York Times, he wrote a piece about me and just one of the many things he said that was wrong, but he said that I would go around saying that I was honored here years ago as the man of the year or whatever and I talked about how your car industry. This was long before, many years before I ran for president, maybe 18, 20 years ago and he made the statement that never took place."
    },
    {
      "text": "That honor never took place. I was never honored here, which was quite insulting actually. I didn't remember the specifics of it, it was 18 or 20 years ago, but he said it never took place. Very much like Kamala, she said she worked at McDonald's and she didn't and I didn't want to get into that, so what I did is, I asked my people, you got to find it. () When, it was like 19 years, 17, it was a long time, but I was honored and guess what? They found it. I was. Right here. Nice looking young guy."
    },
    {
      "text": "That was a long time ago. Let's see, this was an update of the article that they originally printed. It says Oakland County GOP to honor Donald Trump, former president to speak at upcoming Lincoln Day fundraising dinner. It says down here, the county party gave Trump the Man of the Year award at the dinner too and he was honored as Man of the Year. Here's your article right here. Oakland Press, Oakland County GOP to honor Trump."
    },
    {
      "text": "I have a man in the failing fake New York Times, disgraceful paper, they ought to be ashamed. Whatever they say, believe the opposite. Who knows how long they're going to be around. It's killing our country, this kind of stuff. It's killing our country. It's really terrible. () I want to thank the president of the Detroit Economic Club, Steve Gregorian, who's a very wonderful guy, as well as Congressman John James, Ambassador David Fisher, Michigan Senate Republican leader Eric Nesbitt. Thank you Eric. It's great."
    },
    {
      "text": "Thank you very much. How are we doing? I hear we're four points up. How are we doing? Yeah, she says at least it. Thank you. Michigan House Republican leader, Matt Hall. A very good guy. Thank you, Matt. Thank you. Is John there? John? John James? Where's John? He's doing well. We have some good people here. Chairman of Michigan Republican Party, Pete Hoekstra. Pete, thank you very much. A very special man, a great guy, Dr. Massad Boulos. Many of you know him. He is a very successful man."
    },
    {
      "text": "He happens to be the father of Tiffany's husband Michael, who's a very exceptional young guy and she's an exceptional young woman and she's going to have a baby, so that's nice. Thank you for being here. Thank you very much. Thank you. Great honor and many other distinguished guests and we have some very distinguished Democrats in the room too and I really do appreciate you being here. That's very nice, thank you. There'll be a day when we're going to work together. I hope we're going to be able to work together."
    },
    {
      "text": "That'd be great. Good for everybody. () I'm here today to talk about a subject that has always been very dear to my heart, saving the US auto industry. That's what I spoke about in Oakland many years ago. I said, they're stealing your auto industry, years ago. They're stealing your auto industry. You got to stop it."
    },
    {
      "text": "Well, they didn't exactly listen, but we have to make that industry bigger, better, stronger and more dynamic than ever before and I've been reading about Detroit for so many years that it's coming around, it's coming around and never really got there. Everybody tries so hard, but if you make the auto industry bigger, better, stronger, you don't have to worry about Detroit. It'll be very good. It'll come by its own. That would be non-artificial. That would be the way to do it, right?"
    },
    {
      "text": "You make the auto industry thrive, bring it back to where it was 50, 60 years ago. You can do that too and that's my goal and I'm laying out a policy that will absolutely do it. In my opinion, absolutely do it and I've been very good at this over my life. () My goal is to see US auto manufacturing even greater than it was in its prime and for Detroit and Michigan to be at the center of the action."
    },
    {
      "text": "For generations this city and state were the world capital of automotive production and American automakers rolled one iconic model off the line after the next, the Mustang, the Corvette, the Pontiac GTO. I had two of them actually. I had that GTO. Oh, I thought I was the hottest guy around. It was crazy. We didn't have all of the foreign competition then. You were so proud to have a Corvette. Oh, if you had a Corvette. I never got a Corvette. I tell you, I feel I was left behind, but I had my GTO."
    },
    {
      "text": "I was something, man. I'd put that top down. See, in those days I didn't mind when the hair waved. I'd go fast and that hair would be waving, that blonde hair and I'd say, who the hell can take me? Nobody. Today, I'm a little more careful I want cover up that little area up there. It's a little bit soft up there. Cover it up. No, it was great, but you did, you had the greatest product. It was just fantastic."
    },
    {
      "text": "Right here in Detroit, Americans invented the muscle car and the minivan and the family SUV, so much and along the road you made the American automobile an inseparable part of the and it was inseparable, of the American dream. It was part of the American dream, but after decades and decades of Michigan auto workers giving our nation their very best, our leaders in Washington did their very worst for them. They were terrible."
    },
    {
      "text": "You lost nearly 4 million manufacturing jobs after globalist politicians gave us the twin disasters of NAFTA, which I terminated and China's entry into the World Trade Organization. That was a very expensive two things. Nearly a quarter of a million jobs were destroyed here, right here in Michigan alone. Think of it. A quarter of a million. 250,000 jobs, including 40% of all of the auto jobs and then it got to be much higher than that. Detroit was decimated as if by a foreign army."
    },
    {
      "text": "This was a foreign army invading us, but it was an army of business people, very brilliant business people, that took the candy out of our pockets just like you'd take it from a baby. That's how easy it was for them. Factories were left in ruins. Beautiful hotels and theaters crumbled. More than 80,000 homes were abandoned. You see it outside."
    },
    {
      "text": "() By the time I came into office after our victory in 2016, the Michigan Auto Industry was on its knees begging for help, gasping and really it was at the last breaths of life and I had to move quickly. You were going to not have any auto industry here. It was going, it was all gone. It was just about over. They were going to move so fast that I let countries that were stealing our businesses know, you do that I'm going to do things to you you're not going to believe. I'm going to put tariffs."
    },
    {
      "text": "They laid off a lot. They could have taken it. We were at a very vulnerable point. I let certain countries know that if you do that, I'm going to put tariffs on you and you're going to get your asses kicked. I'm telling you and they laid off. They really laid off, but they laid off what? We had not very much left. () Just as I promised, I withdrew from the job killing Trans-Pacific Partnership in my very first week and the reason I did is that that would've absolutely destroyed your auto industry."
    },
    {
      "text": "You would've had none left. It was a disaster. If you remember, Hillary Clinton wanted it and Obama wanted it and then after she read the facts when I did it, she came out against it because she said he's right. She was totally in favor of it, but when she said she came out actually and agreed with me and she said, I'm also against it, but I was there sort of like no tax on tips and then two months later, Kamala came out, no tax on tips and it didn't play well for her."
    },
    {
      "text": "It didn't play well for Hillary either, obviously. () I ended the disaster known as NAFTA, the worst trade deal ever made by our country and replaced it with the brand new USMCA. Bob Lighthizer and his team did a great job. The best trade deal they say ever made. I actually think maybe our deal with China, but I don't talk about that deal very much because of Covid, but we have a deal with China where they buy $50 billion worth of our product. That was a great deal."
    },
    {
      "text": "We had made a lot of good ones, but with the USMCA, that's Mexico and Canada, we have massive incentives to make cars in the United States of America. I renegotiated Obama's Korea trade deal, which was a disaster, to fully restore the protective tariff on foreign pickup trucks. The auto industry in this country makes most of its money from the pickup truck. Who would think, right, but we do great."
    },
    {
      "text": "() If we didn't have that, you'd have no auto industry because that subsidizes other things and the only reason it does is that the tariff on every single one of the big... If you didn't have the tariffs, if I didn't put those tariffs, you would be inundated from all over the world and you wouldn't have it. Every single one of the Detroit big three could right now and would right now guaranteed be out of business. 50% of their US sales are pickup trucks. Think of that, 50%."
    },
    {
      "text": "They make all their money with, almost all their money, I want to be very accurate because you got a lot of fake news back there. I want to be extremely accurate. They came to see you in Detroit. I'll tell you, that's a good thing because they're going to hear some things today I think that are going to be very interesting. () Perhaps most importantly, I imposed a 27.5% tariff on all Chinese automobiles, which largely kept them out of the market. Meaning kept them out of the market and kept Detroit in business."
    },
    {
      "text": "In other words, I kept China cars, Chinese cars, out of America and we had to do it because when they come in, they take over everything and you would've had no car manufacturing at all and it was only me that did it. I met with a lot of resistance and remember this between the lobbyists and everything else, it's brutal. It's brutal. Getting people to go along with you is brutal. Even if it's the wrong thing, they know it's the wrong thing, but they get paid a lot of money."
    },
    {
      "text": "I just want to say, Michigan, you're welcome because we have a little base to start on. If you look at Europe, Chinese cars have been absolutely drowning Europe, drowning it, it's killing it, but because of me, they are not drowning America. You see very few of them because of the tariffs and when they do come in, they pay a lot of money."
    },
    {
      "text": "() The Biden administration is thinking of taking that tax off and if they take that tax off, you can wave goodbye to your auto industry and you have the worst union leader, maybe in the history of our country for any business. I don't know him. Shawn Fain is a disaster. Your industry would be gone very quickly. Under my leadership, we created nearly half a million brand new manufacturing jobs, including 30,000 auto manufacturing jobs right away."
    },
    {
      "text": "We saved it and we got it going and that was nothing compared to what I'm talking about now. Nothing because we had Covid come in that final period and we had to focus on that. The share of cars sold that were domestically produced, increased for the first time in many years because it was going down, down, down and since I left, wait until you hear those numbers. The US trade deficit in automobiles dropped by $6.8 billion. Think of that and I had to do it on the fly."
    },
    {
      "text": "We had to do it fast because you were going to have no industry whatsoever. () Whatever you have now and it's a fraction of what you used to have in the glory days. I call them the glory days. That was when we were the greatest in so many ways, US Steel. Look at it. They want to sell US Steel to a foreign country. I'm going to not let that happen. I hope the deal doesn't close before then. I will not let that happen. We need our steel. I imposed a tremendous tariff on China and the steel."
    },
    {
      "text": "They were dumping steel all over the country and our steel mills were going at a business and I put a 50% tariff on and that largely stopped it. I think the people that like me the best are the steel people because I saved their industry. We wouldn't have one steel plant in this country if I didn't do that. There wouldn't be one. () I had no wars, other than I finished off ISIS very quickly, but I had no wars."
    },
    {
      "text": "Whether you have wars or don't have wars, when you have to make army tanks and when you have to make planes and everything else that you have to do is mostly steel and we don't want to be in a position where we have a problem and we need China to help us out with steel. That could be a serious problem. Do you think they'd mind selling us some steel in the middle of a conflict? I don't think we'll have a conflict with China."
    },
    {
      "text": "I think we'll get along with China and I think we'll get along with Russia and I think we'll get along with Ukraine and I think we're going to get that one settled and I think we're not going to have a problem with Israel. October 7th would never have happened. Russia would've never happened. They would've never gone into Ukraine had I been president, but under Kamala, we are now in a manufacturing recession, with manufacturing contracting in 22. () Think of this, it got smaller."
    },
    {
      "text": "In 22 out of the last 23 months, it got smaller. We're losing jobs every single month. We have lost nearly 50,000 manufacturing jobs this year alone. Car sales are down by 38% since I left. The share of domestically produced cars sold has dropped significantly and the US trade deficit in automobiles has exploded by nearly $50 billion to an all-time high. The worst they've ever had it, right now. Your car industry is going out of business. It's going out of business. Nothing to do with me. I stopped that."
    },
    {
      "text": "I stopped Mexico, which is becoming the second China. I stopped Mexico from taking your car plants and moving them into Mexico and taking all of that business, making it in Mexico, so we lose all those jobs in Michigan and South Carolina and other places, Tennessee, we have many places, but I think in terms of this because it's been so badly treated. () This area, this state has been so badly treated by your politicians."
    },
    {
      "text": "Your stupid politicians what they've done to this state is incredible and it would've been easy to stop, but half of them are paid a lot of money by a lot of bad, well, a lot of people that don't care about the country. They care about how much money they're going to make, including lobbyists and others, making a lot of money. You ever see the money the lobbyists make? They make a lot, but they give a lot of it away. I wonder who they give it to? We're not going to allow this horror to continue."
    },
    {
      "text": "The four-year-long nightmare for the American autoworker ends the day I take the oath of office. January 20th, it ends. () Yeah, a poll just came out today. As I was walking on, they said, sir, you are four points up in Michigan. I said, that's all? They said by a poll that they called it a Democrat poll. It's a poll that would normally be very negative, so if they say four points, that means more, but I think we're doing well here and I think we're doing well all over."
    },
    {
      "text": "We're leading in every single state, every swing state, by actually in some cases a lot. Today, I am announcing a detailed plan to save the American auto industry and bring millions and millions of jobs back to our shores and very quickly. If you vote for Trump and you will see a mass exodus of manufacturing jobs, but from Mexico to Michigan, from Shanghai to Sterling Heights and from Beijing to right here in beautiful Detroit. Wait until you see Detroit."
    },
    {
      "text": "They'll also be going to places like South Carolina, Tennessee and others. We have a lot of car-making states, a lot of parts-making states too and our car industry will have a renaissance, the likes of which we have never seen before in this country. We have never seen since the golden years. () It's my goal to get our country on an automaking path where at some point in the near future, it will be bigger and more important than it ever was and even in its heyday. Many years ago, it was unbelievable."
    },
    {
      "text": "I think we can be bigger and more important because we have some very, very great assets and this is very personal for me. Personal. One of the reasons is because I've been talking about it for 20 years. I can't believe it happened. When I was honored, that's all I talked about. I was watching this happen. It was at that time Japan. Japan was just taking our cars like we were a bunch of babies. I always say candy from a baby. That's how easy it was. Now, it's Japan, but it's China and it's a lot of countries."
    },
    {
      "text": "This was one of the biggest reasons I ran for president in the first place. It was probably the auto industry that was most abused. You were the most abused. There were a lot of industries that were abused. We stopped it, but now I could put the brakes on. Not only stop, I now know the game a little better. () I had never been a politician before. I got to the White House. I said, yeah, I've never done this before, but I had to learn and I had some great people."
    },
    {
      "text": "Bob Lighthizer was great, our trade representative, but we had some people that I didn't like. I wouldn't have picked, in retrospect. We had some clinkers, but you have to understand, I just got there. I was only in Washington 17 times and I never stayed over, so I wasn't a part of Washington society. It wasn't my thing. I was a New York person, a developer, did great and I knew New York, but I didn't know Washington. I came. I had to rely on people. Sometimes I'd rely on RINOs and that's what I'd get."
    },
    {
      "text": "I'd get a RINO and that wasn't so good, but we had mostly great people, but we had some ones that I would not have again. We're going to finish the job that we really brilliantly started because we had numbers. The ambassador gave you some of them. I don't want to bore you by going through it, but he gave you some numbers that were unprecedented. I intend for the triumph of the American auto industry to be among my greatest legacies. I want it to be a legacy."
    },
    {
      "text": "I want American companies to not only dominate the American market, but also the foreign markets as well. They buy so of our cars. It's so horrible, but they only buy them if they're made in their countries. China, I don't object. Look, President Xi was and I would say is a very good friend. We broke up a little bit. The way friendships break up, a thing called the China virus broke us up. I think that's understandable, right? Cost the world about $50 trillion and tens of millions of lives all over the world."
    },
    {
      "text": "I think that's a reason, but no, I've always had a very good relationship with him. Very, very strong, smart man. He's strong and smart, meaning he wants to take your auto industry and so does every other leader of a country. They want to take your industry, all of our industry and we're not going to do that. We won't let them play that game and it's not even hard and you'll understand that in a moment. () I want German car companies to be American car companies. I want them to build plants in America."
    },
    {
      "text": "Otherwise I'd rather not have their cars here. Instead of American workers worrying about losing their jobs to foreign nations, I want foreign nations to be worried about losing their jobs to America. That's going to happen. It's going to happen. It's going to happen and I hope the Democrats will go along with us, but we'll get it done one way or the other. I hope they're going to go along with us. It's so good. It's like so many things they don't like, like voter id. () Why aren't they approving voter id?"
    },
    {
      "text": "Democrats don't want voter id. You know why because they want to cheat. I thought I was seeing things. I didn't hear that. When I first started this, I'd say, the Democrats will not approve voter id and it's only gotten worse. Gavin Newsom, the governor of California, just passed a bill. He signed a bill that you're not even allowed to ask anybody whether or not they have voter id. Not only can't you use it, you can't even ask. I think it's a crime or something. I could ask the Secretary of State."
    },
    {
      "text": "They come in and they take our money and they take our jobs like we're, like just so easily, and I would call them and I'd say if a country, let's say, ready to go to China with their currency or someplace else, but China's about 99% of the problem in all fairness, I would say to them, if you do that, I'm going to hit you with tariffs like you've never seen before."
    },
    {
      "text": "Or I'm going to not let you trade with the United States and I'm going to also hit you with tariffs, double whammy if you get anything through, but you're not because we're not going to do any business with you. And they will then call us and they will say, sir, we have decided that we love the dollar very much and we're going to stay. That's what they will say every single time. (:50) So tariffs are a very important thing. They need a PR agent to straighten out that word. If I was Mr."
    },
    {
      "text": "Tariff, I would say, please get me a PR agent. I have to straighten out. It's one of the most beautiful words in the whole world. It's going to make us wealthy again. The other word is reciprocity is going to make us wealthy again. We're going to be a very wealthy country very quickly, very, very quickly. Our greatest wealth, probably proportionately, was in the 1880s and 90s and the early 1900s where we had so much cash. They would set up committees. They didn't know what to do with their wealth."
    },
    {
      "text": "We had such wealth in this country. They didn't know what to do with their wealth. They had no, they would set up, we had so much money all from tariffs. (:41) There was no income tax. And then they went to the income tax stuff and it was a whole different story. Then you had the depression. A lot of people said, oh, tariffs maybe caused it. It didn't. It wasn't. Tariffs came in in 1932 after the depression. They tried putting tariffs on to see if they could save. They said, we got to save this thing."
    },
    {
      "text": "But it was long gone. It was gone. I will do this with each and every abandoning country. If they abandon us, meaning they abandon our currency and our reserve currency will be stronger than ever before. We'll have everybody in there. Everybody will be happy to be in there, including China because I'll tell China the same thing. If you want to play games with us, we're not going to trade with you. They make a trillion dollars a year with us. They built our military. They make so much money."
    },
    {
      "text": "(:30) I say, we're not going to do any business. We'll go cold turkey. A lot of people would like to do that anyway, but we're going to go to cold turkey and we're going to go with 100% and 150% tariffs. So if anything does get through, you're going to have to pay tariffs. China's very smart. I'll tell you, when I put the tariffs on the steel, they were very unhappy, but they didn't tell me. They said, \"It doesn't matter. We're China.\" I said, \"Oh, it doesn't bother them."
    },
    {
      "text": "So then ask them for more.\" That was my initial reaction. We started at 25%. I said, \"They said it doesn't matter.\" And I said, \"All right, so ask them for more.\" So we asked them for more, 10%. It didn't bother them. That's what they said, but it did bother them. But they're great players, they're great poker players. (:17) It didn't bother them. I said, \"Well, ask them for more. Ask them for more, more until it bothers them.\" And finally, I got a call from President Xi."
    },
    {
      "text": "He said, \"You're killing us with the tariffs.\" And then we got along after that. It's very strange. But they're great poker players, they're great negotiators, all these countries are great negotiators. The only one that isn't is the US. We're the dumb country. We're like the pot of gold that's rapidly shrinking. So very much like I told them that if they buy oil from Iran, I would not be trading with them. Iran was broke when I left office, and I don't want them to be broke. I want them to be a strong country."
    },
    {
      "text": "I just don't want them to have a nuclear weapon. It's very simple and you protect Israel and frankly you protect the Middle East. I want to protect the Middle East, the whole Middle East, and I hate to see this death to everybody. (:17) People that have nothing to do with anything are being killed all over the place on both sides. Nobody wants that. We have to protect everybody. And China didn't buy any oil."
    },
    {
      "text": "I said, \"If you buy one barrel of oil from Iran, one barrel,\" I said, \"Then you're going to not do any business with the United States and we're going to impose tariffs if you do get something through. Very substantial, over 100%.\" And they said, \"We'll pass.\" I told this to President Xi. He said, \"We'll pass.\" They didn't do any business. And Iran was, and I said this to many countries, by the way, not just China. I mean, many countries treat us worse than China."
    },
    {
      "text": "You want to really know the truth, but China seems to be the one we talk about. But before I came along, nobody talked about China. They had a free pass. They were going, run silent, run low, right? You know that expression? Submarine. Nobody knew. But I woke up our country a little bit, but Iran was broke. They had no money for Hamas or Hezbollah and I didn't want to see them broke. I want them to be thriving, but I just had to negotiate. The only problem was he was the only problem."
    },
    {
      "text": "The election took place and it was very shocking to a lot of people. And when they took over, they didn't do anything. They didn't do anything. They actually did the opposite. They allowed everybody to go and buy oil. They allowed everybody to do all of those things. (:56) And Iran became very wealthy again. They now have $300 billion in cash. They're very wealthy. They control Iraq, which was a stupid move going Iraq. I remember I said, \"Don't do it."
    },
    {
      "text": "Don't do it, don't do it.\" But I said it as a civilian, then they did it. I said, \"Okay, you've done it. Keep the oil.\" They didn't do that either. So we go in, we blow up countries and then we leave. We got nothing except dead people all over the place on both sides. How stupid are we? That was a Cheney deal and a Bush. How stupid are we? Not just Democrats, it's both. I'm equally angry at both because we have humanity to think about also. You do."
    },
    {
      "text": "You have humanity to think about and all of these things, they should have never happened. Ukraine should have never happened. October 7th should have never, should have never happened. (:53) If you had smart people at the White House that knew something, a little bit of something, it wouldn't have happened. Think of the world, how different it would be. You wouldn't have Ukraine-Russia. You wouldn't have had October 7th. You wouldn't have this horrible thing that's going on. You wouldn't have had inflation."
    },
    {
      "text": "You wouldn't have had the worst, most embarrassing day in our history. We were leaving Afghanistan. I'm the one that got him down, but I would've kept Bagram. You know why I would've kept Bagram? It was one hour away from where China makes its nuclear weapons. One hour away. So you see the ideas and the policy are important, but the most important thing of all is the messenger. Because I could give that same message to a stiff and it wouldn't resonate at all with the other side."
    },
    {
      "text": "You have to have the right messenger. Somebody said, \"Oh, we love Trump policy, but we don't like Trump.\" I think they do. They said that women don't like me. I think women love me because they want to be safe and with me, they're safe. With other people they're not safe. It's true. (:58) So remember, I want tariffs, but a very, very big, easy and uncomplicated part of it is reciprocity because that comes along with it very simply. And all tariffs against our nation must come off. They have to come off."
    },
    {
      "text": "They got to come off immediately because we're going to meet them with an equal tariff and they will come off for the most part. But if they don't, they have to pay a big price. So next, in addition to this rather easy thing to understand, by the way, does everyone understand this? Does everybody, do you understand? Is there anybody that doesn't understand it? Would you please raise your hand? Raise your hand. Does anybody not understand it? See, how simple is that? I'd like to see the person. I really don't sir."
    },
    {
      "text": "Then they have a front-page story and we had a couple of dummies in the room. (:50) But we will implement further protections for critical industries that are fundamental to our national interests, and those include above all steel and the car industry. The car industry is critical to us. We can't fight a war if we can't make cars and trucks and engines and transmissions and drive trains. Surrendering our car industry is not an option. We have to make our car industry brilliant again. We have to make it bigger."
    },
    {
      "text": "I'm going to make it bigger than it was ever before. Now I'm going to make it real, very quick. It's going to go, but to bring it to that level, I guess I'll need a little more time, but I won't have that time. But I'm going to hand it over to people. We're going to make this country so strong and it's going to be so much easier to run, and I think we're going to end up actually having a lot of support from the other party. I really believe that. I think it's too basic. It's too basic."
    },
    {
      "text": "(:50) So as I said, China is currently building gigantic auto plants in Mexico, and they think that they're going to sell all of these cars into the United States, which would destroy Michigan. Totally destroy your state, but it's not going to happen. Not going to happen. Not even close. They might as well stop building the damn plants. They are giants. Sir, you really have to see them. I said, \"I don't want to see them.\" I will impose whatever tariffs are required, 100%, 200%, 1000%."
    },
    {
      "text": "They're not going to sell any cars into the United States with those plants. They're building them close to our border so that they can have easy shipping because they're used to having stupid people to deal with. We're not going to let it happen. Those jobs are coming back to Michigan and they're coming back to other states and they're coming back to our country and they're going to make America great again. That's it."
    },
    {
      "text": "(:48) And to that end, I'm announcing today that upon taking office, I will formally notify Mexico and Canada of my intention to invoke the six-year renegotiation provisions of the USMCA that I put in. That was the hardest thing I had to get. They didn't want that. They wanted to have it long, but I wanted to because there's always little tricks they want to play. I said, \"Nope. I want to be able to renegotiate in six years, otherwise we're not making the deal.\" And I got it and it's coming due very soon."
    },
    {
      "text": "Ooh, I'm going to have a lot of fun and that'll address these concerns and it'll also seek strong new protections against trans shipments so that China and other countries cannot smuggle their products and auto parts into the United States tax-free through Mexico to the detriment of our workers and our supply chains. (:41) They smuggle this stuff in. They don't pay anything. We're going to have very strong language on that. It's not hard once you know about it, but nobody, no politician knows about it."
    },
    {
      "text": "And when they signed the NAFTA deal, there were some mistakes made. Typos, like typos. There were mistakes made and they were going to take care of it the following day. 30 years later, they said whatever happened, like mistakes like on the numbers, which were always against us. Nobody ever did anything about it except me. I terminated NAFTA. That's a pretty big thing. A lot of people said it would be impossible to do. I got it done and we have a great deal."
    },
    {
      "text": "Now what we have to do is make it much better even and we'll be able to do that very shortly, but while I have the build it in America plan, Kamala Harris has the build it in China plan. (:33) This is really a build it in China plan. She's going to destroy our country. Her plan is so stupid. Every policy she has rewards companies for shipping jobs overseas. Most significantly Kamala is a giant tax hiker. The tax queen they call her is demanding a shocking, I don't even know."
    },
    {
      "text": "To be honest with you, after watching her on 60 Minutes and on watching that horrible statement that she made, they call it a word salad. I don't really like those words because it was really worse than that. (:05) But after watching that, I don't think she's interested in 33. I don't think she has any idea what's happening. Okay. I think she's dumber than hell, and we've had enough of that for four years. We're not going to have it any longer because we're not going to be a country if we have it."
    },
    {
      "text": "You will see that. You've got to see, no you've got to see. And to think that a member of the media under this big press corps where they get free licensing, they shouldn't have free licensing when they do that and they change her answer, they take it out, throw it away, and put in a totally different answer in order to protect her and they get caught. CBS should lose their license. They have a license. (:56) They have a license, which is worth billions of dollars and they pay nothing."
    },
    {
      "text": "All of these networks, they're all crooked as hell. You saw that with ABC. They go after me, not her. They go after JD. How good is JD doing? Isn't he doing good? They go after JD, but not this character, this character that calls himself a knucklehead. I've never seen that in the debate. He said, well, he said knuckle. I don't want to say I'm a knucklehead because I say, well, I'm not quoting him. They'll say, Trump just called himself. That's how crooked they are."
    },
    {
      "text": "So I say, well, actually, it's amazing that he calls himself a knucklehead. Normally I'd say, he calls, so I don't want to do that because if I say that, they're going to say, see, Trump called himself a knucklehead. No, I don't call myself a knucklehead. I call myself somebody that wants to make our country great again. Very simple. (:52) The tax queen is demanding a shocking 33% tax hike on all domestic production."
    },
    {
      "text": "That means that everybody's going to leave our country and go to another country where they can pay 15, 16, 18, 19%. It's very simple. It's not that complicated. She wants the largest capital gains tax, largest gains tax. Think of this in the history of our country. She even plans to tax unrealized capital gains. Think of it, unreal. Think of what that means. It's an unrealized gain and she wants to tax it. How do you do that? Okay. She wants to tax, and a lot of people are rich, but they have no money."
    },
    {
      "text": "They have good land or they have something or they put all their money into their business because they want to have a business that's going to get better and better and grow and grow, but they're rich, but they have no cash. (:44) Now they're going to have to go out and borrow a lot of money to pay a tax. They're going to have to get good appraisers. They're going to have to get a lot of accountants. The only one going to make money are appraisers and accountants and lawyers."
    },
    {
      "text": "But those people, they're all going to leave. They're all going to go to other countries. So if a company succeeds, it must give a lot of its value to the government. And if it doesn't succeed, the government doesn't take any risk. They don't lose, but they do lose really because they lose all those jobs and all of those important things. If the tax queen gets her way, every company in the United States will leave. I mean, they're going to leave. They're not staying here. There's such competition for companies."
    },
    {
      "text": "(:25) It's like a basketball player, a baseball player, a football player. There's a lot of competition. No different, just bigger numbers. Altogether Kamala's $4.1 trillion dollar tax hike is projected to reduce GDP by 2%, raise the typical family's taxes by at least $3,000 a year, lower wages by 1.2% and kill at least a million full-time jobs. Other than that, I think it's quite a good plan. It's just crazy. I will not let that happen to our country. I will keep your taxes low and your job numbers high."
    },
    {
      "text": "That's what we're going to do. We're going to have the highest job. We had the highest job numbers in history in my administration. We're going to make that look like peanuts. The theft of our company's factories, jobs, and wealth by foreign countries is over. We are not going to allow it to happen anymore. And many of those who left will be coming back and they're going to be coming back fast. (:26) They want to come back. They want to come back. I produced that with the money."
    },
    {
      "text": "We took in, hundreds of billions of dollars came back into our shores once I made that change on the tax law, which had to get approved by Congress, believe it or not. Next to reduce costs for both manufacturers and consumers, I will remove 10 old regulations for every new regulation. Every time we put on a regulation, we cannot put it on unless, and I did that and that's what gave us, we had it up very high. We had about seven to one it turned out and we had it up high."
    },
    {
      "text": "Now we're going to bring it up to a newer level, a higher level, and I will start by terminating Kamala's insane electric vehicle mandate on day one. It's killing our car industry. (:15) Kamala's EV mandate is killing the US auto industry. It requires that within just a few years, 67% of all new cars and trucks must be electric, and it doesn't work for trucks at all because of their weight. Their payload. Doesn't work at all. And because they can't go far."
    },
    {
      "text": "I was with the truckers recently because they came to see me because they don't know what to do. They say they want us to go all electric with trucks. And I was with one man who was a giant in the industry, older guy, very smart, just like 29,000 trucks, 29. I said, \"What the hell? 29,000.\" He said, \"Yes, sir. And I've been buying trucks for 50 years and every single damn year, those trucks got bigger and better and more efficient and more beautiful."
    },
    {
      "text": "They could carry more payload, they could do, every single year and then we put apartments on those trucks.\" He called it an apartment. So the cab where they put these things where they can live. He said, \"And those damn apartments now are so beautiful that you'd love to live in one of them.\" And he said, \"I don't know.\" (:34) I'm going to leave Mar-a-Lago and move into the back of a truck. But it's beautiful. I can think of worse things to be honest with you. It's sort of cool, right?"
    },
    {
      "text": "Travel all over the country. But he said, \"They get better.\" So then I said, \"Well, what's wrong with the electric?\" He said, \"If we go from New York to Los Angeles, we have to stop six times and you'll never find a charger.\" But assuming you had chargers, which you won't have, they built as you know, big story, eight chargers someplace in the Midwest. They spent $9 billion. This is like a gas pump with electricity in it. Right. Boom. They spent $9 billion and three of them don't work."
    },
    {
      "text": "Now, if you did the whole country at that rate, it would cost you $10 trillion, 10 trillion. But they said, we have to stop six times and they're long stops, much longer than fill it up like a tank. (:39) He said, \"With a big load of diesel, we can get all the way and we can even start coming back without a stop. And the truck gets lighter as you go along.\" The other thing he said that people don't know is that an electric truck would be two and a half times heavier because batteries are very, very heavy."
    },
    {
      "text": "And that would mean you'd have to rebuild every bridge in the United States of America because they're not designed for that kind of a weight. So every bridge in the United States would have to be rebuilt. And also he said a couple of other little problems. He said, \"The battery is so big, it would take a lot of our payload. Would lose 40% of our payload."
    },
    {
      "text": "Would have to have battery in there instead.\" I said, \"So when you tell them this, if you're a child and somebody said that, you'd say, okay, let's think about it in 10 years or 20 years from now.\" (:26) Doesn't work. He said, \"We tell them and they said, we don't care. You're going to order all electric truck.\" This is like a dictatorship. These people are sick. Now they want to make our army tanks all electric. I save the army tanks up in Ohio where they make them."
    },
    {
      "text": "And because I hated the fact that they were closing it. When I was president-elect, I got called from the great Jim Jordan, congressman from Ohio in Lima. They have a plant that manufactures the army tanks. They were going to close it. And I looked, I went there. The complexity, the talent, the people they had working there was incredible. And I said, \"We're not closing this plant.\" And now it's the number one producer. It's incredible."
    },
    {
      "text": "But now they want to make army tanks that are electric because they want to go into a country and blast the crap out of it in an environmentally friendly way. (:21) No, these people are crazy. And the problem is the electric battery is so big and so heavy that it would have to be in like a wagon that a child pulls behind the tank. They'd pull in a battery, and it would have to be, and it doesn't work. They want to make everything electric. And yet, think about it."
    },
    {
      "text": "They want to make everything electric, but and I'm a big fan of electric. I think it's great. There are certain applications. I mean, Elon Musk endorsed me powerfully. Okay. We love him, and his product is incredible. In fact, he's doing a new product today. It's got no steering wheel on it. Do you know that he's out in some place announcing a new product with no steering wheel. I said, \"Well, that wouldn't be for me, but is that really the future?\" He knows. I'm giving him full credit. (:12) I think he's incredible."
    },
    {
      "text": "He gave me the most powerful endorsement. He was in Butler with us the other day. You probably saw that and it was great. He said, the whole country. He said, America will never survive if Trump doesn't get in because he knows the alternative. It's two people. It's like the alternative is not acceptable. He's a strong guy, smart guy, brilliant. But among other things, he does the Tesla and it's great, but it doesn't mean that everybody has to have that. And I tell a story about him. I'm very close to him."
    },
    {
      "text": "I have a lot of respect for him. I think he respects me. He gave me the strongest endorsement you could ever get. But he never once came up to me and said, \"Could you stop knocking electric cars?\" Because I don't knock them. I think they're incredible, but it's for a group of people. (:56) I love them. I think they're great, but it's for a certain group of people where they might work even better, but not everybody, because some people want to go long distances. They will cost more."
    },
    {
      "text": "You have the fact that they probably are going to be made in China. Remember this? I said, we have more oil and gas, we have more liquid gold under our feet. So why would we do the batteries? Where China has that, we have liquid gold. So we want gasoline-propelled cars. But it's even worse than that because Kamala also co-sponsored a bill to impose a 100% ban on the sale of all new gas-powered cars and trucks."
    },
    {
      "text": "So she's going to ban them, which would kill an estimated 200,000 US auto jobs, including almost every job that you have in a place called Michigan. How do you like that idea? (:53) She has a ban. She has a ban where not going to allow them to be made. And honestly, for some app, like I'm telling you about the army tanks, I'm telling you about trucks. The battery's not going to work. It's not going to work. The electrics are just not going to work. Maybe in 20 years, 30 years, who knows, but it's not going to work."
    },
    {
      "text": "What it will do is drive our country into a depression. The entire industry would go to China for the making of these all electric cars and trucks. The auto industry would be non-existent or dead. It will be dead. It will never be able to survive. This is one of the major reasons why I've been overwhelmingly endorsed by the rank and file membership of the Teamsters, including 62% of the Teamsters members right here in Michigan. They rank and file of the Teamsters nationwide, the firemen, the policemen."
    },
    {
      "text": "The policemen, we have 100% of the policemen. I don't think there's one police person and the whole country that endorses lunatic, I don't believe there's one policeman in the country. (:03) We just got a 400,000 group of police, the Fraternal Order. It's the biggest group in the country, but we've got just about every sheriff's group, every law enforcement group, is because we're going to stop crime. She's not going to stop crime. She wants open borders."
    },
    {
      "text": "She wants people to pour into our country and destroy our country and to move into your little towns and cities and your big towns and cities too, and destroy our country. She wants open borders. They put a little trap out there a couple of months ago. They made it a little bit tougher, but they didn't stop airplanes from flying in with hundreds of thousands of people coming into our country. They're destroying our country. We can't let it happen. The rank and file of the UAW members are also with us too."
    },
    {
      "text": "(:54) If you go to the UAW, the autoworkers, they're for us also. Shawn Fain, who I never met, the head of the United Auto Workers, did a tremendous disservice to the people he represents by allowing the government of the United States to put out an all-electric mandate. Because after I terminate the mandate, my first day in office, I will terminate it on my first day."
    },
    {
      "text": "We will go back to making electric cars, gasoline-propelled cars, hybrids, and anything else that comes along at the time, probably hydrogen, I'll do without because when they blow up, you are unrecognizable. I don't like that. The hydrogen car, they keep talking about hydrogen. The problem is when it has a problem, it blows up violently. So the beautiful woman sitting in the fourth row, you'd never recognize her again, and somehow I don't want to be able to. I'm not going to buy one of those suckers."
    },
    {
      "text": "I don't care how good, if they say they're really working quite well now, that's not going to be good enough. (:58) But they talk about hydrogen. Who knows? The EV mandate is also a costly disaster for working families to comply with Kamala's quotas. Auto makers are forced to jack up the cost of gas-powered vehicles artificially to push consumers toward the very expensive electric alternative. So they're going to raise the prices on one to subsidize the other. That's not a good thing."
    },
    {
      "text": "So Kamala gives rich people $7,500 tax breaks to buy luxury electric cars. A lot of people don't know that yet she makes the working class pay more for a entry-level car that's powered by gasoline, which we have so much of. And I will reverse this also, this injustice on day one. (:47) Kamala's EV mandate is one of the most demented regulations that's been conceived. I mean, we have a lot of them, but this is about as bad as it gets. It'll destroy US auto manufacturing immediately."
    },
    {
      "text": "It'll destroy our trucking-based supply chain, destroy our electric grid, destroy our military, destroy our roads and bridges with vehicles that are far too heavy. We can't even use them. Destroy the state of Michigan and it'll totally destroy our middle class. That's why I will not only repeal the federal mandate, I will also stop California from imposing any state-level mandate to ban gas-powered cars, and it's very simple to solve. Vote for Trump and the gasoline engine will be here for a long, long time."
    },
    {
      "text": "They're going to be here for a long time, and they've it to a point where it gives very little pollution, very little. It's amazing what they've been able to do, but it's what people want. It's much less expensive. It's what people want. (:52) The next part of our effort to bring back domestic manufacturing will be to restore the power, confidence, and the wealth of the American consumer. We have to let them be wealthy again. We have to let them make money, not give money like they did. That's also..."
    },
    {
      "text": "Energy, what their stupid energy policies caused inflation, but also the fact that they gave so much money away. That was a very bad thing to do. They thought they were going to buy people's votes. Well, they've already spent that money and they paid for it actually more so because of the cost of inflation for them. (:28) Over the past four years, Kamala's inflation catastrophe has cost the typical family $29,000 in price hikes. So inflation has cost them $29,000. New and used car prices are up over 29%."
    },
    {
      "text": "Average interest rates for new cars has doubled and tripled and quadrupled. Meanwhile, repair and maintenance costs are up 32%. Car parts are up 22%. Car insurance premiums. What's going on with that? Some places it's up 100% and the cost of gasoline is up 62%. By driving up prices and interest rates, Kamala's inflation disaster sent car payments way up and car sales way down. Your numbers are terrible by the way. (:13) For the first time ever, the all in cost of car ownership is now over $1,000 a month."
    },
    {
      "text": "Never been anywhere near that. More than 20% of the median workers' wage just to have an average car. This is a catastrophe for the American dream and a dire crisis for American automakers. One of my top priorities will be to quickly defeat inflation and make America affordable again. We will quickly defeat it. We have to bring down prices. I will cut taxes slash regulations, curb wasteful spending, and unleash energy production. It'll all happen very quickly."
    },
    {
      "text": "This will rapidly drive prices down, lower interest rates, I think so. Speaker 2 Like a bullet to the ear. I have parents that were great. You have good parents, I believe in that theory it helps. But I did, I have two parents that were energetic. They lived for a long time. They were around for a long time. They were great people. But my father had tremendous energy and my mother did too. And it's a little bit that I think more than anything else. And I enjoy what I do and I love this."
    },
    {
      "text": "Despite I could be right now in the most beautiful ocean on the sand, exposing my really beautiful body, so beautiful to the sun and the surf. Skin cancer right? To the sun and the surf all over the world. Or I could be in Detroit with you and I'd rather be in Detroit with you. Speaker 2 Well, I'm fortunate in that they're smart children. Many of you have smart and some will have some that aren't so smart. And you have to understand it happens too, and that's all. And you're going to love them just as much."
    },
    {
      "text": "But I have smart children and they've been good academically, et cetera, et cetera. But very importantly, I would always tell them, \"No drugs, no alcohol, no cigarettes, no drugs, no alcohol, no cigarettes.\" And they'd go out and Ivanka would say, \"Dad, stop telling me that.\" I said, \"I'm going to tell it you every time I see you. I'm going to drive you wild with this. No drugs, no alcohol.\" And I would say that, and I hope that because who knows, they don't have any of those problems."
    },
    {
      "text": "I've seen friends, very smart people, they have smart kids, but their kids get hooked on drugs or they get hooked on alcohol. (:39) Alcohol is in many ways... They tell me, I don't know. I never had a glass of alcohol. I had a great brother, a brother who was a wonderful guy, but he had an alcohol problem and he started to do the same. He said, \"Don't ever drink alcohol.\" And he smoked. And I put cigarettes in that same category, almost that same category, but they're certainly not good for you."
    },
    {
      "text": "But I would always tell my kids, because I've seen parents that had brilliant children, went to the best schools, they were great, but they got hooked on drugs or alcohol and they never made it. They couldn't compete basically. They never made it. And many of them are dead. Many of them die. They die with this fentanyl that's coming in. I'm going to get that problem... I had that problem almost solved with President Xi, by the way."
    },
    {
      "text": "And I said, \"You have to impose the maximum penalty or we're not going to...\" I would always talk about trade. We have the power of trade. And I said, \"Well, we're just not going to get along on trade.\" (:40) Hence, I could do things like we talked about. I don't want to go into it, but we can do things. And he and I had a handshake on he was going to impose the maximum penalty on people that run companies that sell us through Mexico."
    },
    {
      "text": "Almost all of it comes through Mexico and the maximum penalty is the death penalty. And he was going to impose that. And then we had the transfer of power and this guy came in and he didn't know what to do with anything. And so that went down the tubes. But one of the first things I'm going to do is talk to him about that because they were going to give the death penalty to anybody sending fentanyl into this country. And that would've really solved a lot of the problem."
    },
    {
      "text": "And the other thing I say, and it's not nice to say, I don't like saying it, but I've seen a lot of countries, I deal with all of them and I know all of them, and the only ones that don't have a drug problem are the ones that have the death penalty. (:34) We can set up all of our blue ribbon committees. Everybody calls me."
    },
    {
      "text": "You would call me, my friends call me, \"Could I be on that blue ribbon committee?\" And then have a blue ribbon committee on drugs and how to stop these drug lords who are very smart people, very vicious, very smart. And we'll have these people from New York, some dilettantes, and they didn't want to talk about it. They just want to be a part of whatever it is. The only ones that stop drugs, the only ones are the ones that have the death penalty."
    },
    {
      "text": "And you have to remember, it sounds horrible, but what's more horrible is what they do to our country. Because on average, he or she, male or female, drug dealer will kill 500 people. And that doesn't include the families that are devastated. I know families that lost a son or lost a daughter, they've never been the same, they're like different people. You talk to them and they just... Years later, I say, \"Has it gotten better?\" \"No, it's gotten worse,\" they tell me."
    },
    {
      "text": "(:36) And there's nothing worse than that and nothing worse than that. And it's because of drugs. Maybe it's too much for the people to go with. But I will say this, the only countries that solve their drug problem, China, I went to President Xi, I said, so... First time I met him, I said, \"Do you have a drug problem?\" \"No, no, no, no, no.\" 1.4 billion people. \"And why don't you have a drug problem?\" He says, \"Death penalty, quick trial.\" What's a quick trial? The dealer is immediately put on trial."
    },
    {
      "text": "They don't have nine years of legal and then another nine years of appeals, 22 years later and then they're released. No, no, they don't play games and it's a tough deal. But he said, \"Quick trial.\" I said, \"What is quick trial?\" Immediate trial? And you know what the drug dealers do? They say, \"Hey, let's get the hell out of here fast.\" They don't play games. They don't play games. They even send the bullet to the family and they make them pay for the bullet. They make them pay for the bullet. (:51) It's vicious."
    },
    {
      "text": "But they have no drug problem with 1.4... They had a drug problem for centuries with the poppy fields, with all the things, but countries were taking them over that were much smaller. They were being decimated because everybody was... They had a tremendous drug problem. But it stopped years ago and it was a death penalty. And I can tell you, we could set up all the committees, blue ribbon and every... Headed by so-and-so a society person from Madison Avenue. But I will tell you that it's a waste of time."
    },
    {
      "text": "The only thing that's going to stop... And we got it down. I got it down 19%, that's great. But it's not like... I got it done. And we worked like hell. We had so much security in the border. We had the German Shepherds. There's a certain dog, a certain type of German Shepherd, so they have millions of dollars worth of machinery. And they have a dog. And it's a certain German Shepherd. Some of you know what it is. It has a sense of smell that's so incredible that the machine is nothing by comparison, nothing."
    },
    {
      "text": "(:02) And it's incredible to see, incredible. But we watched it very closely on the border. We had a lot of dogs that did this incredibly well and had a lot of very expensive machinery that did it good, it's not great, but they did it good. Not nearly as good, believe it or not. And we had it down about 19%. And that was it. It was very tough. With a death penalty you would get rid of, you would eradicate drugs in this country. And I talk about it a lot."
    },
    {
      "text": "I say that because maybe people have to get used to it because it sounds harsh, but when you think of it, if they do kill on average 500 people... Everybody in this room knows a lot of people that they lost a child or sometimes a father or mother, but they've lost a child to fentanyl. And that wouldn't have happened if we had the death penalty. But the country's going to have to tell us that they're ready for it because it's a pretty big step. Speaker 2 It's got to change. It's got to change fast."
    },
    {
      "text": "Also, the Abraham Accords, when we did that, nobody believed it. We had four very important countries early on, and we would've had all of them in. I even make the statement, I said it the other day. I even think we would've had Iran in if you can believe it. I really believe that because they were ready to make a deal. Biden lost an unbelievable opportunity, and now they're very rich. And I don't know, they view it perhaps differently, but I wouldn't necessarily say they're doing so good either."
    },
    {
      "text": "But I will tell you this, we have to have peace throughout the world. And if we don't have peace throughout the world, we're not smart people because it doesn't make sense. I've stopped a lot of wars from starting. I was very proud of that. People don't know, but there are countries that were going to war, and I stopped them using trade to stop them. I used trade. I threaten trade. I'd say, you're not going to do business with the United States if you do."
    },
    {
      "text": "(:28) There's countries that have been fighting for centuries essentially and stop. And then they go and kill a lot of people, crazy but I've stopped a lot of people. But the Abraham Accords were very important. And you had really peace. You had the Arabs and the Jews getting along, and those are for the four countries. Now, it should have been many countries right now, it's still the same four."
    },
    {
      "text": "Think of it, when I left, we were going to sign people as fast as you can think, and they could have done the same thing, but they didn't have the talent. They didn't have the administration to do it. And they even agreed it was a good thing. It was a good thing. It was actually a great thing. If I were named Obama, I would've had the Nobel Prize given to me in 10 seconds. He got the Nobel Prize, he didn't even know what the hell he got it for. Remember he got elected. (:20) Well, so did I."
    },
    {
      "text": "He got elected and they announced he was getting the Nobel Prize. Remember? He said, \"Oh, what did I do?\" He didn't know what the hell he did. He got the Nobel Prize for doing nothing, for getting elected, but I got elected too. Think of that, we did something, the Abraham Accords unprecedented. Nobody thought it was possible. And I'm not saying I want or not, I'm just saying if it was anybody else, Liberal, Democrat, they would've had it before the damn thing was even signed."
    },
    {
      "text": "There has to be fairness and I don't care about... I'm not looking for it. I'm not politicking for it. I'm just saying that there's a lot of unfairness in this world, and I think when you do things, you should really be... You can have peace in the Middle East. You can get along. This was a start. This would've been so important if you could have had almost all of the countries and maybe even Iran. Iran would be the outlier, but maybe even Iran."
    },
    {
      "text": "(:24) At a certain point, I really believe I could have gotten them all, including Iran. Everybody would've been happy. You would've had peace in the Middle East and you would've had the Arabs getting along with the Jews and the Jews getting along with everyone else. It would've been so beautiful, and they wasted this great opportunity. It's so sad. Speaker 2 I've met some people backstage who are young and some really beautiful people, great people, smart as can be from colleges and schools."
    },
    {
      "text": "And I think what I'd do is I'd listen to the speech I made and I'd say maybe... Because they really would like to stay here. They grew up here. And I'd follow, and I will say this, if I implement and I will be able to do it, I will. If we win the election, I would stay right here and I would follow the gravy train because you're going to have such a great opportunity right in the area that you want to be."
    },
    {
      "text": "You want to be here because your grandparents are here and your parents are here, and people they don't want to leave. They've been forced to leave this area because of politicians that didn't know what they were doing. I would say stay tuned for a little while. (:51) Let's see what happens on the election. This area will be thriving, like probably almost no area in the country. I think this area will be one of the hottest areas in the country."
    },
    {
      "text": "And I think you can stay here, you'll get a great job because we're going to have a lot of opportunities right here in Michigan. And you want to stay here because of your parents. Lot of them really, they told me backstage, \"I'd love to stay here, but there's no real jobs here.\" And when you look at those horrible statistics with the auto workers and with what's happening to the industry, you understand it. But if we win, I would stay here and you watch what's going to happen, you'll be happy."
    },
    {
      "text": "You'll be happier here and I think more successful here than any other place in the country. You will have the American dream. We have to bring back the American dream. You don't even hear that statement anymore. And we have to have the American dream for our young people and have it right here in Michigan. Speaker 2 I knew you were going to say that. Speaker 2 That's great. Speaker 2 I don't want to get them involved. Speaker 2 You should be proud of it. Speaker 2"
    }
  ]
}