{
  "speech_id": "347",
  "speaker": "Trump",
  "title": "Trump Rally in Reno, Nevada",
  "date": "20241013",
  "url": "https://www.rev.com/blog/transcripts/trump-rally-in-reno-nevada",
  "topics": "Economy, Government Policy",
  "num_segments": 79,
  "content": [
    {
      "text": "So, a very big hello to Reno, we love Reno, and hello to Nevada. It's great to be back in this beautiful state with thousands of proud, very, very hardworking American patriots. Thank you very much. Nice crowd, big, beautiful crowd. We always have a good crowd in Reno, we love it. Before we begin, I want to send our love to all of the people back east who are recovering from two really devastating hurricanes. Our hearts are with those who lost a loved one, and we are with you all the way."
    },
    {
      "text": "We're getting it straightened out, and we need better help from a thing called the federal government. We need better help from, I guess you could say, from Kamala. They've been very bad. They've been, in particular, bad to North Carolina and other parts that were really devastated really bad, but we have to get them on the ball a little bit. God bless them all, God bless you all, thank you very much."
    },
    {
      "text": "() 25 days from now, we are going to win Nevada, we are going to defeat Kamala Harris, and we are going to make America great again. From the very beginning of this journey, I have been on a mission to rescue our nation from a failed and corrupt political establishment, and it is corrupt. And to give you back the country that you believe in, the country that you were born in, and the country that you deserve, and we're going to do it."
    },
    {
      "text": "In that mission, I will never quit, I will never bend, I will never break, I will never yield. Not even in the face of death itself. Won't happen. () As you know, I'm putting everything on the line to fight for you, and I am also only asking you for one thing: vote. Get out and vote. Early mail-in voting is underway in Nevada right now, so return your ballot today, vote Republican at every level, and go. And we know that you're going to vote for Trump and we're going to make America great again."
    },
    {
      "text": "We're going to turn around our country so fast. () Yesterday, it was announced that inflation surged viciously again last month, coming in at a much higher number than anticipated. Your food prices went way up, higher than expected. Your rent and housing costs went up much more than expected. Your car prices went through the roof. Yet Kamala Harris has no plan to fix it. You ever hear her? She goes, \" No, we did everything wonderfully.\" That place is falling apart. Then she's got ideas."
    },
    {
      "text": "\"I know what I'm going to do.\" Why didn't she do it three and a half years ago, right? Kamala has already cost the typical family $29,000 with her horrible inflation and the cost of inflation. Yet she said, this week, when asked the question, that she can't think of one thing she could do differently, right? So, you know what? Take a look at the video. We're going to talk about that. Take a look. Not one thing. Take a look at this. So, that answer, that she would do nothing different, is totally disqualifying."
    },
    {
      "text": "Our country is in crisis. We don't need four more years of gross incompetence, radicalism, and failure. We need strong leadership. We're going to change it. We're going to do such a great job. Your head's going to spin. Your head is going to spin. It's time for the people of Nevada to tell Kamala Harris... Does anybody know the name Harris? If you say Harris, everybody says, \"Who the hell is Harris?\" That we've had enough. We can't take it anymore. We're not going to take it anymore. Kamala, you're fired!"
    },
    {
      "text": "Get out of here. Get the hell out of here. Get out of here. So bad, the worst we've ever had. () Look, he's the worst president in the history of this country. The worst. And she's the worst vice president. And she's actually worse than him, okay? We defeated him, and then now we have to defeat another one. I shouldn't have defeated him, it would've been just as easy. Think of it. I spent $150 million to beat him. And then we had the debate, and then everyone said he's out of there, so they got him out."
    },
    {
      "text": "It was a coup, you know, it was a coup. He hates Kamala more than he hates me, in my opinion. And that's a lot. And the problem is that she's actually less competent than him. And that's hard to believe, actually. () With your vote in this election, we will quickly defeat inflation and we will make America affordable again, because you have such a problem. On day one, I will unleash... We will unleash American energy, and I will cut your energy prices in half, 50%. I'm going to cut them."
    },
    {
      "text": "Within 12 months of taking office, we're going to cut them in half. We're going to cut them down 50. You know why? Because we have more liquid gold under our feet. I don't have to deal with other countries. All I have to do is say, \"Let's go.\" We're going to have very large tax cuts for workers, and especially to help the hard-working people of Nevada. We will, listen to this one, no tax on tips, no tax on overtime. No tax on tips, think of that. No tax on overtime."
    },
    {
      "text": "That's why we're going to win, and service workers in Nevada, they love Trump, and I love you too. Take a little look at this. Everybody take a look at this. I'm Donald J. Trump, and I approve this message. What do I know? But this has to be the tipping capital of the world. In some places, I say, \"No tax on tips.\" So we get, \"Nice.\" Here, I was in Las Vegas two weeks ago, I said, \"No tax on tips.\" The place went crazy. So, you're the same thing. But also, no tax, think of it, on overtime."
    },
    {
      "text": "You do a lot of overtime, and that's a big thing. () And for those of you who are seniors, now I wouldn't know about that because I'm not a senior. Michael, am I a... No. I'll be a senior, what, another 10 years? 15 years? No, look, for the seniors, think of it, you've been destroyed on fixed incomes with inflation. They have destroyed you because of energy and because of the way they spent, like so stupidly on the Green New Scam. But you've been destroyed."
    },
    {
      "text": "And now we have no tax on Social Security benefits for seniors. And we owe that to you. What they've done to this country. () But I keep saying, still the most important, the border. We can talk about inflation and it's horrible, we can talk about it. But they let 21 million people in here, and many of those people, murderers, drug dealers, gang members, people from mental institutions. To me, I watch... They say that the biggest thing is the economy and inflation."
    },
    {
      "text": "And the second-biggest thing is the border and immigration. I think it's maybe the other way around. Wait, we do a free poll. Ready? Which is bigger, ready? I'll go border first. Border and immigration? Pretty big. Or the economy and inflation? I've been saying that. In 2016, I won because of the border, and I made it so good. It was so good. Within two months, we had the best border, and that was it. And then I could never talk about it. My people said, \"Sir, they don't want to hear it."
    },
    {
      "text": "You fixed it.\" But the problem is this border is 20 times worse. What they've done here is crazy. They either hate the country or something's going on. () My message to every service worker in Las Vegas and Reno is this: if you vote for me, inflation will end, your taxes will be cut massively, your wages will skyrocket, your savings and pensions will soar, and your retirement will be more prosperous. You're going to be so much more prosperous. You're going to be more secure, you're going to be safer."
    },
    {
      "text": "You're going to have a much better life. Just vote for me, let's get it over with, okay? Much better life. Much better life. () Under Kamala, it will be massive inflation, massive layoffs, massive tax hikes, and- ... massive misery and depression. Depression. Kamala Harris will kill the American Dream. That's what she's doing. And for your children, they don't have a dream with these people. These people- Look, she's a Marxist. A lot of people don't know what a Marxist is, so let's put it simply, she's a communist."
    },
    {
      "text": "We're not going to have a communist leading our country. She's a communist. She's also known as the taxing queen, she loves taxes. This is the first time I've ever seen, I've been doing this stuff a long time, only for a short time on this side, but I became president, but I've been doing it for a long time on the other side, writing checks, so I can contribute to guys like Senator John Cornyn of Texas and all."
    },
    {
      "text": "But I've never seen, ever, all these great politicians are over here, where somebody's campaigning on massive tax hikes. She's campaigning, \"We will raise your taxes.\" And some people, they're not the smartest people, but they, \"Oh, thank you very much.\" I've never seen it. I've always heard politicians say, \"We will cut your taxes.\" Sometimes they don't mean it, but they say it. But these people openly say that they're going to raise your taxes. Let's give her credit for one thing."
    },
    {
      "text": "It's probably the only thing she's honest about. She's going to raise your taxes at levels never seen before, and she's going to drive out all the jobs in the country that I created. Her plan will raise taxes for the typical American family by at least $3,000 a year. Watch this tax video, you have to watch this. I'm Donald J. Trump, and I approve this message. () So, she's looking to increase your taxes, the biggest economic disaster it will be in American history. I will deliver."
    },
    {
      "text": "And I'll tell you what, we're going to show you some things pretty soon that are going to be amazing. What we've done, compared to what they've done, we've had the most successful presidency ever. They had a disaster. They've had a disaster. The biggest inflation ever. We talk about the senior citizens. The only reason I did that for the senior citizens is they've been devastated. It's been taken away from them. Everything's been taken away because of their inflation."
    },
    {
      "text": "So, I'll deliver the biggest economic boom in American history. It's going to be the biggest. Take a quick look. Can you see what that says? But let's get back to business, because who the hell cares what it says? Look at that. I love the unrealized capital gain. In other words, it's an unrealized gain, but they're going to tax it anyway. That's a beauty. That'll be the first in history."
    },
    {
      "text": "() And in Detroit yesterday, we had a great day in Detroit, because we announced we're bringing the car industry back at levels never seen before. And we're going to make interest on car loans fully tax-deductible, because affording a car is essential to restoring the American Dream. We're going to restore the American Dream."
    },
    {
      "text": "To bring jobs and factories and wealth racing back to the United States, we'll have a 15% made in America corporate tax rate, cutting the tax from 21 to 15, but only for those who make their product in... Remember this, I'm the one that got it down from almost 40% to 21. Everyone said that was impossible. That led to a job boom, the biggest boom we've ever had in this country, and the numbers were great. But it was better than competitive, it was good, but it wasn't the best. Now I'm bringing it down to 15."
    },
    {
      "text": "But only if you manufacture, if you make your product, in the US. How good is that? Right, Michael? You have to make it here. () I had one of the top Wall Street guys call me. They said, \"Who the hell gave you that idea? How simple is that?\" You've never heard anything like, \"If you make your product here, you get a lower tax.\" You don't hear it. It seems so simple, like the paper clip. Some guy made the paper clip a long time ago and everybody looked and said, \"Why the hell didn't I think of that?\" Right?"
    },
    {
      "text": "And for those who don't make their product in America, they'll be forced to pay a stiff tariff for the privilege of competing with our cherished companies that we are going to protect, because they're stealing our jobs, our treasure, our wealth. And we will take in hundreds of billions of dollars to benefit American citizens in pay. We are going to pay off debt."
    },
    {
      "text": "We're going to reduce your taxes still further as an individual, we're going to reduce them, and we will be at a level of prosperity, it's called growth, that we haven't seen in 60 years. () Her? You're going to have a 1929-style depression. And remember, you know the hat, it says Trump was right about everything? I really was right about it. I was right about everything. You're going to have a 1929-style, not recession, depression."
    },
    {
      "text": "My pro-American trade policies are one of the major reasons why I've been overwhelmingly endorsed by the rank-and-file membership of the Teamsters, including 60% of the Teamster members in Nevada. Can you believe that, huh? Where are the Teamsters? Do we have any Teamsters? Are you guys... They're breaking down doors. They're collecting the rent. Isn't it nice? They just come over from Venezuela. They are collecting the rent. And you know what the landlord said? Whatever you'd like, sir. You'd like to collect my rent?"
    },
    {
      "text": "Whatever you want. No, they're actually going around collecting the rent from now and you... Let me tell you, if I were president now, those guys would be out of here before you left this room. Send them back. We're sending them back. But they're shooting people. They're smashing jaws, breaking skulls. Watch this video. You're not going to believe it. Speaker 6 These are our new citizens. These are the new people."
    },
    {
      "text": "These are the people that we have coming into our country and we're now known as, and all throughout the world as an occupied country. We're an occupied country. Can you believe? And they have, a lot of people, if you think about it, 21 million, not including the Got Aways. You know what a Got Away is? Those are the people that just run and nobody knows who the hell they are. But we have 21. Think of this, 21 million people, 13,000 murderers to be exact. 13,099 murderers, the biggest drug lords in the world."
    },
    {
      "text": "They got them all out of Caracas, Venezuela. Do you know that Venezuelan crime went down 72%, because they put all their criminals into the good old USA. () We are not going to stand for it. We're an occupied state that refuses to let our great law enforcement professionals do the job that they so dearly want to do. The law enforcement wants to do the job. They really want to do the job, and they're not allowed to do the job. They want to do it so badly, they're so good, but they don't want to lose their pension."
    },
    {
      "text": "They don't want to be fired and lose everything, lose their family, lose their house. But to everyone here in Nevada and all across our nation, I make this vow to you. November 5th, 2024 will be Liberation Day in America. Liberation day. My teleprompter, people doing a great job though. Thank God I don't use teleprompters too much. These people, they do a great job. I look at the teleprompter, it's totally gone. I say, what the hell happened? The sign fell on top of it, but I can level with you. Did you see her?"
    },
    {
      "text": "Now here's the good thing. Isn't it nice to have a guy that doesn't need a teleprompter as president? A potential president that doesn't need a teleprompter. When you use a tele, it gets very boring when you use one. But how about her? That was 32 days left. And her teleprompter, a teleprompter goes bad a lot. If you rely on a teleprompter. In other words, if you're like Biden where he couldn't function without a tele, he couldn't function with a teleprompter."
    },
    {
      "text": "But if you need a teleprompter like to do like she did, it was just announced, did you see the picture? () She did a town hall using a teleprompter. You can't do that. No, think of it. You're walking around you. There's no tele. She's reading a teleprompter. It's following, oh, it's terrible. You can't have her as your president. You can't have her as your president. But did you see where she was 32, it was 32 days. So she's going and I'm watching her, I say, what the hell's wrong with her? She goes, 32."
    },
    {
      "text": "And the teleprompter went down. She meant 32 days till the election. So she goes, 32, 32, 32, 32, 32, 32. I said, what the hell is wrong with her? I called the first lady, I said, first lady, what the hell is wrong with her? 32. And then thank goodness for her, the teleprompter kicked back in. But usually it doesn't kick back in. Usually it doesn't. You got to be out there."
    },
    {
      "text": "I would say 5% of the time, if you want to do this professionally, if you want to run for president someday, no matter how good you run, because I have a guy, Gabe, he's excellent. I've had some real bad ones, but I have Gabe, some of the bad ones, they go so fast. I will go and I say, slow the damn thing. No, a good one is really like gold, but I don't use them that much because I find it's very boring. The concept I use, but I don't like it."
    },
    {
      "text": "But if you can't, if you want to run for president, you have to assume that 5% of the time, even if you have good people, you're not going to have a teleprompter. For instance, when you do outdoors, I was with Bernie Marino, he's doing very well for the Senate and I think he's going to win in Ohio. He's got a chance and I'm way up and I went out and I didn't want to do it because I said, the weather's too bad, but that's okay. I did it. () We had 45 mile an hour winds. This is in Ohio."
    },
    {
      "text": "That's like, I thought we were in Scotland actually. And the teleprompters were bending because they're not strong, they're bending, they're going over. And that didn't matter because within about two minutes they blew off the stage. Ir actually blew away. And we had 50,000 people. I'm standing there like this. I didn't have any notes. Nothing. And you know what? He won the election. Thank you very much, President Trump, he won the election."
    },
    {
      "text": "() And other than a few people that saw the things flying away, they flew away beautifully. Nobody even knew. So anyway, no, there's something wrong with her when you can't get up and make a speech. Normally with all the work we do, you think you could, for 40 minutes, well, she makes very short speeches too. Do you ever notice? They're like 10 minutes. It's ladies and gentlemen, I'd like to thank you. My name is Kamala and she'll speak so routinely. And I hate the word, they had word salad, the words, words."
    },
    {
      "text": "I don't like the sound of it, but it's true. She just like, they're just words. They're put together. They don't mean anything. How the hell can we have a person like this to be our president? It's crazy. () But I will round up the illegal alien gang members and they will be put in jail or thrown out of our country until not a single one is left. And we're going to call it Operation Aurora, if you don't mind. Okay. Because they were the first. And this is happening all over the country by the way."
    },
    {
      "text": "If they come back, it's an automatic 10 years in jail with no possibility of parole, because we don't want them to come back. They got to stay out. And I'm hereby calling for the death penalty for any migrant that kills an American citizen or a law enforcement officer. Thank you very much. No, we have to do that. We have to do it. They're violent people. These are violent. Remember when Kamala said, people that come into our country are far less likely to commit a crime? Really?"
    },
    {
      "text": "The fact is they make our criminals look like very fine people, and that includes our murderers. They are very fine people by... These people make us look like a bunch of babies. Okay. And we are getting them the hell out of our country. They're destroying our country. They're ruining lives. We're getting them out. Kamala's open border policy will destroy Medicare and social security for seniors because they're stuffing them there. They're putting them everywhere, but they're stuffing them in."
    },
    {
      "text": "She led in 21 million people and wants to make them all citizens. She wants to make them citizens because there's no way, there's no way of telling. They have no records, they have no anything. () They let them in. Totally unvetted. Everyone's coming in, the murderers and whoever. She wants to have them come in and then they can loot, they can plunder. They can take everything that you've made in your life. They can destroy your lives. They can kill you. They can hurt you. She wants to make them all citizens."
    },
    {
      "text": "It's crazy. It's crazy. Remember we're the party of common sense and you know that doesn't work. A new study released this week found that if Kamala gets her way, illegal aliens will drain Medicare and social security to the tune of $2 trillion. In other words, they'll be useless. They'll be worthless. You won't get your social security worth. She'll kill it. And she has no idea, economically with finance, she has no idea what the hell she's talking about. They asked her a simple question."
    },
    {
      "text": "When they asked her the other question that was a disaster, because she said, yes, I'll change a lot of things from Biden. And then she gets in trouble because he hates her so much and said, what do you mean you'll change? So now they're fighting. () So she doesn't know what the hell's going on. He's angry. Her people want her to say she'll have nothing to do with Biden because he's a disaster. And then she wants to say that she's okay, but Biden doesn't want that. So they go back and forth."
    },
    {
      "text": "This poor woman doesn't know what the hell is happening. I will protect Medicare and Social Security with no cuts. We're not going to have any cuts and we're not going to raise the age. She's going to raise the age by seven years on social security. We're going to have no cuts whatsoever. And we didn't have any. And there'll be no benefits for illegals by the way. Already Kamala is ransacking Medicare to pay for the Green New Scam, do you know what the Green New Scam is? She actually wants $93 trillion."
    },
    {
      "text": "Think of this. That's bigger than our budget for... 93. You know who made it up? AOC plus three. () We said, did you go to college on the environment? No. Do you have anything to do? This is AOC. Do you have anything to do with the environment? No. No, but I've decided that this is the way it is. All buildings in New York are going to be ripped down and new buildings are going to built without windows because you see a window is environmentally unfriendly having to do with the heat, the gases, and the sunlight."
    },
    {
      "text": "The ideal building is tall, thin, with no windows whatsoever. It's a hard sell. If you can get somebody to buy it, you can sell anything. That's the only thing. Now they have the craziest thing I've ever... But the total cost is $93 trillion. So if you add us, China, every other country in the world and gave us about 40 years, we might be able... These people are crazy. They're destroying our country. They use it almost as a method of hurting us and hurting our country. And some countries laugh at it."
    },
    {
      "text": "China laughs at it. () Kerry goes over there on his private jet, lands, meets with President Xi. We don't want you to use coal anymore. Oh, okay, we'll work. We're going to start working. In the meantime, he's building a coal plant a week. Oh, we'll work on that. Kerry goes, he promised he'd work on it. He promised. What a fool. No, it's so embarrassing. These people are very streetwise. They're brilliant people, and they're at the top of their game."
    },
    {
      "text": "We have a man that 30 years ago wasn't at the top of the game and she's worse. I'm telling you, she's not as smart as Biden. Watch. And you see it now. And she's fading rapidly in the polls. The only reason she was okay is because nobody knew who the hell she was. They said Harris. Who the hell is Harris? Nobody knew who she was. And now they're learning that she's a communist. We're learning that all sorts of bad things about her. () She's further left than Pocahontas. Do you know Pocahontas?"
    },
    {
      "text": "Remember when they wanted me to apologize to Pocahontas? I said, I'll do it because I destroyed her presidential campaign. She was leading for president and then she said she was an Indian. Why are you an Indian? I worked over the french fry bin. You know what I'm doing next week? I'm going to a McDonald's to work because if I work there for 10 minutes, I will have worked there longer than her. (:20) In many ways, I don't like that because it's so basic. But there's something beautiful about it too. It's so simple."
    },
    {
      "text": "She said she worked at McDonald's, meaning I worked so hard. It's hard work. She worked at McDonald's. It turned out to be a lie. She's a liar. That's why I call it lion. That's why I call her lion. I had her as comrade. (:42) Okay, here's another poll. Who likes Comrade Kamala Harris? Comrade meaning sort of a communist thing or who likes lion? Let's do comrade first. Who likes comrade? Comrade Kamala Harris. Lion Kamala Harris. I guess that's the end of that one."
    },
    {
      "text": "(:10) But with you vote this November, and I did three of them today. I did a little one, a little tiny one with a small group. And then I did a really big one. I did a big one and I did this one. And I'm still raring to go. They say, \"How the hell do you get through all of them, how do you get the energy? How do you get that energy?\" But I love doing it. You know why? Because I see it. We're making so much progress. We're exposing her for what she is an, incompetent communist."
    },
    {
      "text": "And people aren't going to have that because we don't have a choice if we don't win this election. (:49) There are those people that say, you'll never have another election if we don't win this one. That could be possible. Look at Venezuela. Look at so many places. It sounds far-fetched. It's not at all. Look at what's happened in just three and a half years. Look at what's happened to our country in three and a half years. We have to get out. We have to win this election."
    },
    {
      "text": "(:07) But with your vote this November, we are going to defeat these radical left country destroyers and we are going to finish what we so brilliantly started. We had it going so good. (:17) On day one I will close the border. I will stop the invasion of illegals into our country and we will begin the largest deportation operation in the history of the United States, we have no choice. (:39) The illegal migrants coming into our country are taking the jobs of American citizens."
    },
    {
      "text": "But you know what they're really taking? The jobs of Black and Hispanic workers. They're taking the jobs. Black community, Hispanic community is being decimated by what's happening. They're coming in and they're taking the jobs and what's going to be next? Unions are, they're going to be next. (:04) They're going to take a lot of union jobs away. They're going to take jobs away, period. But the Black community, -- saw the bad numbers last week. They were terrible. They've gone down. And you know why?"
    },
    {
      "text": "Because they're hiring people. Well, you had a job. You had a job for years, and now all of a sudden somebody else is taking the job. And it's also affecting the Hispanic people. And my numbers with the Black -- and especially Black men. I love Black men. I love them. I love them. I have gone through the roof with Black men, Black men. I don't do quite as well with Black women, I must say. I don't know why, but I'm sure that'll work out too. I do appreciate it. I do. (:51) And we're doing unbelievably with Hispanic..."
    },
    {
      "text": "The Hispanic population is going to come, incredible. We will quickly become energy independent as we were before, and make America the dominant energy producer in the world by far. We will frack, frack, frack and drill, baby drill. Get our prices down. (:17) And we will terminate the insane mandate demanding that you have to have all electric... Everybody has to have an electric car within a very short period of time. That goes for trucks and everything else. You know the truckers, it doesn't work."
    },
    {
      "text": "The battery is so heavy. Do you know that a battery for a truck is so heavy that you'd have to build, rebuild every bridge in America because they can't hand away? (:41) That doesn't affect these people. The other thing is you'd have six stops between New York and Los Angeles. With diesel, you'd have none and can even come back 10%, okay? You'd have none. Think of it. And it takes up a lot of payload. (:56) But think about it. It's much heavier. The battery's very heavy, right? Very, very heavy."
    },
    {
      "text": "You would have to rebuild every bridge in America because it's not designed for that kind of a load. Can you believe it? And I said to this gentleman, one of the big truckers, one of the biggest, maybe the biggest in the world, I said, \"Have you told them that?\" \"Yes.\" What did they say? \"We don't care. We want you to build all electric,\" and he ain't doing it. (:19) I'll tell you he's not doing it. I said, \"How many trucks do you have?\" He said, \"29,000.\" I said, you got 29,000? How big are they?"
    },
    {
      "text": "They're all 18 wheelers. Is that what it is? The big ones are 18 wheelers?\" And he said, \"You must be very rich.\" He said, \"I'll tell you what, they're going to try and make me poor.\" He said, you know he said something interesting. (:38) He said, \"Sir, I've been buying trucks for 50 years and every year they get better, more efficient, stronger, bigger, better looking. And now we even build beautiful,\" He called them an apartment."
    },
    {
      "text": "\"We build beautiful apartments behind that cab and they are beautiful.\" This guy loves trucks, and they are beautiful, \" Sir. Honestly, you'd be proud to live in one of them.\" (:04) And I said, \"How about the first lady? You think she'd love it?\" I don't know. I don't know if she'd love it. I can handle it. I don't know if she would like it. (:19) I don't know if she, by the way, go buy her book. Her book is great."
    },
    {
      "text": "I was a little nervous when I read it because I said, \"I wonder if she's going to be hitting me hard.\" No, she was very nice. Otherwise, I wouldn't recommend it. It's very simple. No, go buy it. It's great. It's number one. Number one bestseller. (:43) I will stop outsourcing and turn the US into a manufacturing superpower working with Elon Musk, we will slash a record amount of government waste. He's good at that. That's what he wants to do. He doesn't want to be a secretary. He doesn't need it."
    },
    {
      "text": "He's got rocket ships all over the place. He is going, he's a wild man, I'll tell you. (:03) But you know what he wants to do. He said, \"I can cut costs trillions of dollars and nobody will be even affected. And our country will be back in great shape. Between that and charging countries that come in and plunder and steal. We'll have a country that's a machine."
    },
    {
      "text": "We're going to make a beautiful machine, and then we're going to take all that money and pay off debt and help people that are not in good shape and sick and old and tired.\" But he wants to do that. He doesn't want anything. He doesn't want a title. He just wants to say, \"Look, there's so much waste and abuse and fraud.\" You ever hear the expression, fraud, waste, and abuse, right, levels that you wouldn't even believe?"
    },
    {
      "text": "(:44) You know when I cut the price of Air Force One, I bought it, \"Sir, it will be 5.8 billion dollars.\" I said, \"Nope, I'm not doing it.\" I was supposed to walk in and sign it, because I said, \"Who negotiated the contract?\" They said, \"Barack, Hussein, Obama.\" I said, \"Well then it's too high.\" They said, \"Why do you say that, sir?\" Because he negotiated it, it's too high. And I said, \"It has to have a three.\" You know that story."
    },
    {
      "text": "So I waited, waited, waited, Boeing, and then finally they said, \"Oh boy,\" because they thought they had... So think of it, if I didn't do that, they would've made 1.7 billion dollars. (:20) I said, because they ultimately cut it down to 3 billion, 999 million 99999 and 99 cents, one penny. I says, \"It's got to have a three in front.\" This had a five, and a 5.7. So I said, \"Let me ask you a question. So if I didn't come along, you would've made 1.7?\" Same exact plane, right? Except I had a much better paint job."
    },
    {
      "text": "Much nicer. It's true. It was red, white and blue the way it should be. (:50) It wasn't baby blue, it was blue. Not that little baby blue. But no, I did a great job on it. But I said to the head of Boeing, I said, this was before the two planes went down. This is before the problem. So Boeing, Boeing was considered maybe the greatest, but certainly one of the greatest companies in the world. And now they've suffered a lot."
    },
    {
      "text": "(:12) But this was before I said, \"You mean if I didn't come along, you would've made 1.7 billion dollars on this?\" Actually, it's two planes you know. Air Force One is actually two planes, two identical planes, 747s. \"You would've made 1.7 billion?\" He said, \"Well, we have course,\" they would've tried. The answer is they would've made 1.7 billion. So Elon's actually, right, because they shouldn't make that kind of money on it. But I got them down 1.7 billion dollars."
    },
    {
      "text": "It took about two months of not returning phone calls. (:45) I will end the war in Ukraine, stop the chaos in the Middle East and prevent World War III. I will crush violent crime and give our police the support, protection, resources, and respect they so dearly. They dearly... Look, you know that they dearly deserve it. We're going to give our police their respect back. (:12) They want to do the job. No, but think of that with all the criminals that are being put in all over the world."
    },
    {
      "text": "This is not just South America. We mentioned Venezuela, but it's all over the world. (:25) Crime is down all over the world. Prison populations are down all over the world. They're delivering into the United States, mental patients, prisoners, killers, drug dealers, gang members, criminals, street criminals, they're all here. They're all going to be here soon. (:47) We're not going to allow it to happen. Not going to happen. We will strengthen and modernize our military."
    },
    {
      "text": "We'll build a missile defense shield, all made in the USA, and we will not have a woke military. Watch this, watch this, watch this. You'll like this. It may not be politically correct, but we won two world wars. We won two beautiful big, ugly wars and we are in a woke mode. Look, I defeated ISIS in a matter of weeks. It was supposed to take years, and those people did it. And I had great generals. Not the guys you see on television that don't know what the hell they're doing and they are woke."
    },
    {
      "text": "(:18) But the military, you could take these military guys that we have and put them into a woke cage. They call it a woke cage, scream at them for two years about wokeism, and they come out and they want to beat your ass. We have very tough, smart, great military. We have to take care of our military though. (:41) We gave billions and billions of dollars of it to Afghanistan, to the Taliban. We didn't have one soldier killed in 18 months. They were going along killing our soldiers."
    },
    {
      "text": "And I made a phone call and the fake news. That's a lot of fake news back there. Look, the fake news, that's a lot. That's a lot of cameras. (:06) It's amazing when I watch and I see those red lights, when the red lights are on, and sometimes I'll point to them and as soon as I start pointing, those lights go off so fast. (:16) We will lead the world in space and reach Mars before the end of my term and we will rebuild our cities, including our capital in Washington D.C."
    },
    {
      "text": "Making them safe, clean, and beautiful again. (:28) And I will support universal school choice, very important. And we will get critical race theory and transgender insanity the hell out of our schools. (:42) And we will keep men out of women's sports. I will defend the Second Amendment, protect religious liberty, restore free speech, and we will secure our elections. (:10) Under the Trump administration we will put American citizens first, American children first, American patients first."
    },
    {
      "text": "You cannot get into a hospital, by the way, because the migrants have all of the beds. You cannot get into a hospital. You cannot get your kids into a school because the migrants there that don't even speak the language. It's unbelievable. They're giving, because of Biden and Kamala, they're giving precedence over your children who've been in that school. Is it not even thinkable? (:43) I will put American taxpayers first."
    },
    {
      "text": "American workers first, and American communities first, and we will put communists and Marxists and fascists last. We're going to put them last way down at the bottom, and they will always be last. (:01) We will defend our territory. We will not be conquered. They're trying to conquer us. Think of it. These guys are walking in with guns that are more sophisticated than our military has. They have no money. They come in from different parts of the world and they have better guns than we have."
    },
    {
      "text": "(:19) There's something going on, but I'll get to it very quickly. It's going to end. It's going to end unpleasantly for them. We will reclaim our sovereignty and I will give you back your freedom, your life, and your country. (:34) Everyone will prosper, every family will thrive, and every day will be filled with opportunity and hope. We're going to bring back the American dream. But for that to happen, we must defeat Kamala Harris and stop a radical left agenda once and for all."
    },
    {
      "text": "(:57) We want to a landslide that is too big to rig. Too big to rig. And again, early mail-in voting is underway and you have to get out there and do it and get everyone you know to vote because all, I mean, think of this, after everything that we've been through, we've been through a lot together, right? Hey, these are vicious, horrible people. I call it the enemy from within. (:22) We stand on the verge of the four greatest years in the history of our country."
    },
    {
      "text": "If we win this election, we're going to have the four greatest years in the history of our country. (:35) With your help, from now until election day we will redeem America's promise. We will put America first and we will take back the nation that we love. November 5th will be the most important day in the history of our country, and together we will make America powerful again. We will make America wealthy again. We will make America healthy again. We will make America strong again."
    }
  ]
}