{
  "speech_id": "371",
  "title": "Donald Trump Leaked Unedited 60 Minutes Interview Transcript",
  "date": "20201022",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-unedited-60-minutes-interview-transcript",
  "topics": "Economy, Gun Control, Government Policy",
  "num_segments": 55,
  "content": [
    {
      "text": "You're going to be fair. Just be fair. No, I'm not looking for that. I'm looking for fairness. That's all. Yeah. No, I'm not. Well, I'm going to be fair. You don't ask Biden tough questions. It's terrible. It's terrible. You know that. Okay. Are you ready? Because we've done a great job and it's not finished yet, and when I finish, this country will be in a position like it hasn't been maybe ever. The economy is already roaring back and other people aren't going to bring it back."
    },
    {
      "text": "Certainly the person that we're dealing with is not going to bring it back. They're going to raise taxes. They're going to take away your second amendment. They're going to do things that nobody would even believe. It's radical. There's never been anything like it. No, we are- ... positioned like never before. We're going to have a fantastic year next year. Well, ultimately let me, and I'll tell you, it was happening."
    },
    {
      "text": "We created the greatest economy in the history of our country and the other side was having- It is totally true. Best unemployment numbers, best employment numbers, 160 million people working, highest stock market price. You wouldn't say that to Biden, what you just said to me. If he had it, you would never say that to Biden. We had the best stock market price ever, that we're getting close to that price again. We had the best ... Everything was the best."
    },
    {
      "text": "Our companies were doing better than they've ever done before. You cannot even think about talking about that. Well, you don't have to fact check me. I mean, excuse me. The stock market was at its highest, the unemployment numbers for African-Americans, for Asian Americans, for Hispanic Americans, for everybody were the best. Virtually every number was the best. We had the best economy ever. And what was happening is things were coming together- Well, I'm going to say that."
    },
    {
      "text": "And the other side was starting to call, let's get together. There was going to be unity. And then we got hit with the plague and we had to do it again. And we closed it up and I saved millions of lives. Millions of lives we saved. And now the economy's growing again at record numbers. 11.4 million people employed in the last short period of time. The priority now is to get back to normal, get back to where we were, to have the economy rage and be great with jobs and everybody be happy."
    },
    {
      "text": "And that's where we're going and that's where we're heading. I would say China. They're an adversary. They're a competitor. They're a foe in many ways, but they're an adversary. I think what happened was disgraceful. It should never have happened. They should never have allowed this plague to get out of China and go throughout the world. 188 countries. It should never have happened. What's wrong? Speaker 3: () The flag is wobbling I think because it's under those vents, perhaps behind you, Tom?"
    },
    {
      "text": "Speaker 1: () His hair's coming down a little bit. It doesn't look nice blowing in the wind? Let's go. I don't think so at all, no. I think we've done a great job with COVID, and we've hired- Excuse me. 11.4 million people. Why? Because the last report was just a little bit off? And this is without- Okay. You know why cases are up also? Because we do more testing. If we didn't do testing, cases would be way down. No, what I'm saying to you, Lesley, is the following."
    },
    {
      "text": "We do more testing than any country in the world by far. Second is India with 1.5 billion people. We do more testing. If we did half the testing, we'd have half the cases. If we did no testing, like many countries, we would have very few cases. Because we do so much testing, the fake news media loves to say cases are up. The fact is we've done a very, very good job. We have done ... That's right because we're doing so much testing."
    },
    {
      "text": "Yes, cases are up because we are doing tremendous testing and we're finding where there's a problem. Testing is a good thing, but it's also very misleading. That's right. We have turned the corner now. We have turned the corner. We have turned the corner. We understand the disease. We understand the elderly and we're taking care of them at a level like nobody's ever taken care of the elderly, especially the elderly with diabetes problems, heart problems."
    },
    {
      "text": "We are taking care of them like nobody's ever taken care of them. We also understand youth, 99.9%. As an example, Barron had it and it was gone in no time. It was just like he had it, it was gone, hardly knew he even had it. So we are taking care of our people, but we've done a great job with the ventilators, with the equipment, with stocking governors that were not stocked. We made a lot of governors look very good that shouldn't look good, and that's okay with me. Yeah. Oh, I didn't say that."
    },
    {
      "text": "You know, that's so misleading, the way ... I say jokingly suburban women, you should love me because I'm giving you security and I got rid of the worst regulation. See, the way you said that is why people think of you and everyone else as fake news. I said kiddingly, suburban women, you should love me. I got rid of a regulation that would bring low income housing into suburbia that would destroy suburbia. And I said that in a joking way. The way you have it, it's like I'm begging. I'm kidding. Play it."
    },
    {
      "text": "And I'm kidding. That is such a misleading question, Lesley. I doubt it. I doubt it. I really doubt it. I'm saving suburbia. He's going to destroy suburbia. He's got a regulation, which I terminated, that he would put back and even worse that will destroy, that will bring low income housing projects into suburbia. And women understand that. And they've really learned about it over the last two, three weeks. I terminated the worst regulation you could possibly have. It's gone, and suburban women appreciate it."
    },
    {
      "text": "They want security. They want safety. Look, I've been endorsed by almost every police department, almost every law enforcement group in the country. He's been endorsed by almost nobody. Suburban women want security. You're not looking at recent polls. We are rounding the corner. We are rounding the corner. We are rounding the corner. We're rounding the corner. We're doing well. We're doing well. We understand the disease. I saved millions of people. 2.2 million people were supposed to die."
    },
    {
      "text": "You go back and you look at your models, 2.2 million people. We saved tremendous numbers of people. Plus I closed it very early from China, heavily infected, and even from Europe heavily infected, we've done a good job. We've done maybe a great job. What we haven't done a good job on is convincing people like you because you're really quite impossible to convince, but that's okay. And the economy now is coming back and it's coming back very strongly. And people see that, Lesley."
    },
    {
      "text": "Lesley, we just picked up 11.4 million jobs. It's the largest number in the history of our country in a short period of time. Lesley, you didn't hear me. We just picked up 11.4 million jobs in a short period of time. It's the largest number in the history of our country. What I'm saying is we got hit by something, not my fault, not your fault. We got hit from something that came out of China. I got stuck with it."
    },
    {
      "text": "And let me tell you, before it happened, we were doing so good and now we're going to be doing, and we are, we are doing good. And that we're going to be doing, and we are, we are doing good. But look at, as an example, last week, a few days ago, Gallup did a poll. 56% of the people said that they'd better off now during a pandemic, then they were doing Obama and Biden, 56%. It was a record number, right? No, I don't ignore it. What I'm saying is that we got hit with somebody, it's not our fault. We got hit- ..."
    },
    {
      "text": "and we've done a good job, not a good job. We've done a great job. Remember that number, a very important number, 56% say they're happier now than they were four years ago under Biden and Obama, right? I'll put his name first, Biden and Obama. And they didn't have a pandemic. Although, Biden did have a big problem with H1N1, which he says in reverse, with the H1N1, swine flu and it was a disaster. And his own chief of staff said it was a total disaster. They didn't know what they were doing. Dr."
    },
    {
      "text": "Fauci, when did I call him an idiot? When did I call him an idiot? Well, he's been wrong a lot. I like him, but he's been wrong. Well, Dr. Fauci originally said, it's a very complex subject. Let me just tell you, you mentioned ... Dr. Fauci said, \"Don't wear masks.\" Then he said, wear them. I say that ... I feel masks possibly work, but certainly you want to stay away a certain distance, socially distance, et cetera. But I would say a mask works and I have nothing against masks. And I tell people to wear masks."
    },
    {
      "text": "I have no problem. A lot of people are wearing masks and they're outside. Take a look. Yesterday, we were in Arizona, record setting rallies, numbers of people like nobody's seen before. Many, many masks, I watched. What, what? No, these are much bigger than I ever had. You're so negative, you're so negative. These are the biggest rallies we've ever had. You just come in here with a negative attitude. These are the biggest rallies we've ever had. We're having numbers like we've never had. There is a more ..."
    },
    {
      "text": "excuse me, no, but you made a statement. There's more enthusiasm right now for us than we ever had before, ever. And you will see that in a short period of time. A lot of people are wearing masks. I mean, I looked yesterday, a lot of people were and it's outdoor. They want it outdoor and we're doing it outdoors. I tell people to wear masks. Lesley, we hand out thousands of masks. Well, have you been looking yesterday, take a look yesterday in Arizona, everybody behind me had a mask on. Right, right."
    },
    {
      "text": "A lot of people had masks and it was outside. Okay. What's your next question, Lesley? We're outside. The rallies are bigger than they've ever been. There's more enthusiasm than we've ever had. There has never been anything like what you're witnessing now and you'll see that soon. You commented on the size of the rallies. You said they're not as big as they used to be, and I'm telling you they're much bigger. Lesley, we handed out masks to everybody that comes to the rally. We tell them to wear the masks."
    },
    {
      "text": "Oh, I don't know, Lesley. I have no problem, no problem. Next question, go ahead. I hope you're right. Go ahead. Go ahead. Yeah. It will be. It is developed. It is fully developed. It's going to be announced very soon. When we see what happens with Obamacare, which is not good. And when we see what happens with Obamacare. And it will be much less expensive than Obamacare, which is a disaster, and it will take care of people with pre-existing conditions. No, they're won't."
    },
    {
      "text": "We will make a deal and we will have a great healthcare plan- ... with less expensive, less expensive, and a much better plan. You have seen it. I've been putting out pieces all over the place and we actually have plans. And we have 180 million people right now have a plan. And you haven't been watching, you haven't been watching. Are protected, will be totally protected. They'll be protected, Lesley. I mean, the people with pre-existing conditions are going to be protected- ... as they are now."
    },
    {
      "text": "In any plan we do, they will be protected [crosstalk :42]. Lesley, people with pre-existing conditions would be always protected, always. We're going to have to see what happens, it's got a ways to go. I mean, we'll see what happens. I think it'll end ... I hope that they end it. It'll be so good if they end it. Because we will come up with a plan, which will be- Yeah, we will. We have large sections of it already done."
    },
    {
      "text": "And we've already come up with plans, take a look at your various secretaries, various plans that we've already come up with. And also, a large part of this country has private health insurance, 180 million people. And under that, Biden, he doesn't have any clue, but under that 180 million people will lose their health care. And they'll go to socialized medicine, and that's not going to be acceptable. 180 million people Lesley, will go to socialized medicine. It won't be ... it will not acceptable."
    },
    {
      "text": "Then we're going to have a new, and we're going to have new and it's going to be very good. And it's going to- We've come with many plans, Lesley, and they're already in existence. I'll tell you what, after this interview, I will show you short-term, longer term. I'll show you different plans. We've come up with many plans. And we got the individual mandate out. The individual mandate is gone. That was the worst part of Obamacare, that's gone. Right. No, no. It's wrong. It's wrong."
    },
    {
      "text": "A new plan will happen- And we won't do anything ... will and is. We won't do anything and no plan, unless we have pre-existing conditions covered. And the individual mandate, which you don't want to mention was terminated. It was terminated. Individual mandate was terminated. That is the biggest thing that's happened. And that actually makes Obamacare not Obamacare. Because under that, you would pay a fortune for the privilege of not having to pay for bad health insurance."
    },
    {
      "text": "We got it terminated, terminated through the legislature, signed, done. That means Obamacare is no longer Obamacare. We got rid of the most important element of Obamacare. And it was the worst element of Obamacare that nobody wanted, nobody liked. So Obamacare essentially was terminated as we know it. Now we have the carcass of Obamacare- We managed it well. Lesley, we've managed it well. I had a choice to make, when we got rid of the individual mandate, nobody believed we could do that and I did it."
    },
    {
      "text": "I had a choice to make. Do I manage the remainder of whatever's left of this whole thing called Obamacare, which is no good, do I manage it well or manage it badly? If I manage it well, politically, maybe that's not good [crosstalk :03]. I decide- Politically, maybe that's not good. I decided to manage it well. No, I don't want to leave it, I want to see what happens. Here's what happens. We may be stuck with it if we lose in the Supreme Court, in which case, we're wasting a lot of words."
    },
    {
      "text": "If we win, we will come up with a much... And we will do that. Come up with a much better healthcare for much less money, always protecting people with pre-existing conditions. No, you're only trying to... I wish you would interview Joe Biden like you interview me. It would be so good. You know what? I don't mind it, I don't mind it. But when I watch him walk out of his store, he's in the midst of a scandal, his family is corrupt, okay? He's corrupt. He's a corrupt politician. And he's walking with ice cream."
    },
    {
      "text": "And the question the media asks him, what kind of ice cream? What flavor ice cream do you have? And he's in the midst of a scandal. Of course he is, Lesley. Of course he is. See that? You're like big tech, you protecting him. And everyone is, except for a few people. Lesley, let me ask you. You think it's okay for the Mayor of Moscow's wife to give him millions and millions of dollars, three and a half million dollars, to give his family three and a half?"
    },
    {
      "text": "Do you think it's okay for Hunter Biden to say that we're giving the big guy 10% of this massive amount of money they're taking? Do you think it's okay for all of these horrible things that you've seen, where they're getting hundreds of thousands, and millions of dollars, where China gives them a billion and a half dollars to manage, the family, a billion and a half dollars, and then he's supposed to negotiate? Let me tell you, it's the second biggest scandal."
    },
    {
      "text": "The biggest scandal was when they spied on my campaign. They spied on my campaign. Of course there is. Is it's all over the place. Lesley, they spied on my campaign and they got caught. You won't put it up because it's bad for Biden. Lesley, they spied on my campaign. It's been totally verified. Just go down and get the papers. They spied of my campaign, they got caught. And then they went much further than that, and they got caught. And you will see that, Lesley."
    },
    {
      "text": "And you know that, but you just don't want to put it on the air. Okay. So why don't you get back to your interview and let's go. I said that jokingly, that is sarcastic. Nobody likes me, it must be my personality. I say it all the time. Nobody likes me, it must be my personality. I say it all the time, Lesley. No, I think I wouldn't be here if I didn't have social media, because the media is corrupt. In my opinion, the media is corrupt."
    },
    {
      "text": "But the media is fake, and frankly, if I didn't have social media, I'd have no way of getting out my voice. Yeah. I don't have to discredit you. You've discredited yourself. Lesley, you've discredited yourself. When you say that you're not going to cover Biden, you're going to ask him what flavor ice cream he has, okay."
    },
    {
      "text": "Instead of, \"Why did Hunter get three and a half million dollars from Moscow?\" Instead of, \"Why is an energy company paying your son $183,000 a month, or whatever they're paying him?\" And he has no experience in energy. You discredit yourself. I don't have to discredit you. I don't know anything about that. I just know it's a laptop and they haven't- I don't know about the two gentleman you mentioned. It's a very important issue to find out whether or not a man is corrupt, who's running for president."
    },
    {
      "text": "Who's accepted money from China, and from Ukraine, and from Russia. Yeah, I think that's an important issue. It's incredible the way you can try and say this and sit there and look me in the eye and say it. He accepted money, his family, from Russia, from Ukraine, from China and from other places. His brother who didn't have experience became a big builder in Iraq, without experience. Take a look at what's going on, Lesley. And then you say that shouldn't be discussed? It's the biggest scandal out there, Lesley."
    },
    {
      "text": "I think it's one of the biggest scandals I've ever seen, and you don't cover it. You want to talk about- You want to talk about insignificant things. Of course it can be verified. Excuse me, they found a laptop. Lesley, listen. What can't be verified? Why do you say that? Even the family hasn't... The family on the laptop... He's gone into hiding for five days, he's gone into hiding. Oh, it's taking him five days to prepare? I doubt it, I doubt it. Okay, go ahead. No, I think it is what it is. Where are we sitting down?"
    },
    {
      "text": "Where are we sitting? Of what? That's right. How did I get here? How did I get here? We're in the White House. No, not the name calling. Doing the right thing, and we have a great record. I mean, we got hit by a pandemic, wasn't my fault. But it was China's fault. But Lesley, we're in the White House. The press is very biased, very, very biased. And I'm not talking about [crosstalk :47] I'm talking about... No. No, I'm not. You're discrediting yourself, Lesley. Lesley, you're discrediting yourself."
    },
    {
      "text": "When you don't go after Biden with the corruption in the Biden family. When you don't go after what happened in the Russia witch hunt, which turned out to be a total phony with no collusion, no collusion whatsoever. When you don't do that, you discredit yourself. The press is highly discredited right now, you do know that? So you discredit yourself. They were starting to, Lesley. When the economy was, just prior to the plague, they were starting to really like... We were all starting to like each other."
    },
    {
      "text": "It was coming together. There was going to be a lot of unification. I'm just telling you- People were calling me- People were calling me about coming together, and then we got hit by the plague. And now we're rebuilding it again. And it's going well. I do. I think I do unify the country, I think I will unify the country. It's called success. When our country becomes, again- I'd like not to, but perhaps everybody has to take a little responsibility for it."
    },
    {
      "text": "But when people put out phony witch hunts, when they spy on your campaign, you have to fight back. And if you don't fight back, you're not sitting here very long. You go back home. You go back home to mommy. I don't think so. It's not attack. It's defense, it's defense against attacks. It's defense against attacks. I don't think so. I mean, I don't view it that way. I'm defending myself and I'm defending the institution of the Presidency. Very important. Hi Mike, are you having a good time, Mike, watching?"
    },
    {
      "text": "You know Mike, right? Our great Vice President. You think she would ask questions like this of- No? I don't think so, either. You think she would ask questions like this of Joe? I don't think so. Yeah, I think I can. People that love our country. And people that don't want to see the stores get looted and burned down, and people that don't want to see riots, and they don't want to see anarchists. Yeah, I think I can."
    },
    {
      "text": "These are people that love our country, and they don't like to see- They don't like to see policemen get shot and not be able to defend themselves. ... didn't get shot and not be able to defend themselves. They don't like to see rioting in the middle of 5th Avenue or the middle of other streets in Portland or other places. And they like it when their President gets the endorsement of virtually every police group, and frankly, almost everybody having to do with law and order. Positive law and order."
    },
    {
      "text": "But you know what they are? They're people that love our country more than anything else, and they'd like to see our country thrive. I don't encourage them. They say it. Hillary Clinton deleted, she deleted 33,000 emails after she got a subpoena from the United States Congress. No, no. That's illegal. Why somebody doesn't do something about it- I think it's an issue. To me it's an issue. Excuse me, when they say lock her up, it's not me. They say it. It starts, it ends up being- I don't encourage it. No."
    },
    {
      "text": "If I mention her name about something, they go crazy. I don't know anything about the plot but I can- But I can tell you this, it was our justice department that is the one that's helping her. My justice department, if you call it that, It was our justice department that's helping her. And people aren't so... They're not liking her so much because she's got everybody locked down. Now we just won a Supreme Court where it's unconstitutional."
    },
    {
      "text": "The only one she doesn't have locked down is her husband who went sailing and did things that he wasn't supposed to be doing. I haven't gone after her. I haven't gone after her- I've helped her. It was our justice department that's helping her. Oh, I do criticize her, yeah. I think the way she locked down Michigan is a disgrace. The way she closed churches in Michigan is a disgrace. Yeah, I think it's disgraceful what she's done. I do. By the way that's other... Of course not. That's other governors also."
    },
    {
      "text": "They happen to be Democrats and they've closed up their states and they're causing a lot of problems with these lockdowns. Suicide, drugs, alcohol, a lot of bad things are happening and they should open up their states. Carefully, but they should open up their states. Oh, I say carefully. The governors run their states. We help them a lot, but the governors run their states. And the governors have to do what they have to do. But when they locked down Michigan, she's doing a tremendous disservice."
    },
    {
      "text": "Same thing with Pennsylvania. Same thing with North Carolina. These are Democrat governors and they're doing a great disservice. I say- I say, I'm not against masks at all- Sure I am. Wear them. Wear them. But I also say socially distance. I say all the things, but you know what? Well, look, with you, nothing I said would be any good, Lesley. That's okay. But in the meantime, we're having a record comeback because if you look, we're the fastest growing nation in the world after this pandemic by far."
    },
    {
      "text": "And we sunk less than any other nation, relatively speaking, and we're coming back very strong. Very, very strong. When did I lock her up? I never said that. When did I say lock up the Governor? I didn't say, \"Lock up the Governor.\" Why would I lock her up? No, but why didn't you say, \"You don't want to lock up the Governor?\" Of course I don't want to lock her up. Why would I lock her up? I never said it, Lesley. I never said, \"Lock up the Governor.\" Lesley, it's such a vicious that you just said."
    },
    {
      "text": "I never said, \"Lock up the Governor of Michigan.\" I would never say that. Why would I say that? She's doing lockdowns. No, I don't want to lock them up, but they certainly should be looked at. No, I don't want to lock him up, but he spied on my campaign. Obama and Biden spied on my campaign. Do you know what that is? You know what they did? Do you know how horrible it is, what they did? It's been totally verified, Lesley. You'll find out, but it's been totally verified."
    },
    {
      "text": "Oh, he probably will because I think he's a very dishonest guy and he probably will look for something. Probably will. We'll see. But you know what? Attorney General Barr has been very nice. That's all I can tell you. He's been very nice. He's been very respectful. No I didn't criticize him, it's just a different personality. They're very lucky. They're very lucky because the evidence is overwhelming and Attorney General Barr is a great gentleman. He's a great gentleman. They are very lucky."
    },
    {
      "text": "No, I can't tell you what's going to happen. I don't know- Because I purposely like to stay out of it. You know what? I don't like to get invol... I can if I want, but I don't like to get involved. But I think they've been very, very lucky. Attorney General Barr is a gentleman. Of course you did. Of course you did. Well, then you brought up a lot of subjects- ... that were inappropriately brought up. They were inappropriately brought up, right from the beginning."
    },
    {
      "text": "Your first question was, \"This is going to be tough questions.\" Well, you set up the interview. It was your first statement was- Excuse me, no, no. Listen, your first statement to me, \"This is going to be tough questions.\" Well, I don't mind that. When you set up the interview, you didn't say that. You said, oh, let's have a lovely interview. And here's what I do say. You don't ask Joe Biden. I saw your interview with Joe. The interview with Joe. It was a joke. The interview, 60 Minutes."
    },
    {
      "text": "I see Joe Biden giving softball after softball. I've seen all of his interviews. He's never been asked a question that's hard- No, but you- ... start with me. Excuse me, Lesley. You started with me. Your first statement was, \"Are you ready for tough questions?\" That's no way to talk. That's no way to talk. Speaker 3: () Lesley, one second. This is the first warning. I think we have five minutes until we have the Vice President step in, is that about right? Well, I think we have enough. Really, we have enough."
    }
  ]
}