{
  "speech_id": "372",
  "title": "Trump Campaign Roundtable in Auburn Hills, Michigan",
  "date": "20241022",
  "url": "https://www.rev.com/blog/transcripts/trump-campaign-roundtable-in-auburn-hills-michigan",
  "topics": "Economy, Government Policy",
  "num_segments": 72,
  "content": [
    {
      "text": "Yeah. And I want to thank Brian and all the people from the UAW and just autoworkers, frankly, UAW or not, just autoworkers. And they're great autoworkers up here. This is where it all began. It all began, for the world, it all began right here. And then slowly but surely, and then actually rapidly it got taken away from us, like candy gets taken away from a baby. They take that candy away from a baby so easy, and that's what they did to us."
    },
    {
      "text": "And a long time ago, I told a story where I was given the Man of the Year or something. I was given a big award and I came up and spoke, and I talked about how... This is long before I ran for politics. And by the way, the fake New York Times said it never happened. And then they found the event. They found it. Did you see that? And they said, \"Well, it never happened. There was no such award given or there was no such event.\" And fortunately, we found a newspaper article that talked about, I was up here."
    },
    {
      "text": "This is long before this, this is probably 18 or 19 years ago. And I came up and I talked about, \"Don't let them steal your jobs. Don't let them steal your automobile factories.\" But they did. I wasn't involved. I was happily in the private sector. But this is much better. This is much more important for me, because we're going to save America. We're going to save the automobile industry, which wouldn't have happened if we didn't come along. I mean, think of it."
    },
    {
      "text": "If you have all these places building these plants with China's money and other countries, I'm not looking to blame China. Other countries too. You don't have a chance. You don't have a chance. They were going to build a lot of different plants in Mexico and Canada. We have to watch Canada. But Mexico and Canada, all of a sudden you're going to say, \"What happened to our industry?\" We'll be bringing cars. You'll be a parking lot for cars that are going to be sold in America. We're not going to let that happen."
    },
    {
      "text": "We're going to make the auto industry bigger and better and stronger than it's ever been. And this community is such a big factor. I'm surprised you knew that, Brian. I'm very impressed with you. Do you have a little Arab blood in you, by any chance? I know they are. They're great people too, and they're smart and that's what we want. So it's an honor to get your endorsement. It's an honor to be here as we open up this beautiful facility. And I'm going to be seeing you a lot, Mr. Mayor."
    },
    {
      "text": "And I think there's a hell of a future, don't you think? [inaudible :28]. Fake news. I'm going to be honest now, they say every week they have a different concept for me. I'm going to be the biggest dictator in the world. I'm going to destroy the world. I'm going to... They have so many things that they've said about me and nothing sticks. Is this the new one? I'm going to come and we're going to deport... But just your community. That's good."
    },
    {
      "text": "Well, and I'll tell you what, they're also great people and they're great workers and [inaudible :27]. Thank you very much. It's a tremendous honor to be with you. And now we're going to go, we're going to make two stops and we're going to make a big speech. But this was a very important one. This is my first stop and this is in honor of the mayor, because in particular he and the [inaudible :36]. Thank you. [inaudible :25]. Speaker 2 Thank you. We'll see you at the White House."
    },
    {
      "text": "We'll see you at the opening of these great auto factories that we're going to build next yea. Thank you everybody. Speaker 2 Thank you. I heard that. Speaker 2 How good are the restaurants? Is the food good or is it great? Speaker 2 Thank you. Speaker 2 Thank you. Speaker 2 Thank you very much. Speaker 2 I appreciate it greatly. Speaker 2 I will do that. I will. Thank you. Thank you everybody. Thank you very much. Thank you, my friend. Speaker 3 It's a great honor. And it's great to be here at this opening."
    },
    {
      "text": "It's an opening and it's maybe an opening of more than just a building. I really believe it. And we all ultimately, want one thing. We want piece in the Middle East. We're going to get peace in the Middle East. I think it's going to happen very fast. It can happen with the right leadership in Washington. You have a woman running against me, she shouldn't even be running against me. She hasn't got the capability. But you have a woman running that won't get anything done. She's wishy, she doesn't know what to do."
    },
    {
      "text": "And she's a very confused person. And I think I probably would take Biden over her. I have somebody, we were talking. The mayor, first of all, it's an honor to be your friend and it's an honor for that endorsement coming from you and a highly respected man, somebody that really is respected in the community and along beyond this community. A few people said, \"Who is that guy? He's really something?\" I've got big plans for him, right? It really is, it's a great honor. And I see somebody else, Mr."
    },
    {
      "text": "Mayor, if I could, in the audience. So United Auto Workers, so many of them as you know, support me, because I'm going to bring back the auto jobs. () Whereas unfortunately, the head of the union doesn't have any clue. He doesn't understand that the electric cars are going to drive everybody back to China and we're not going to have that. And we want the jobs in your community."
    },
    {
      "text": "And you have tremendous numbers of auto workers in your community, which is something that I did not know, but I know now and I realize it. And somebody, they've written and they've called and we're going to bring the companies back. If you go back 50, 60 years, we were the king and queen together of the auto industry. Now it's been taken by China, Mexico, and so many other countries. We're going to bring them all back."
    },
    {
      "text": "We're going to bring all of those companies that left back through a series of very smart and not very expensive incentives. And we're going to then protect them, so they don't get ripped off and robbed, like everybody in our country has been over the last long period of time for many, many years. So I'd like to bring... Brian, would you come over here for a second? This man, and I've seen him for a couple of years and I didn't know who he was, but he was a Trump fan like I've never seen."
    },
    {
      "text": "And he wanted to get the United Auto Workers on our side. And he literally has 80%, a tremendous number of them on our side, because- 79. It's pretty good. I'd say it's pretty good. But we have a tremendous amount of auto workers on our side. Many of the auto workers are in your community and a lot of them are really great, I hear, very Talented. Yeah, very talented. But I'd like you to say a few words about what we're doing. And you missed the one meeting we had in Detroit, which was good."
    },
    {
      "text": "And I might say it here, because it's important. So I've been saying that Mexico's building two of the largest plants anywhere in the world and we're just not going to let it. It would literally wipe out Michigan auto business. And that would go to South Carolina to a lesser extent, because of certain reasons. But South Carolina, Tennessee, others also could be, maybe completely knocked out. I don't know. These are the biggest plants in the world. Somebody that I know very well is building them."
    },
    {
      "text": "And he told me about them a year ago and I told the mayor about them. I told Brian about them. We told a lot of people. And I've been talking about them now for over a year. () And I said, \"If we're going to allow Mexico to build these massive plants, you're not going to have any jobs. They're all going to be gone.\"They go into Mexico, they can produce so many cars out of these very modern... You press a button and the whole plant opens up. They don't have a lot of workers, but they have a lot of capacity."
    },
    {
      "text": "And so I've been talking about this now for a period of over a year. And I found out about it from a man who's the biggest in the world at building auto plants. I think he's building these two, in fact, I know he's building these two. But one in particular, is just massive. And they were getting ready to start. () And when I was in Detroit last time, I saw the gentleman, who I hadn't seen for a while. And I said, \"Let me ask you, John, how are those plants coming?\" \"So they've been stopped."
    },
    {
      "text": "They've been stopped.\" I said, \"You mean the plants in Mexico?\" Because I wanted to see a plant and I wanted to see one in the United States. He said, \"Sir, we don't make them in the United States the way they do elsewhere.\"Now, these plants were owned by China and built in Mexico near our border. They were going to just build a car and just pour them in. And you wouldn't have had any... Which Brian understood. And the mayor understood. You wouldn't have any capacity."
    },
    {
      "text": "You wouldn't have had any reason to be here and be making cars. So I heard about this and I hated it. And I talked about it for a year. It was in every speech I made on autos. And I came up three weeks ago. We spoke before the Economic Club, Detroit and I talked about it. And then I saw the gentleman in the audience and I said, \"Could I speak to you for a second?"
    },
    {
      "text": "How are those plants coming?\" \"Sir, they've been stopped.\" I said, \"What do you mean they've been stopped?\" \" They think you're going to be president and you're going to charge tariffs and it will make it economically impossible to build them. So they stopped construction [inaudible :11].\" So I didn't even tell you that, Brian. So what I've done, is I've saved Michigan, I think, because we're going to reverse it. I'm going to go back to them, I'll say build the plant in Detroit."
    },
    {
      "text": "Build the plant up here, build it in the state of Michigan. Or build it in the United States, we can handle that, right? As long as it's in the United States. But let's start over here. Maybe you make a deal and you will make a deal. I think you could make a deal right here. And we'll end up having those plants built over here instead of built in other countries. Other countries. So this plant that I was talking about for the last year, year and a half is stopped, because they think I'm going to get elected."
    },
    {
      "text": "They know if I get elected, I'm not going to let them sell cars into our country in order to destroy the rest of Michigan. You had many times the number of cars being built many, many years ago. This was a different world. And you see the empty hulks all over the place. So we're going to start that little project. We're going to get to the people, they have plenty of money, but they don't want to lose money."
    },
    {
      "text": "And they would've lost a lot of money, because I wasn't going to let any car come into the United States and destroy the Michigan automobile business [inaudible :21]. Thank you. Brian's here for you. Look at the arms of this guy. I don't know, that's got to be a lot of lifting. I don't know. I think you have it naturally, [inaudible :31]. Well, I want to thank... And I'm really in particularly proud that you are here- Because right from the beginning, you understood it, you got it."
    },
    {
      "text": "A lot of people don't understand it and it's easy to do. And I'm so happy that it happened before the election as opposed to after the election, because this is big news now. I don't know if the fake news will cover it, but this is big news now. Think of it, the biggest plants in the world were going to be built and now they've stopped. And what that would do is really hurt America and it' Polymarket, and we're, I guess at 64 to 38, 36, something like that. So that's not bad."
    },
    {
      "text": "I don't know what the hell it means, but it means that we're doing pretty well. And we're the 64, by the way, okay? Just, we don't want to be the 38 or 36. So I just want to let the Mayor know. I want to let the council members know, the three council members. I appreciate it. We won't forget it. Please, stand up. Speaker 6 Yeah, and I want to thank Brian and all the people from the UAW, and just auto workers, frankly. UAW or not, just auto workers. They're great auto workers up here. This is where it all began."
    },
    {
      "text": "It all began for the world. It all began right here. Speaker 5 And then slowly but surely, and then actually rapidly, it got taken away from us, like candy gets taken away from a baby. They take that candy away from a baby so easy, and that's what they did to us. And a long time ago, I told the story where I was giving the Man of the Year or something. I was given a big award, and I came up and spoke. This is all before I ran for politics."
    },
    {
      "text": "And by the way, the fake New York Times said it never happened, and then I found the event. I found it. Did you see that? Speaker 5 And they said, \"Well, it never happened. There was no such award given, or there was no such event.\" And fortunately, we found a newspaper article that talked about I was up here. This was long before this. This was probably 18 or 19 years ago. And I came up, and I talked about, \"Don't let them steal your jobs. Don't let them steal your automobile factories.\" But they did."
    },
    {
      "text": "I wasn't involved. I was happily in the private sector. () But this is much better. This is much more important for me because we're going to save America. We're going to save the automobile industry, which wouldn't have happened if we didn't come along. I mean, think of it, if you have all these places building these plants with China's money and other country. I'm not looking to blame China. Other countries too. You don't have a chance. You don't have a chance."
    },
    {
      "text": "() They were going to build a lot of different plants in Mexico and Canada. We have to watch Canada. But Mexico and Canada, all of a sudden, you're going to say, \"What happened to our industry?\" Because you'll be a parking lot for cars that are going to be sold in America. We're not going to let that happen. We're going to make the auto industry bigger and better and stronger than it's ever been before. () And this community is such a big factor. I'm surprised you knew that, Brian. I'm very impressed with you."
    },
    {
      "text": "Speaker 5 Do you have a little Arab blood in you? Speaker 5 I know they are, and they're great people too, and they're smart. And that's what we want. So, it's an honor to get your endorsement. It's an honor to be here as we open up this beautiful facility, and I'm going to be seeing you a lot, Mr. Mayor. And I think he has a hell of a future, don't you think? [inaudible :30] Speaker 7 Fake news. [inaudible :58] They say every week, they have a different concept for me."
    },
    {
      "text": "I'm going to be the biggest dictator in the world. I'm going to destroy the world. They have so many things that they've said about me, and nothing sticks. Is this the new one? I'm going to come, and we're going to deport, but just your community. Speaker 8 That's good. Well, and I'll tell you what- Speaker 9 ... they're also great people. They're great workers. [inaudible :22] It's a tremendous honor to be with you. Now, we're going to go."
    },
    {
      "text": "We're going to make two stops, and we're going to make a big speech, but this was a very important one. This is my first stop, and this is a honor of the Mayor because in particular, he [inaudible :38] thank you. Speaker 8 Thank you. [inaudible :30] White House. [inaudible :33] at the opening of these great auto factories that we're going to [inaudible :39] Thank you, everybody. Speaker 12 I heard that. Thank you. Speaker 12 How good are the restaurants? Speaker 12 Is the food good or is it great?"
    },
    {
      "text": "Speaker 12 Thank you very much. Speaker 12 Thank you, I appreciate it [inaudible :20] I will do that. I will. Thank you. Thank you, everybody. Thank you very much. Thank you, my friend. Thank you. Thank you. Thank you very much, everybody. Thank you. Well, it's an honor to be with you. We're doing very well in the polls, as you've probably heard. They're getting very big numbers, Byron. They're getting much bigger than even anticipated. So, I don't know what that means. That's a poll in itself."
    },
    {
      "text": "But the early voting seems to be even far bigger than we thought, and we had great expectations. People are not loving her, and why should she? She didn't show up for the big Catholic event. This hasn't happened in decades. She didn't show up. She gave a very short tape, and it was not an appropriate tape either, but she probably hasn't figured that out yet. And we should have gotten about 100% of the Catholic vote last night because I showed up."
    },
    {
      "text": "But I think we're doing very well, and we're going to find out very soon. (:04) And what I'd like to do is maybe before saying anything, I'll finalize it out, but maybe we can go through the folks, and we can see what they have to say and how you've been doing. And I know one thing. Everybody did better four and five and six years ago than they're doing now. That's one thing. That's one thing I know. So, why don't we do that? And then we can maybe say a few words. You have a great gentleman running for the Senate."
    },
    {
      "text": "He's been a friend of mine for a long time, and he's a very talented guy. It's not easy. To win these things, it is not easy. But he's doing a great job. I hear he's taking a lead. We'll see what happens. But I hear he's taking a lead. (:46) So Mike, we'll talk in a couple of minutes. How about we'll go through it pretty quick, Dale? And then I'm going over to make a little speech in front of 10,000 people. You think this is an easy life I have, right?"
    },
    {
      "text": "I go from here, I say, \"Am I finished?\" They say, \"No, sir, you have one more speech.\" \"Oh, good. Where is it?\" What is it, 20 minutes, 30 minutes away? Is anybody going? We'll get you and 10,000 people. So Dale, go ahead, please. Thank you. You're looking good, Dale. Look at the arms on this guy. He's almost as bad as my friend over here. Wow. Really? A healthy-looking guy, too. Thank you. Thank you, Dale. Well, Dale, thank you. And I just want to say, you know Sean O'Brien, right? Sean O'Brien, head of the Teamsters."
    },
    {
      "text": "He's a great guy. They took a vote nationally, and I won by similar numbers nationally. And that's an honor. I mean, that's really an honor. I think it's been many decades before they endorsed a Republican. I think they'll start very soon. But we had rank and file Teamsters all over the country by numbers similar to that. (:26) And I have some good news for you on the automobile business in Michigan."
    },
    {
      "text": "I'll wait till we finish up, maybe, and talk about it, because you were going to have a lot of competition in Mexico, and that competition's not going to happen anymore. But I want to thank you. I want thank the Teamsters also. I see another guy over there with that shirt. I can't miss him, right? Thank you very much. I appreciate it. Oh, you do, eh? Is he easy to work for or tough? Oh, wow. Wow. Well, that's good genes. That's good genes, I can tell you. I look at him. You got the best. Thank you very much. Thanks, Dale."
    },
    {
      "text": "Appreciate it. Thanks. That's true. Thank you. My all-time favorite. Thank you. Let me just say one thing about Howard. Well, thank you very much, Howard. He's being very modest, I have to tell you. This guy is one of the leaders on Wall Street, one of the most respected people in all of business. And certainly, all of Wall Street, there's nobody really like him. And he's being very modest. On that horrible day, he lost his entire firm, other than some people in Europe, a few, small group. And he saw it happen."
    },
    {
      "text": "He was driving down the West Side Highway. (:25) And he's always in the office at six o'clock in the morning, so he would've been there. This was at eight o'clock. But his wife was just so angry at him because she wanted him to take their child to school, because he just doesn't do it, and he won't do it, and he hasn't done it for years. And this was the one day that he wasn't there at six o'clock in the morning because he took his child to school."
    },
    {
      "text": "And at about 8:50, which is just as the plane was striking, he was driving down the highway looking at the World Trade Center. This was the only day in years that he wasn't in that building. And do you ever thank your wife? And do you ever thank your child? But it was amazing. There are miracles in life. We have miracles, and we have help up there, Howard, in my opinion. In my opinion. But just the end of that. So I mean, you saw this, they had the top three floors, the top."
    },
    {
      "text": "A great firm, and just, they couldn't get out. There was no way they were getting out. Some of the people were calling their wives, their family. I think you were speaking to your brother, right? Yes, speaking to your brother up there. They knew. They probably knew it was the end. And Howard sought to rebuild the firm. And he spent a lot of time, a lot of everything, a lot of effort. Most people would've said it was an impossible thing to do. And he rebuilt it bigger, better, stronger."
    },
    {
      "text": "But the big thing is he gave a big chunk of it, for a long period of time, to the families of those that died in the building. And who would do that? Who would do that? (:09) And so he rebuilt Cantor Fitzgerald into something bigger than it was, which was pretty hard to do. And there are a lot of people that love this guy. He's a special guy, a real talent, by the way. Real talent, a brilliant business talent."
    },
    {
      "text": "So he is, he's in charge with a couple of other people we have that are great, working along with him, but he's in charge of that whole transition process, which is a very important process. I love these exploding mics. Huh, do you? No, it's good for emphasis. It explodes every time. Speaker 18 Yeah, right. It explodes every time you're about to make an important point. So, it's okay. It's not bad. No. Normally, I say, \"Don't pay the guy that supplied the mics,\" but we'll pay."
    },
    {
      "text": "And then they say, \"Trump doesn't want to pay.\" But it's one of those things. But I just want to thank you for doing a great job, Howard. You really have. And we'll get on, and perhaps we can ask Nancy. How are we doing? Thank you. Good, thank you. Good. Good. Oh, thank you. Right. Yeah. You must love Bobby Kennedy, right? I think so. You sound like Bobby Kennedy to me. Great. Thank you very much. And I think you should actually set up a meeting with Bobby Kennedy and the whole group- ... because I see you're into it."
    },
    {
      "text": "You have the same fervor that he has, and so I think it'd be maybe- ... very interesting- ... for all of you. Okay? Thank you very much. Byron. Thank you. Jim. That's right. You have. Thank you. Thank you. Thank you. Thank you. So Jim, one thing we're going to be doing and we're going to be doing it strongly, and I've wanted to do it and looked at it for a long time, but we have to do it. Immunity for some of these."
    },
    {
      "text": "You said you have 14 people and you don't believe, maybe one or two, I mean maybe some are guilty of something, but I would bet you a lot of them aren't. And they're going through hell and their pension is going to be gone. Frankly, their family's going to end up being gone, their car, their house, everything. So we want to do immunity. We also want to call for the death penalty for anybody killing a police officer. We'll be pressing and thank you for your support. Yeah, I know your attorney general. That's right."
    },
    {
      "text": "If they're innocent, they have no money left. That's right. We're going to be looking at that very strongly though, that police officers, they're doing their job if they do their job and if they make a mistake, even if it's a mistake, and that can happen. You were telling me, others were telling me they have a quarter of a second to make a decision. You would have a hard time with that. I mean literally a quarter of a second to make a decision."
    },
    {
      "text": "And if it's the wrong decision, their life is over and we have to help people out now. It's time. So we're going to do the immunity thing and we're going to fight alongside of them. We have to stop being politically correct. And you're always going to have some bad apples, but they are very, very few. How many of the 14 would you say would be innocent? All right. Yeah. Yeah. It's pretty tough stuff. It's happening all over. Well, they're afraid to do their job too."
    },
    {
      "text": "They want to do their job, but they're afraid to do their job. We'll take care of it. Thank you, Jim. Great job. Thank you for the support. Thank you. Thank you Tricia. You're right. Thank you. Well, I want to start by saying you look a lot younger than you must be, because if you've worked for the company 46 years, that's a long time. You look like you're 35 years old, I would say. What's that all about? What are you doing? What are you doing? Well, you believe in God that I can see. But you're very lucky in that sense."
    },
    {
      "text": "And thank you very much. It sort of pertains to what saying. So I'll just make this statement. A big thing happened over the last couple of days for Michigan and for Detroit and for the country. Howard knows all about this, but some of the biggest auto plants in the world were planned for Mexico. And I've been talking about it for the last year. I've been talking about the whole concept for 10 years, 15 years."
    },
    {
      "text": "I mean, even as a private person, I couldn't believe how they were just, how companies were and countries were coming in and stealing our jobs, stealing our plants. Everyone's unemployed then they sell cars back in. All they do is you get fired and then they make the car and they sell it into our country. They make a lot of money. We make nothing. We have unemployment. And I've watched this for 20 years. I've watched it for so long and it's disgraceful. (:35) And so I have good news for you."
    },
    {
      "text": "I've been talking about in particular one giant plant, bigger than anything you've ever seen. And the story where a person I know he builds plants. That's what he does. And I said, \"I want to see a plant, a big one.\" About a year ago, year and a half ago. And he said, \"Okay, when do you want to go to Mexico?\" I said, \"No, I want to see one here.\" He said, \"We don't build them here big, we build them, but they're little by comparison. China's building the biggest ones in Mexico.\" (:06) I said, \"That's not good."
    },
    {
      "text": "I don't like that.\" And he said, well, that's the way it is.\" I said, \"I'm not going to Mexico, I'm not going to look at them in Mexico. I want to see him here.\" So anyway, time went by and I started thinking about it. And in speeches, because it's just an automatic instinct to me. I started saying, \"Well, if they're building a plant, they're going to wipe out here.\" That means they're building a plant. They're going to send the cars into our country one way or the other by the millions."
    },
    {
      "text": "And Detroit and Michigan, you had many more, you probably 60% wiped out from what it was in it's heyday, maybe more than that. (:41) I said, \"You're going to get wiped out. The rest of it's going to be.\" And then you have a union head who wants to build electric cars and they're going to all be made in China, you know that. And we have a thing called liquid gold, which is oil and gas. We have a lot of it. And by the way, Brian, stand up for a second if you would please. This guy, he's like you. He gets it so much."
    },
    {
      "text": "You know each other, maybe. He gets it so much. He gets it like nobody. And he's been fighting against all of this nonsense for so long. And so the electric cars are going to... (:16) And by the way, Elon, Musk is a great friend of mine. He gave me a tremendous endorsement. He's right now campaigning in Pennsylvania because he thinks we have to win if we don't win this election because she's a Marxist. This woman has no idea what she's doing and we can't let her be president. I don't want to be rude about it."
    },
    {
      "text": "We can't let her be president. This country is finished, if that happens. I mean beyond a normal candidate, this country would be absolutely finished if she got it. So we have to stop her. (:46) But what happened is, I've been thinking about it and what it would do to the country, and these are plants that are bigger than anything you've seen. They will knock out the cars, you press a button and the whole thing starts operating."
    },
    {
      "text": "And so I started talking about this, about what do you think brought a year ago, less than a year ago, that I won't let it happen a year ago. And I said, \"I'm not going to let it happen. If they do this plant in Mexico right near the border and a couple of others, I'm going to put giant tariffs on of a hundred percent. And if that doesn't work, I'll go to 200%. I don't care."
    },
    {
      "text": "They're not going to be selling cars here.\" (:22) Now if they want to build their plant here, I hope here, but at least in the United States, someplace in the United States, that's a whole different ballgame. But we're not going to have them building them in other countries, sending them into the United States, taking all those jobs. So I've been announcing it and I've been talking about it and I saw the gentleman that builds the plants."
    },
    {
      "text": "I was here a couple of weeks ago at the Detroit conference as you know, and it was really the auto conference. And so I look in the audience and there he is, the man that builds the plants. And I said, \"Can I see you a minute before the speech?\" And after the speech I saw him and I said, \"So how is that plant doing?\" He said, \"Sir, they've decided not to build.\" I said, \"Why?\" He said, \"Because I think you're going to be elected and if you put tariffs on it...\" Thank you. (:17) That was easy."
    },
    {
      "text": "I didn't even do anything other than say, I'm telling you, the man said it right over here. It's the most beautiful word in the dictionary. You have other words that are damn nice like love. But I tell you, I think it's more beautiful than love, the word tariff. So here it works. Hey Brian, here it works without even doing anything. They thought there was a chance. And they're not going to spend $2 billion on building a plant and then have Trump get elected and put 200%. And if that wasn't enough, I'd raise it."
    },
    {
      "text": "And again, the higher it goes, the more likely it is that they build in this country. But think of it. (:58) So they stop this giant plant just in the basis. Now if I don't get elected, they will start it up as, sure as you're sitting there. These people have no clue. She has no clue what she's doing. She wants to raise everybody's taxes. She's a disaster. And other than that, I like her quite a bit. But no, I don't care even about like, dislike. Somebody has to come in. We did great the first time."
    },
    {
      "text": "We did better the second time as everybody knows, we got millions and more votes. And frankly, if I didn't, and some bad things happened, and let's not talk about it because we're going to make up for it this time. Too big to rig. But I will tell you, if I didn't do well the second time, I wouldn't have done it. (:39) But I watched Biden and her and now especially her because she's worse than Biden. I watched them and I said, \"I got to run again. I got to run again.\" That's what happened."
    },
    {
      "text": "Because they said they're ruining our country with the open border. I mean 8,000, just the drug dealers, 8,000 drug dealers, 13,099 murderers in jail. They're going to let them out of jail. Some with death penalties. They're just going to say, \"Well, this is easier. We'll just send them to the United States because their people don't know what.\" (:10) But think of 13,000 plus people who murdered people and they're going to be let free in our country."
    },
    {
      "text": "And then you have their prisons are being emptied up like Venezuela. They're emptying up their prisons. Their crime is down 72% in Venezuela. If they get elected, we're all friends. If they get elected, we'll all meet next year in Venezuela because it'll be the safest country because they've emptied out. And let tell you, it was a very unsafe country. Caracas, you couldn't walk across the street. It's sort of like some of our cities are getting right. Our cities are getting like that."
    },
    {
      "text": "(:44) So just the thought of me getting elected stopped somebody from destroying the rest of Detroit, from destroying the state of Michigan's auto industry and with your auto industry, so goes Michigan. I mean it's a big deal. And we're going to bring, actually we're going to reverse that very easily. He knows because he's got a natural, when he said, when I explained it to him, so he's a business, he's a savant. Is that good? He's a savant. He knows. It took me about two minutes after. About two minutes."
    },
    {
      "text": "\"Oh, I get it.\" How long did it take you to understand the word tariff, two minutes or less? It took very little. He figured it out very quickly. He wasn't exposed to it, frankly. He actually said, \"You mean you can really do that?\" You couldn't believe it. And we have another one, Paulson. He sort of was. He can't even sleep at night, he's so excited about it. But they have to be. And then we have stupid people that don't know, they say, \"Oh, tariff.\" But they're very stupid people."
    },
    {
      "text": "We have a senator from Pennsylvania who decided not to run. He fought me all the way on tariffs. This guy fought me and fought me. His name's Toomey. He fought me and fought me and I wouldn't endorse him. And he decided not to run based on that. (:56) And that's good because all he did was..."
    },
    {
      "text": "I said, \"So if China charges us 100%, can we for a similar product charge them 100%?\" \"No, sir.\" \"Okay, can we charge them 50% or 25%?\" \"No, sir.\" \"Why?\" \"It's not free trade.\" I said, \"Explain that.\" I said, \"Can we charge him 10%, 2% or one?\" \"No sir. It's not free trade.\" I said, \"You got to be kidding.\" And I said, \"I wouldn't endorse you under any circumstances.\" (:27) Now I don't know if he really believe this or because he's not a stupid guy."
    },
    {
      "text": "Did he really believe this or was there something else going on? (:37) But anyway, so we're going to bring back the auto industry, but also, Tim, a of other industries. This pertains to many, many. We talk about cars because it's so nice to talk about cars. It's sort of the ultimate thing to manufacture. But we're going to bring back a lot of industry and it's going to be great. Fantastic presentation. We appreciate it. From everybody. From everybody. Is that your father over there?"
    },
    {
      "text": "Who is that guy though, the good-looking guy? Is he your father with that shirt on? I like that color. I'm going to wear a couple of them now, I think. I've got such support from the Teamsters I'm going to have to wear that, I think. But I want to thank everybody and again, support always, you've been with me and I appreciate it very much, Jim, thank you very much. Thank you."
    }
  ]
}