{
  "speech_id": "376",
  "speaker": "Trump",
  "title": "Donald Trump Announcement Transcript: Israel and Sudan Agree to Normalize Relations",
  "date": "20201023",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-announcement-transcript-israel-and-sudan-agree-to-normalize-relations",
  "topics": "Foreign Policy, Economy",
  "num_segments": 57,
  "content": [
    {
      "text": "... sign, but it's peace. So that's official and that's nice. Yeah, we have at least five that want to come in, and we'll have many more than that very soon. Journalist 1: () When you say \"want to come in,\" you mean? Want to come into the deal. In other words, yeah, part of the peace deal. Journalist 2: () You said Saudi Arabia- You know what it's costing the United States? Nothing, nothing. It's so nice. Isn't that nice? I say nothing. Why should we be paying? We're settling peace. It's like Kosovo and Serbia."
    },
    {
      "text": "You look at what's happened there. We're doing a trade deal, BB, two trade deals. They were killing each other all the time for 25 years. Right? Much longer than that. I said, \"Wait a minute. We're doing trade with each country. Why don't we just settle it up, so you don't have to kill each other?\" They were so happy. They were so happy. So we settled a deal. We do a lot of things that people don't know about, fellas. Any other questions for me about this? Journalist 3: () [crosstalk :55]."
    },
    {
      "text": "President Trump, can you just walk us through what \"normalize relations\" means? What [crosstalk :56]- Bibi, do you want to give that, what normalized relationship, what it really means and what it means to you? Go ahead, Bibi. They're also poor. Iran is poor. Hamas is poor. They're all poor. They weren't poor three years ago. They were blowing everything up. They're very poor. Do you think Sleepy Joe could have made this deal, BB, Sleepy Joe? Do you think he would've made this deal somehow? I don't think so. Yeah."
    },
    {
      "text": "[crosstalk :57]. Yeah, no, I think it's a terrific thing. It should be completed pretty soon. Say? Journalist 3: () Yeah, I just wondered if you could expand a little bit on what this means to Iran, the pressure that these deals are now placing on them? Well, I think ultimately, Iran maybe will become a member of this whole thing, if you want to really know the truth. Look, in the end, you're going to have everybody together with the United States. Beyond the United States, you'll have other major powers involved."
    },
    {
      "text": "And with it, not have to be signed into it because it's a region, but with it, and I could see Iran ... Look, someday, I'd love to help Iran. I'd love to get Iran back on track. Their GDP went down 27%. They've gone from a rich country to a poor country in a period of three years. I'd love to get them back on track. They just can't have nuclear weapons. That's all."
    },
    {
      "text": "Nuclear weapons, and it's always, \"Death to Israel.\" That's all they shout is \"Death to Israel.\" So they can't have nuclear weapons, but they can have what they want. They should be a great nation. They're great people. I know so many Iranians. I have a lot of Iranian friends, and should be a great nation. We want it to be a great nation, but we can't have nuclear weapons. I could see Iran ultimately, it sounds ... Right now, it doesn't sound like something that would happen, but I see it happening."
    },
    {
      "text": "Ultimately, they'll all be one unified family. It'll be an amazing thing. Probably has never happened in the Middle East because the Middle East is known for conflict and fighting. Journalist 4: () [crosstalk :41]. Is this a full normalization, and do you and the Prime Minister want to say anything about the sale of F-35 to the UAE? No, but I think that it's moving along. That process is moving along. It's a good process. We've had an incredible relationship long-term. We've never had a dispute with UAE."
    },
    {
      "text": "They've always on our side. That process is moving along, I think, hopefully rapidly. Journalist 2: () [crosstalk :03] remove Sudan from the state-sponsored list of terrorism. Can you speak a little bit about how that move or those plans that are playing into the dynamics of the normalizations deal with Israel? Which plans? Journalist 2: () To remove Sudan from the state-sponsored- The dam, you said? The dam, is it? Journalist 3: () [crosstalk :20]. The state department. Journalist 2: () State-sponsored list."
    },
    {
      "text": "The list of state-sponsored terrorism. Sudan has great potential on trade and other things. It could be a very, very successful, wonderful country. I think it will be. It's been hampered by what's going on in the world. Journalist 2: () Can you explain, though, how that connects to a normalization deal, Israel as well as negotiating- And with the leaders on the phone, they've been incredible leaders. I will say they have been incredible leaders. You have great leadership now, which you haven't had in the past."
    },
    {
      "text": "Please. Journalist 1: () I was going to ask you, obviously you're going to hit the road in the next couple of days. Are you envisioning any sort of a meeting here in Washington between the Sudanese, as well as the Israelis? Then I'm just curious, what's it like to try to do something like this, while also campaigning, and you're in there, trying [crosstalk :22], trying to do something like that? That's my life. Do I have a choice? Do I have a choice?"
    },
    {
      "text": "This is all things I've been working on, and then the campaign- Journalist 1: () [ crosstalk :]. Can I say something? The campaign begins. I think last night was very, very successful. We've gotten great reviews, great polls, great everything. I had 91% denied. That's good. But, no, it was an exciting night. A tremendous audience, I understand, I hear bigger than they even thought. It was certainly an exciting night, but I have to ... You know, this is my day job. I have to do this. This is very important."
    },
    {
      "text": "Journalist 1: () So are they coming to DC soon? We will have them, along with some other countries that you will be hearing about coming, probably simultaneously. Then ultimately, we're going to have a big reunion at the end, where everybody's here and everybody's going to be signed. We expect that Saudi Arabia will be one of those countries and highly respected. The king and the crown prince, they're all just highly respected in the Middle East. Mohammed from UAE, highly, very highly respected, a warrior."
    },
    {
      "text": "He's really a great warrior. So they'll all come together. We're going to have a big, beautiful party at the end. Okay? You'll be there. Okay? Okay. Anybody else have a question? Journalist 1: () Another question about the meeting last night. Journalist 2: () [crosstalk :37] Middle East process. Journalist 1: () I know, obviously this is very informative. I think everybody was watching the debate last night. You seemed much more calm and measured at the podium."
    },
    {
      "text": "How much of that was you trying to change your strategy, or was that you wanting to play by the debate commission's rules? What was going through your mind? Because you did seem to jump out at the first debate. I think the other is more effective, in terms of business and life. The first one, I thought I did great. There are certain groups of very aggressive people that loved the first debate, but I think this was better. This is obviously a more popular way of doing it. No, I think I wanted to play by the rules."
    },
    {
      "text": "They felt very strongly about it. It's two different styles. I'm able to do different styles, if you had to. But this seemed to be much more popular. Journalist 1: () Would you do another debate? Yeah, but I don't think there's any reason. I think we're leading in a lot of states that you don't know about. Your pollsters may be the worst there are, by the way. Journalist 2: () Do you stand by your statement that you take responsibility for the pandemic, that you said last, sir?"
    },
    {
      "text": "I always take responsibility, and I've done a great job. The people around me have done a great job. Just like these people have done a great job, the pandemic people, what they've done for ventilators and for equipment and for stocking governors that had absolutely nothing. They had nothing on their shelves, and we stocked up them. Those governors, if they're honest, they'll tell you we'd done the best job they've ever seen."
    },
    {
      "text": "I've had governors say it's one of the best jobs I've ever seen anybody do on anything, what we did. We made a lot of governors look good. There are a lot of good governors, too, by the way. They did a good job, but they had nothing. They didn't have ventilators. They didn't have gowns. They didn't have masks or goggles or anything. We got them, and think of it. Ventilators are very tough. Not one person with all of this going on, not one person who needed a ventilator didn't get it."
    },
    {
      "text": "That's very untrue in other countries. In other countries, very few people were able to get. We're now supplying ventilators to many other countries because they're very hard to make. They're very complex, very hard to make, very expensive. So, no, I think we've done a great job. Journalist 4: () [crosstalk :45] offer up any more stimulus talks with Speaker Pelosi? I think we can. Sure. I think we can. Go ahead, Steve. Your word. One of the big differences that you... And I said it last night, loud and clear."
    },
    {
      "text": "She wants to bail out poorly-run Democrat states. They're poorly-run both in terms of crime and in terms of economics. And we just don't want that. We want COVID-related. But she wants to bail out poorly-run Democrat states. And that's a problem because you're talking about tremendous amounts of money. And we don't want to reward areas of our country who have not done a good job. And a lot of them, a lot of those leaders have not done a good job on medical and COVID, frankly."
    },
    {
      "text": "If you look at New York and if you look at some others, it's been rough. It's been very rough. But we don't want to do that. Now we're talking and we'll see what happens. But at this moment, I would say that I actually think Nancy would rather wait till after the election. She thinks it's a good point for the election, but I think it's against her. Because, the American people know it's her that's stopping the money to going to them. I really believe it."
    },
    {
      "text": "I think she views it as a good election point, perhaps, good for November 3rd. I'd like to see the people get the money. I don't think she wants the people to get the money before the election. I don't think that's a good point for her. But we want the people to get the money. It wasn't their fault. It was China's fault. It was China's fault. The plague came in from China. And that's about it. [crosstalk :42]. No, no, no, no, no. That's enough. That's enough. Thank you. Four questions is too many. [crosstalk :48]."
    },
    {
      "text": "Yes, we're talking about it. We're working with Armenia. We have a very good relationship with Armenia. They're very good people. They're so dedicated. They're incredible people. And we'll see what happens. Speaker 1: () Have you spoken to either leader in the last month? I don't want to say, but we will see what happens. I think really good progress is being made with respect to that. [crosstalk :09]. Armenia is..."
    },
    {
      "text": "We have a lot of people living in this country from Armenia, originally from Armenia and they're great people and we're going to help them. Okay? No, I think at the very end, Iran will be... Yeah, I could see that. I could see that. Could you see that? Speaker 2: () Absolutely. I would say that. Yeah, sure. Go ahead. This is Jeff Mason. He's got a mask on. It's the largest mask I think I've ever seen."
    },
    {
      "text": "I don't know if you can hear him, but he wants to know about what you think, what you gentlemen think about, as I said, when it's all finished up and everybody's in the deal, I said that I wouldn't be surprised to see Iran be very friendly, also. You have everybody unified and I think that Iran will be in some way involved. And what do you think about that? When everybody's unified, and this is all done, and it won't be in a long period of time, Iran will be in some way involved."
    },
    {
      "text": "If not part of the deal, they'll be very happy. And you know what? They're tired of fighting too. They're tired of what's going on. Those are great people and they want an end to it. They want an end to it. In fact, if we win the election, they don't want me to say when, but I always say if, because it's an election, right? If we win the election, one of the first calls I'll get will be from Iran. Let's make a deal. One of the first calls I'll get. They don't want me to win and Russia doesn't want me to win either."
    },
    {
      "text": "You know what was unique about those two countries? They both don't want me to win and that's okay. But I think we're going to win. And I think if you start looking at what's happening in these states, and the votes that are coming in, and the amount of votes that are coming in, and the great red wave hasn't hit yet, that hits in a few days. It's going to be a great red wave like you've never seen before. You're going to have a wave like you've never seen before."
    },
    {
      "text": "It's going to be all red and it's going to be a thing of beauty. Have a good time, everybody. Thank you. Thank you very much everybody and I'll see you all soon, okay? Thank you very much. We have some very talented people from the press here and I'll just make a quick statement. On the phone we have some terrific people, Chairman Abdel al-Burhan and Prime Minister Abdalla Hamdok of Sudan, a beautiful part of the world and Prime Minister Benjamin Netanyahu, I think you mostly know him."
    },
    {
      "text": "You perhaps heard of him somewhere. We have the very highly sophisticated press. I think they may have heard of him, of Israel. I want to just congratulate all of you. The state of Israel and the Republic of Sudan have agreed to make peace. This is for many, many years, they've been at odds, to put it nicely, and to normalize their relations. This will be the third country where we're doing this and we have many, many more coming."
    },
    {
      "text": "They're coming at us hot and heavy in the coming weeks, they will meet to negotiate cooperation agreements. You saw that happened with UAE and Bahrain recently, in agriculture, technology, aviation, migration, and other critical areas. This historic deal comes just a few weeks after the groundbreaking agreement between Israel and the United Arab Emirates and Israel and Bahrain. That was very historic. That was a great day, a very historic day."
    },
    {
      "text": "Bahrain and the United Arab Emirates, three months ago, no one thought this would be possible. Even BB didn't know that this was going to be possible, BB, right? But now multiple Arab countries across two continents have made peace with Israel. And again, we have many lined up. They want to come in. They want to get the deal done. They all see it, no blood in the sand. I say no blood. This is one where there's been no blood in the sand. It was common sense. It should have been done this way a long time ago."
    },
    {
      "text": "It's a very special deal for much of recent history. The people of Sudan were ruled over by brutal Islamic dictatorships. It was the home of Osama bin Laden, a place of terror, genocide, and many of the tragedies today. A great people of Sudan are in charge and new democracy is taking root. And the two people I have just mentioned are highly-respected leaders, highly, highly-respected leaders."
    },
    {
      "text": "The Sudanese transitional government has demonstrated its commitment to combating terrorism, creating market economy, and developing the democratic institution that is becoming today's deal, builds on those commitments, and marks a pivotal turning point in Sudan's history. This is, I would say, one of the great days in the history of Sudan. This is an incredible deal for Israel and Sudan. For decades, Sudan has been at a state of war with Israel."
    },
    {
      "text": "They have been in a state of war and boycotted Israeli goods, there was no relationship whatsoever. Today's peace agreement will enhance Israel's security and end Sudan's long isolation from the world because of what was taking place. It will unlock new opportunities for trade and commerce, education and research, and cooperation and friendship for both peoples. I want to thank the leaders of Sudan. I want to thank you very much for being with us."
    },
    {
      "text": "And of course, Benjamin, for the incredible work you do constantly. We've had a tremendous relationship. There's never been a relationship where Israel and the United States were so close. And I would say a few years ago, there's probably never been a time when it was so far apart, so distant, if you want to know the truth. But this is a tremendous show of faith and courage and leadership, which has forged this agreement."
    },
    {
      "text": "The United States stands with all of you and all the nations that seek peace and cooperation. And again, we will be signing many nations over the next coming weeks and months, including some very big ones. It's very exciting, actually. It's peace in the Middle East without bloodshed. And it should have been done this way a long time ago. The Palestinians, by the way, if you ask about the Palestinians, they're wanting to do something. They've never seen anything like this. They're wanting to do something."
    },
    {
      "text": "I'm sure that will get done too. I'd like to congratulate everybody on the phone. And I don't know if you have interpreters or if you needed the interpreters for that. But if you do, you can go forward, interpreters, if you need them. Prime Minister, Well, thank you very much. It was beautifully stated and I appreciate it. BB, would you like to say something? Even the media is very excited about it. I mean, everybody is excited about it. It's an incredible thing."
    },
    {
      "text": "And again, as you know, Bibi, because you're negotiating and talking to people, but they're falling into line. Everybody's going to be involved in this very shortly, I would say. Who knows? I can't exactly put a date on, but within a very few number of months, everybody's going to be in this deal. And that's the way it should have been done a long time ago. We did it the opposite way, exactly the opposite way and we took a lot of abuse from the people that were unable to make a deal for 40 years."
    },
    {
      "text": "And this has gone very quickly, very nicely, very inexpensively and with no blood. So we're very happy about that. Would anybody else like to say something and then I'll have the press ask. Perhaps they may have a question for you. Please, go ahead, Prime Minister. Speaker 3: () I think from the agreement, our relation, [inaudible :16] local and regional security and peace. [ inaudible :24]. Thank you, Mr. President. Thank you, Prime Minister Netanyahu. I thank you for standing up from the beginning."
    },
    {
      "text": "Thank you for you. And our appreciate to Mr. President Trump. Well, thank you very much. Mike Pompeo, would you say something? Secretary of State. It's very funny when Jared said that, it's true. They've been going on for, you could say centuries in some cases really. I mean, if you think about it, but they've been going on for many decades and it's just falling into place. It's all falling into. It's the right system and all falling in. Robert O'Brian? Nobody would've believed it. Except you. No, think of that."
    },
    {
      "text": "In Afghanistan, we have not had a combat death since February. It's a long time ago. I mean, that's something that is very nice. It's got a beautiful ring to it. Thank you very much. Steve? It's a much different place. Brian Hook, please. Had we not done what we did with Iran, this could never have worked. That was a horrible deal. There was a horrible setback. BiBi and others were very much against it at the time, but that's what the problem was. And it was not well done, not well executed."
    },
    {
      "text": "And that agreement is practically over. Had we let that agreement stay, it's practically over. And that would have been a pathway to nuclear weapons. And we'll never let Iran have nuclear weapons. [inaudible :57], just say a few words, please. Speaker 4: () Thank you, Mr. President. Congratulations. I think it's worth reiterating that these deals, the third Arab League country to recognize Israel is only possible because of your leadership."
    },
    {
      "text": "This would not have happened if not for President Trump and the possibilities are endless because of your leadership and hopefully more and more countries will join. So they've been working on those... how many years, BiBi, peace? How many years have they been working? Approximately? And Bibi, how does it feel flying those beautiful airliners right over the top of UAE? You never thought that was going to happen, right? To save about two hours in flight time. Dangerous."
    },
    {
      "text": "So we have many countries as you know, getting ready. And we also have, I'm sure you'll see some. As you know, getting ready. And we also have, I'm sure you'll see Saudi Arabia in there, very soon. I really believe that will happen, too. And, very good relations with Saudi Arabia. So, you'll see something very special. This is already special, but we are going to be signing numerous countries in the not too distant future, so that'll be great."
    },
    {
      "text": "While you are on the phone, could I ask you, how is the dam doing in Ethiopia? The largest dam in many, many years, being built. Unfortunately, it stops water from flowing into the Nile, which causes Egypt a little bit of a problem, right? As it should. But Ethiopia built a dam, you know all about it probably, BB, but I've been dealing with Sudan on that. And I'm just curious, how is that going? Because you're really the third party involved with Ethiopia and Egypt and the dam. Are they working out their deal?"
    },
    {
      "text": "Because I had a deal done for them. And then unfortunately, Ethiopia broke the deal, which they should not have done. That was a big mistake. And we've stopped payment to them, of a lot of aid, because they did it. And they will never see that money, unless they adhere to the agreement. But they built a dam, which stops water from flowing into the Nile, and you can't blame Egypt for being a little bit upset, right? How are they doing with that? Do you know? Yeah, no. I was actually talking to Sudan, BB."
    },
    {
      "text": "Talking to the chairman, talking to the prime minister. How are you doing? Prime Minister, He may not want to answer that. Yeah. If you would, because I had a deal done and then they broke the deal and they can't do that. They can't do that. So the deal was done and it's a very dangerous situation because Egypt is not going to be able to live that way and they'll end up blowing up the dam. And I said it, and I say it loud and clear, they'll blow up that dam and they have to do something."
    },
    {
      "text": "So whatever you can do to get them, Ethiopia to do that, they're going to have to, okay? And we've cut off all payment and everything else, to Ethiopia. It was terrible. We were all set to sign a deal. It was negotiated for five years and longer than that. And they couldn't make the deal and I got the deal done and then they're getting ready to sign the deal and they broke the deal, which is not good. So whatever you could do, prime minister, if you could, that would be great okay?"
    },
    {
      "text": "You tell them they got to get it done. And I'm telling Egypt the same thing, by the way, because they could have stopped it. They should have stopped it long before it was started. I said, \"How do you let it get built?\" And then you say they have a dam. But they had other things on their mind. That was at a time when they were having a minor revolution to put it mildly. That was a bad time for Egypt. So I guess they had other things on their mind. So you'll work on that Sudan, and thank you very much."
    },
    {
      "text": "Do you have any questions for Sudan or for Benjamin? Yes, please. Only for that please. Speaker 5: () Well, more broadly than for you sir, than the gentlemen on the phone. You referenced some other countries. Can you give us a sense of which countries those are? And you also said that the Palestinians want to do something. Can you give us an update on the status of those? Nope. I mean, they're both just statements that we have many countries wanting to come in and we're doing them one by one. We did Sudan."
    },
    {
      "text": "They wanted to do a deal. And that was in particular nice, because they've essentially been at war with Israel for a long time. I don't know if it was fighting. I don't know that, but probably there's been a little bit, but certainly it's been for many years, you've been officially at war with Sudan and now it's not only the deal was signed, but it's peace. So that's official and that's nice. Yeah, we have at least five that want to come in and we'll have many more than that very soon."
    },
    {
      "text": "Speaker 5: () And when you say want to come in, you mean [crosstalk :25]. Want to come in to the deal. In other words, yeah, part of the peace deal. And you know what it's costing the United States? Nothing, nothing. It's so nice. Isn't that nice? I say nothing. Why should we be paying? We're settling peace. It's like Kosovo and Serbia. You look at what's happened there. We're doing a trade deal, BB, two trade deals. And they were killing each other all the time for 25 years, right? Much longer than that."
    },
    {
      "text": "I said, \"Wait a minute, we're doing trade with each country. Why don't we just settle it up, so you don't have to kill each other?\" And they were so happy. They were so happy. So we settled the deal. We do a lot of things that people don't know about fellas. Any other questions, for the prime minister? Speaker 5: () Can you just walk us through what normalized relations means? What now [crosstalk :13] BB, do you want to give that? What normalized relationship, what it really means and what it means to you."
    },
    {
      "text": "Go ahead BB. They're also poor. Iran is poor. Hamas is poor. They're all poor. And they weren't poor three years ago, they were blowing everything up. They're very poor. Do you think sleepy Joe could have made this deal, BB? Sleepy Joe, do you think he would've made this deal? Somehow, I don't think so. Yeah, no, I think it's a terrific thing. And it should be completed pretty soon. Say."
    },
    {
      "text": "Speaker 5: () Yeah, I just wondered if you could expand a little bit about what this means to Iran, the pressure that these deals are now placing on [crosstalk :40] Well, I think ultimately Iran maybe will become a member of this whole thing, if you want to really know the truth. Look in the end, you're going to have everybody together with the United States and beyond the United States, you'll have other major powers involved."
    },
    {
      "text": "And with it, not have to be signed into it, because it's a region, but they're with it. And I could see Iran... Look, someday, I'd love to help Iran. I'd love to get Iran back on track. Their GDP went down 27%. They've gone from a rich country to a poor country in a period of three years, and I'd love to get them back on track. They just can't have nuclear weapons, that's all. And nuclear weapons and it's always death to Israel."
    },
    {
      "text": "That's all they shout, is death to Israel, so they can't have nuclear weapons, but they can have what they want. I mean, they should be a great nation. They're great people. I know so many Iranians. I have a lot of Iranian friends. It should be a great nation and we want it to be a great nation, but we can't have nuclear weapons and I could see Iran ultimately... Right now, it doesn't sound like something that would happen, but I see it happening. Ultimately they'll all be one unified family."
    },
    {
      "text": "It will be an amazing thing. Probably has never happened in the Middle East because the Middle East is known for conflict and fighting. Speaker 5: () [crosstalk :560] full normalization and do you and the prime minister want to say anything about the sale of F- 35s to the UAE? No, but I think that's moving along, that process is moving along. It's a good process. We've had an incredible relationship long-term. We've never had a dispute with UAE."
    }
  ]
}