{
  "speech_id": "393",
  "title": "Trump Transcript: Trump Says China Should Investigate Biden",
  "date": "20191003",
  "url": "https://www.rev.com/blog/transcripts/trump-transcript-trump-says-china-should-investigate-biden",
  "topics": "Healthcare, Foreign Policy, Government Policy",
  "num_segments": 10,
  "content": [
    {
      "text": "...a lot of work on health care. We're very successful at it. And so we're going to be speaking to the great people of Florida and I think they're very happy with the job we're doing. Yeah? What? Well, if you're looking at the whistleblower's complaint it's totally inaccurate because the conversation that I had was absolutely perfect and most people that have read it say the same thing."
    },
    {
      "text": "The whistleblower never saw the conversation, he got his information, I guess, second or third hand he wrote something that was total fiction. And now when people see that they're not happy. Well, we're looking at a lot of different things. China's coming in next week, we're going to have a meeting with them. We'll see. But we're doing very well. Some of the numbers, I think, are being affected by all of the nonsense, all of the politics going on in this country by the Democrats."
    },
    {
      "text": "I call them the \"do nothing's;\" they do nothing for this country. They don't care about this country, but the numbers really are looking very good going into the future. So, we'll see. I have a lot of options on China, but if they don't do what we want, we have tremendous, tremendous power. Well, I would think that if they were honest about it, that sort of major investigation into the bias, it's a very simple answer."
    },
    {
      "text": "They should investigate the Biden's because how does a company that's newly formed and all these companies did you look at ... and by the way, likewise, China just started an investigation into the Biden's because what happened in China is just about as bad as what happened with with Ukraine. So, I would say that president Zelinsky, if it were me, I would recommend that they start an investigation into the Biden's because nobody has any doubt that they weren't crooked. That was a crooked deal. 100%."
    },
    {
      "text": "He had no knowledge of energy, didn't know the first thing about it. All of a sudden he's getting $50,000 a month plus a lot of other things. Nobody has any doubt. And they got rid of a prosecutor who was a very tough prosecutor. They got rid of them. Now they're trying to make it the opposite way, but they got rie- So, if I were the president, I would certainly recommend that of Ukraine."
    },
    {
      "text": "I haven't, but certainly something we can start thinking about because I'm sure that President Xi does not like being under that kind of scrutiny where billions of dollars is taken out of his country by a guy that just got kicked out of the Navy. He got kicked out of the Navy. All of the sudden he's getting billions of dollars. You know what they call that? They call that a pay off. Well, I leave that to the lawyers. I can say though, that Schiff has now been proven to be a liar."
    },
    {
      "text": "We've known it for three years because they've been trying to impeach for three years. He's a lie- He's just stone cold liar. So, I leave that to the lawyers. That's up to them to decide. But the whole investigation is crumbling. Yeah? I can. Yeah, I can. I can. I can. We have a real problem. We've been hitting the Taliban very, very hard."
    },
    {
      "text": "And as far as I'm concerned, they still haven't recovered from killing 12 people, one who happened to be a great American soldier from Puerto Rico and they still have not recovered and they probably never will. No. But I read Mitch McConnell's statement yesterday and he read my phone call and as you know, he put out his statement that said that was the most innocent phone call he's read. And I spoke to him about it, too. He read my phone call with the President of Ukraine, Mitch McConnell."
    },
    {
      "text": "He said that was the most innocent phone call that I've read. I mean, give me a break. Anybody that reads it says the same thing. And the only people that don't understand it is when they look at the false, fabricated, fraudulent statement made by shifty Schiffs. Well, I think Biden is going down and I think his whole situation, because now you may very well find that there are many other countries that they scammed, just like they scammed China and Ukraine and basically who are they really scamming?"
    },
    {
      "text": "The USA and it's not good. And that's probably why China, for so many years, has had a sweetheart deal where China rips off the USA because they deal like people with Biden where they give their son a billion and a half dollars. And that's probably why China has such a sweetheart deal that for so many years they've been ripping off our guns. We're looking at it. We're looking at it very closely. It's under study. We'll see. They want to talk and we'll be talking to him, too. We'll see. I'm going to ... Yes?"
    }
  ]
}