{
  "speech_id": "398",
  "speaker": "Trump",
  "title": "Donald Trump Rally Speech Transcript Butler, PA October 31",
  "date": "20201031",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-rally-speech-transcript-butler-pa-october-31",
  "topics": "Economy, Government Policy, Climate",
  "num_segments": 85,
  "content": [
    {
      "text": "Thank you very much. Thank you very much. Hello, Pennsylvania. Let's go, Pennsylvania. We've got to do the same thing we did four years ago, and I have a feeling... Look at this, I have a feeling we're going to do it. And hello, Butler. Butler, right? Three days from now, we are going to win the Commonwealth of Pennsylvania, and we are going to win four more years in our great and beautiful White House."
    },
    {
      "text": "With your support, we will continue to bring back your jobs, cut your taxes, cut regulations, and ensure more products are stamped, very proudly, with that wonderful term, Made in the USA. Nobody else talks about that. Next year will be the greatest economic year in the history of our country. You saw what happened the other day? They don't like to report it. GDP 33.1, biggest in history. Biggest in history by far. Some people say it's one of the biggest moments for our country economically."
    },
    {
      "text": "They don't like to report it. There's a lot of fake news out there. A lot of fake news. Thank you. Thank you. Joe Biden will shut down your economy, ship your jobs to China, where they pay him a lot of money, raise your taxes $4 trillion, and send your state into a deep and catastrophic depression. That's what's going to happen. He's going to raise your taxes. He's the only man I've ever seen, he campaigns, \"We will raise your taxes.\" All my life I've seen guys..."
    },
    {
      "text": "You study politics, and you say, \"I've never seen anyone say, 'We're going to raise your taxes.'\" That's his primary theme, \"We're going to raise your taxes,\" and \"We'll end fracking,\" that was the other thing. Remember? He'd said it for a year, and then he came to Pennsylvania. They said, \"We have a million jobs.\" \"Oh, okay, well, we'll leave fracking.\" But the people won't let him. His bosses won't let him. Biden has vowed to abolish the entire US oil industry."
    },
    {
      "text": "No fracking, no mining, no natural gas, no heating in the winter, no air conditioning in the summer, no electricity during peak hours. And gas prices, you like that $2 gas, right? How about $5, $6 and $7? \"Darling, let's sell the car. It's a little bit too large. Let's get a compact.\" Biden's plan is an economic death sentence for Pennsylvania. He will outlaw fracking and eradicate your great economy. You had the greatest year you've ever had last year. And now next year, you're going to have the best."
    },
    {
      "text": "If this happens with the taxes and with the fracking, you're going to have a real problem in Pennsylvania. Kamala, Kamala Harris. You have to pronounce her name exactly right, or she gets very upset with you. Although our great vice president beat her very badly in that debate, wouldn't you say? Very badly. By far the most liberal senator in the US Senate. In fact, Bernie Sanders is like a conservative by comparison. She even sponsored the Green New Deal. That's another beauty, the Green New Deal."
    },
    {
      "text": "But I have great news for Pennsylvania. So this has just happened. This is like breaking news. Are you ready for breaking news? Because we have to protect you. Are you ready? Moments ago, I signed an order to protect Pennsylvania fracking and block any effort to undermine energy production in your state. So in other words, if one of these maniacs come along and they say, \"We're going to end fracking, we're going to destroy the Commonwealth of Pennsylvania,\" you can say, \"Sorry about that."
    },
    {
      "text": "You have just...\" I signed it on that beautiful Marine One. Did you see that? I said, \"Go right over them.\" Did you see it go right over you? Whoa. It's a good way to arrive, right? No, I just signed it on the helicopter, I just signed it, and I'm very honored to have done it. So we're protected. So now if they say, \"We're going to do this or that,\" let's just say they're going to have a long fight. Pennsylvania oil and natural gas in the Marcellus Shale contributes $45 billion to your local economy."
    },
    {
      "text": "I'd say 45 billion's a lot. No, but he said if... oh, so for, what, a year, right? He's on the stage with the super liberals. They had like 27 of them. We only had 17 running for the Republican. You remember? 17 plus one. I was the one. And they said, \"No, he doesn't really want it. He just wants to have a good time.\" No. And by the way, do you consider this a good time, okay? Okay, let me ask you, is there a better place to be anytime, anywhere than a Trump rally, right? We're having a good time. We have a good time."
    },
    {
      "text": "You know why I have a good time? Because no president, no administration has done more in the first three and a half years with tax cuts and regulation cuts and rebuilding our military and helping our vets and all of the things we've done. And therefore I have a good time, but we're fighting a very nasty deep state. And if we win, and we're going to, I... I don't know if you see what's going on. Florida, ooh, it's looking very good. They're very concerned."
    },
    {
      "text": "They're saying, \"What's going on in Florida?\" We love Florida. We're getting a lot of votes down there. This isn't based on polling, polling where they say, \"Let's see, what are we going to give him today? Let's put him down like 30. What are we going to do? Suppression. Let's do a...\" No, no, the votes are actually coming in. We're looking very good in a place called Pennsylvania, but don't tell everybody. Don't tell everybody. Right, Mike? Have you seen? Our great Congressman. Mike, have you seen?"
    },
    {
      "text": "Very good, very good numbers. Very, very good numbers, incredible. But when you have crowds like this, and, honestly, this is my third stop. Can you believe? I have a fourth one. I have a fourth one. Other guys, they go home, \"Darling, what are we having for dinner?\" I say, \"I got to speak in front of another 25,000 tonight.\" It's all right. That's all right. We got to do what we got to do. We got to get the job done. Just make sure you get out and vote."
    },
    {
      "text": "But Pennsylvania oil and natural gas supports nearly 1 million Pennsylvania jobs. So when Sleepy Joe heard that, he said, \"Yeah, of course I like fracking.\" But it's not going to happen. It won't happen. It's not real. And it's one of the state's top exports, that's what it is. Energy is your top, or one of your top exports. This is the biggest thing you do. If Joe Biden is elected, he will cancel our..."
    },
    {
      "text": "And you know that, he's going to terminate, frankly, a better word, terminate your energy industry and every job because they want to go to wind. They want to go... They don't even want wind. Honestly, I don't think they want energy period, close down every factory. I don't think they want anything. I don't think they have any idea what they want. I know Joe doesn't. For a fact, he doesn't. He has no clue. He is totally shot, okay? You see the new sunglasses, the aviator glasses, right?"
    },
    {
      "text": "They should be a little bit larger, covers up those new eyes. A vote for Biden and Harris is a vote to ban fracking, ban mining, and completely destroy Pennsylvania. Otherwise, he's not bad. A vote for me is a vote to remain energy independent and build the strongest economy in the history or your state and of your country. And our economy is now growing at the fastest rate ever recorded. That was the 33.1% that the fake news doesn't want to talk about. Think of that, faster than any nation in the world."
    },
    {
      "text": "In the past five months, we've created a record 11.4 million American jobs. That's a... Nobody's... We've never done that. We've never done it. You know what? We've built such a strong foundation, we had the greatest economy in the history of our country, and we had the plague. We had the plague come in from China, and we had to close it up for a little while. And we closed it up, and then... But the foundation was so strong."
    },
    {
      "text": "And that's why, I don't know if you saw auto production, housing production, the numbers are through the roof. Many of the numbers are bigger and better. Did you know this, Mike Kelly? The numbers are bigger and better than they were before the plague came in. Okay? It's pretty amazing, right? It's pretty amazing. That's because the foundation... If we didn't have the foundation, it would be just the opposite. We would've been in big trouble. And again, faster than any other nation."
    },
    {
      "text": "While foreign nations are in a total free fall, we're creating the world's greatest economic powerhouse. And that's what we're doing. We're going to have a greater year next year. I mean, unless somebody comes in and quadruples your taxes, \"We're going to raise taxes.\" A recent Gallup poll, this is amazing, just came out, found that 56% of Americans say they're better off today than they were four years ago under the Obama-Biden administration."
    },
    {
      "text": "And in all fairness, that's during a pandemic, and we're rounding the corner of the pandemic, but that's during a pandemic, think of that. If Biden... Thank you too. I don't know. Wow, he's got to have a... They're back there. Look at that, you can't even see. You can't even see. No, it's like, you can't even see the end of people. A lot of people. There's a lot of people here. If Biden gets in, the economy will..."
    },
    {
      "text": "(silence) (silence) The last 47 years outsourcing your jobs, opening your borders and sacrificing American blood and treasure in endless foreign wars, in countries that most of you have never even heard of. Biden is a Washington vulture who decimated your steel mills, annihilated your coal jobs, that's for sure. And supported every disastrous sellout trade deal for a half a century. Biden was a cheerleader for NAFTA, the worst trade deal ever made."
    },
    {
      "text": "And for China's entry into the World Trade Organization, where they are considered at a level where they get all the advantages. We don't get the advantages. They're considered a developing nation. I said, \"No, no, you're not going to be a developing nation. We're a developing nation.\" Because if you're a developing nation, you get all of the advantages. And we were treated very badly. And we said, \"Look, we're going to have to talk about this.\" We pulled out of the World Health Organization. You know why? No."
    },
    {
      "text": "So we have 325 million people. China has 1.5 billion people. Right. We paid $500 million a year. They paid $39 million a year. In addition to that, they had guys, and for this I give them credit, but they had guys that practically ran the place. Right. So they're paying 39 and we're paying 500. And we have a smaller population, but we have a stronger economy and we were beating them. For the last 10 years, anybody in business, you heard 2019 China will surpass the United States in the economy."
    },
    {
      "text": "That China was going to be a bigger economy than... 2019, 2019. And then I came along and we were skyrocketing way, way above. They would've never caught us. They would have never caught us. Then we got hit with a plague, but now we're bringing it back into... I talked about a V and the fake news said it won't happen. It's a super V. Super V. Thank you. Thank you very much. Thank you. Thank you very much. Now we have a super V. That's even better. They all said, \"Oh, it won't be a V."
    },
    {
      "text": "It'll be a K or it'll be an S.\" They have no idea what the hell they're talking about. They want to make it as bad as possible, but it's a super V. That's what's going to happen. And a big thing in the election, if we win, you're going to see a stock market that roars. We have a headwind and the headwind is we're in an election. If Biden ever got in, you'll go... I mean, can you imagine quadrupling everyone's taxes and all of the regulations put back on?"
    },
    {
      "text": "And I'm a believer in regulation, but not where it takes you 20 years to build a highway. By the way, we're down to two years. We're going to get it down to one. And it may get rejected. And if it does, that's fine, for safety reasons, for environmental reasons, something. But you're going to know in a year, and you're going to be able to build your highway. And it's so much... You have no idea. We have done... You are so lucky I'm your president. You are so lucky."
    },
    {
      "text": "You are so lucky that we've taken this journey together. Right. We've taken this journey, this beautiful journey together. And it is, it's been an amazing journey, but we've accomplished so much. At every turn Biden twisted his knife into the backs of Pennsylvania workers. When sleepy Joe Biden was giving China your jobs, his family was raking in millions and millions of dollars from the Chinese communist party. And whether you like it or not, Joe Biden is a corrupt politician. And you see what's happened."
    },
    {
      "text": "And they don't like that. See, what they'll do is they're going to do... Because they don't want any of that to get out, because we've learned a lot about the media. They don't let any of this get out. They don't want any of it to get out. Nobody knew this. We have learned more in the last two weeks about the media and about the tech giants, big tech. We've learned a lot. We learned a lot. But you know what? The word spreads. It's very hard for them. Take a look at this. The word spreads. If Biden wins, China wins."
    },
    {
      "text": "When we win, America wins and we produce the greatest economy ever. In 2016, Pennsylvania voted to fire this corrupt political establishment. And you elected an outsider as president who is finally putting America first. You mind? You mind? And if I don't sound like a typical Washington politician, it's because I'm not a politician. This is one of the reasons I got elected. Like these guys, like my friends, they're good politicians."
    },
    {
      "text": "If I don't always play by the rules of Washington and the Washington establishment, it's because I was elected to fight for you. And I fight harder for you than any president has ever fought. That I can tell you. And I'm not just running against Joe Biden. I'm running against the left wing media, the big tech giants, the rhinos. You know what a rhino is? A rhino is Republican in name only. We know too many of them. Right. But they're a dying breed. They can't believe it. They used to make so much money."
    },
    {
      "text": "And now, they're reduced to doing other things. They don't like us too much, but that's okay. That's the way it's supposed to be. And the Washington swamp, we are draining. The swamp was very deep and very vicious. On Tuesday, November 3rd, you can send them a message that they will never forget. You don't have to take my word, on Biden's betrayals. So what I do for very special states like Pennsylvania, what I do is we produce a video. Go take a look. It's an expensive video. Take a look."
    },
    {
      "text": "Speaker 1: () We love you Donald Trump. Speaker 2: () Get Biden to [crosstalk :44]. You said it on tape. I'll put it on. Would he close down the oil industry? Speaker 2: () It falls... Would you close down the oil industry? Speaker 2: () It falls... Oh, that's a big difference. In terms of business, that's a bigger statement. Speaker 2: () Okay. We have one final question. Mr. President. Because basically what he's saying is he is going to destroy the oil industry. Will you remember that Texas? Speaker 2: () Okay."
    },
    {
      "text": "Will you remember that Pennsylvania? Thank you very much. There's a lot of truth in that, isn't there? This election is a choice between a Biden depression, which is what will happen, or a Trump boom. There's going to be a boom. It's a choice between a deadly Biden lockdown. And by the way, Governor, open up the state of Pennsylvania. Open them up. Open up those schools, open it up. Or a safe vaccine that ends the pandemic."
    },
    {
      "text": "It's ending anyway, but we have the greatest companies in the world and we're literally weeks away. And we're going to mass distribute the vaccine in just a little while. We have our great military doing it and they are set to do this. They're going to do it so quickly. We'll eradicate more quickly the virus. Wipe out the China plague once and for all. And it's back to work, back to work, which is what we want. You know what we want? We want normal. We want normal. We want normal. Let's go back, go back seven months."
    },
    {
      "text": "Hello. How are you doing? Biden will delay the vaccine and impose a crushing lockdown on all America. Jimmy wants to lock it down. He has no idea. They'll tell him what to do. He'll do whatever they ask. Even on the youngest Americans who are at the lowest risk, like Barron Trump, 14 years old. \"Sir, your son just tested positive.\" I said, \"Positive for what, doc?\" He didn't say the China plague. Yes, he said, \"He's got COVID.\" So he's 14. He's very tall. You know, Baron, right? He's very tall. But he's strong."
    },
    {
      "text": "And he's got tough... I asked 12 minutes later. How's Baron doing? \"Sir, he's fine. It's all gone.\" I said, \"That wasn't too long, Doc. Are you sure he had it.\" \"Yeah, he had it.\" That's why I say, get the kids back to school. Get them back. Get them back to school. But I had it. I'm sure you didn't hear that. Did you hear that, sir? Did you see the debate the other night? Yes. It was a big debate. They had a lot of people watch it. That was good. That was good. We did a good job of exposing... That was like Perry Mason."
    },
    {
      "text": "You know the whole thing about the oil? I said, \"Well, wait a minute. Let's talk about this. We're just about ready to go off the air.\" Even she, she looked, Kristen Walker. She was fair. She wasn't supposed to be, she was fair. She looked at him when he's making a statement about, \"Yeah, we're going to transition out of oil. We're going to transition out of this, out of the fracking.\" And she said, \"Why did you say that?\" Right. Even I said. I felt like Perry Mason. In the end, everything's going badly."
    },
    {
      "text": "And then, \"I did it. I did it.\" It was him. I'm going to transition. He didn't have to answer. I said, \"You mean you're going to get out of oil\" \"No, I'm going to transition.\" \"Oh, that's okay. What did you say?\" And I just hope you people were listening. Okay. Because that's where it's coming. The Biden lockdown will result in countless deaths from suicide, drug overdose, deferred medical care, all sorts of abuse, all sorts of problems."
    },
    {
      "text": "The cure can never be worse, remember, I've been saying it from the beginning, than the problem itself. You can't do that. He will imprison you in your home, letting writers roam free. We call this a protest because the only way you can meet is if you have a protest. They weren't expecting this kind of a protest. Right. If you want to go to church, if you want to go to church, you can't. If you want to burn down the stores and run down Main Street and knock people over and do whatever you want to do, that's okay."
    },
    {
      "text": "Because they want to make sure that they can protest. Not with me. Under Biden, there will be no school, no graduations, no weddings, no Thanksgiving, no Easter, no Christmas, no 4th of July. No nothing. Other than that, you're going to have a wonderful life. Now, we've got a great future. We have more potential in this country. He made a mistake and I watched him. It was really boring. That's the case. 10 people and Obama came, brought another 10 with them. They have nobody. All you hear is a couple of horns."
    },
    {
      "text": "And most- And with them, they have nobody. All you hear is a couple of horns, and most of the horns are from our people. Did you see? And he called them, what did he call them? Ugly people or something, that was terrible. He shouldn't say, it's not politically correct. He's been in this business a long time, 47 years. He shouldn't be saying that. Yeah, but most of the noise is our people. It's like, ah, this is some... You know, in history, there's never been a movement like this. There really hasn't."
    },
    {
      "text": "There's never been anything like this. There's never been. And we have the fake news, 96% against us. Think of it, because you're smart. The smartest people are you, you get it. No, you have them against... Oh, their heads are exploding, as a friend of ours would say. If you want a vaccine to kill the virus, a job to support your great family, and freedom to live your life, then I am asking you to vote for Republican. Vote for Trump. Let's keep it going. We'll keep it going. We'll keep it going. We have more potential."
    },
    {
      "text": "But Biden said today, he said, there's never been a better time to run, there's never been a better time to run this country. This country is in great shape. And I'm saying, wait a minute. He's not supposed to be saying that. It was sort of a strange thing, but I don't know if anybody picked it up. I'm sure if they did, they wouldn't mention it. Oh, if I did, it's a disaster. I have to watch every word. Even pronunciation."
    },
    {
      "text": "If you pronounce a word slightly off, you know, you're talking for five days, one word, it's like, oh... These people are the worst. Joining us today are the opposite of the worst. They're warriors, and they've been with me from the beginning. 197 to nothing with the fake impeachment, the impeachment over a phone call. Hello, congratulations on winning. Right? Ukraine. If you see any corruption, please report it to the attorney general of the United States, because they have a lot of corruption in Ukraine."
    },
    {
      "text": "They say, let's impeach him for that. And what a disgrace, honestly. Wasn't that a disgrace? Think of it. The time wasted, the time wasted. But we have some people that fought with me, and on other things too, and we haven't lost. We haven't lost yet. We'll start with a man who is great, respected by everybody in Washington and here, and loved by this entire state, Congressman Mike Kelly. A real friend. Great guy, great guy. And another warrior, Guy Reschenthaler. Guy, where's Guy? What happened to your location, Guy?"
    },
    {
      "text": "What happened? You're being very nice to a lot of people, Guy, that's very good. Thank you. Great help. And another one, Congressman GT Thompson. GT. Great, thank you. Great job. They're warriors. They really are incredible, and we want to get you a couple of... GT, can we get you a couple of other warriors, do you mind? Congressional candidate, Luke Negron. Luke Negron, [inaudible :26]. I heard you're doing very well, Luke. Go win, get them and get these people out, get the Nancy Pelosi crowd out. Crazy Nancy."
    },
    {
      "text": "Crazy Nancy. They don't represent your values. They don't. Another one who's going to be an absolute star, running against a lamb, a little lamb. Running against a lamb. And this guy is, he's fantastic, I'll tell you. You have to see his record, he's a hero. He's a hero. He's a star. I'm even tweeting him all the time. I said, he's got it. You know, they fixed around and played around with a district, now they're having a problem with ballots. They sent like, thousands of ballots out, and they were wrong."
    },
    {
      "text": "So they said, oh, don't worry about them. Just send them in. They will, do you know where they'll send them to? The Elections Commission. So Sean's got to be careful, but Sean is a star. Sean, Sean Parnell. Sean. He's a star. And he's a tough cookie. Tough cookie. Maybe tough enough, I don't know, this is interesting, Sean may be tough enough to have played football for the great Lou Holtz, who's a friend of mine. Where is Lou Holtz? Come here a little, come here."
    },
    {
      "text": "So Lou has been, Lou is a great, great coach and a great guy, and he's an inspiration to a lot of people. He just lost his incredible wife. How many years, Lou, were you with her? 59. That's one I'll never be able to top you on, Lou. But he had a great wife who was really brave in what she went through, and he's getting the Presidential Medal of Freedom for just an outstanding life. Want to say something, Lou? Say something, go ahead. Hey, I'm glad I brought him up, huh? That's great. He's a great gentleman."
    },
    {
      "text": "A great man. We're also joined by many members of UAW Local 3303, where are you? They've been great. They have been great. What a group. Thank you, fellas, appreciate it. Thank you, fellas. Appreciate it very much. Great people. We have so many endorsements from so many, but we have almost every law enforcement group is endorsing us. Almost every one. We have a lot. So who's with law enforcement tonight, law enforcement? Yep. Tremendous."
    },
    {
      "text": "The sheriffs, Florida, Oklahoma, Texas, Louisiana, New York's finest endorsed, first time they've ever endorsed a presidential candidate, so it's been a great. Chicago, can you imagine Chicago with the police? Police in Chicago, they're having a hard time. They have people that won't let them do their job. They just won't let them do their job. When you see the New York stats go way up, Chicago go way up, and then Portland, we want to go into Portland so badly."
    },
    {
      "text": "Take out the anarchists, it would take us about 25 minutes. You saw what happened in Minneapolis, you know, after a week and a half. They could have called a little quicker, like, about an hour. But remember the CNN, look, the light always goes off whenever... Turn the light on. He's talking about us again. It's all right. Their ratings aren't that good, so it's not like you're losing [inaudible :49]. Remember that guy, does the little shave job, right?"
    },
    {
      "text": "I was thinking about doing it, but I wanted to remain your president. No, shaved head, he goes... Ali Velshi, right? Ali Velshi? I don't even know who the hell he is, I just have a good memory. Ali Velshi. And he's going, this is a peaceful protest. You know, he's being hit by rocks and stuff. This is a peaceful protest, it's wonderful to see such a peaceful protest. And then they have the camera on him, and behind, you have a city that's burning. It's blocks long. I've never seen fire like that."
    },
    {
      "text": "I always say it looked like Berlin in the worst day of the war. And he's saying this is a peaceful protest. Well, this is a peaceful protest also. For 47 years, Joe Biden betrayed, insulted, jailed and attacked Black Americans. He called them super predators. He used the term super predators. He's not a good person, that I can tell you. You know, because some people knew him in prime time. This is no longer prime time, now he's shot. Some people knew him in prime time. He's not."
    },
    {
      "text": "And frankly, if he were, I would never say the things I say about him, but he's not a good person. I signed landmark criminal justice reform, and in a second term, will continue fighting for African Americans like never before. And I appreciate the support that I'm getting in the election. It's very early, but I really appreciate it. From African Americans and from Hispanic Americans, the support has been incredible. In Florida, you have to see what's going on."
    },
    {
      "text": "You're going to go home, they're trying to figure out what is going on. I never say we won Florida. I've never said we won anything, you know. But I'll tell you, it's going to be tough for them to catch us. It's going to be very tough. We've had tremendous support from the Black community, from the Hispanic community. It's been incredible. All over, all over, and we appreciate it. But when he's calling and using terms like super predator, which is a term that you can't use, but he used it all over the place..."
    },
    {
      "text": "To protect our security, I suspended the entry of foreign refugees from terror-afflicted nations. Biden has pledged a staggering 700% increase in refugees from the most violent terrorist hotspots anywhere on Earth. If you don't mind, I'll end that. And that was the deal, the manifesto that he agreed to with Bernie Sanders and AOC plus three, right? So you had Bernie Sanders... This actually took them further left. Bernie wasn't even... A 700% increase."
    },
    {
      "text": "The Biden plan would overwhelm your communities and hospitals and open the floodgates to radical Islamic terrorism. Call France, ask them how are they doing. How are they doing? You saw what's happened. What's happened is a disgrace. I called the president, Macron, good, good friend of mine, great guy, and I just gave our condolences on behalf of our country. But what's going on over there is terrible. So if you don't mind, we'll take a pass. Is that okay? You know I passed the ban, right? The ban."
    },
    {
      "text": "And everybody said, oh, what a terrible thing. A lot of them said, what a terrible thing, but let's not fight it. And we won at the Supreme Court a long time ago, and now we keep people out who can't love our country, or people that want to hurt people. We want them out and we will keep them out. I am also keeping the terrorists and jihadists... And again, some people say that's not politically acceptable, but whether it is or not, I have to do what's right for our country."
    },
    {
      "text": "We are keeping them the hell out of our country. We invested $2.5 trillion, most ever in the United States military. We've totally rebuilt our military. Our military was depleted. Our military was totally depleted from years of endless wars that just kept going on and on. We became the policeman of nations, and we invested 2.5. We have the finest equipment in the world. We are the envy of Russia and China and North Korea and anybody else. We have equipment, the rockets and missiles and tanks and submarines."
    },
    {
      "text": "Submarines, nobody does like we have, the submarines and all of the things that we've been doing and building. And our planes, you have 35 Stealth. They can't see it. It's hard to shoot down because you can't see it. The enemy says, you know, we want to figure that one out, and in five years, they will. The only thing they won't figure out is the wall and the wheel, right? The wall and the wheel. We are doing great on that wall. It's almost complete. That's why you don't hear about it anymore."
    },
    {
      "text": "And we saved a place called, I'm sure you've never heard of it, the Philadelphia shipyard, you know that? And Biden was shutting it down. They were shutting it down, and we said, no, thank you, we'll keep it open. And it's still in a good job. We also passed VA choice and VA accountability, our great vets. And we recently got a 91% approval rating from our vets."
    },
    {
      "text": "So now the vets can go online, and if they have to wait a long time to see a doctor, we have great doctors in there, but they'd have to wait two weeks, three weeks, a long time. They go out, they get a doctor, local doctor, we take care of the bill, and we take care of our great vets. We take care of our vets. They'd been trying to get that for 44 years or something. And the accountability is where they don't treat our... We have people that work there that don't treat our vets with respect."
    },
    {
      "text": "They don't treat them good. They don't love our vets like we do. And we couldn't do anything about it, because of unions and because of civil service and lots of other reasons, and they've been trying to get this for over 40 years. And now if we have somebody that doesn't treat our vets right, if they're sadistic, if they steal from them, if they do bad things to them, we say, Jim, sorry, you're fired. Get the hell out of here. And we get them out."
    },
    {
      "text": "And we terminated about 8,000 people that should have never been there, we couldn't do anything about it. So our vets are leading a much better life. Really, it's a tremendous thing. Not that I like firing people. I don't like firing people, but they're leading a much better life. They were some terrible people in there, they couldn't do a thing about it. You couldn't do it a thing about it. Last night, they never thought they'd get that one passed."
    },
    {
      "text": "Last night, at my direction, the United States military conducted a successful operation to rescue an American hostage kidnapped overseas. It was 96 hours, 96 hours. Our incredible people from the US special forces brilliantly executed a daring nighttime operation. They kidnapped an American in a far away land. Over the last four years, we've rescued over 55 hostages and detainees in more than 24 countries. And we don't pay. We never pay. If you pay, you'll have thousands of people. All of a sudden you can't pay."
    },
    {
      "text": "Now, this is sort of a lesson. We had no casualties, nobody injured, except the other side was badly injured, I'll tell you. You have no idea. I won't tell you how badly injured, but they kidnapped an American and they can't do that. And I just want to thank special forces, these are really special forces, but they're really special people. And today's operation should serve as a stark warning to terrorists and thugs who try to kidnap our people, no matter where it may be."
    },
    {
      "text": "You cannot escape the long reach of American justice. So they did a great job. And as you know, we wiped out 100% of the- We wiped out 100% of the ISIS caliphate in Syria in Iraq. And we killed the vicious, horrible founder and leader of ISIS, al-Baghdadi. They were looking for him for 18 years. One of the first things I said is, \"Find al-Baghdadi.\" And they found him and they killed him. That was Conan, right? Conan the dog. Conan, who was incredible."
    },
    {
      "text": "In fact, they gave Conan far more credit than the president, but that's okay. He deserved it. Actually. We took out the mass murderer of US troops in many trips, in many people. The worst terrorist of them all, Soleimani is dead, Soleimani is dead. And I withdrew from last administration's disastrous Iran nuclear deal, 150 billion. For nothing, for nothing. 1.8 billion in cash we gave them. Can you believe it? What is 1.8 billion Mike in cash? How did you let that happen, Mike?"
    },
    {
      "text": "He said, \"It wasn't my fault.\" I recognized the capital of Israel and opened the American embassy in Jerusalem. I also recognized Israeli sovereignty over the Golan Heights. they've been working on it for 52 years. We got it done in two hours. And instead of endless war, we're forging peace in the Middle East. You see what's happening? They're all coming together. No more blood in the sand. Biden will plunge us into one ridiculous foreign war after another. He loves the war stuff."
    },
    {
      "text": "It's like, Hey, we want to have the greatest stuff in the world. We don't have to fight, but if we ever fight, we only fight to win. We only fight to win. Not let's do this. Oh, let's not do that. No, if we fight, we fight to win. Thank you. Thank you very much. A vote for me and the Republican party is a vote to save the American dream. Very simple. And just remember the late, great Abraham Lincoln happened to be a Republican, right? Got to remember that. You got to remember that. In conclusion over the next four..."
    },
    {
      "text": "I could stay with you all night. I have to go to another part. Can you believe it? I'm going to take that chopper. We're going to go to another part of Pennsylvania and then we're going to have such a big day on Tuesday. No, the fake news can't believe it. They follow me all over the... They say, \"This guy's got a lot of energy,\" I'll tell you. Thank you very much. Over the next four years, we will make America into the manufacturing superpower of the world. And we will end our reliance on China."
    },
    {
      "text": "And we've already started that, long ago actually. We will hire more police, increased penalties for assaults on law enforcement. And we will ban deadly sanctuary cities. We will defend the right to life, free speech, religious liberty and the right to keep and bear arms. Second amendment. The second amendment is under siege. Don't worry. As long as I'm here, it's not under siege. And you guys are right there with me. You guys are right there with me. We will maintain America's unrivaled military might."
    },
    {
      "text": "That's what we've done. That's what we've done. Like we've never had before. And we will ensure peace through strength. We will end surprise medical billing, require price transparency. Starts January 1st. Bigger than healthcare, you watch. All set to go. January 1st, all signed up. Lower drug prices, even more. Favored nations, we're going to go from the highest to the lowest price anywhere in the world. The drug companies are not good fans of President Trump. They don't like me."
    },
    {
      "text": "They're taking out more ads than Sleepy Joe about me. They're saying things about me in those ads and all I'm doing is just give me the lowest price in the world. I don't know. They come up with things. It's not good to do that. I don't know to me, it's good to do that. And we will always protect patients with pre-existing conditions. America will land the first woman on the moon and the United States will be the first nation to land an astronaut on Mars. Very excited actually."
    },
    {
      "text": "And don't forget, that's on top of Space Force. With everything else we did. Space Force. We created the first new branch. 75 years, Air Force was the last one. Now we have Space Force. And we never even used to talk about that at the rallies. Right. I've actually done more, I really believe that, I think I've done more than I promised. I may be the only politician, if you call me a politician. We've done more than I promised. I think that might be a first. We'll have to check that out."
    },
    {
      "text": "Check that out for us [inaudible :47]. Space Force, we needed it. That is something, when I became president, I saw Russia, I saw China. I saw what was going on. I said, \"We have to do that too.\" And I got great help from the Republican Senate and from these gentlemen right here. And we actually had some bipartisan help, believe it or not, which is not easy to get. We will stop the radical indoctrination of our students and restore patriotic education to our schools."
    },
    {
      "text": "We will teach our children to love our country, honor our history and always respect our great American flag. And we will live by the timeless words of our national motto, in God we trust. At the Democrat national convention. Right. The pledge of allegiance, they took the word God out. And I watched it. And I said, \"They must've made a typo.\" The problem was that I heard it a second time. And I said, \"That was not a typo.\" And the American public went crazy."
    },
    {
      "text": "And all of a sudden they put it back, but that's where they're coming from. Never going to happen with me, never going to happen with these guys. Right. Never going To happen with our guys. Right fellows? For years, you had a president who apologized for America. Now you have a president who is standing up for America and standing up for the great people of Pennsylvania. It's true. For the last four years, you've seen me fight for you. And now I'm relying on you to deliver another historic victory for our country."
    },
    {
      "text": "On November 3rd, we must finish the job. Have to go out and vote. Just have to go out and vote. We're going to finish draining the swamp. It's deeper and more vicious than anybody ever thought. Swamp creatures, yeah. It's a great term. Swamp, you know the swamp creatures, we got them all over Washington. So get your friends, get your family, get your neighbors, get your coworkers, grab your boss. Come on boss. And you have to get out and vote, November 3rd. On November 3rd. And you want to do that."
    },
    {
      "text": "You want to pick that... We're so well because November 3rd, people, they just want to get out and vote. We're going to have a historic day. I really believe that we're going to have it. Just based on what's going on throughout all these other states. But we win Pennsylvania, we win it all. You know that, right? We win Pennsylvania, we win it all. If we win Pennsylvania, it's over. Over. And I told you, Florida's looking so good and Ohio is looking so great. They've always been great. They've always been great."
    },
    {
      "text": "They get it. For generations, America's destiny was made forged. Hello, Fox. No, they're very happy. I think I love them. I might as well wait till they finish up. Speaker 9: () We love you President Trump. Thank you. Thank you. Just such a friendly group. I said and I don't want to interrupt them. They have it. No, that was good. Thank you very much. We do appreciate it. For generations, America's destiny was made, forged and won in places like Johnstown and Pittsburgh, Erie, Altoona, Bethlehem, and right here in Butler."
    },
    {
      "text": "True. Our American ancestors gave their blood, sweat, and tears to defend our country and our freedom. We stand on the shoulders of American heroes who crossed the ocean, settled the continent, tamed the wilderness, laid down the railroads, raised up the skyscrapers, won two World Wars, defeated fascism and communism. And made America into the single greatest nation in the history of the world. And the best is yet to come. The best is yet to come. Truly. Proud citizens like you helped build this country."
    },
    {
      "text": "And together we are taking back our country. We are returning power to you, the American people. That's what we're doing. Ultimately, that's what we're doing. Right? Speaker 10: () Thank you. With your help, your devotion and your drive. We are going to keep on working. We are going to keep on fighting and we are going to keep on winning, winning, winning. We are one movement, one people, one family, and one glorious nation under God."
    },
    {
      "text": "And together with the incredible people of Pennsylvania, we have made America powerful again. Our great military, our great, great military. We have made America wealthy again. Your 401(k)s are doing great. Your 401(k)s. And if we could get Biden out of the way, you'll see a stock market that goes through the roof. He's a headwind. You know what I call him? I call him Joe Headwind. He's a head... We get him out of the way, you'll see a stock market that goes through the roof. It's already."
    },
    {
      "text": "Could you imagine in the middle of a pandemic we're doing so well? Speaker 11: () Get him out of there. We have made America strong again. We have made America proud again. We have made America safe again. And we will make America great again. Thank you, Pennsylvania. Thank you. Thank you very much. Go out and vote. Thank you everybody."
    }
  ]
}