{
  "speech_id": "407",
  "speaker": "Trump",
  "title": "Trump and Musk Speak at Butler Rally",
  "date": "20241007",
  "url": "https://www.rev.com/blog/transcripts/trump-and-musk-speak-at-butler-rally",
  "topics": "Immigration, Gun Control",
  "num_segments": 79,
  "content": [
    {
      "text": "Lee, thank you very much, really, and thank you, a very big thank you to Pennsylvania, we love Pennsylvania. And as I was saying... Oh, I love that chart, I love that graph. Isn't it a beautiful thing? But also beautiful because look at the number, that's the day I left office, it was the lowest border patrol, the lowest it's ever been. Illegal immigration, today it's out of control, but I love it for other reasons too, you know that."
    },
    {
      "text": "So thank you very much and thank Lee, and what Lee has done with that song, and it's such an honor to have it. I want to just let you know that tonight I returned to Butler in the aftermath of tragedy and heartache to deliver a simple message to the people of Pennsylvania and to the people of America. () Our movement to make America great again, stand stronger, prouder, more united, more determined, and nearer to victory than ever before."
    },
    {
      "text": "We're going to make America great again, going to win the election, going to win the election. And to all Americans, whether you are a Republican, Democrat, Independent, Conservative, or Liberal, or you have no label whatsoever, it makes no difference, our movement, it belongs to you, it belongs to our country, it belongs to our country."
    },
    {
      "text": "And together in just one month, we are going to usher in a new golden age of American security, prosperity, sovereignty, and freedom for our citizens of every race, religion, color, and creed. () Exactly 12 weeks ago this evening, on this very ground, a cold-blooded assassin aimed to silence me and to silence the greatest movement, MAGA, in the history of our country, MAGA. We love MAGA."
    },
    {
      "text": "For 16 harrowing seconds during the gunfire, time stopped as this vicious monster unleashed pure evil from his sniper's perch, not so far away, but by the hand of providence and the grace of God, that villain did not succeed in his goal, did not come close. He did not stop our movement, he did not break out our spirit. He did not shake our unyielding resolve to save America from evils of poverty, hatred, and destruction. Yet we are here this evening in record numbers, this is a big crowd, this is a big one."
    },
    {
      "text": "This is a big one. Not only to mark the triumph of American spirit but over, and you know that, this is really truly in the truest sense, spirit over evil and adversity, but also to pay tribute to some of the best and bravest we have ever known. () This field is now a monument to the valor of our first responders, to the resilience of our fellow citizens, and to the sacrifice of a loving and devoted father, a really great man, you know that. Forever afterward..."
    },
    {
      "text": "Speaker 1 Forever after, all who have visited this hallowed place will remember what happened here and they will know of the character and courage at so many incredible American Patriots have showed and know, and they know it at a level never seen before probably. First, I want to thank the men and women of the US Secret Service who threw their bodies on top of mine without even a thought for their own lives."
    },
    {
      "text": "They were on top of me so fast, they were on top of me, and there was not even a moment of doubt in their minds. You watch those tapes, not even a moment of doubt, I want to thank Secret Service, great people, they are great people. () And in that moment, those agents displayed a devotion to duty that cannot be described, and they did it yet again, less than three weeks ago when they really did a fantastic job, another attempt, there was another attempt. We have an evil world, we have a very sick world."
    },
    {
      "text": "My gratitude to them is beyond measure. We also owe a tremendous debt thanks to the Secret Service Counter Sniper and a local police sniper who returned fire within seconds and stopped the shooter quickly and saved many lives. If he didn't stop, he saved many lives, he had a lot of bullets, a lot of ammunition up there with him. And we are... Just amazing when you think they did it so quickly without any knowledge of what was going on, boom."
    },
    {
      "text": "And had that not happened, it would've been a very different story, it would've been many, many, potentially many, many people. () I also want to express our thanks to the Butler Township Police Department, credible people. The Butler, Sheriff's deputies, Pennsylvania State Police, and all of the other law enforcement heroes, as well as the emergency personnel and doctors, the medical teams at Butler Memorial Hospital, Allegheny General Hospital, who rushed me and rushed some of these very badly people."
    },
    {
      "text": "They were wounded, a lot of badly wounded people, and in particular, two people, two people. And I tell you, they were very brave and great people, they were big Trump fans and they still are. That means something, that was pretty amazing. () When I got up, I asked whether or not anybody was killed. I assumed that there would be a lot because I heard the bullets winging right over my head. They said probably three, the doctors did such an incredible job."
    },
    {
      "text": "It was one, one great gentleman, but the other two have been amazing actually, they've gone through a lot. And when the crisis struck, they did really Pennsylvania proud. You've heard that expression, Pennsylvania proud, it's a great place. I went to school, I went to college in Pennsylvania, it's a great place, the people are incredible. () Also, and I have to say, after returning to the field, tonight is one of the really brave Americans who was hit by the assassin's Bullet, US Marine Veteran David Dutch."
    },
    {
      "text": "David, thank you. Thank you David. Thank you David. And David, we're thrilled to see your recovery is going well. Great doctors up here, I have to tell you, great doctors. Your courage is really an inspiration to us, so I want to thank you very much, David. Great gentleman, great, great gentleman. I want to send our love to someone who could not be here because he has just undergone a major surgery related to the shooting, a man who was really badly wounded like David, James Copenhaver."
    },
    {
      "text": "() Because James was a wonderful man, a big Trump fan, and Mr. Copenhaver is out there watching us right now, but he's in a hospital where they did some additional work, but he's in great shape. He wanted to be here so badly, but he's in great shape and we appreciate it and we're looking to his full and complete recovery, he will have a complete recovery. Thank you. Thank you very much. And of course there's one more hero who could not make it back here tonight because he is no longer with us, right?"
    },
    {
      "text": "You know who that is, right? Corey, our beautiful Corey. Corey is not with us tonight, and he should be, and we all miss him, he's become somewhat of a folk hero. I have to tell you who is with us, is his beautiful wife, and daughters, and relatives, sister. Please, where are you? Where are they sitting? There they are. There's just a lot of people, it's not easy to find people in this audience. Goes back further than you can see. Thank you very much. Thank you very much. Thank you very much."
    },
    {
      "text": "Great family, great incredible family, and he loved you a lot. And his wife said something very beautiful. The public, a lot of people, all of us, a lot of people have been very generous, and she said, \"I'd rather have my husband.\" That's a good thing to say, that's a good thing to say. \"I'd rather have my husband.\" () Corey Comperatore was a incredible husband and father, a devout Christian, a veteran, and a proud former fire chief. Very respected within the town, everybody knew him."
    },
    {
      "text": "Few men volunteered to run into fires, but Corey was one of those who did, he ran into fires. I spoke to people that were with... This guy would do anything. He was brave, right? Brave guy like you, and he was also a protector who put his life line for others and he loved doing it. And when the sound of gunshots pierced the air on that July evening, Corey leapt into the fire one more time. In his last seconds of this earth, he threw himself on the top of his wife and daughters, he didn't want them hurt."
    },
    {
      "text": "He threw himself, he knew what was happening, he didn't want them hurt, and he was hit hard, he was hit hard, and he gave his life to shield their lives. () Every father and husband in America hopes that if the time came, we would have what Corey had, tremendous courage, tremendous guts, and he wanted to protect his family, and he did protect his family. At this time it is 6:11, 12 weeks to the minute that the shooting began. I would like to ask everyone to join me in a moment of silence. Wow."
    },
    {
      "text": "Now that is what you call a voice. One of the greatest opera singers in the world, and Christopher Macchio, who's truly a great talent, is going to be back when I leave and I'm going to stay backstage watching every song he's going to sing, three or four great songs, Nessun dorma and others. And so I wouldn't leave you seat too fast when we're finished today, but this is in honor of three great people, actually three great and in particular, Corey, and we appreciate it. But that is a real voice, isn't it, huh?"
    },
    {
      "text": "What do you think, Mr. future vice President, pretty good, right? I don't know if you could do that JD, I don't know. I don't think JD can do that. () In the face of murderous hate, Corey answered, the most selfless kind of love. We are joined this evening by Corey's incredible widow, Helen, his two precious daughters, Kaylee and Allyson. And his sisters, Kelly and Dawn, thank you so much. Thank you so much, this is an incredible tribute. This is a tribute like no other, and he deserves it."
    },
    {
      "text": "To Helen and the entire family, I can only begin to imagine the depths of your grief, but I want you to know that just like you, we will carry his memory in our hearts for as long as we live. () Everybody in this stadium and everybody that was there on that tragic evening, we are thinking about Corey, we think about him a lot, and I know he's looking down on us right now from heaven smiling at his beloved wife and daughters, and his mother, Karen, and his entire family, his entire family."
    },
    {
      "text": "And he's with you and he's going to be with us for a long time because some people just don't die in vain, and what he's left behind is incredible, and so God bless you, Corey, God bless you, thank you very much, god bless you. () Just one little story. Helen told me that on the day that they came to the rally, Corey was really excited because somebody gave them great seats right up front here with the people from North Carolina, the ladies from North Carolina."
    },
    {
      "text": "This is their 227th rally, I don't know what's going on with them, those beautiful ladies, but they always seem to have good seats. But Corey had the best seat in the house, and he was telling his wife and family on the way over in the car, he said, \"I'm telling you, he's going to invite me up on the stage.\" Because I do that sometimes, I take people, we invite them up in the stage. () And she smiled thinking it'll never happen."
    },
    {
      "text": "And little did anyone realize that Corey would be on the stage three months later in an almost immortal position, and that's where he is today. He's on the stage in a, I think in not almost, I think it's a truly immortal position. So the love that he showed on that day and throughout his life is the love that sustains the entire movement."
    },
    {
      "text": "The love that our families have, and it's love of our communities and love of our country, it's a force more powerful than any hatred and malice because even in the darkest hours it shines forth as a guide and it guides us like nothing could ever guide us. It guides us really like a candle in the night."
    },
    {
      "text": "And so it's love Corey's that is joining us to save our country, that's going to heal our country, and that is going to reunite our country as one nation under God, indivisible, with liberty and justice for all. () So what our opponents have never understood is that this movement has never been about me, it's always been about you, it's been about a lot of people, millions and millions of people, the biggest ever in the history of this country may be anywhere."
    },
    {
      "text": "And everyday people who are the heart and soul of our country, they love our movement, they love our country, and they know they're doing right. Your hopes are my hopes, your dreams are my dreams, and your future is what I am fighting for every single day. And now I have a great companion in JD Vance, how good was he the other night? How good? He was great. Speaker 1 He was great."
    },
    {
      "text": "But from the very beginning of this journey, I've been on a mission to rescue our country from a failed and very corrupt political establishment, very corrupt. We have to change it, we have to change it. We need also a very free and open press and to give it back to the country you believe in, and I believe in, it's a country that we were born in and the country that you deserve, you deserve this."
    },
    {
      "text": "() And that mission, I will never quit, I will never bend, I will never break, I will never yield, not even in the face of death itself. And I believe that every citizen deserves an America with a very, very grand ambition, great opportunities, and limitless, we just want limitless potential. We want an America where you can get ahead and be proud of life and provide for your family in a really decent way, where we don't have crime, we have a fabulous military to protect us from evil."
    },
    {
      "text": "Everything has to be the best, we have to have the best schools. We have to have strong borders, we don't want bad people coming in and hurting us. We don't want to have open borders, do we? () You deserve a government that protects and respects its own citizens, that defends your sovereignty, your security, and your dignity and your freedom. You deserve A nation that builds things again, makes things better, that aims for the stars once more, and that once again commands respect."
    },
    {
      "text": "And we want to get respect like we had it four years ago, the entire world respected us, they respected us. They respected us more than they've ever respected us, and now they laugh at us. () We can't have them laugh at us, can we? Above all, you deserve leadership in Washington that does not answer to the lobbyists, to the bureaucrats, or to the corrupt special interest, but answers only to you, the hardworking citizens of America, which there are a lot of them, we have a lot of them. We have a lot of them."
    },
    {
      "text": "Over the past eight years, those who want to stop us from achieving this future have slandered me, impeached me, indicted me, tried to throw me off the ballot, and who knows, maybe even tried to kill me, but I've never stopped fighting for you, and I never will, never will. Never going to stop. Thank you. Thank you. And in turn, you have always stood with me. You have always stood with me. No matter what, you saw what was going on, you saw the hoaxes and the scams, you saw everything that went on."
    },
    {
      "text": "We are a team, we're a great team I think. We're probably the best team ever in the history of our country if you really think about it. We fought together, we have endured together, we have pushed onward together, and right here in Pennsylvania, we have bled together, we bled. We've had three people that really got hit hard, two of them made it, great doctors, great doctors. They weren't supposed to make it, I wasn't supposed to make it. () My great doctor at Butler said, \"Sir, you're the luckiest man alive."
    },
    {
      "text": "This would be a good time for you to go out and buy a lottery ticket. I've never seen anything like... \" I almost went out and bought a lottery ticket, I'll take it. And 31 days from now here in this great commonwealth and all across our land, we are going to win together, we are going to vote together, we're going to win the greatest election in the history of our country, maybe the greatest election all time."
    },
    {
      "text": "After we all have been through all of this together, nobody's gone through what we've gone through, nobody. Because I go through it, you're going through it too, but there's never been anything like this. I always say there's an enemy from within and there's an outside enemy, and if you're smart, the outside enemy is not going to be a problem. Russia, China, and North Korea, we're not going to have a problem if you have a smart president."
    },
    {
      "text": "If you have not such a smart president, then it's a problem, but we have an enemy from within, which I think is much more dangerous than the outside enemy. () We stand on the verge of the four greatest years in the history of our country, we can make these the four greatest years. We'll turn it around so fast that your head will spin. With victory on November 5th, we are going to redeem America's promise and unlock the extraordinary future that is just within our reach, it is now within our reach."
    },
    {
      "text": "Think of it one month from today, one month. We got to get there, we got to get there. They'll drop all sorts of bombs, they'll be hitting you JD, they'll be hitting me. These people, they'll hit and hit, but I think we've almost become immune to it, haven't we? We've become immune to it, you got a little dose of it, couple of little doses. No, that's, that's the only way they can even think about winning with open borders. () Who wants open borders? Who wants men playing in women's sports?"
    },
    {
      "text": "Who wants sex change operations for illegal aliens in holding bins? No, I don't think so. We will begin a new era of soaring income, skyrocketing wealth, millions and millions of new jobs, and a booming middle class. We are going to boom like we've never boomed before, and we're going to unleash a manufacturing renaissance right here in Pennsylvania, including fracking like we've never fracked before. We're going to frack, frack frack."
    },
    {
      "text": "Our opponent said, \"There'll be no fracking, no fracking, we'll never frack, we'll never frack.\" I had one about a month ago, very, very rich guy, and he called me up. He said, \"President...\" I've known him for a long time. I don't say how long because I don't want my wife to hear that number. It's a long time. But he's very successful. And he said to me, \"Sir, could you do me a favor?\" Guy is worth billions of dollars. He said, \"Could you do me a favor? I can't get into a restaurant."
    },
    {
      "text": "Do you think you could call them to get me in?\" And I said, \"What the hell is the good of being rich if you can't get into a restaurant?\" () And I called the maitre D, \"Hi,\" I'm a little embarrassed, \"Hi, this is Donald Trump.\" \"I recognize your voice.\" I said, \"Would you do me a favor? A friend of mine is online about a mile back. This is a very successful restaurant. And he's got his wife.\" I describe the wife. \"Could you possibly go get them? Could you go get them and bring them in?\" And he did."
    },
    {
      "text": "And my friend called me up the next day. He said, \"Thank you very much. Thank you.\" Oh. Doctor, please? Doctor, in the house? Thank you. Thank you. Thank you very much, doctor. Yeah, thank you. Take your time, doctor please. We got plenty of time, right? We got a lot of time. You're doing okay? Take your time. We've got to protect our people, right? Take your time. It's all right, doctor. Go ahead. That's all right. That's all right. People come out two, three days ago and then they get... It's an amazing thing."
    },
    {
      "text": "It's an amazing thing. We appreciate... Everybody appreciates it. Yep. Take your time. That's great. That's great. Do we have the greatest people in the world? We have the greatest people in the world. First responders, thank you very much. Thank you, doctor. Great job. Thank you very much. Thank you all. Fellas, thank you. First responders, thank you very much. People are here for a long time and we appreciate it very much. And so sometimes that happens. A lot of times that happens actually. But you'll be great, you watch."
    },
    {
      "text": "So 12 weeks ago, we all took a bullet for America and all we are all asking is that everyone goes out and votes. We got to win. We can't let this happen to our country. We can't take another four years like this. We won't have a country left. We're not going to have a country left. And all of this will be for nothing if you don't get out and vote. It will all be for nothing. We will have talked about it."
    },
    {
      "text": "And if we do it'll be the greatest achievement, I think in the history of politics for all of us for this age because we're going to change our country around and fast. () We're going to do things that nobody thought were possible. We're going to do them fast. So Pennsylvania's time to stand up for America and time to save our country. This is really about saving our country. It's never been like this. When you look at the crime, look at the crime, look at the people that are coming in. Murderers."
    },
    {
      "text": "13,099 murderers led in over the last short period of time. () Murderers that have been released from penitentiaries, prisons, jails released into our country. Crime rates all over the world are down. They're taking their gang members and their criminals. They're taking their people in jail and they're releasing them into our country. We can't have it. We just can't have it. How do you get more simple than that? They're releasing murderers. They're releasing drug dealers. They're releasing gang members and criminals."
    },
    {
      "text": "Human traffickers. Mostly they traffic in women and they're releasing them all into our country, and they're emptying their jails. And their crime rates in Venezuela are way down because... But it's not only in South America, it's all over the world. And Africa, the Congo. () A lot of people coming out of the Congo in Africa. They're coming out from Asia. They're coming out from the Middle East, Yemen. They're coming out from Yemen."
    },
    {
      "text": "A lot of people coming out of Yemen, and they're known terrorists, and they just release them into our country from countries unknown also. They know nothing about the people. They'll go right in. These people are crazy. And we have to win. We'll stop it immediately and we'll have to... Look, it will be a big deportation. () We're going to deport these people. We're going to get them out of our country immediately. Or we won't have a country. And if we win Pennsylvania, we will win the whole thing."
    },
    {
      "text": "The whole thing will be won. So for the sake of our families, for the sake of our children, we will keep on going. And as the expression goes, I mean, I'm a little embarrassed to say it, to be honest you, but I'm going to say it because a lot of people do say it, we will fight, fight, fight. Going to fight for our country. We're going to fight for our country. And together we will save this country."
    },
    {
      "text": "We will restore the republic and America's future will be bigger, better, bolder, brighter, happier, stronger, freer and greater and more united than ever before. Our country will be united. You'll watch, you'll watch. We had the most successful country ever, maybe in the world during my term. We are the greatest economy that we've ever had. And you know what was happening? We were uniting the other side, radical left. People were coming over. They wanted to meet. They were coming over. Women, men."
    },
    {
      "text": "If you look at population, our black population, our Hispanic population, our Asian population, everybody was doing better. () People that went to the best schools and best colleges in the world got the highest marks. And people that couldn't get a high school degree, everybody was doing better. And our country was coming together. And then we got hit with COVID, a gift from China. Some people would call it the China virus. And we did a great job on that too. We did a great job. But the world was disturbed."
    },
    {
      "text": "() $60 trillion in damage worldwide. Tens of millions of people killed, and we still during this four-year period, we had the greatest economy. One of the great countries of the world. And we left with the stock market that was higher than it was just prior to COVID coming in. So what we did was something really incredible. But we had the greatest, most successful country ever. We had the greatest economy in our history and we're going to do it again. And maybe even better. We learned a lot."
    },
    {
      "text": "We learned a lot about people and about doing things, and what works, and what doesn't work. And we're going to do it. And it's going to be quick. It's going to be quick. () We're going to have safe cities, and we're going to have great cities again. And we're going to have a capital in Washington, DC which is right now crime-ridden. You leave from the great Commonwealth of Pennsylvania, you go drive down to Washington DC and you drive down and you end up getting murdered. You end up getting hurt, you get mugged."
    },
    {
      "text": "We are going to straighten out Washington DC. We're going to make it again, the most beautiful capital in the world. () We're not going to have graffiti. We're not going to have graffiti on our marble columns. We're not going to have roads that have potholes all over them and medians that are falling into the highways. We're going to run it properly. We're going to change it. We're going to run it properly. It's an embarrassment to us."
    },
    {
      "text": "Can you imagine foreign leaders coming in and running over roads that haven't been paved in years? We're honored to be joined tonight by one of the people who is going to help us build this incredible future. And he is a truly incredible guy. And I don't say that that often. () He's a great gentleman. He's done such an unbelievable job for North Carolina, for Georgia, for Alabama, for Florida, for Tennessee. His name is Elon Musk. He saved free speech. He created so many different great things. Where is he?"
    },
    {
      "text": "Come on up here, Elon. He created the first major American car company in generations. And his rocket company is the only reason we can now send American astronauts into space. Come here. Take over, Elon. Yes, take over. What a great guy. And he'd rather be making rocket ships because he'd really rather do that. Nobody better. I think he's got 90% of the rockets that go up. But Elon, thank you very much. Incredible, incredible. What he says is true. What he says is true. We're all having fun here tonight."
    },
    {
      "text": "But if we don't register and if we don't vote, we're just going to look upon this as another sort of nice day in our life. But it won't even be a nice day. We're going to look back and we're going to say, \"Wow, it's a lot of time, a lot of effort. We got to win.\" If we don't win, it's as he said, it's just not important. We have to save our country. So you have to get out and vote. You got to get out and vote. You got to get your friends and vote because they play a lot of tricks this particular other side."
    },
    {
      "text": "() Elon is a very nice guy. He doesn't want to say it, but they play a lot of tricks. We can't let it happen. We can't let it happen again. We can't let it happen. And one thing, they showed us how bad they are, they showed us how bad a job they do. So that's one thing we got from this four years. They've done the worst job. It's the worst president in the history of our country. It's the worst vice president in the history of our country. And if you watched over the last couple of days, they are doing..."
    },
    {
      "text": "This is a Katrina for them. () This is one of the worst. They say it's the worst job ever done on helping people through the ravages of a hurricane. And they're watching... She's out there, out there campaigning in San Francisco, a place that she ruined. Okay? She ruined. She ruined San Francisco. She ruined... Think of this. She ruined San Francisco. She was the worst DA. And she ruined the state of California, and now she wants to ruin the United States of America. We can't let her do it."
    },
    {
      "text": "() So I called Elon to tell him that they needed Starlink as an example. They couldn't get Starlink. I didn't know what Starlink was. I must tell you. Elon, I'm so embarrassed. I didn't know what the hell Starlink was. He loves Starlink. He can tell you every little screw that's needed, every wire. Me, I didn't know. But when I was in North Carolina and Georgia just the other day, yesterday to be exact, but they were saying, we have tremendous communications especially in North Carolina."
    },
    {
      "text": "And we have tremendous problems. We have no communication. The poles were ripped down, the wires were underwater, houses were destroyed. () Possibly a thousand people. Maybe more will be. There's 600 people missing. Missing is not good. Because you know what missing means generally. That's really bad. And they had no communication. They had literally no communication with, they called it the mainland because the water was so crazy. It was like they were in the middle of a lake and they'd never seen anything like it."
    },
    {
      "text": "And they said, \"Do you know somebody named Elon Musk?\" I said, \"Yeah, I happened to know him a little bit. He just endorsed me actually.\" () Well, he endorsed me a long time ago, but he still... To me, every day is a good endorsement from Elon. Nobody is smarter than Elon. And they said, \"Could you do us a favor? Could you help us? We're trying to get Starlink and it's very hard to get. Most people say, you can't even get it.\" I called up Elon. I said, \"North Carolina is in big trouble. Georgia is in big trouble."
    },
    {
      "text": "They need communication. They have none because their poles have been knocked down and their wires are underwater and even dangerous. dangerously underwater. But they have no communication. Elon, could you do something about Starlink? Whatever the hell that is, Elon. Whatever, Starlink. That's all they want to hear is Starlink.\" () And an amazing thing happened. I got a call from one of the top people in North Carolina. I got a call from another great person in Georgia."
    },
    {
      "text": "And I wasn't finished with my phone call yet, and they got word that Starlink would be delivered to the States. No. And I said, \"What the hell is he... What kind of a system is that? Normally you'd have to hang up and he'd go and call people.\" He did it during the phone call. What kind of a system do you have? That's why he's a very advanced, he is a very advanced person, but I want to thank you, Elon because I got it. And I said, \"How does it work?"
    },
    {
      "text": "Two days later, how does it work?\" They said, \"Much better than the wires.\" () So now I'm saying, \"Why the hell are they... You're going to come out very well anyway.\" And he also said, \"You don't have to pay me. You pay someday when you get the money back. You don't have to pay me.\" He wanted nothing. He's a great guy. Thank you, Elon, for being here. Thank you very much. Great honor, great honor. Thank you, Elon. And that's heartfelt. I can't even see the end. That's a lot of people here today."
    },
    {
      "text": "We're also joined by a great gentleman, a top, top, brilliant student. He went to a tremendous college and he graduated right at the top of his class in two years. I didn't know you could do, that's four-year college. Then he went to the military then he came out and he did fantastically inside the military. Then he came out, he went to Yale without the benefit of family ties. You know what that means? Right? That's pretty good without family ties. I don't know too many of those people. They had no family ties."
    },
    {
      "text": "He got in. He can't get in, and he graduated along with his wife. They're not going to have any problems with your kids academically. I can tell you. () His wife and him were like the top students in the class. But he went to Yale Law School and then he went out into the private sector, did great. Then he ran for the senate and he did fantastically. He won. And he's like a rocket ship. He's like one of Elon's rocket ships the way his career is going. But you see why? Because he's a really brilliant guy."
    },
    {
      "text": "And you saw that the other night in the debate. Right? You saw that the other night in the debate. You know the expression they have? If that were a fight, they would've stopped it. Right? () So I just want to thank JD. I was always confident in that pick. And we had great people too, JD. And my money's on that guy right there. We will rebuild our cities, including Washington, D.C., making them safe, clean, and beautiful again. And we will keep the US dollar as the world's reserve currency. It's losing right now."
    },
    {
      "text": "It's losing right now. But I'll be able to do it. Other people won't. I'll tell these countries, as they leave us on the... I say, \"You want to do business in the United States? You're going back into the reserve currency. And if you don't, we're going to charge you a big, fat, beautiful tax to do business in the United States.\" And they're going to say, \"I would love very much to go back into the US reserve currency.\" No, we're going to save it. But these people aren't going to save it."
    },
    {
      "text": "They don't know how to talk. They don't know how to think. (:43) Together, we will deliver low taxes, low regulations, low energy costs, low interest rates, and low inflation, so that everyone can afford groceries, a beautiful car, and a home. Very basic. It's very basic. We will stop the invasion, end migrant crime, strengthen our military, build a missile defense shield around our country, keep critical race theory and transgender insanity, we're going to keep it the hell out of our school."
    },
    {
      "text": "We're going to keep that insanity out of our school. And as I said, we will keep men out of women's sports. So demeaning to women. (:28) You saw that in the Olympics. They have female boxing, women's boxing, and a young lady from Italy, very good boxer, very, very good. She was all excited."
    },
    {
      "text": "But she played a person who transitioned, person transitioned, a male transitioned to a female, and the young girl from Italy, beautiful young woman, I'm not allowed to say that anymore politically, but I'll say it, she was a beautiful young woman. If you say that, that's the end of your career, right? But it's not. If it is, so be it, okay? We've got to get back to real life."
    },
    {
      "text": "But this beautiful young lady is out, and she gets, boom, a little jab, left jab, and she goes back, \"Oh my God, I've never been hit like that. This is just like a defensive.\" Then he goes, the corner said, \"You can take her!\" So, they push her out. Boom, another one. And she says, \"That's enough, I can't do it. I can't take it.\" I've never seen anything like it. So, we had two people that transitioned. Both people, shockingly, won the gold medal in their division. So, it's crazy."
    },
    {
      "text": "And if you look at weightlifting contests, they're the best of all. For years and years and years ago, they put an eighth of a pound on one side of the barbell, an eighth of a pound on the other. And they can't do it! And the record's standing for 18 years, they just can't do it. And then a guy comes along who never lifted before, and he puts a hundred pounds on, and he goes like this, like it's nothing. It's so demeaning to women. We're not going to allow it to happen. It's ending. No men playing in women's sport."
    },
    {
      "text": "(:06) And we will defend the Second Amendment, protect religious liberty, restore free speech, and we will secure our elections. Everyone will prosper, every family will thrive, and every day will be filled with opportunity and hope. We need hope. We need the American Dream back, don't we? We're going to have the American Dream. We're going to have the American Dream, so every kid in your family is going to grow up and say, \"I want to be like Elon Musk. I want to have $200 billion in cash."
    },
    {
      "text": "I'm going to be like Elon Musk.\" Get to it. That's the American Dream. (:44) But for that to happen, we must defeat Kamala Harris, and we must stop her country-destroying radical left agenda once and for all. We cannot have it happen. So, you must get out and you must vote. Here in this incredible Commonwealth, we stand on the shoulders of generations of Pennsylvania patriots, who gave everything they could give, every single thing, for their rights and for their freedom."
    },
    {
      "text": "Pennsylvania is where our founding fathers declared American independence and sounded the beautiful Liberty Bell. It's where the Army weathered its brutal winter at Valley Forge, where General George Washington led his men on a daring mission across the Delaware. And where generations of top, strong, beautiful miners and steelworkers put Pennsylvania spirit into every single thing they did."
    },
    {
      "text": "(:40) And from Gettysburg to Germantown, and Philadelphia to Barren Hill, and from Brandywine to right here in Butler, this is the place where Pennsylvania patriots poured out their blood with the love of their country. They love their country so much. And so, in honor of all those American heroes who came before us, we will press forward, we will push onward, and together we will win, win, win. We're going to win, win, win. Nothing will sway us, nothing will slow us, and no one will ever stop us."
    },
    {
      "text": "No matter what dangers come our way, no matter what obstacles we must face, we will keep striving toward our magnificent American future. We will not fail, we will not allow ourselves to fail. (:31) From this day forward, we will always put America first, and we'll take back and save the United States. November 5th, election day, will be the most important day in the history of our country. And together, with the great people of Pennsylvania, we will make America powerful again."
    },
    {
      "text": "We will make America wealthy again. We will make America healthy again. We will make America strong again. We will make America proud again. We will make America safe again. And we will make America great again. Thank you, Pennsylvania. God bless you. God bless you, Pennsylvania. Christopher, did you want [inaudible :08]? [inaudible :14]."
    }
  ]
}