{
  "speech_id": "409",
  "speaker": "Trump",
  "title": "Trump Speaks at October 7th Event",
  "date": "20241008",
  "url": "https://www.rev.com/blog/transcripts/trump-speaks-at-october-7th-event",
  "topics": "Climate, Government Policy",
  "num_segments": 13,
  "content": [
    {
      "text": "Wow, that was something, huh? Thank you very much, Miriam. Thank you. Very special woman. I have to say that. Friend of mine for a long time, and she is very, very special and her husband is, I mean, this was one tough cookie. He loved Israel. You talk about special, that was a special man, wasn't he? He was great. So, I want to thank you very much, Miriam and for all of the exceptional commitment that you've given to the safety and security and the prosperity of the United States and Israel."
    },
    {
      "text": "() Before we begin, I would like to tell you that there's a very violent hurricane that's coming down the line, and it's a category five, which is something that I've never heard a category five actually coming on to land, but it looks like it's going to, right smack in the middle of Florida. Nobody's seen a line like that and it's heading there quickly."
    },
    {
      "text": "() I have to tell you that I called Miriam, I said, I was in New York and I said, \"Miriam, maybe I shouldn't be flying.\" I think I'm the only person that flew down to Florida tonight because I didn't have a chance with her. I said, \"Miriam, maybe I should stay back. Heading into a hurricane, Miriam.\" () It made no difference. \"No, no, you have to be here. Our friends are there.\" And I said, \"Okay, when you say that I'm going to be there."
    },
    {
      "text": "100%, I'm going to be there.\" I was watching the airplane highways and they were all heading this way As I was going that way. They said, \"What's he doing?\" () But I wouldn't have missed this regardless. I wouldn't have missed this for anything. This is a very special time and it's a very special day. This is the day we have to do it. This was the day we had to do it. We don't have to postpone it for a week."
    },
    {
      "text": "This is the day because I'm looking forward to coming back and maybe seeing all of these seats filled up the next time. That's what I want. That's what we want. () So we're praying for Florida and we hope everyone is safe and we're praying for North Carolina and all of the different places. You look at Georgia, and Alabama, and Tennessee, and South Carolina, and Florida, it's amazing. This has been an amazing period of time, but the response has been very weak. Unbelievably weak."
    },
    {
      "text": "Nobody's ever seen such a weak response, so we have to get a strong response. Now, we have another one coming and it looks like it's going to be a whopper. () I also want to thank Rabbi Kaplan for doing such a great job. I appreciate it. Your son, I appreciate that. And we have a lot of very, very powerful people here tonight. Great people. Senator Rick Scott, a big fan of Miriam and a big fan of Israel. Members of Congress, Carlos Gimenez, Mario Diaz-Balart, thank you."
    },
    {
      "text": "Maria Salazar, Guy Reschenthaler, David Kustoff. () Congressman Lee Zeldin, he's helping us win New York. We got to win New York. We're going to see if we can do it right, Lee? We're going to see if we can do it. Ambassador David Friedman, what a job he did. Everybody loved him. Robin Bernstein. Where's Robin? Robin? Hi, Robin. How are you? Good job you did as the ambassador and Duke Buchan, thank you very much here. You raised a lot of money for our campaign. We appreciate it."
    },
    {
      "text": "() The consul general, and I think you all know, Maura, where are you? Where is he? Where is he? What a good job you've done. Where are you? Thank you very much. What a beautiful job. Thank you very much. Thank you. And Florida House members, Danny Perez and Randy Fine. Randy Fine. Where is Randy Fine? Randy Fine's been out there. Thank you, Randy. Great job. () State Senator Ileana Garcia, Keith Rabois, thank you. Ed Russo. Oh, Ed Russo, the environmental specialist."
    },
    {
      "text": "Whenever I have a problem, I call Ed Russo and he solves the environmental problem for me. We appreciate it. And somebody who's been a great defender of ours on television, on Fox and elsewhere, but particularly on Fox, Elizabeth Pipko. Where's Elizabeth? She has been so, so great. Thank you, Elizabeth. () And a person, one of the greatest business people in the country in the United States, and I think actually beyond."
    },
    {
      "text": "And she's been a fan and I've been a fan of hers, but she's been a friend of mine for a long time, Safra Catz. Thank you very much. Thank you, Safra. I haven't seen you. You look well. () So, we're here this evening in solemn remembrance of one of the darkest hours in all of human history. One year ago today, every civilized person was filled with shock and horror and grief at the news of an evil, and so absolute that nobody's seen anything like it. Nobody's seen anything that it really can barely be described."
    },
    {
      "text": "You can't describe it. () October 7th was not just the deadliest day for the Jewish people since the Holocaust, it was not just the worst terror attack since 911, it was an attack on humanity itself. It was a hideous, incredible cruelty. It was chilling savagery. It was demonic delight. The destruction of innocent life On October 7th, it seemed as if the gates of hell had sprung open and unleashed their horrors onto the world. () That's exactly what happened. What a moment in time."
    },
    {
      "text": "What a moment in horrible history. Horrible history. Today we mourn more than 1,200 innocent victims of the October 7th attacks, whose memory we honor with 1,200 beautiful individual candles. () We honor them with grace and with gratitude for their lives and for their families, what their families have gone through. Maybe we'll have a moment of silence, please. Thank you very much."
    },
    {
      "text": "() To every family that lost a loved one, I know so many of them, on that terrible day, including several here tonight, we grieve with you. We stand with you, and we make you this sacred and sacred vow. Very simple vow. A vow you've heard many times and sometimes it'"
    }
  ]
}