{
  "speech_id": "412",
  "speaker": "Trump",
  "title": "Donald Trump Delivers Speech in Iowa Transcript",
  "date": "20231009",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-delivers-speech-in-iowa-transcript",
  "topics": "Economy, Immigration, Infrastructure, Government Policy",
  "num_segments": 27,
  "content": [
    {
      "text": "But he was an amazing guy. And I said, \"Japan's really taken advantage of the United States, and so we have to do something.\" He said, \"I know.\" I said, \"What do you mean?\" He said, \"I know. I know you're going to be coming.\" And we ended up making an incredible deal, for farmers, manufacturers and everybody else. I mean, we had a horrible deal. We ended up making it a fair deal. A fair deal, a very good deal. They're tough to negotiate with, but a very good deal. He was a great guy. He was somebody that we missed."
    },
    {
      "text": "() We created the strongest border in U.S. history, you know that, right? Built nearly 500 miles. We got Mexico to give us free of charge, 28,000. So when these characters say, \"Oh, Mexico.\" When I say Mexico will pay for the wall, they did, much more so than the wall. They gave us 28,000 soldiers for free. That's why we had the safest border in the history of our country. We had 28,000 soldiers while I was building the wall. They were adding that other 200 miles. We would've done it."
    },
    {
      "text": "We would've had that done within three weeks. All we had to do is install the panels. They were all built. () Those are the ones you see sitting all over the ground. It's horrible. When I look at that, when I look at all of those things that we did, and then I just see the destruction that there's never been a president in the history of our country that's done a job so poorly, that's been so incompetent, so corrupt. There's never been anything like it."
    },
    {
      "text": "And I say oftentimes I'll say, you'll hear me say, \"You could take the five worst presidents in the history of our country, and they will have not... You can add them up and they will not have done the damage that crooked Joe Biden has done. And I mean that a hundred percent. () And now I could add it. I think I could probably say, take the 10 worst presidents, he's a horrible president. The only one that loves him, really loves him, is Jimmy Carter. Jimmy Carter's in this. Thank you. I got that thing off my back."
    },
    {
      "text": "No, I think Jimmy Carter's going to go down as one of the greatest presidents in history by comparison to crooked Joe Biden. I think Jimmy was great. So it's nice. He's pretty old, and he might even say, \"I really like Trump.\" He actually used to say, \"I really like Trump. I really like Trump.\" Then the Democrats got to him, but he changes to him pretty quickly. () But he did. He liked me. But he's the one, he's very happy with the job that Joe Biden is doing, which is basically a non-job."
    },
    {
      "text": "If he would've gone to the beach, he's got a consultant somewhere. This is the worst consultant in politics, that thinks he looks good in a bathing suit, right? Now he spends so much time at the beach. How do you do that? And I have a much better body than him, but I'm not really sure that I want to expose it, with the sun blaring down in the sand, the surf, the wind. I mean, it's not a pretty sight. () And they make those chairs. They're actually miracles. They weigh like three ounces."
    },
    {
      "text": "They're meant for a child to carry. A child, or a very old person to carry. Very, very old, I mean really old. And they weigh like ounces, right? He can't lift it. Remember what he said? \"I'd like to take him to the back of the barn.\" And I'd show up, I think I could go like this, and he'd go down. No, I think so. I hit a long ball, I hit a long ball in golf, I hit a long ball in golf, I'm a good golfer and all that stuff. This guy, I could hit a drive, it would take him four shots to catch up to where my drive is."
    },
    {
      "text": "() But he used to talk about how he wants to take me to the back. And the press never criticized him for that. If I said that about him, they'd say, \"How violent, he's bringing violence into the equation.\" Now, these are sick people. But if you want a president who leaves $500 million worth of wall materials, think of this, rusting in the desert, rusting in the sand, while illegal aliens stampede into your communities, walking over those panels, just walking right over them."
    },
    {
      "text": "They're laying there rusting and routing, brand new, beautiful stuff, then you should vote for crooked Joe Biden. () If on the other hand, you want a president who will seal the border, and by the way, let people come into our country, but they have to come in legally. Is that okay? But we have to stop the invasion and reclaim our sovereignty on day one. And that's what we will do, we will claim, because right now we don't even have a nation between our bad elections and our open borders."
    },
    {
      "text": "You need borders and you need elections, and then you start going from there. And we have horrible open borders. Who would even think... Think of it, the people coming in, think of it. They're from prisons and jails. There is a slight difference. () They're from mental institutions and insane asylums. There is a slight difference. A insane asylum is like Silence of the Lamb stuff. That's serious stuff. That's Hannibal Lecter. How good an actor was he? How good an actor was he? Did he play a good role, right?"
    },
    {
      "text": "But insane asylums, they're emptying them out. Mental institutions. And then of course, terrorists are coming in. And in 2019 there was a report, I saw it on one of the fake news channels, but in this case, I don't think it was fake. () They said that for 2019, I think the year was, they caught no terrorists, there were no terrorists coming into our country. And last month, as you know, they reported the highest number of terrorists that they've ever reported coming into our country."
    },
    {
      "text": "We're going to be paying a price, we're going to have the largest deportation operation in history, but we're going to be paying the price. () So as you also know, I appointed nearly 300 judges and three great Supreme Court justices who gave us incredible, incredible victories. Last week, I don't know, two weeks ago... If you go to college and you have bad marks and they let you in, but they don't let somebody else, it's called the merit system. They approved the merit system. Even I was surprised by that."
    },
    {
      "text": "They approved a merit system. So now you get into places, but in particular in this case, colleges, you have good marks and somebody has bad marks. You get in before other people got in for all sorts of reasons. They approved the merit system, is what this country is all about. Is that amazing? () And something that when politicians learn how to talk about it, they ended Roe v. Wade, they ended it. And politicians just don't know how to talk about it."
    },
    {
      "text": "And we talk about it, and we talk about it proudly, but they ended Roe v. Wade. But I watched some of the politicians, some of your local politicians, actually talking about it, they don't understand the Democrats or the radicals because they'll kill a baby in four months, five months, six months, seven months, eight months, nine months, and even after birth, they're allowed to kill in some cases after birth. () You remember the crazy former governor of Virginia, where he was explaining what happens."
    },
    {
      "text": "And then if it's after the ninth month and the baby is born, you put the baby aside, you discuss with the mother, and if the mother doesn't want the baby, we execute the baby. This is part of their thing. Now think of it. So they're the radicals, but you have to say that, they always make the pro-lifers, the radicals. They're the radicals. And when you think, now I happen to be like Ronald Reagan, the exceptions, rape, incest, life of the mother, the exceptions, three exceptions."
    },
    {
      "text": "I happen to be there, I think 75% or so. I see polls, I don't know, you have to follow your heart. () But very hard to win elections without that, to be honest. Very hard to win. But you have to be able to speak about the subject. What happened was an incredible... It was an incredible thing. They've been trying to get it for 52 years. They failed. For 52 years exactly, they've been trying to get it, get it terminated, bring it back to the states. So many different things we won."
    },
    {
      "text": "But before we had no power to negotiate, a pro-lifer had no power to negotiate. Now you have massive power to negotiate, and something will be negotiated, because you have two sides to every... Here you have people with other views, but we have a very strong view. () But we had no power whatsoever until I came along and appointed three people that made this possible. And so you have now massive power to negotiate."
    },
    {
      "text": "And remember, again, you have to say, I mean, again, you have to follow your heart, but the exceptions. But you have to say, and it's so important, you have to say, \"They are the radicals. We are not the radicals.\" You can't kill... One thing, every poll says, regardless of what side you're on, and it's very even, it's about 49/51, and then it's 51/49. It switches over the years. For decades, it switched. But you have to be able to say what's in your heart."
    },
    {
      "text": "() You have to be able to fight for that issue, if you believe in that issue. And a lot of people believe in that issue. But now for the first time, you have tremendous power to talk and to negotiate. The one thing the polls all say is that after the fourth month, or at least a certain number of months, everybody, no matter how much on the other side of the issue they are, don't want to see the baby killed. Everybody. And under Roe v. Wade, they could execute the baby at any time."
    },
    {
      "text": "You remember when I said with the debate, you rip the baby out of the womb with Hillary. I said, \"She's willing to rip the baby out of the womb in the ninth month.\" () And the whole place winced. Even she winced, because nobody wants to see after a certain time, any time, but after a certain time, almost 100 percent of the people agree, in the seventh month, the eighth month, the fourth month, but the ninth month and after birth, they don't want to see that happen. They don't want to see that take place."
    },
    {
      "text": "So when you speak about it properly, perhaps like I just spoke about it, I don't know. But when you speak about it properly, otherwise it's been a very devastating issue. That's what happened in the midterms. You had politicians that had no idea how to talk about the issue. () It was new. It was shocking because nobody thought it would happen. I got that for you, and I got that for a lot of people that they consider that to be the greatest achievement. But I just say, speak about it properly. Speak about it right."
    },
    {
      "text": "It's an amazing thing that happened. And now you have tremendous powers of negotiation. And some people say, \"Oh, Trump isn't pro-life enough.\" And other people look at him and say, \"I don't care what he's saying. That's the guy that got us here to talk in the first place. Because nobody else could have done it. Nobody else could have done.\" So you're going to speak about it. You're going to speak about it properly and intelligently. () It's a very, very complex issue and all."
    },
    {
      "text": "But we did a tremendous thing, because remember nobody at a certain period of time, nobody wants to see death to those babies. Nobody. You could say almost the most radical people on the other side. The Hamas terrorist invasion of Israeli territory, and the murder of Israeli soldiers today, and the brutal murder of citizens is an act of savagery that must and will be crushed, it has to be. It has to be dealt with very powerfully. This is a time where the United States needs leadership. We don't have leadership."
    },
    {
      "text": "() But Israel is at war, and the United States obviously is going to stick with Israel, and strongly. The war happened for two reasons. The United States is giving and gave to Iran $6 billion. 6 billion, over hostages. Over hostages. And there was a very good trade. They got five hostages. We got five hostages. Okay, that's the good news. The bad news is, and their hostages were tough, by the way. I have to tell you, that was... Okay. Let's assume they're doing just fine. But it was five for five."
    },
    {
      "text": "But in addition to that, we agreed to free up $6 billion. And that is a absolute disaster. () And I would not be at all surprised if part of that tremendous wealth that they just accumulated went into all of a sudden watching this level of aggression. They didn't have that level of aggression with me. They didn't have it. This would've never happened with me either. You know what wouldn't have happened? Ukraine wouldn't have happened. Taiwan and all this tough talk with Taiwan wouldn't have happened."
    },
    {
      "text": "And what's going on with Israel right now, people were shocked. I was in shock, because two weeks ago we gave them $6 billion. () Think of it. So we get five, they get five. But the difference is we have to give 6 billion. 6 billion! Does anyone know what a billion is? $ 6 billion. It's like it's water. And we have now, our country is a perceived, we're really a country that's looked at with this tremendous perceived weakness with a grossly incompetent and corrupt president. He's an incompetent man. He's corrupt."
    },
    {
      "text": "I don't know if he makes it to the start and get, I hope, I guess in a way he does, we want to... And I say it all the time, and I mean it 100 percent. I would rather that Joe Biden right now, instead of being one of the worst presidents. () And I think without question, the worst president, the most corrupt president, the most incompetent. I would rather have him be a great president, even though that would mean likely we wouldn't be doing this. Either that or we wouldn't win."
    }
  ]
}