{
  "speech_id": "413",
  "speaker": "Trump",
  "title": "Donald Trump Laura Ingraham Interview Transcript August 31: Says People “in the Dark Shadows” Controlling Biden",
  "date": "20200901",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-laura-ingraham-interview-transcript-august-31-says-people-in-the-dark-shadows-controlling-biden",
  "topics": "Social Justice, Gun Control, Government Policy",
  "num_segments": 50,
  "content": [
    {
      "text": "Thank you. Well, these are terrible and very incompetent people. Portland's been burning for many years, for decades it's been burning, but now it's gotten to a point they don't want to do... I watched the Mayor try and get in with these people. And he went to a protest and he went in there. They almost killed him. If he didn't have security, whatever he had, five security guards, he would have been dead, just like they would have done to Rand Paul, who's a great guy, and his wife, Kelly. It is a disgrace."
    },
    {
      "text": "When you look at what's happening. Now, we sent in Homeland Security. The reason we sent them in was to protect our courthouse. We have a $300 million courthouse, and they wanted to blow up our courthouse or burn it down. \"Take your choice, blow it up, or burn it down,\" they said, and I said, \"No, no, that's not happening.\" So they wouldn't protect it, because the Mayor said he doesn't care. So we sent in our Homeland people, they did a great job. Homeland Security. Immediately, it was protected."
    },
    {
      "text": "And that's the only reason they were there. I've offered to send in the National Guard. I've offered to send in anybody they want. I could put that out in 45 minutes and it would stop. And I think the people of Portland and the people of Oregon, I know it's a liberal state, considered liberal. They're tired of it. They're tired of living with this curse. They're living with a curse."
    },
    {
      "text": "They say that when you walk through the streets of Portland, this is years and years of burning and it's not- It's been horrible the last 90 days. But no, it's been going on for many... It's been going on for many, many years. It's like, you're in, I won't name the city, but it's the city someplace in the world that's not so good, okay? It's a terrible situation. Right? But they won't ever criticize anybody that truly, that's a violent person, frankly. That's violent. They stick up for the violence."
    },
    {
      "text": "The people that are getting hurt, they don't care about. They don't care about these people. It's a weird thing. It's like warped minds. And for the last 93 days, I've been offering to send in... And as you know, they have to take the offer. They have to ask to have help. I've been standing and I've been saying, \"Anytime you're ready, we'll put it out.\" I think it's a sickness, actually. I think they're are also, there's a fear. I watched the way they treated this Mayor Wheeler when he was standing there."
    },
    {
      "text": "And I'll tell you how unfair the news is. NBC news didn't show that he was being shouted at and cursed at. And he ran, literally he had to run for his life, because they were going to really hurt him. He had security. If he didn't, he would have probably- How he can still stick up for them. I think there's a fear. I think he's afraid. I don't know. No, I think that like the Mayor Wheeler, I think he's probably afraid for his life. Because if you would have seen him..."
    },
    {
      "text": "But I'll show you, had this on NBC news put on and they didn't have the people shouting, they had him standing there, and they talked about how it was a show of great unity. The mayor standing with the people. Those people were going to kill him. They were saying things that I can't repeat right now, but horrible things. But they didn't put that on. I actually happened to see the real tape on Fox. He escaped with his life, and yet he doesn't want any help. It's so unfair to the people of Oregon."
    },
    {
      "text": "We could solve that problem quickly. Like I did in Kenosha. You know, Kenosha went through three or four days of that. You wouldn't have a Kenosha right now. We demanded that they send in the National Guard. Called the governor. And in all fairness, the governor did it. Not enough, but it was enough to put it out. And we ultimately put in where we had 1,000 people and we put it out quickly. You wouldn't have Kenosha right now. Look, he's a weak person. He's been weak all his life, but now he's really weak."
    },
    {
      "text": "He shouldn't be running for president. He should not be there. No, I don't want them to. I want to leave it to law enforcement. But my supporters are wonderful, hardworking, tremendous people. And they turn on their television set, and they look at a Portland or they look at a Kenosha before I got involved and stopped it. Or they look at Chicago, where 78 people were shot last week and then numerous people died. Or they look at New York where violence is up by like what, 150%? It's up by a number that nobody..."
    },
    {
      "text": "And people are leaving. They're looking at all of this and they can't believe it. They can't believe it. Whether it's my supporter or not. Well, it's a peaceful protest. I mean, they were protesting. They weren't... You know, it's amazing. They want to protest and they get criticized. The other people run through the streets, burn down storefronts, hurt people, beat people and kill people, kick people in the face."
    },
    {
      "text": "That would have happened to Rand Paul, by the way, and his wife, except that you had two, and then ultimately four very good policeman, who took a big beating. They took a big beating and they really saved Rand Paul. In fact, we're going to bring them into the white house and give them some kind of an accommodation because they really... What they did was very brave, actually. I mean, can you imagine? I'm saying policemen were brave because they were escorting, but they're escorting a US Senator and his wife."
    },
    {
      "text": "And as Rand said, he would have been killed if they weren't there. It's a terrible- Sure. It's not only the Democrats, it's the media, the fake news. The news is so fake. Like I told you with the mayor, where they make them look like it's a great unity thing, when actually they were cursing at him and they would have done big numbers on him, but they don't show that. They just show the mayor standing with these very tough thugs and he was gone. Okay? They saved him. But NBC shows it like it's unity with the people."
    },
    {
      "text": "I don't get it. I don't know why they're doing it. And I will say this. At some point I will not be President. Hopefully that'll be in five years from now, but I will not be President. And they're going to die. They're all going to die. Can you imagine if they had to cover sleepy Joe Biden, it won't be very much fun. But much more importantly, our country would go to hell. Our stock markets will crash, as sure as you're sitting there. We will have problems like you've never had."
    },
    {
      "text": "But if you take Kenosha and if you take other parts of the country that I don't even talk about, I could show you things that we've done to stop this kind of a thing that's happening in Portland, and happening in Chicago, and happening in other places. So if it weren't Donald Trump's America, to just use the expression as I'm president, you would have riots like you've never seen. The Democrats have lost control of the radical left."
    },
    {
      "text": "And if you look at Bernie and the, I call it the manifesto that was agreed to with Biden and his crew, that's further left than Bernie ever was. They won't be able to control these people. These people have lost control of these people and it's hurting them. Don't forget, Biden wasn't going to come out of his basement until the election. Now he had to because the polls are so good for me. Now he had two because the polls are different. So all of a sudden he's in Pittsburgh. He wasn't going to leave his basement."
    },
    {
      "text": "Then he said, \"Okay,\" he's leaving. But he won't leave for 10 days. 10 days is a long time. So in the meantime, like on Sunday, or Saturday, I'm in Texas, I'm in Louisiana. I was going to stop in two other places. Fortunately, they didn't get hit. Arkansas wasn't hit very much, et cetera, et cetera. I would have stopped. But I'm all over the place. I leave early in the morning. I get home late at night. And that's what you have to do as president Joe doesn't have energy."
    },
    {
      "text": "Because I am a tremendous fan of law enforcement and I want to thank the law enforcement. They've done a good job. And when the governor says that I shouldn't come or he'd prefer that I not come, I'm the one that called him and said, \"Tony, you got to bring out the National Guard.\" \"Well, I don't really want to do it.\" \"Tony, you got to bring it out.\" And unlike your governor of Oregon, that just keeps saying no, he agreed to it at least. Now he agreed to a small number, but the small number was plenty."
    },
    {
      "text": "Oh, that's true. That's true. If you look at what's going on in, as you call it, blue state America, blue city America. You look at what's going on in New York. You look at what's going on in these states. Chicago is a disaster. Portland. You look at Portland. Now Portland's a little different. That's anarchists. And I actually think in many ways that's easier to handle. I think Portland is very easy to handle, because that's a group of anarchists that are paid by the outside."
    },
    {
      "text": "And you know, we put a lot of people in jail. I don't know if you know this or not. You remember three, four months ago, we were having a problem with monuments? They were ripping down statues and monuments [crosstalk :]. Oh, the Democrats had no control. It actually got out of control even for them. I signed in an executive order, 10 years in jail if you knock down a statue or monument. You haven't heard one thing about it. You haven't. We wouldn't have..."
    },
    {
      "text": "They were going after Thomas Jefferson, they were going after Lincoln. And they were going after the Washington monument, that they could knock that one down. They were going after it. And I actually don't even think they know. I think they're just thugs. I don't think it's... It may be an ideology and it may not. It is an ideology for the people that are paying them."
    },
    {
      "text": "And the funny thing is, and the strange thing is, the people that are paying them and all this money, because somebody's doing it [crosstalk :49] The people paying them, those people will be overthrown. Their lives will be taken away. Their lives will be endangered. They're all going to be gone. They're just stupid foolish people that made a lot of money. Because they're weak people led by weak people. In many cases, not all corporations."
    },
    {
      "text": "I looked at numbers where one company is giving hundreds of millions of dollars. Because they just do what's the easiest path. That's not the easy path. That's a very dangerous path. Black Lives Matter is a Marxist organization. You remember pigs in a blanket, fry them like bacon. That was the first time I ever heard of Black Lives Matter. I said, \"That's a terrible name. It's so discriminatory.\" It's bad for black people. It's bad for everybody. And all of a sudden it becomes like, sort of..."
    },
    {
      "text": "Although now if you look, it's gone way down, because people are tired of this stuff, what's going on. The Black Lives Matter. If you look at what's going on with the bats and a lot of thugs. Oh, it's terrible, what's going on. But Black Lives Matter came into existence, walking down the street, screaming, \"Pigs in a blanket, fry them like bacon.\" And that was about police officers that was representing police. They were pigs, pigs in a blanket, like the sausages or hot dogs, fry them like bacon."
    },
    {
      "text": "I think even worse, yeah. Probably. [crosstalk :23] I don't know, do you get worse? We have them all. So they have under investigation a lot. In fact, I'll show you. I just had this, because of this very important interview with you. But I just... And I'll give this to you. In Kansas City, violence has decreased by a third since the initiative began. In Indianapolis, 49 guns confiscated. More than 1000 arrests have been made under the initiative. DOJ is addressing violence and crime across the country."
    },
    {
      "text": "But you don't read that. The FBI and ATF are assisting the Portland police department, but you can't do much when you have absolutely no cooperation. Biden won't calm things down. They will take over. They will have won. If Biden gets in, they will have won. He's a weak person. He's controlled like a puppet. So it's not going to be calm things down. It's going to be, they will have won. They will have taken over your cities. It's a revolution. You understand that, it's a revolution."
    },
    {
      "text": "And the people of this country will not stand for that. They're not going to stand for that. The vast majority of people feel like me. They feel like... Every time I put law and order up on social media, it gets such an incredible positive response. The people of this country will not stand for it. If you say calm things down. Yeah. Calm things down, because they will have taken over. Take a look at what's going on. And Biden... Well, Biden is, I don't even like to mention Biden, because he's not controlling anything."
    },
    {
      "text": "People that you've never heard of. People that are in the dark shadows. People that are- People that you haven't heard of. There are people that are on the streets. There are people that are controlling the streets. We had somebody get on a plane from a certain city this weekend and in the plane, it was almost completely loaded with thugs wearing these dark uniforms, black uniforms with gear and this and that. They're on a plane. I'll tell you sometime, but it's under investigation right now."
    },
    {
      "text": "But they came from a certain city, and this person was coming to the Republican National Convention. And there were like seven people on the plane like this person. And then a lot of people were on the plane to do big damage. They were coming [crosstalk :12]- Yeah, this is all happening. Money is coming from some very stupid rich people, that have no idea that if their thing ever succeeded, which it won't, they will be thrown to the wolves like you've never seen before. Yep."
    },
    {
      "text": "Well, that's what they said last time, too. Okay. I have to be aggressive because I'm like standing here in a sea of incompetent people, stupid people, and violent people. Very violent. That's okay. It's also the kind, well ... Where are we? Oh, we're in the White House. I see. See. Okay? So I'm standing here in a sea of people, and we need law and order in this country, and women see that with me. You're never going to have law and order with Biden. Hey, look at Ferguson. Look what happened during the ..."
    },
    {
      "text": "You know, people forget. Look at all of those horrible race riots you had during Obama. Ferguson's just one that comes to mind. But you had them all the time. Look at all of what happened with Brown and this one and that one. Look at all of the problems you had under Obama. It was a disaster. It was actually worse than anything. This is a much different situation. Again, the anarchists in Portland are different than what's going on in Chicago. Chicago can be solved."
    },
    {
      "text": "I think it's actually a little bit more difficult to solve. I think the anarchists, in many ways, are much more solvable, but for women, more than anything else, they want security. They want safety. They have to have safety. They talk about the suburban woman. What I did recently, I ended the regulation that provided low-income housing, that mandated low-income housing- That was the Obama rule. It was a disaster. Oh, yeah. We already- [crosstalk :56] I know the suburbs, look ... Westchester was ground zero, okay?"
    },
    {
      "text": "For what they were trying to do. They were trying to destroy the suburban, beautiful place. The American dream, really. They wanted low-income housing, and with that comes a lot of other problems, including crime. May not be nice to say, but I'll say it. [crosstalk :18] No, I'm not saying that at all, but it does ... There is a level of violence that you don't see. So you have this beautiful community in the suburbs, including women, right? Women. They want security."
    },
    {
      "text": "I ended where they build low-income housing project right in the middle of your neighborhood. I ended it. If Biden gets in, he already said, it's going to go at a much higher rate than ever before, and you know who's going to be in charge of it? Cory Booker. That's going to be nice. Okay. So I think that women are going to want me, well, for a lot of other reasons. The stock markets will crash."
    },
    {
      "text": "As sure as you're sitting there, your 401(k)s will go down to a small percentage of what they are- He's going to do $4 trillion in tax increases. He's going to do things that are going to cost so much on the Green New Deal, which is done by a child. Okay? That's the mind of a child. Because the Green New Deal is ridiculous. It doesn't work. They're going to do things under the Green ... You know, the Green New Deal, if you actually did it, is $100 trillion."
    },
    {
      "text": "That's more money than this country could make in a thousand years- Let's rip down a building and build a new one with no windows. Okay? I've done criminal justice reform. I saved the historically black colleges and universities. What they went through was, for years, including Obama- Prison reform, criminal justice reform. Opportunity zone. More of the same. And in fact, I actually said in the speech, the best is yet to come. And I've been treated very well, at least in the polls, I hope."
    },
    {
      "text": "I hope that translates because, unfortunately, the African American, the Black community, has been so used to going and pressing the Democrat lever, and what have they got out of it? They've got nothing. Obama didn't give them criminal justice reform. I did. Obama didn't give them opportunity zones. I did. Obama didn't do all of the things, didn't save ... Obama could have saved the historically black colleges and universities. He didn't do anything for them. He didn't do anything for them. I've done more."
    },
    {
      "text": "And I said in the speech, some people would say, you shouldn't say it. It's too aggressive. I said, what's aggressive? I've done more than any president in the United ... in the history of our country, except for maybe Abe, and I say maybe, maybe, Abraham Lincoln. The reason I say maybe is I'll explain that to you later. Okay? Wait a minute. I've done more for the Black community than any president in the United States with the exception of Abraham Lincoln. And it's true."
    },
    {
      "text": "Criminal justice reform was such a big deal, and look what Biden did in 1994, what he did to people, to Black people. Well, he called them predators. Super predators, actually. He called them super predators. What the Black community wants in this country is they want police, and they want law and order. They don't want what's happening to their communities. They're being affected in a much harsher, meaner matter than anybody else. That includes Hispanics, who aren't doing very well, also."
    },
    {
      "text": "Look, they want law and order. They want the police. They do polls, and the polls are at 82, 83%. They want the police. They've gotten along with the police, and the police have been very badly mistreated because you have one bad apple, and it becomes a story for weeks. Oh, yeah. Dorn- Yeah, that's true. Yeah. That's true. Killed. The police are under siege because of things ... They can do 10,000 great acts, which is what they do. And one bad apple, or a choker, you know, a choker, they choke. Shooting the guy."
    },
    {
      "text": "Shooting the guy in the back many times. I mean, couldn't you have done something different? Couldn't you have wrestled him? In the meantime, he might've been going for a weapon, and there's a whole big thing there. But they choke. Just like in a golf tournament, they miss a three-foot- I'm saying people choke. People choke, and people are bad people. You have both. You have some bad people, and you have, they choke. You could be a police officer for 15 years, and all of a sudden you're confronted."
    },
    {
      "text": "You've got a quarter of a second to make a decision. If you don't make the decision and you're wrong, you're dead. People choke under those circumstances, and they make a bad decision. I've seen bad decisions of people that, it looked bad, but probably it was a choke. But you also have bad police, but you also ... The vast, not only the vast majority, thousands and thousands of great acts, and one bad one, and you make the evening news for weeks. The call is being made, as I understand it, yes."
    },
    {
      "text": "Well, once you get to a certain number, we use the word herd, right? Once you get to a certain number, it's going to go away. So, it doesn't have to be. But yeah, I mean, a lot of people are not going to want to do it. A lot of people don't want to do the flu vaccine. You know, I never had the flu, but I never had a shot. I never had the vaccine. I come here, the first thing is, sir, you have to have a flu shot. I said, \"Why?\" \"Because you have to have it.\" I say, \"What's the percentage?"
    },
    {
      "text": "And I wasn't thrilled with the percentage, it's like 50%, 55%.\" Well, I said, look, if I've never had it, wouldn't it be good? And then I thought I should have it because I'll set an example. So I had it. So I've had it now three times, and I still haven't had the flu. So maybe I'll give credit to the flu vaccine. I don't know. If I can say this. I think we're going to have a vaccine very soon. A lot of tremendous work has been done."
    },
    {
      "text": "We're going to have a vaccine, just like we have therapeutics, which to me are even more important. You go into the hospital, you make people better. That's to me the most, and we just did the convalescent plasma, I think. And you have other things too. So I think we're going to have a lot of therapeutics and we're going to have a vaccine very soon as to whether or not people take it- You add 35 to the people that have had it. And to all of the other things."
    },
    {
      "text": "People that have had it, where in theory, you can't get it, although they found one person and they're making a big deal. One person got it twice. But if you add it all up, it gives you very good protection. Yeah. Well, I think it's a very dangerous statement for him to make. Look, we did the right thing. We shut it down and now we built it up and we're setting records on job numbers. We're setting records on retail numbers."
    },
    {
      "text": "So this guy comes in, I heard it the other day, if they said, so that means that if some doctor said we have to shut it down, we're going to shut it down. We're setting records. By the way, the stock market is at an all time record right now. You look at what's going on in the stock market. Look at what's going on. We're going to have a phenomenal year, next year. We're going to have a great third quarter. Interestingly, the numbers for the third quarter will come out before the election."
    },
    {
      "text": "So what happens- [crosstalk :47]. Well, I can tell you what is happening. Nancy Pelosi doesn't want to give any stimulus. We should have it. It wasn't the people's fault that China gave us this virus. China gave us the virus. Whether it was through incompetence or on purpose. Well, I always tell her to go back to San Francisco, take care of your homeless problem. Take care of your problem in California. Because there's nothing like what I'm witnessing out there."
    },
    {
      "text": "Right outside, right where she lives right in her district is so bad. Needles all over the place- Well, we should have. We'd like to get it for the people because it wasn't their fault, but she doesn't want to give it because that will make the economy a little bit better and that would be a terrible thing. I get along with him very well. I disagree with a lot of what he said. He said, \"Keep it open for China.\" That was a big mistake, and he admits it."
    },
    {
      "text": "I get along with him, but every once in a while, he'll come up with one that I say, \"Where did that come from?\" I inherited him. He was here. He was a part of this huge piece of machine. I didn't put anybody in charge. He was here. He's been here for 40 years. Okay. He's been here for many, many years, but you inherit a lot of people. It's part of the machinery and you have some you love, some you don't. I like him, I don't agree with him that often, but I like him. Yeah."
    },
    {
      "text": "It's been different because I've accomplished so much. On the military, I've accomplished, first of all I'm bring in many of the troops home and most of the troops home, even cutting down Germany. Okay? Because they've taken advantage of us like you wouldn't believe. But it's been different for a lot of different reasons. I think primarily because I've accomplished so much."
    }
  ]
}