{
  "speech_id": "419",
  "title": "Donald Trump Press Conference Transcript September 11: Bahrain & Israel Normalize Relations",
  "date": "20200911",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-press-conference-transcript-september-11-bahrain-israel-normalize-relations",
  "topics": "Foreign Policy",
  "num_segments": 29,
  "content": [
    {
      "text": "Thank them for that there's no more powerful response to the hatred that spawned 9/11 than the agreement that we're about to tell you. You will hear something today that's I think very, very important for not only the Middle East but for the world. In the spirit of peace and cooperation, both leaders also agreed that Bahrain willfully normalize its diplomatic relations with Israel."
    },
    {
      "text": "They will exchange embassies and ambassadors, begin direct flights between their countries, and launch cooperation initiatives across a broad range of sectors including health, business, technology, education, security and agriculture. This is a truly historic day. There had been two peace agreements with Israel in the last 72 years. This is now the second peace agreement that we have announced in the last month and I am very hopeful that there will be more to follow."
    },
    {
      "text": "I can tell you there's tremendous enthusiasm on behalf of other countries to also join and we think ultimately you'll have most countries join and you're going to have the Palestinians in a very good position. They want to come in, they're going to want to come in because all of their friends are in but we have tremendous enthusiasm for coming into the deal."
    },
    {
      "text": "I want to thank the group of very talented people behind me and you're going to be hearing from them in a second but it's just a very historic day, a very important day and so interesting that it's on 9/11. It's such a great time. We didn't know this was going to happen in terms of the timing but it did happen and we're very honored by it. When I took office the Middle East was in a state of absolute chaos."
    },
    {
      "text": "I have restored trust with our regional partners and together we have eliminated the ISIS caliphate 100%, isolated the radicals who pervert Islam and sew instability. Today nations across the region and throughout the world are joining together, united in their determination to build a better future, free from the evils which perpetuate terror and I think you see that, I think you see that happening very, very strongly."
    },
    {
      "text": "I also spoke with King Salman of Saudi Arabia and we talked about this and he is a great gentleman and what they've done in terms of fighting terror is a much different ball game than it was before we attained this office, the fact is that Saudi Arabia was doing things that they're not doing anymore and so are other countries and neighbors. They are doing things that they just would never have done."
    },
    {
      "text": "Their levels and all of the things, all of the many, many elements of fighting and hate, they seem to be evaporating and we'll find out very soon but they seem to be evaporating. So things are happening in the Middle East that nobody thought was even possible to think about and that's what's going on right now."
    },
    {
      "text": "Bahrain has agreed to join Israel and the United Arab Emirates for, and by the way I want to thank Mohammed who is a great leader, a truly great leader, at the White House on Tuesday so they will be here on Tuesday for the signing of the Abraham Accords. The significance of the signing will be elevated from an already historic breakthrough to one representing a previously unthinkable regional transformation and that's exactly what it is."
    },
    {
      "text": "It's unthinkable that this could happen in so fast and as you know when we did the original signing with which will actually take place in terms of official on Tuesday, United Arab Emirates, people thought that was amazing and now they're hearing this and they're also hearing from other countries because they understand that other countries want to very much come in. On this occasion I want to thank the leaders of Israel and Bahrain for their vision and courage to forge this historic agreement."
    },
    {
      "text": "Their leadership is proving that the future can be filled with hope and does not need to be predetermined by conflicts of the past. You know all about the conflicts of the past, they are very legendary. There was a lot of problems going on but we have been able to work things out to a level that nobody thought possible. This is really something very special, very, very special."
    },
    {
      "text": "As more countries normalize relations with Israel which will happen quite quickly we believe, the region will become more and more stable, secure and prosperous. In the meantime we're pulling most of our soldiers out so we're doing it the opposite way. They were doing it with nothing but fighting and blood all over the place. The sand was loaded up with blood and now you're going to see that a lot of that sand is going to be loaded up with peace."
    },
    {
      "text": "The United States will continue to stand with the people of the region and work with them and build a brighter and much more hopeful future so we're very proud of this and as time goes by I think you'll see more and more why, I think most of you realize how important it is. Even the New York Times was very generous in their praise of the original deal and they never thought ..."
    },
    {
      "text": "Just on this deal because of the importance of the deal, we'll take some questions but first I'd like to ask Jared to say a few words and Mike Pence to say a few words and some of the folks, David, I'd like you to say something about it because it's so historic and these people have worked so hard and so long on it. This is really the culmination of a long period of time, let's put it that way. I don't want to say how long but it's a long period of time. It's a great thing. Jared, please."
    },
    {
      "text": "[inaudible :23] great job. Great job. Thank you very much, Jared. Mike, please. Thank you. Thank you very much Mike. Great. Our wonderful ambassador to Israel, David Friedman, who has been really something. He's been ... I put him there, I knew him for a long time. He was one of the most successful lawyers in the country by far and at least based on his paycheck I can tell you that and he's a great lawyer, he's a great talent and a great deal maker and I put him there for a reason, I put him there to get it done."
    },
    {
      "text": "[inaudible :29] just don't be a regular ambassador like so many are, just get it done, see if you can bring peace to the Middle East. David, please. Thank you David. Great job. Thank you. Avi, please. He looks young [inaudible :53] but I will tell you he's very smart. Go ahead. Thank you Avi. Speaker 6: () Mr."
    },
    {
      "text": "President, I think historians will look back on these two peace agreements as the beginning of the end of the Arab-Israeli conflict and you've talked about the journey to get here and I remember, I heard you pledge when you were in Riyadh and when you were in Israel, you pledged that you would strengthen America's friendships and to build new partnerships in the pursuit of peace and you kept that promise and we see that very clearly today."
    },
    {
      "text": "Rather than appeasing America's adversaries in the region, you recruited America's allies and you focused on shared interests and shared threats but you also asked them to shoulder their part of the burden and to fulfill their end of the obligations. Nations rallied behind it, and as a consequence, the foundation has now been laid for great things in the coming years. Great. Well said. Thank you very much. Would you have anything to say? Speaker 7: () Mr."
    },
    {
      "text": "I think it's very fitting that on September 11, we honor those special operators that we've buried and lost with peace and this is the way to beat terrorism at the end of the day so we're honored and privileged and thank you for your leadership. Well they had a lot of bad thinking and a lot of bad concepts, a lot of things that I never thought were going to work."
    },
    {
      "text": "These were the ones that we were relying on to make the deals and they wasted 35 years, they wasted many, many years and they are the ones that have been critical of us and look what's happening. Now they're all of a sudden saying thinking I think they made a mistake, they were all saying that about themselves."
    },
    {
      "text": "So I just want to thank this group in particular for staying here and helping us out and doing things that nobody thought could have happened and under the old concepts of national defense or whatever category you want to put it under, that wasn't working and it was never going to work and we changed things around very drastically and then we started to negotiate and the good news, I look at David because you know it, you see it, you hear it."
    },
    {
      "text": "The good news is we have many other countries now in the Middle East that want to be in this and that means peace because they're tired of fighting. They can fight and they're all great fighters and they're warriors but even great warriors get tired of fighting and they're tired of fighting and I can see things positively happening with Iran ultimately. I think that can all work out very well and I think that so many great things are going to happen and then we can also discuss the Palestinians."
    },
    {
      "text": "I think the Palestinians are going to end up doing something that's going to be very smart for them and all their friends are coming into this and they want to come into it, they want to come into it very badly and I can see a lot of good things happening with respect to the Palestinians which would be really wonderful, whether you were on their side or not on their side, people want to see it all brought to an end and brought to an end quickly so that's going to be very important, but this is a very historic day."
    },
    {
      "text": "Would anybody else like to say anything? Please, no, please. Speaker 8: () Mr. President, I just want to thank you and Ambassador O'Brien for giving me the opportunity to serve on the National Security Council staff and be part of something historic and be part of a team. Avi and Jared are tremendous leaders and the opportunity to work with them to do something important has been the highlight of my life, and thank you for letting me do that, sir. And you've been doing this for a long time."
    },
    {
      "text": "You never saw anything like this, right? Speaker 8: () No sir. We take a little bit of a different approach. Anybody? Please, come on, my friend. Speaker 9: () Mr. President, 19 years ago today, my father and I almost got caught in the crosshairs of that first jet that hit the Twin Towers. That event changed the course of my life, it led me to become a United States Marine which led to other things that brought me through a strange path here and I want to thank you for the leadership you've shown."
    },
    {
      "text": "Walter Russell Mead recently wrote, he was quoting Churchill who once said he got a bowl of pudding, he said, \"Take it away, it has no theme.\" There's now a theme emerging in the Middle East and it is the theme of what is possible from peace through strength, through not appeasing our enemies and holding our allies and friends close. So congratulations sir. Thank you very much and this is a very, very big day. Very, very big day. Would you like to say something?"
    },
    {
      "text": "Speaker 10: () Yes sir, like Matt and many others 19 years ago within a month of the attacks of 9/11, I and others were conducting operations in Afghanistan. As General Correa pointed out, it's a privilege to be in different historic circumstances today, to be part of a tremendous team with outstanding leadership, all of it possible sir because of your vision, because of your leadership and the relationships of everyone in this room. It's an enormous opportunity."
    },
    {
      "text": "It's something that no one can imagine but it's an enormous privilege and I'll always be grateful for it so congratulations to you sir and thank you to you and everyone else here. Well it is an honor to have worked with all of you. You're really talented people, incredible, and you are willing to be flexible."
    },
    {
      "text": "The word flexible is a very important word because we weren't going by the old standards and norms, we were going by standards that can get things done but not only get them done, get them done in a much better way and this is just the beginning. A lot of things are happening and they're happening very quickly. People want to be involved and they want to be involved ..."
    },
    {
      "text": "For the first time I think some of you have told me the first time ever that you've ever seen anything like this where they're rushing into an agreement. They want to be involved. They're tired of fighting as I said, they're tired of fighting no matter how they are, no matter how great a warrior they are and you have some great warriors. I know most of them but it's time. Thank you all very much. Thank you, please. Speaker 11: () [inaudible :30] Mr. President, can we ask you about this?"
    }
  ]
}