{
  "speech_id": "425",
  "speaker": "Trump",
  "title": "Donald Trump Hosts Latinos for Trump Event Transcript September 14",
  "date": "20200914",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-hosts-latinos-for-trump-event-transcript-september-14",
  "topics": "Economy, Government Policy",
  "num_segments": 59,
  "content": [
    {
      "text": "The fake news, they said that this is supposed to be a roundtable, but it looks like a rally, but it is a rally because we love each other. No, it is a roundtable and we're here to really listen. We're here to discuss the Latinos and the Hispanic Americans. I want to say you have a great Governor. He has been fantastic. Thank you. I love you, too. And we're really doing well. The country is doing numbers that... You will see."
    },
    {
      "text": "Next year is going to be, you know, you had your greatest year ever, Doug, last year, the best year you ever had. Then we had to close it up. We had to stop and we saved millions of lives by doing it. We saved millions of lives. And then we restarted and now we've set all kinds of records and we're setting records. And I think next year you're going to have a fantastic year. It's going to be great. We're cutting taxes even further. And we're going to have big growth. A lot of good things happening."
    },
    {
      "text": "But I'm thrilled to be back in Arizona with the... Thank you. By the way, I just looked. I see Artie over here. You've done a great job. How's Albert? Is he good? He's a good guy. Good job, Artie. So it's really great to be back. This is good. You know, this is what the polls are all saying too. As a Republican, Republicans don't do as well as perhaps they should. And probably some shouldn't do very well, but the polls came out and were leading sleepy Joe by a lot. And so it's a great honor to be here. President Donald J."
    },
    {
      "text": "But we're here to discuss my administration's unwavering devotion to Hispanic American communities, Hispanic Americans embody the American dream and they are great business people like this guy right here. They're great business people. Great, great business people. I know that because I've had to compete with them. They're not easy to compete with. I want to say that. Hispanic Americans strengthen our nation beyond description."
    },
    {
      "text": "You protect our nation as brave members of the military and as members of law enforcement, great, great members of law enforcement. You uplift the communities and promote our shared values of faith and family, community, hard work and patriotism. You're an amazing group of people. And I love you and we're taking care of you and I'm never letting you down. You'll never let you down. President Donald J. We're glad to be joined by your fantastic Governor, Doug Ducey. He's done a fantastic job. You've done a great job."
    },
    {
      "text": "Gov. He really has. It's been incredible. So, and thank you, Doug. Gov. Also, thanks to Arizona Republican Chairwoman, Kelli Ward. How are we doing, Kelli, by the way? Thanks, Kelli. Arizona State Representative T.J. Shope. Thank you very much. Thanks, T.J. Arizona Corporation Commissioner Leah Marquez Peterson. Thank you very much. Thank you very much. Thank you. Sergeant Jimmy Chavez of the National Troopers Coalition. Sergeant, thank you. We have the law enforcement from all over the country."
    },
    {
      "text": "Just got Florida, all the sheriffs, all the law enforcement, Ohio, Texas, everywhere, New York. We got New York's finest. They said they've never endorsed before, but they're endorsing this year. That took a little courage, too, because they're in very unfriendly territory politically. But New York did and we just got Chicago. Can you believe that? With that wonderful, wonderful mayor. President Donald J. We also have a man that I have a lot of respect. I like baseball."
    },
    {
      "text": "I've always liked baseball and he's done a fantastic job. Arte Moreno, the owner of the Los Angeles Angels. Doing a fantastic job. How is Albert Pujols doing? Good. I think he's great. Huh? Good. And you have a Mike Trout. So is he as good as they say? They say he's the best player. He said he's better. He's better. Right? But they say is the best player in baseball. Speaker 1: () One of the best. President Donald J. That's great. That's very good. Thanks, Arte. Congratulations on your success, too. Great job."
    },
    {
      "text": "Also with us are two wonderful Arizona Republican nominees for Congress, Tiffany Shedd and Brandon Martin. Thanks, Tiffany. Good luck. Good luck Thank you, Brendon. And you have my complete endorsement, you know that. Complete and total, as they say, complete and total, okay? And we'll be out working with you. We'll be helping you a lot. I hear both of you are doing really well. Very important. Doug is working hard on that. Thank you very much. President Donald J."
    },
    {
      "text": "Joe Biden has spent 47 years selling out the Hispanic American community, sending your jobs to China, raising your taxes, surging regulations. I don't know. He doesn't sound too good to me. He's coming up once every three, four days. I've been in every state. I've been in so many states the last few days. Yeah. Well you need a lot of energy to do this job properly. You can't be sitting in your basement for four days and come out. No, and then he comes out and I like Delaware."
    },
    {
      "text": "I think Delaware is a good place, but you got to leave it on occasion, you know. I mean, he comes up. President Donald J. And remember, they say that his home state is Pennsylvania. No, no, no. He left Pennsylvania when he was young. It's not his fault. Hiss father left, okay, and his mother. They left, but they left Pennsylvania when he was very young. And we just had a great ruling. Doug and I were talking."
    },
    {
      "text": "Just literally minutes ago, a federal judge, a very prominent, a very respected federal judge came out and ruled that they can't shut the state down any longer. It's too much. They can't do it. He said it was unconstitutional and it was a great ruling. President Donald J. And we hope that's going to happen in North Carolina. We hope that it's going to happen in North Carolina. We hope it's going to happen in Michigan too, because it's just totally shut down. Well, you know what's going to happen."
    },
    {
      "text": "On November 4th, they'll open up everything. They're just doing it. on November 4th, they'll announce everything's open now. You know, we were only kidding. The fact is that November 4th, you're going to see it's going to all open up. It's going to all open up. It's politics. President Donald J. So if you know, and as Hispanic Americans, you know better than anybody, we implemented historic tax cuts and regulation cuts, the biggest in the history of our country."
    },
    {
      "text": "And we built opportunity zones that have really benefited your state and a lot of other states. And it's been great for everybody, really, African Americans. And if you look at the African American, what they've done and how that's benefited them, was I was helped by Tim Scott of South Carolina. And he's a fantastic Senator. And he came in the idea of the opportunity zone, but for African Americans, Hispanic Americans, Asian Americans, and really everybody, it's been a tremendous success. President Donald J."
    },
    {
      "text": "Before the China virus came in, we achieved the lowest Hispanic American unemployment rate ever recorded ever. Not even close. Over 600,000 Hispanic Americans were lifted out of poverty in that short period of time. That's a record. All records, Hispanic American ownership, home ownership reached an all time high. And that includes Arte's home. Okay? That includes the home. Okay. That must be a nice home. I want to see that home."
    },
    {
      "text": "But it's the highest home ownership ever in the history of our country for Hispanic Americans. We built the greatest economy in history and now we're doing it again. So it's called make America great again. And I say, make America great again and again. Again and again. President Donald J. And we added, as you've probably heard, we added 3.3 million jobs for Hispanic Americans in the last four months. That's a record. So we're coming back very, very strong. I call it the super V."
    },
    {
      "text": "In July, I launched the White House Hispanic Prosperity Initiative to improve access to education and economic development and opportunity for all Hispanic Americans. It's been a very big success. We have great people on the board. And we have that Biden would, as you know, terminate this recovery because if a doctor said, \"Let's shut it down,\" we have all these records. We have retail sales records, everything. He said he'd shut it down. Can't shut it down. Peaceful protesters."
    },
    {
      "text": "Have you seen his peaceful protesters? These are not. They'll rip down your community. Many of these are Hispanic, American, small businesses, stores, shops, and they rip them down and they call it peaceful protesting. President Donald J. You see some of these reporters on television, they're saying, \"Yes, this has been a peaceful protest.\" And over his shoulder, it's a pretty famous clip. The entire city is burning down. And these are all Democrat mayors, super liberal usually, but Democrat mayors and governors."
    },
    {
      "text": "Republicans are doing very well. Republican cities and states are doing incredibly well. We're at records. We have been at records. We will be at records and we don't have anything like this. Nobody's ever seen anything like this. And we've sent the National Guard into Minneapolis and we ended it after a week and a half. They should have called it sooner. We would solve the problem in Portland in I say less than a half an hour. It would be solved. But they don't want to call us. They don't want to call us in."
    },
    {
      "text": "President Donald J. Every place we've gone, we solve it immediately. Seattle is an example. They took over a piece of the city and we said, \"What are you doing?\" And we complained, complained. We said, \"That's okay. We have to go in because we're supposed to wait. We're going in. And we're going in tomorrow.\" And we informed them we're going in. As soon as we did that, they had people go in and these wise guys gave up, those so-called protesters. They gave up. They're anarchists. They're not protesters."
    },
    {
      "text": "They're agitators and they're anarchists. President Donald J. So, you see what happens with the anti-police rhetoric from that whole group of Democrats and their supporters. They're endangering our law enforcement. We love our law enforcement. Many, many of the law enforcement are Hispanic Americans, as you know. Biden is not a strong person, never was a strong person. In prime time he wasn't any good. Let's face it. And this is not prime time for him. This is not prime time."
    },
    {
      "text": "But he'll surrender your entire country to the radical left. And that's all they're doing is using him. He has no clue. President Donald J. So we will take this to a whole different level. What we're doing is taking it to a whole different level. We don't want to have a socialist country. Some of you came from parts of the world where it's socialist or worse. You know, it's called the C word, right? The C word."
    },
    {
      "text": "Because I think in many cases, these people are talking even beyond socialism and we're not going to let that happen. We're not going to let the rule of law really just be ruled by the mob. We're going to do it. We're going to do it properly. We're going to do it the way we're doing it. President Donald J. And again, remember the top 10 are all Democrat. And then you go into the top 25 and you take a look at that. It's the same thing. It's all a Democrat problem."
    },
    {
      "text": "Whether it's New York, where crime is through the roof, it's gone up in some cases, 150 to 300%, not even recognizable. Or Chicago. You take a look at Chicago, what's happening. They had numbers that were just absolutely horrible. And I don't even want to mention it, but so many people shot, so many people killed. Nobody's ever heard of this. This is a Democrat runs the city. These are Democrats and they have no clue. President Donald J. They have no cash bail. They get rid of bail."
    },
    {
      "text": "They get rid of all of the things that you need. The police are afraid to do anything. They don't want to lose their pensions. They don't want to lose their life. They don't want to lose their family and their job and everything else that comes with it. And we have to give our great law enforcement people, we have to give them the respect that they deserve. And if we don't do that, they can never do their job properly. President Donald J. Thank you. Thank you. Thank you. Thank you very much."
    },
    {
      "text": "And just in closing up, I just say a few words more because it's so important to me, and your community is so important to me. But many Hispanic Americans came here to pursue the American dream, right? We all want the America. I want the American dream. We all want the American dream. If you look at what they're asking for, it's like the American nightmare or whatever you want to call it. But we want the American dream, having left countries that did not have safe streets."
    },
    {
      "text": "Many of you or your family, your mothers, your fathers, they left countries that were very, very bad, very bad, a lot of problems. And if we let this go on, you'd have that. President Donald J. And I often say, we're not going to be another Venezuela. We love the people of Venezuela. We have tremendous support in Miami, from Venezuelans and Cubans. We're not going to let that happen to our country. Nobody wants it. And you know who wants it least is Hispanic Americans."
    },
    {
      "text": "They want to see it less than anybody because they know about it more than anybody. And so we're not going to let that happen. President Donald J. Biden wants to take away your police. He wants to, I wouldn't say defund in his case, but I will tell you some of his compatriots want to defund your police. Let's face it. They want to defund your police. They want to take it away. I don't know who's going to do the job when they call up at night. You saw the commercial where you call up and they say, \"Murder, I'm sorry."
    },
    {
      "text": "We won't be here for 24 hours.\" And then they say, \"I'm sorry, rape. We won't be here for about a week. We'll call you back in a week.\" And this is what you'll end up with. We can't do it. We have to treasure our law enforcement. We have to let them do what they're good at. President Donald J. Another thing I think that's so important is that we're defending religious liberty and Joe Biden will totally eliminate religious liberty."
    },
    {
      "text": "He's going to take away your second amendment because he's not going to be what I had to put up with in the last four years to defend your second amendment. But you have to have your second amendment. And they're going to at least obliterate it. They're going to at least obliterate it. President Donald J. They're going to abolish school choice. They're going to abolish charter schools. And we're going to put charter schools all over wherever we can. We have so many people doing so well, and school choice."
    },
    {
      "text": "And we've been very hard on school choice and we'll get it very much achieved like we have. Nobody's done as much as we've done in three and a half years. Nobody. No administration in their first three and a half years. I say it. I say this that I've achieved more for Hispanic Americans in 47 months than Joe Biden is achieved in 47 years. It's true. It's true. They don't call him sleepy Joe for nothing, okay? President Donald J. But a vote for Republicans this November's a vote for the American dream."
    },
    {
      "text": "And that's all I have to say. I just want to thank you very much, and I want to thank you very much. And I look forward to hearing from some of the folks at the table and some of these people that I know. I have great respect for all of you I've heard of in one way or another. I want to thank you all for being here. Really, it's a great honor. And Arte, it's an honor meeting you. And maybe we'll start with our Governor, our great Governor. And Doug, please say a few words. Gov. Thank you. It's my honor, my honor. Gov."
    },
    {
      "text": "You know, Doug is very aggressive. He called me up. He called me up once he said, \"We really need ventilators badly.\" That's hard. You know, because it's like they're big, expensive, very complex, I mean, from a tech standpoint, a high tech standpoint, they have to be perfect. They're very hard and people don't have them. Countries don't have them. And now we've become the king. We're making them like you wouldn't believe. What did I say?"
    },
    {
      "text": "I said, \"How many do you need?\" \"Could you send us a thousand?\" I sent a thousand. That's a lot. But we got them to you. Did we get them to you? Gov. A lot of ventilators. President Donald J. Before this pandemic and after this pandemic, our economy has been booming in the state of Arizona. This has been the fastest growing state in the nation. Speaker 2: () In the state of Arizona. This has been the fastest growing state in the nation. Your jobs act and tax cut has done much dispar to our economy."
    },
    {
      "text": "The negotiation of the USMCA has allowed Arizona to maximize its relationship with its number one trading partner, Mexico. And we have now surpassed China with Canada as our number two trading partner in Arizona. President Donald J. Thank you guys very much. Speaker 2: () Thank you very much- President Donald J. And the relationship with Mexico has been really great. I'll tell you they have a very good president and we've gotten along very well and they've actually been very good. We've had a real relationship."
    },
    {
      "text": "NAFTA was a disaster for our country and now we have the USMCA, which is Mexico-Canada, and it's been a great... And we're not going to lose our businesses now to Mexico and Canada, they're going to stay right here. So they have a very big economic penalty if they want to play the games of leaving. I mean we lost 55,000 firms went down to different, I mean, different places, but a lot of them went to Mexico, a lot of them went to Canada. There's a very, very big disincentive to doing that."
    },
    {
      "text": "Well, I'd like to hear, as a baseball fan I'd like to hear from Arte, because he really has done, that team has been glamorized and it's a great team and great players, great individual players. And let me know about the team a little bit and how you're doing and let's hear it. Come on. That's a beautiful thing to own. Thank you very much. Thank you very much. Well, now I really like that team. I liked it before. I didn't know he was going to do that, but I tell you what, I appreciate it."
    },
    {
      "text": "And your story is an amazing story, it's a great story. Think of that. And he's one of the most respected people in sports and in business. And just a great story. Thank you very much. It's a great honor to be with you. Yeah. But they were nice. This is very special. Speaker 3: () Exactly. Exactly. Speaker 3: () My story is as 27, I was elected to the state legislature."
    },
    {
      "text": "I represent a very fast growing area between Phoenix and Tucson that has been in the news quite a bit with companies like Nikola Motors and Lucid Motors announcing their factories there. My family has been in the grocery business since 1952. They moved to Arizona because they failed at hog farming in Iowa, and I think you have to actually try to do that in Iowa. But opened up a business here in Arizona, their first business went bankrupt."
    },
    {
      "text": "They pulled themselves up, got back to work, opened a new grocery store later on, because you can do that in Arizona. President Donald J. That's great. Speaker 3: () You can do that in America, to be able to- Speaker 3: () To be able to have failure and to come back. And now here I am at age 27 in the state legislature, at 35 excuse me [crosstalk :51]. President Donald J. That's what I thought. Speaker 3: () Living a wonderful life. And it's something I think for a lot of the folks out right now to realize."
    },
    {
      "text": "It is difficult to be a minority and Republican at times because your friends, other members of your family, oftentimes don't understand, treat you differently, things like that. And you experience things that you probably shouldn't, but we're a very proud people, very happy to be up here. Actually in a few weeks, I'm going to be getting married to Melissa out there. She's wearing a dress by Ivanka. She's wearing a dress by Ivanka. President Donald J. Oh, that's very good. Speaker 3: () So you can share that."
    },
    {
      "text": "President Donald J. That's very nice. Speaker 3: () But more than anything, we, 100% believe in what you're doing and we want you to keep it up, and we know that the one way we can make sure that it keeps up is by getting out to vote and fully supporting the Trump re-election campaign, because that will also help us in Arizona be able to keep the State Senate and the State House. And we were very, very close. We want to have a huge turnout. We appreciate you coming. President Donald J. Thank you."
    },
    {
      "text": "Speaker 3: () Love that you're here and we hope to see you many more times. President Donald J. And it is getting a lot easier to be Republican for as you say, minority. It's getting a lot easier, whether you're Hispanic or anything else. It's a beautiful thing to see what's happening with the Republican Party. And remember it's the party of Abraham Lincoln. A lot of people forget that. Abraham Lincoln was a Republican."
    },
    {
      "text": "The other side likes to try and claim him, big disinformation, but they can't get away with that one so, hey, thank you very much. It's great. Please go ahead. Speaker 3: () Thank you. Speaker 4: () Thank you Mr. President. I'm here to share my American dream and I want everyone to know that our dream is still alive. The American dream is still alive. And I'm going to tell you a little bit about my story. I came here to the United States when I was 11 years old. My mom worked so hard to support all my siblings."
    },
    {
      "text": "When I was 22 years old, I got shot by the father of my kid, I survived horrible domestic violence. But after I got shot, after a month of getting better, I had two choices to make. One was to survive out of government welfare, survive out of government welfare or get a job. I chose to get a job as a janitor. Speaker 4: () Thank you. Because for so much long, for the first time I felt freedom. I felt that I needed to be free and I didn't want to be dependent on the government."
    },
    {
      "text": "So I started making $5 an hour in 1997. And I love my job so much that I worked my way up to become a supervisor manager, and then five years later, I ended up buying my company, my own janitorial company. Thank you. Thank you. Speaker 4: () And for me, that is looking at the American dream. A high school dropout, they didn't finish high school. I mean, what else can they do but to clean very well and move up the ladder. That is the real American dream. President Donald J. That's great. Thank you very much."
    },
    {
      "text": "Speaker 4: () That's what happens here. Going to work eight hours a day, we end up working 16 hours a day for the next five years to pay off the big loans and my fiance, [inaudible :46], now my husband is here, helped, I mean, put together. So after five years in 2005, we paid it all off. Then after that, I started feeling that I was getting more free and more free and I'm a giver. I like to help. If God takes care of me, I take care of others. So what I do- Speaker 4: () Thank you."
    },
    {
      "text": "Speaker 4: () So at that time in 2005, I had already 60 employees working for me. And one of the things that I love and do for them is help them learn English, help them buy their first car, help them get their first home. But most of the things that I enjoy the most is teaching them English and make them become US citizens. And over the course- Speaker 4: () Over the course of I would say maybe 15 years, probably, my husband and I helped more than 30 people become US citizens. President Donald J. Great."
    },
    {
      "text": "Speaker 4: () And I'm so proud of that. It's incredible. Then my American dream was keep coming. I became a US citizen in 2008. I kept living my American dream and then 2012 came. That's when Obamacare came. And I keep hearing in the news, if you have more than 50 employees, you have to cut back or you have to do something. And I told my husband, \"What's going on? Why am I have to lay off people?\" And that's when I started getting involved more into what's going on. Why is the government telling me what to do?"
    },
    {
      "text": "I worked so hard for what I have. Why did they have to get in my business? Why do I have to let people go? Speaker 4: () Thank you. So I started getting involved into local politics and see what they were doing, so they can hear my American dream and see, I'm still here, I'm still alive, I want to keep moving now. I don't like to sit and listen. I'm the one that wants to get active and do something about it if there's a problem. So that's what I did and look where it got me."
    },
    {
      "text": "Now, I'm here next to the president getting involved- President Donald J. Thank you. Thank you. Speaker 4: () Let's protect our country, let's protect our American dream. We're all Americans. It doesn't matter where you come from. This is our safe heaven. Please let's put President Trump again for the next four years. We need to [inaudible : 29]. President Donald J. Thank you very much. Thank you very much. Thank you. Thank you very much. Good. Good. Good. Thank you. Great. That's a great job. Beautiful story. Thank you."
    },
    {
      "text": "Thank you very much. Thank you. Thank you. Thank you very much. Thank you very much. Thank you very much. And look what happened in New York where they cut a billion dollars and they got rid of a lot of great, great crime fighters. And look at what happened in a short period. Sounds good. Good governor there. Good governor. Thank you very much. Appreciate it. Please. Has to be doing well. How's it doing? Wasn't doing well for a little while, now it's doing good right? That's good. That's good. Yes, I know. Thank you, sir."
    },
    {
      "text": "Thank you very much. Thank you. Thank you, sir. But the real reason is that, I tweeted out, I saw they were giving him a hard time and I tweeted out, this is a great couple. And I looked at him, I said, \"Look at this couple.\" And they were giving him a hard time and they were trying to do a boycott because this other side is very vicious. They'll try and do boycotts. So I said, \"You know what?"
    },
    {
      "text": "It's not very presidential, but I'm going to do a tweet for Sammy and his beautiful wife.\" And you never saw lines like this ever before. And that's the reason. And I'll tell you, you've been great. And I appreciate it. I hear the places is doing fantastic. Yeah, go ahead. Thank you. I will. Beautiful. Wow. That was a good job. That was actually very good. Are you proud of him? Thank you. Go ahead. Speaker 6: () [inaudible :43]. President Donald J. Follow that. Go follow that. Good. That's really nice. Thank you. Beautiful."
    },
    {
      "text": "Say hello to your wife, please. That's really nice. I appreciate it. We have made a lot of strides with the opioid and the drugs, but you get set back with this China virus was a big setback, but now we're back to business, but we did get set back with this horrible thing that was sent. It could have been stopped. It should have been stopped. It should have been stopped. They stopped it going into their country, but not coming into our country, not coming into Europe and the rest of the world."
    },
    {
      "text": "But I appreciate, those are beautiful words. Thank you very much. Please, go ahead. Good. That's great. Thank you. Thank you. Not going to happen here. Thank you very much. Thank you very much. Please. Thank you very much. Oh, great. That's good. That's good. Great. Thank you very much. Thank you. Great job. Great job, thank you. School choice, absolutely right. Thank you. Please. Thank you. And they're beautiful. And they're beautiful kids too. Thank you- ... it's really nice. Thank you. Thank you. That's a great job."
    },
    {
      "text": "That's a great job. Thank you very much. Please. That's great, thank you. It's really nice, thank you very much. That's a nice looking good too. Nice looking. Beautiful. Thank you. Thank you very much. Thank you very much. That's great. That's great. [inaudible : 31]. Thank you very much. [inaudible :37]. Great. Well, I just want to finish by saying my people told me this was going to take about one-third of the time, but after these stories started going, I wasn't leaving."
    },
    {
      "text": "I want to tell you, they are incredible stories, success stories, all success stories. You've done so well. The Hispanic community is amazing. I knew that from many years ago, long before I thought about doing this whole deal in politics. I didn't have to be told about the Hispanic community. I dealt with them. Natural business people, great business people. Great, great business people. You have to be very sharp when you deal with Hispanic Americans, or my Latinos."
    },
    {
      "text": "I love the Latinos, but I've always known how great you were. And [Arty's :25] a great example of it, one of your great examples of it. But it's a fantastic community. I will never let you down. I will tell you, I'll never let you down. Thank you. Thank you very much. Thank you. Thank you very much. Artie, thank you very much. [inaudible :45]."
    }
  ]
}