{
  "speech_id": "427",
  "title": "Donald Trump Receives Briefing on California Wildfires Transcript September 14",
  "date": "20200914",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-receives-briefing-on-california-wildfires-transcript-september-14",
  "topics": "Climate, Government Policy, Veterans Affairs",
  "num_segments": 22,
  "content": [
    {
      "text": "Secretary of Homeland security, Chad Wolf, FEMA administrator, Pete Gayner, and all of the people, state local leaders, they join us today and we're having a separate news conference a little bit later on some other subjects. And I just want to thank everybody. It's been pretty amazing. In August, I approved a major disaster declaration for California. I've approved... I think Gavin about 40 Stafford Act declarations."
    },
    {
      "text": "So very quickly because we want to get this thing taken care of, including fire management, assistant grants, to help multiple states stop the fires. More than 28,000 firefighters and first responders are combating the fires in California, Oregon, and Washington. Over 230 soldiers are fighting the August complex fire, and that's the largest fire in California. That's the big one. That's the biggest. And we want to thank all of the brave fighters."
    },
    {
      "text": "We want to thank these incredible people, the first responders, service members who are racing to the extreme peril really, their lives in extreme danger. Soon after the event, I'll present the distinguished flying cross to seven military heroes who recently brave raging fire and suffocating smoke to save lives. So we have seven people that were recommended very strongly by your representatives, and we're going to give them a very nice medal, very important medal."
    },
    {
      "text": "A US medal that's very powerful, very important. So I know you like that. Together, we'll keep the people safe. I want to thank the governor for the job he's done. We've had great coordination, great relationship. I know we come from different sides of the planet, but we actually have a very good relationship. Good man. And governor, would you like to say something? Absolutely. Chad, please. Well, they're doing a great job, and they really have over the years. It's a tough battle, but they've never let us down."
    },
    {
      "text": "Incredible what they're able to do and the risk and the danger. Pete Gaynor, please, FEMA. That's great. Thank you, Pete. Great job. Let everybody know what we think. Incredible job. So Wade and Tom, please. Okay. It'll start getting cooler. You just watch. Well, I don't think science knows, actually. Tom, please. Yeah, I'd love that. Thank you. Go ahead. And why is that? Why are you doing that? Really? Right. Would those trees have died anyway from the beetle kill?"
    },
    {
      "text": "So they were largely dead or the area was largely dead in terms of the trees? Yeah. Do you view that differently, when the trees are dead in the whole area, because I know the beetle kill has been terrible. So do you view that differently? And now you're going to be clearing it or doing whatever you're going to do. But those trees are dead and therefore they're very flammable? They're explosive? So why is that, because of the thickness, the power of the tree? Why aren't they burning? ... and they're very wet?"
    },
    {
      "text": "Are you losing some redwoods or almost none. No kidding, that's something. I'd never heard that before. So with time, they could go. But, but the fact is they don't go with the fires. That's a fantastic- That is so incredible. Think of that. Yeah. So you're giant redwoods are where? What area? The giant redwoods. And they're in good shape? Do you see a big difference? Will that change with time, where you don't see it? Or will you always know there was a fire there. You'll always know? On the redwoods? Yeah."
    },
    {
      "text": "Well that in itself is a shame when you think, right? That in itself is a shame. That's an incredible story. Thank you very much. Appreciate it. Mark, would you like to say something? Right, right. How many individual fires do you have? So when you add them all up, this is about as big as it's ever been, right? So we put them out? Most of them are put out? Yeah. Right? Right. That was a bad one. We were there together. Let me ask you in Paradise, so did they have, it was like a blow torch, right?"
    },
    {
      "text": "Because the winds are 85 miles an hour. Nobody's ever seen anything like that. So that was different. Has there ever been anything like that in terms of the power and the heat? I see. So that creates the heat also? That's incredible. Would you like to say something, please? Speaker 9: () Well, thank you Mr. President for coming and visiting California and on behalf of Fresno County, who I'm speaking for today, I want to thank you for your visit. Speaker 9: () Beginning on September 4th, our Creek Fire started."
    },
    {
      "text": "It impacted not only the residents, but utility infrastructure that services California. Yeah, That's right. That's right. That's a big problem, isn't it? How is that going? Good. Good. That's a lot of utilities that are burning up though. Yeah, go ahead. Speaker 9: () Our fire right now is over 200,000 acres and it's really more than any single local government can take care of. And so we are asking for assistance. We've already made some progress today by getting a hold of FEMA."
    },
    {
      "text": "Speaker 9: () And I made a request from Pete to have a representative right in our command post and we're making that happen so that's going to be very valuable for us. Not only has it impacted our woodland, but the families that have lived there for generations in that area, the Big Creek Hydroelectric power generating system that served California for over a hundred years is destroyed as well as the people that live there in their homes that operate that system."
    },
    {
      "text": "Speaker 9: () One major concern in the future is erosion, slope, stability, ash runoff, and possible mud slides as a result. [crosstalk :53]. So what's going to take the place of that generator? What are you going to do? Speaker 9: () We have to actually restart it at Southern California Edison. You'll be able to fix it and restart it? It's a big damage? Big? I see. I love hydro. Hydroelectric. I love, I think it's great. You must like that. I love the hydroelectric. Go ahead please."
    },
    {
      "text": "Speaker 9: () So far we've had over 300 structures that have burned, but we could have had many more and I need to commend the efforts that Cal Fire gave to us not only with pre-work by doing some tree mortality mitigation- Right. Speaker 9: () ... but during that fire, they were able to cut some breaks that allowed law enforcement to evacuate over 20,000 people from these areas. So they did a great job and I'm glad to report that in Fresno County, we've had no loss of life. Great."
    },
    {
      "text": "Speaker 9: () And I will say that in Fresno County, we understand that we need a strong partnership with our federal government and we are ready, willing, and able to be your partner on this. We support- And your state government. Speaker 9: () Of course. That's going good, right? Speaker 9: () We're getting what we need. I have no doubt. Good. We ought to mention that. Speaker 9: () Of the areas that we've mitigated, I think in Fresno County, we got five of those so thank you."
    },
    {
      "text": "So you're working well with every body? Speaker 9: () Yes. Okay. Speaker 9: () Yes. Good. Thank you very much. I appreciate it. Thank you. Please. Speaker 10: () Thank you, Mr. President for... On? Thank you Mr. President for being here and listening to a very rural community and county in California. I am at the far extreme end of the state up there they were pointing to. My county continues to repeat the things that you saw in Paradise when you were there, on a smaller scale."
    },
    {
      "text": "Speaker 10: () The town of Happy Camp this year is under the Slater Fire that took off, and in a 24 hour period, we lost 258 structures in a very small town. Half of my population is displaced. At this point in time, we have 158 homes completely destroyed. Will that population come back? Speaker 10: () Sir, that's a tough question because these are very poor people anyway, and they're living through the downturn of the timber economy at this point and there's very low employment in this area."
    },
    {
      "text": "We are completely surrounded by federal timber at this point that needs some active forest management that would both improve the economy of the area, as well as even increase the water flow that is in shortage in California in some of these places. Speaker 10: () Personally, I'm been coming to you as a forester, an elected official in a past land manager for the US Forest Service and firefighter. Right. Speaker 10: () In this area, I've worked with UC Berkeley and UC Merced on some studies."
    },
    {
      "text": "Our forests in the northern region, which historically have been pretty asbestos-like, are carrying four times the density that they did in 1930. Speaker 10: () So we have both the increase in brush in the Wildland Interface, as well as the lack of management producing these extreme densities and climate changes. And I can't do much about that as a forester actively managing that forest, I can manipulate fuels and I can do that in a pretty short order. Speaker 10: () I applaud you for the work you've done."
    },
    {
      "text": "I applaud you for the Farm Bill authorities, our County just completed a master stewardship agreement with the US Forest Service. And we have about a half million acre project that's ready to go across all boundaries in our state and- Good. Speaker 10: () ... and the four national forest within our boundary. Well, Gavin's working on that with me. You know, you make money too. You're cutting down trees. You're thinning it out and you're selling those trees for a lot of money."
    },
    {
      "text": "And it's really pretty good in a lot of ways. And I guess one of the things are the cuts, the big, whether it's 50 yards or 100 yards, but the cuts to stop it from spreading. And that's always tough environmentally, but you know, they can do it in a way that's pretty good. And I think now the environmentalists have come a long way after watching this. Speaker 10: () Yeah. The ones that really want to take care of a problem, they've come a long way. So there'll be thinning it out, then."
    },
    {
      "text": "You're working on a plan to thin it out? Speaker 10: () That's what the plan is right now. I will say that we have a excellent working relationships with CAL FIRE as well. Good. Speaker 10: () And we need to marry the state programs with the federal programs across the boundaries and jurisdictional boundaries so that we're effective in moderating large fire behavior. Good. Yeah, well I'm all for it. That's something that I feel so strongly about. You can knock this down to nothing."
    },
    {
      "text": "You go to Europe and different places in Europe, countries where they're forest countries, and they're very, very strong on management and they don't have a problem. They really don't have with, as they say, more explosive trees than we have in California. So thank you very much for your comments, but we're working on that very hard together and I think we're totally in sync. I really think we're totally in sync. Speaker 11: () Governor?"
    }
  ]
}