{
  "speech_id": "428",
  "speaker": "Trump",
  "title": "Abraham Accords Signing Ceremony Transcript September 15",
  "date": "20200915",
  "url": "https://www.rev.com/blog/transcripts/abraham-accords-signing-ceremony-transcript-september-15",
  "topics": "Foreign Policy",
  "num_segments": 15,
  "content": [
    {
      "text": "Thank you very much. Please. Thank you. The First Lady and I are honored to welcome to the White House Prime Minister Netanyahu of Israel, and Mrs. Netanyahu. Thank you so much. Thank you, Sara. And Foreign Minister Abdullah bin Zayed, United Arab Emirates, UAE. Thank you very much. And Foreign Minister Abdullatif Al Zayani of Bahrain. Thank you. Thank you very much. We're here this afternoon to change the course of history. After decades of division and conflict, we mark the dawn of a new Middle East."
    },
    {
      "text": "Thanks to the great courage of the leaders of these three countries, we take a major stride toward a future in which people of all faiths and backgrounds live together in peace and prosperity. In a few moments, these visionary leaders will sign the first two peace deals between Israel and the Arab state in more than a quarter century. In Israel's entire history, there have previously been only two such agreements; now we have achieved two in a single month, and there are more to follow."
    },
    {
      "text": "Israel, the United Arab Emirates and Bahrain will establish embassies, exchange ambassadors, and begin to cooperate and work together so strongly, to cooperate as partners across the broad range of sectors from tourism to trade and healthcare to security; they're going to work together. They are friends. The Abraham Accords also open the door for Muslims around the world to visit the historic sites in Israel and to peacefully pray at Al-Aqsa Mosque in Jerusalem, the third holiest site in Islam."
    },
    {
      "text": "Together, these agreements will serve as the foundation for a comprehensive piece across the entire region, something which nobody thought was possible, certainly not in this day and age, maybe in many decades from now, but one founded on shared interests, mutual respect and friendship, to our honored guests from Israel, the United Arab Emirates and Bahrain. Congratulations on this outstanding achievement. Congratulations. Fantastic. I also want to thank Vice President Mike Pence. Thank you, Mike. Great job."
    },
    {
      "text": "Secretary of State Mike Pompeo. Mike, thank you very much. National Security Advisor Robert O'Brien. Robert, thank you. Mr. Jared Kushner. Jared, thank you very much. Ambassador Brian Hook. Thank you very much, Brian. Thank you. Thank you. And Avi Berkowitz. Avi, thank you very much. I also want to give a very special thanks, he's been an incredible ambassador to Israel, David Friedman. That's a very great group of people, great group of patriots."
    },
    {
      "text": "They wanted this to happen so badly, they worked so hard, and again, nobody thought it could happen and they thought it could happen; they never even doubted it. So I want to thank you all very much. Thank you. For generations, the people of the Middle East have been held back by old conflicts, hostilities, lies treachery; so many things held them back. Actually, lies that the Jews and Arabs were enemies and that Al Aqsa Mosque was under attack. Constantly, they would say it was under attack."
    },
    {
      "text": "These lies passed down from generation to generation fueled a vicious cycle of terror and violence that spread across the region and all over the world. These agreements prove that the nations of the region are breaking free from the failed approaches of the past. Today's signing sets history on a new course, and there will be other countries very, very soon that will follow these great leaders."
    },
    {
      "text": "The people of the Middle East will no longer allow hatred of Israel to be fomented as an excuse for radicalism or extremism. So important. And they'll no longer allow the great destiny of their region to be denied. On my first foreign trip as president, I had the honor of addressing the leaders of more than 54 Arab and Muslim nations in Saudi Arabia. My message that day was very simple."
    },
    {
      "text": "I urged the nations of the Middle East to set aside their differences, unite against the common enemy of civilization, and work together toward the noble aims of security and prosperity. I offered America's friendship, I offered America's help, but I said clearly that the nations of the regions had to decide what kind of a future they wanted for their children and for their families and for their nation itself. No one could make that choice for them. They had to do that themselves."
    },
    {
      "text": "Today, the world sees that they're choosing cooperation over conflict, friendship over enmity, prosperity over poverty, and hope over despair. They are choosing a future in which Arabs and Israelis, Muslims, Jews, and Christians can live together, pray together and dream together, side by side in harmony, community and peace. Once again, let me congratulate the people of Israel, the people of the United Arab Emirates and the people of the kingdom of Bahrain. God bless you all."
    },
    {
      "text": "This is an incredible day for the world. This is a really wonderful and beautiful occasion. I want to thank all of the members of Congress for being here, senators, Congressmen, Congresswoman. We just appreciate it so much. Everybody wanted to be here. It's a very important day for the world. It's a very important day for peace."
    },
    {
      "text": "Before the parties sign the Accords, I'd like to ask Prime Minister Netanyahu to say a few words, followed by the foreign minister of the United Arab Emirates and the foreign minister of Bahrain. Thank you very much. It's a great honor. Thank you. Thank you very [crosstalk :47]. Thank you very much [inaudible :14]. Thank you very much. I appreciate [inaudible :17]. Great job. Great job. That's a great job. Beautiful. Fellas, come on over here."
    },
    {
      "text": "Speaker 3: () The President of the United States, the Prime Minister of the State of Israel, and His Highness, the Minister of Foreign Affairs and International Cooperation of the United Arab Emirates will sign a treaty of peace, diplomatic relations and full normalization. They will each sign three copies, one in English, Hebrew, and Arabic. We kindly ask that all guests remain seated for the signing of the documents. It's easiest. [inaudible :53]. Speaker 4: () Now show the crowd. Should we flip them over?"
    },
    {
      "text": "Or [crosstalk : 00]? Speaker 4: () Yeah, turn them over [inaudible :00]. Yeah. Sure. Speaker 4: () [inaudible :57] Two more. So glad [inaudible 00: ]. [inaudible :30]. Speaker 4: () Pass down to your right. [inaudible :48]. Now, pass down to [inaudible :48]. Yeah. You're good? Speaker 4: () Yes. Hold that up. [inaudible :36]."
    },
    {
      "text": "Speaker 3: () The President of the United States, the Prime Minister of the State of Israel, His Highness, the Minister of Foreign Affairs and International Cooperation of the United Arab Emirates, and the Minister of the Foreign Affairs of the Kingdom of Bahrain will now sign the Abraham Accords. They will each sign four copies, one in English, one in Hebrew and two in Arabic. [inaudible :46]. Speaker 4: () [inaudible :48]. Good. Now, you do this. [inaudible :03]. Thank you, [inaudible :12]"
    }
  ]
}