{
  "speech_id": "431",
  "speaker": "Trump",
  "title": "Donald Trump ABC News Town Hall Transcript with George Stephanopoulos in Philadelphia",
  "date": "20200916",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-abc-news-town-hall-transcript-with-george-stephanopoulos-in-philadelphia",
  "topics": "Healthcare, Infrastructure, Government Policy, Technology",
  "num_segments": 101,
  "content": [
    {
      "text": "Thank you very much. I can see, definitely. There's no doubt about it. Hi, Paul. Well, we really didn't, Paul. We've worked very hard on the pandemic. We've worked very hard. It came off from China. They should have never let it happen. If you look at what we've done with ventilators and now, frankly, with vaccines, we're very close to having a good vaccine. If you want to know the truth, the previous administration would have taken perhaps years to have a vaccine because of the FDA and all the approvals."
    },
    {
      "text": "And we're within weeks of getting it, could be three weeks, four weeks, but we think we have a Johnson & Johnson Pfizer. We have great companies and they're very, very close. It's a terrible thing. But if you look at as an example, are you from New York? Where are you from? Well, that's very good. It's a good place. But actually, if you look at what we've done for various things, we built hospitals. New York, we took the Convention Center, converted it to 2,800 rooms. We brought in the ships."
    },
    {
      "text": "I wish they would have used it because frankly they would have saved a lot of people had they used it, but we really are. We're starting to get very good marks. If you look at what we've done compared to other countries with the excess mortality, the excess mortality rate, we've done very, very well. When you see our testing, we're going to be at 84 million tests, 84 million. Think of that. And next would be India with about 50 million less. Our testing program's far greater."
    },
    {
      "text": "I brought this along today because I think it's something that's really very special. We have a new test that came out literally today, that's just showing you a numbers of how well we're doing relative to other countries. But this is actually a new test just came out from Abbott, highly sophisticated. You wouldn't think it's a piece of a really little light cardboard. This came out and this is a very accurate test and people will be able to have this and they'll be able to test or ideally go through a doctor."
    },
    {
      "text": "But it's very simple and very accurate. We supplied governors including this state with equipment like nobody's ever gotten. We were short on ventilators because the cupboards were bare when we took it over. We're now making thousands of ventilators a month, many thousands that we're sending, and we don't need them in our country anymore. Not one person that needed a ventilator, didn't get a ventilator. Everybody got a ventilator and, Paul, they're very complex."
    },
    {
      "text": "But when you look at our testing, when you look at our swabs, when you look at our ventilators, when you look at what we've done with hospitals, and we've made a lot of governors look very good and now some are in a shutdown and some aren't, we'd like to see it open up and open up as soon as possible. But we're very proud of the job we've done, and we've saved a lot of lives, a tremendous number of lives. The excess mortality rate is among the best in the whole world."
    },
    {
      "text": "I mean, I can show you there's a chart that just came out a little while ago. Excess mortality rate is compared to Europe, compared to other places, it's about 25% better. In one case, it's over 60% better. And we also have a very big country here. This is, we're talking about a lot bigger than most countries. When you look at testing, just as an example, when India does 40 million less tests than us, they have 1.5 billion people."
    },
    {
      "text": "China, you don't get the accurate numbers out of China, but China, they lost a lot of people. They just don't say what- Well, we have 20% of the cases because of the fact that we do much more testing. If we wouldn't do testing, you wouldn't have cases. You would have very few cases. Well, Dr. Fauci, said we've done a fantastic job. He just said it yesterday. Actually, he said we've done a fantastic job that we didn't mislead anybody. Now. I'm not going to make people feel like I want to..."
    },
    {
      "text": "Look, with a leader of a great country, we want to keep it that way. I don't want to scare people. I don't want to make people panic and you're not going to go out and say, \"Oh, this is going to be. This is death, death, death.\" You have to run a country. We're in a country. We got hit by something very unfairly. What I noticed yesterday Dr. Fauci, said that we've done a really good job and we didn't mislead anybody. He came out with that statement, which I appreciate. But whether it's Dr."
    },
    {
      "text": "Fauci, or anybody else, a lot of people got it wrong. They talked about, don't wear masks, and now they say wear masks, although some people say don't wear masks. I mean, you have a lot of different ideas. Some people say, \"Just leave it the way it is and don't do any shutdowns.\" Other people say, \"Do shutdowns.\" I have my own views on that. Not down playing- Not downplaying. I don't want to drive our nation into a panic. I'm a cheerleader for this nation. I'm the one that closed up our country."
    },
    {
      "text": "I closed it up long before any of the experts thought I should and saved hundreds of thousands of lives. But when I closed it, I put a ban on our country. And the ban was a very important ban because China [crosstalk :12]. China was heavily infected. By the way, I read where other people said, \"Do it.\" No people that I saw said do it, and I know they said security advisers and others. I put a ban on when it wasn't at all popular."
    },
    {
      "text": "Joe Biden said I was xenophobic because I put the ban on, and I thought that was a very unfair. By the way, he's totally taken that back. But I'm not sure he knows what it means, anyway. I don't think I did. We just finished a trade deal. We just had the largest order of corn in the history of our country last week, the largest order of soybeans, largest order of beef, because they know I'm very unhappy. They know I'm very, very- No, I didn't say one way or the other. I'm not saying one way or the other."
    },
    {
      "text": "At the beginning before anybody knew what it was, I spoke with President Xi and he said, \"We are doing it well. We are having it under control.\" And I was very open with that. He told me that it was under control, that everything was, and it turned out to be not true, because it wasn't under control. It went all over the world, 188 countries. I didn't say anything bad about President Xi initially, because nobody knew much about the disease. Nobody knew the seniors are susceptible."
    },
    {
      "text": "They thought people would be susceptible, but not... The seniors are really a very, very endangered group of people, especially if they have problems with hearts or diabetes or any of that. Well, I do wear them when I have to, and when I'm in hospitals and other locations. But I will say this, they said at the Democrat Convention, they're going to do a national mandate. They never did it, because they've checked out and they didn't do it."
    },
    {
      "text": "A good question, as you ask, like Joe Biden, they said, \"We're going to do a national mandate unrest-\" No, but he didn't do it. I mean, he never did it. By the way, a lot of people don't want to wear masks. There are a lot of people think that masks are not good. And there are a lot of people that, as an example, you have- I'll tell you who those people are, waiters. They come over and they serve you, and they have a mask. I saw it the other day where they were serving me and they're playing with a mask."
    },
    {
      "text": "I'm not blaming them. I'm just saying what happens. They're playing with a mask, and so the mask is over and they're touching it. And then they're touching the plate. That can't be good. There are a lot of people, if you look at Dr. Fauci's original statement, you look at a lot of people, CDC, you look at a lot of people's original statement, they said very strongly George, \"Don't wear masks.\" Then all of a sudden they want to wear masks."
    },
    {
      "text": "The concept of a mask is good, but it also does, you're constantly touching it, you're touching your face, you're touching plates. There are people that don't think masks are good. Yeah. Well, I didn't downplay it. I actually, in many ways I applied it in terms of action. [crosstalk :54]. My action was very strong because what I did was with China, I put a ban on, with Europe, I put a ban on, and we would have lost thousands of more people had I not put the ban on. So that was called action."
    },
    {
      "text": "Not with the mouth, but in actual fact, we did a very, very good job when we put that ban on, whether you call it talent or luck, it was very important. So we saved a lot of lives when we did that. Well, they were Americans. I mean, the holes in were if you have somebody in China, that's an American citizen, we had to let them in. I mean, there were actually some people that said, well, once it got going, they said, \"Wait a minute."
    },
    {
      "text": "That is really a heavily infected place.\" We had a case where we had a lot of Americans, they probably had COVID and we're saying, \"Do we let them into our country?\" We let them in very carefully. We quarantined them, but we let them in. But yeah, they say that we allowed certain people and it's true, but they were American citizens. I think we could have had 2 million deaths if we didn't close out the country. No, I think we did a great job."
    },
    {
      "text": "If we didn't close the country, look, we created, I created, we all created it together. You helped everybody. The fact is, we created the greatest economy in the history of the world, best employment numbers for African-American, Asian-American, Hispanic-American, women, everything, the best employment, high school, no high school, college. We had the best economy we've ever had. 160 million people almost, just short of 160 million people. We were never closed."
    },
    {
      "text": "And then somebody comes in and then somebody else, doctors, and they start talking about the pandemic and about closing, they want to close up our country. I said, \"Wait a minute. We have the greatest country, the greatest economy.\" And it was coming together, even in terms of unity, because it was so successful that people that weren't getting along were starting to get along, George. That's the way we solved that problem. But we had the greatest economy ever, and we have to close it."
    },
    {
      "text": "If I didn't close it, I think you'd have 2 million deaths instead of having the 185, 190. It's a terrible. [crosstalk :15]. George, I was so far ahead of my closing. I'll give you an example. When I closed at the end of January, Joe Biden was talking about in March about it's totally over-exaggerated."
    },
    {
      "text": "Nancy Pelosi was standing in the streets of Chinatown in San Francisco, late a month, more than a month after that saying, \"This thing's totally exaggerated, come to try and build up tourism.\" And all of these people- What? It is going to disappear. It's going to disappear. I still say that. No, I still say it. It's going to disappear, George. We're going to get back. We aren't going to have studios like this. We have all of this empty space in between. I want to see people and you want to see people."
    },
    {
      "text": "I want to see football games. I'm pushing very hard for Big Ten. I want to see Big Ten open, lift the football games, let them play sports. But no, it's going to disappear, George. And I say this- When Churchill was on the top of a building, and he said, \"Everything's going to be good. Everything's going to be. Be calm.\" And you have the Nazis dropping bombs all over London, he was very brave because he was at the top of a building. It was very well known that he was standing on buildings and they were bombing."
    },
    {
      "text": "And he says, \"Everyone's going to be safe.\" I don't think that's being necessarily honest, and yet I think it's being a great leader. But he said, \"You're going to be safe. Be calm. Don't panic.\" And you had bombers dropping bombs all over London. So I guess you could say, that's not so honest, but it's still great leadership. I'm not looking to be dishonest. I don't want people to panic, and we are going to be okay. We're going to be okay, and it is going away."
    },
    {
      "text": "It's probably going to go away now a lot faster because of the vaccine. It would go away without the vaccine, George, but it's going to go away a lot faster- Sure. Over a period of time. Sure, with time, it goes away. You'll develope like a hard mentality, it's going to be hard developed, and that's going to happen. That will all happen. But with the vaccine, I think it will go away very quickly. But I really believe we're rounding the corner, and I believe that strongly."
    },
    {
      "text": "Well, I mean, but a lot of people do agree with me. You look at Scott Atlas, you look at some of the other doctors that are highlighted from Stanford, look at some of the other doctors, they think maybe we could have done that from the beginning. I think we did it exactly right. We closed it up. Now, we're opening and we're opening up to a super-vee because the numbers are fantastic. The employment numbers, you look at, we hired 10.4 million jobs in four months. That's a record by far. We have every record."
    },
    {
      "text": "Retail sales are through the roof. We have every record. We did the right thing. If we didn't close it up, I believe we'd have two million, two and a half, maybe three million deaths. Well, I think they were tragic events, and I do feel that we have to also take into consideration that if you look at our police, they do a phenomenal job. You'll have people joke, make mistakes, and they happen. It happens where they have to make a fast decision and some bad things happen."
    },
    {
      "text": "And you also have bad apples, but you have 99% great people. I know the police forces very well. I think almost every one of them. If you look, I've been endorsed by so many of them, and these are great people. I will say this, if you're going to stop crime, we have to give the respect back to the police that they deserve. They've done a fantastic job in many locations, but then bad things happen. Look at New York, New York was a very safe city. Rudy Giuliani did a fantastic job."
    },
    {
      "text": "The city was safe, and then all of a sudden we have a mayor. He starts cutting the police force and crime is up a hundred percent, 150%. I saw one form of crime up 300%. So I think it's very important, whether you talk Seattle, where they have very good police, but they're not allowed to do their job. You have to allow the police to do their job. I agree with you, those events are terrible, but we have to allow the police to do their job. Otherwise, crime is going to soar."
    },
    {
      "text": "Now, the problem is that in Democrat, usually liberal Democrat run cities, we have tremendous problems. The top 10 most unsafe cities are run by Democrats. You go into the top 25 and top 35, almost every one of them is run by Democrats. No cash bail, just weak policies on crime. We have to give the police the respect that they deserve and we have to give them their mojo. We have to let them protect us."
    },
    {
      "text": "How about that horrible crime that took place two days ago, where this terrible human being walks up to a police car with two people sitting in the car and he starts shooting bullets right through the glass right in their face and just has destroyed? I hear they're going to make it, but they're going to have a hard time ever being the same- It's just a terrible thing. But that's a lack of respect. When somebody can do that, that's a lack of respect. There's no retribution. The field, there's no retribution."
    },
    {
      "text": "This guy walks up to a police car and he starts shooting point blank range at two innocent people. You can't let that happen. You have to be very tough on crime when it comes to that. So, just do a poll where... I just saw a poll where African-Americans in this country, black communities are 81% in favor of having more police. They want more police. They want protection. They suffer more than anybody else by bad police protection."
    },
    {
      "text": "All minorities, whether it's Hispanic or black or Asian, they suffer more than anybody else, George. We have to give the police back the authority to stop crime. When you have something like in Portland, where it's just night after night, I could stop that with the people we have in a half an hour if they'd let me do that, but they don't- Bring in the National Guard. We'd bring it in, and we would stop that within... Well, we did it in Minneapolis."
    },
    {
      "text": "Take a look at Minneapolis- I can only say this, that the police in this country have done generally a great job. There are crimes, there are problems, and there are chokers. They choke under pressure. They have one quarter of a second to make a decision, and sometimes they make a wrong decision. That's a terrible thing. The problem is that'll be on the news for two weeks or three weeks in a row, and the hundreds of thousands and thousands of good acts, nobody talks about it."
    },
    {
      "text": "No, I think there's problems, but I also think there's some very big problems where if you don't give the police back their authority... Right now, police are afraid they're going to lose their pension, they're going to lose their job if they talk to somebody in the wrong way. When I watch New York... The New York City Police endorse me, and I love them. [crosstalk :42] but I watched six months ago, policemen walking down the street, and people were dumping water on their head. They had absolutely no fear."
    },
    {
      "text": "They had absolutely... There was no retribution. I thought it was a low point. I thought it was a low point for New York City's finest. Frankly, those people should've turned... Those cops should've turned around and really done something. Good. Well, I can say this. We have tremendous African-American support. You've probably seen it in the polls. We're doing extremely well with African-American, Hispanic-American at levels that you've rarely seen a republican have."
    },
    {
      "text": "If you talk about make America great, if you look at just prior to, and I'm talking about for the black community, you look just prior to this horrible situation coming in from China, when the virus came in, that was probably the highest point. Home ownership for the black community, home ownership, lower crime, the best jobs they've ever had, highest income, the best employment numbers they've ever had."
    },
    {
      "text": "If you go back and you want to look over many years, you could just go back six or seven months from now, that was the best single moment in the history of the African-American people in this country, I think, I would say. If you go... Well, I hope there's not a race problem. I can tell you, there's none with me, because I have great respect for all races, for everybody."
    },
    {
      "text": "This country is great because of it, but when you go back six months and you take a look at what was happening, you can't even compare that with past administrations. When you look at income levels, and a lot of things, because of the job situation, where they had the lowest income, the best unemployment numbers they've ever had, the black community, by far, and that was solving a lot of problems. You know what else? It was bringing people together. I was starting to get, just before..."
    },
    {
      "text": "We were having a long run of success. I was starting to get calls from democrats that, \"Hey, it's starting to work. Let's get together.\" People that you would never have thought this would've happened with, there was going to be unity, but unfortunately, that was hurt because we got set back."
    },
    {
      "text": "Now, I think next year's going to be one of our best years economically, but [crosstalk :18] Well, the income inequality, which I agree with you is a problem, I always agreed with that, but if you looked under President Obama and Biden, the income inequality was phenomenal. It was record setting. It was- Well, we're talking about a plague coming in. Before the plague, we were doing very well. Now, we will soon be doing well again, because we're going to have a fantastic third quarter."
    },
    {
      "text": "You're seeing the numbers come in. I think you're going to have a GDP that's mid 20s and may be much higher. Somebody said 35. I don't know. These are all records we're talking about. You're going to have a very good... Economically, you're going to have a very good year next year, but I agree with a lot of the things you say, but you have to look back, because we really had it going well."
    },
    {
      "text": "Had we not been hit by this horrible disease that came into our land and all over the world, by the way, came all over the world, we would be in a position where I think income inequality would be different. It was really getting there. We were really driving it down. I can only compare it to the past."
    },
    {
      "text": "The African-American, the black community was doing better than it had ever done by far, both in terms of unemployment, home ownership, so many different statistics, even in terms of crime- I mean, there was a gap, but we were doing a good job. It was getting better. Then, it was artificially shut down by this disease that came onto our land. Hi. Well, as you know, we did pay check, but we're doing a lot of other things. But, what I want to do is see some additional stimulus. We're trying to get it, and we may."
    },
    {
      "text": "I mean, just before I came here, we had some pretty good talks with the democrats. We'll see, but they've been very difficult- Because, they know exactly where I stand. At the right time, I'll do that, but they know exactly where I stand. What they want is a bail out of democrat run states that are doing poorly. I don't think this is the right way- They are. No, the democrat run states are the ones that are doing badly, George."
    },
    {
      "text": "If you look at New York, if you look at Illinois, if you look at a lot of different places, they're doing poorly, and cities in particular. Cities, I mean, these cities are being run so poorly- ... but largely because of the crime. They don't want to do anything about crime. Sanctuary cities. They have sanctuary cities where they're protecting criminals. They have things that the republicans don't have. So, they are. I don't want to say..."
    },
    {
      "text": "Look, I'm the president of everybody, but I don't want to say it, but they're democrat run cities. It is what it is. At the right time, yes, I would like to see additional stimulus for people that really, it wasn't their fault. It wasn't your fault, wasn't anybody's fault. It was China's fault. I don't care how you want to define it. This was China's fault, and our people shouldn't be hurt. We should do stimulus."
    },
    {
      "text": "We did a lot of it initially, and now they stopped, because they think it's going to be better for the election. Well, we can do something maybe, but I'm just hearing for the first time about an hour ago that maybe there is a chance to get something, and I'd like to do it. I would like to see it happen, George. Hi. That's great. No. First of all, I hope you are taken seriously. I hope you are. We are not going to hurt anything having to do with preexisting conditions."
    },
    {
      "text": "We're not going to hurt preexisting conditions, and in fact, just the opposite. If you look at what they want to do, where they have socialized medicine, they will get rid of preexisting conditions. If they go into Medicare for all, which is socialized medicine, and you can forget about your doctors and your plans, just like you can forget under President Obama. He said you can have your doctor, you can have your plan, and that turned out to be a lie. He said it 28 different times, at least."
    },
    {
      "text": "We have 28 different times. You can have your doctor, you can have your plan. Well, it's not true. But, what we're doing is we're going to be doing a healthcare plan, preexisting, protecting people with preexisting conditions. As an example, yourself. It sounds like that's exactly perfect. That's exactly what we're talking about. We're going to be doing a healthcare plan very strongly, and protect people with preexisting conditions."
    },
    {
      "text": "I will say this, they will not do that, because they have socialized- No, so we can do new healthcare. I have it already. I have it already. It doesn't matter. I have it already, and it's a much better plan for you, and it's a much better plan. When you say Obamacare, I got rid of the individual mandate, which is the worst part of Obamacare."
    },
    {
      "text": "Wouldn't pertain to you, but it'd pertain to a lot of people where they were going literally bust because they didn't want to have health insurance, and they were paying for it anyway, and it was no good. Obamacare was a disaster. Obamacare is too expensive. The premiums are too high. It's a total disaster."
    },
    {
      "text": "You're going to have new healthcare, and the preexisting condition aspect of it will always be in my plan, and I've said that loud and clear- And, we got rid of the individual mandate, which essentially ended Obamacare- George, I had a decision to make. Do I run... We gutted out the worst parts of Obamacare. Now, I have to make this decision. This is three years ago. Do we run Obamacare well and do a good job, and do the best, even though it's never going to be very good, or do we let it run badly?"
    },
    {
      "text": "Probably letting it run badly would've been a better political decision, but I couldn't do that. We have run it so much better than Obama ran it. Now, it's not the same because I got rid of the most unpopular thing and a very unfair thing, which was the individual mandate. George, we have run it really well, but we also have now other..."
    },
    {
      "text": "If you go to Department of Labor, our great secretary as you know, and you know him well, we have other alternatives to Obamacare that are 50% less expensive, and they're actually better. George, it's been 40 years since you had good healthcare. You never really had good healthcare in this country. This country has never had it. But, when you say that Biden doesn't want to do it, everybody else does. Bernie does. He agreed to the manifesto as I call it."
    },
    {
      "text": "The agreement with Bernie is that you're going to go to socialized medicine. If you go to socialized medicine... Well, he agreed. Harris, who he today, said, Harris-Biden, because you think she's president, Harris... Someday, you'll have to explain that one to me, but Harris is all for doing that. She wants to go to socialized medicine. You no longer have your doctor really, and you no longer have your plan."
    },
    {
      "text": "And, Joe can say all he wants, he's only doing it because he sees his poll numbers going down so substantially. But, Joe can say all he wants about healthcare. Obamacare has been a failure from day one. It's too expensive, whether it's the premium or whether it's the cost generally, and they don't have their doctors, and they don't have their plans. We're going to have a very good healthcare. I think maybe a great healthcare for less money. Thank you. Hi Jim. Good Jim."
    },
    {
      "text": "So I'm fighting a battle, it's a big battlefield and I have a lot of forces against me. I have the media, which I call the fake news, because a lot of it is fake. And I mean a big pop, as you understand, a lot of is fake. I'm fighting a lot of forces. Sometimes you don't have time to be totally, as you would say, presidential. You have to get things done. I think I've done more than any other president in the first three and a half years."
    },
    {
      "text": "When you look at what we've done for tax cuts and regulation cuts and the vets, all of the things that we've done for the West, we have a 91% approval factor now for the vets, we rebuilt our military, we created Space Force. I mean, we did so many things, Right-to-try, which is so incredible and so successful. You know what Right-to-try is? We did more, I really believe it, more than any other president in the first three and a half years."
    },
    {
      "text": "By the way, at the end of my first term, we're going to have close to 300, maybe over 300 new federal judges, including Court of Appeal, two Supreme Court justices. And honestly, we move very fast and I have to get rid of people fast because they're not doing their job. I could tell you people that weren't doing their job. And when I do that to get somebody else that is good, and if they don't do it, we get rid of that person. We do a lot of things and we have to get them done. I could be so pres..."
    },
    {
      "text": "I always used to sort of kid on the campaign trail that I could be more presidential, would be very easy, more presidential than any other candidate, except for possibly Abraham Lincoln when he's wearing the hat, right? The high hat. But the fact is, being presidential is easier than what I have to do, but I get things done. I get things done like nobody's ever gotten, including environmental things."
    },
    {
      "text": "When you look at what's going on in the country and all that we've done, we unfortunately got hit by this plague, but it's going to be back very soon, we opened it up and we have...you talk Jim about the V. We have a super V, looks like it's going to be a super V. We're going to have a great economy next year. And I think we're going to have a great economy in the third quarter. And thank you for voting for me in 2016. I hope you're going to do it again. Thank you. Thank you very much."
    },
    {
      "text": "George, stocks are owned by everybody. I mean, they talk about the stock market is so good, that's 401(k)s. I'm meeting people with as long as they didn't sell when the market went down, when we first realized the extent of this horrible thing from China. I mean, these people are doing, some of them are doing better than they were doing before the pandemic came."
    },
    {
      "text": "If people held onto their stocks, and remember this, because I noticed you said wealthy, sure, wealthy, but you have people that aren't wealthy, but have done well because of the stock market. I've set records on the stock market even during the pandemic. And that doesn't happen by accident. I will tell you this, if Joe Biden ever got this position and that's a headwind on the stock market, our stock market would be much higher if it weren't for that."
    },
    {
      "text": "If Joe Biden ever got in, I think you'd have a depression, the likes of which we've never seen in this country. If you look at his policies, where he wants to raise everybody's taxes, you look at what he wants to do in terms of regulation, where he wants to put all of the regulations back on that I took off, and then some, and in many cases, double it up, you will have a depression, the likes of which we haven't seen in this country, and that doesn't affect big people. It affects everybody."
    },
    {
      "text": "It affects a person that owns $10,000 worth of stock in IBM or whatever company it may be. Look, we're having a tremendous thing in the stock market and that's good for everybody, but people that aren't rich own stock and they have 401(k)s. You take a look at the 401(k)s. They're in many cases better than they were before the pandemic came. Thank you. Could you say that again? Oh, oh, I see. Okay. It was a fake statement. It's easy, because they never made those statements. They were never made by me."
    },
    {
      "text": "They said, I stood over the grave of soldiers killed many years ago, and I said they were suckers. I never made that. We had 26 people as of today, come out to say it never happened, and many people were there. Then they said about the rain didn't happen and that wasn't the reason. The secret service said, we have a statement from them. They said that we could not travel because the helicopter couldn't be used, we would not be able to travel."
    },
    {
      "text": "Because when you do that through a major city, it takes them days to get it prepared. I wanted to go anyway. I said, \"Let me just go separately in a car in disguise. I don't care.\" I wanted to be there so badly, but the statements never happened. They were lies. As far as John McCain, I was never a fan of John McCain. I never thought he treated our vets well, he didn't do the job. I was never a fan of his, and I think that's fine and everybody knows that, and I said it to his face. I was very much up in that."
    },
    {
      "text": "But as far as [inaudible :30], I have done so much for our vets and for our military, I rebuilt our military. When I came into this great office, our military was depleted, it was in the worst shape it was in probably ever. It was depleted. The planes were old and broken, the ships, everything. You see what I've done. I've rebuilt $2.5 trillion, and you think that was easy, getting that money from Democrats? Because they don't like the military. This magazine came up, they made up this quote."
    },
    {
      "text": "It was a made up quote. And the gloves are off with Biden who I've never respected greatly. I've never respected him greatly. But when they took this made up quote that was now knocked out by over 25 people and they made an ad out of it, I thought it was a disgrace. Do you know what disinformation is? That's what it was. They made up a phony quote and then they went with it. It was a phony deal. And the one who started it was a big friend of President Obama and Clinton."
    },
    {
      "text": "And it was a phony deal from a very not very successful [inaudible :34]. They didn't hear me say that. Because I never said it. These are people that I let go. These are disgruntled former employees to put it in a nice way with a term people would understand. Mattis was a highly overrated general, didn't do the job, didn't do good on ISIS. I took over a hundred percent of the ISIS caliphate. I had the people that I wanted and Mattis was fired as you know by President Obama. And I fired him also. He didn't resign."
    },
    {
      "text": "I said, \"Give me a letter.\" No more. Give me a letter. I was being nice. One of the problems when you're nice, oftentimes it comes back to hit you. I said, \"Jim, give me a letter. It's time for you to move on.\" He gave me a letter, but I fired him, [inaudible :50], I fired him. Now, General Mattis Didn't do the job. I wasn't happy with him. If you look at John Bolton, John Bolton, all he wanted to do is blow people up. He wanted to go to war with everybody. And frankly, I used him very nicely."
    },
    {
      "text": "I bring him into a room in a negotiation, when people saw them, they said, \"Oh wow, he's going to go to war.\" I'm bringing our troops back from Afghanistan. I'm bringing our troops back from Iraq. We're almost out of almost every place. Everybody said because of my personality, they said, \"He'll be in a war immediately.\" Look at North Korea, how that's worked out. The sanctions are on, everything's the same, we haven't spent anything. We're getting along with him, I get along with Kim Jong-un."
    },
    {
      "text": "That was supposed to be a war. If President Obama were president, if Hillary Clinton ever got in, that would be a war. We would have a war, probably a nuclear war with North Korea. In the meantime, I'm getting calls all the time from friends of mine in South Korea. \"Thank you. We love you. Thank you.\" It's really been rather amazing. So instead of wars, everybody said, look at what we had today with the United Arab Emirates, UAE, and just take a look at what happened with Israel today with that."
    },
    {
      "text": "Take a look at what's going on. That was going to be a problem. We're actually creating peace in the Middle East without blood staining our sand. Look at what happened with Bahrain- George, look at what happened with Bahrain. Well, a guy like Jim Mattis would have disagreed with the way I went about it, and I've turned out to be correct. Tom Friedman of the New York Times wrote incredible glowing articles last week about this incredible thing that I've been able to do in the Middle East."
    },
    {
      "text": "A guy like Jim Mattis could have never done it because they were all doing it the old fashioned way. They were going in the wrong outlets and the wrong doors. And what happened today with the UAE, and with Bahrain, and with Israel, people don't even believe it. And George, as sure as you're sitting there, I have numerous other countries in that region that are going to be signing very soon also."
    },
    {
      "text": "You'll have peace in the Middle East, and this is without war and without losing, and I'm talking about on both sides, but without losing our great young soldiers. I go to Dover and I greet oftentimes soldiers coming in, and they're dead. And there's no sadder thing than to sit with a widow or a mother and watch these big, massive cargo planes, and that back opens up and these incredible Marines are walking off a casket and they were killed in the Middle East. And in many ways, nobody even knows why."
    },
    {
      "text": "Going there was the worst decision in the history of our country. We've spent $8 trillion and we've lost thousands of lives, but really millions of lives because I view both sides. Okay? If that's okay. Millions of lives, this was the worst decision. And by the way, Iraq did not... Saddam Hussein did not knock down the World Trade Center in case you don't know, and I'm sure you do know that. They said they had weapons of mass destruction, they made a mistake. So we're now $8 trillion."
    },
    {
      "text": "We've been in there for 20 years, almost 20 years in Afghanistan. I guess it's getting very close to that, it's over 19 and we're bringing our soldiers back home. Nobody expected that from me and people are so happy about it. And you know who's the happiest? The soldiers. I see them all the time. \"What do you think? Should we be here?\" \"No, sir. You shouldn't be here.\" \"Why?\" \"They don't like us, sir.\" And I'll tell you what, I've rarely met a soldier that's over there."
    },
    {
      "text": "They're better than anybody because they can tell you better than anybody what's happening. Rarely do I meet a soldier that says we should be there. It was the worst mistake, the most costly mistake in the history of our country, going into the Middle East. So we have a great Senator named Tim Scott from South Carolina, and he had a plan that was very much of a compromise plan, but it was a plan that everybody pretty much agreed to. A lot of Democrats agreed to it, but they wouldn't vote for it."
    },
    {
      "text": "And it was a really good, it was a compromise of a lot of different factors, and it didn't get done, and it should have gotten done and it could still be out there, it could still be resurrected very easily, but they just didn't want to do it. Because I think the Democrats are viewing this as a political issue, and I probably agree with them. I think it's very bad for them because we're about law and order, we have to be about law and order."
    },
    {
      "text": "Otherwise you're going to see your cities burn and that's the way it is. If we can do a plan like Tim Scott's plan, which is really, it goes far enough, but it doesn't take the dignity away from our police. We have incredible people. They've been protecting us for a long time. I mean, we are here, and I feel very safe being in this room. These are great people. We can't take their dignity away. We have to let them be able to do what they do better than anybody else. So I think we have to look at it that way."
    },
    {
      "text": "We have to be very, very careful. Police are so afraid today, that they do something slightly wrong, slightly wrong, and their pension's gone, their job's gone, who knows what happens? Their life is ruined, their wife or their husband will leave, the whole thing, it's a very scary thing to do. And then you look at safety. I mean, you look at that horrible human being that shot these two police, [inaudible :59] right next, just a disgusting and then ran off. You look at that."
    },
    {
      "text": "This is a very tough job and it's a very unsafe job. It's a very dangerous job. We have to give them back their dignity and we have to give them back respect. These are great people, for the most part. There's always going to be a bad apple in your business, in my business, no matter what. I mean, there's going to be bad apples so we have to weed out the bad apples, but we have to give the police back that strength that they had a short while ago and that they have in Republican cities, frankly, and states."
    },
    {
      "text": "But you take a look, this is a Democrat problem. George, I know you're a Democrat, but this is largely a Democrat problem. If you just take a look at the list, every Democrat city, almost, not all, but a lot of them certainly in the top 25, even if you go to the top 50, almost every city is run by the Democrats. People don't respect our police and they have to respect them- Respect our police. And they have to respect them. And I have, except in Democrat-run cities. Look, we have laws. We have to go by the laws."
    },
    {
      "text": "We can't move in the National Guard. I can call insurrection, but there's no reason to ever do that. Even in a Portland case. We can't call in the National Guard unless we're requested by a governor. If a governor or a mayor is a Democrat, like in Portland, we call them constantly. I just spoke to the governor yesterday, because we're giving them relief from the fires. We're giving them an emergency declaration. I said, \"Governor, let us go in and we'll clean up Portland so fast."
    },
    {
      "text": "In a half an hour, it'll be all right.\" And she's just torn by it. I don't understand the thinking, but they are torn by it. I have a lot of respect for the governor, frankly, and what happened in Minneapolis was pretty amazing. Unfortunately, it just went on for a week or a week and a half before he allowed us to bring in the National Guard. When we brought in the National Guard, everything stopped, the crime was gone, meaning the whole thing. But by that time, a big portion of the city was burned down."
    },
    {
      "text": "We're talking about Minneapolis. In Seattle, we let them know we're coming in. They took over a big chunk of the city, 20% of the city. We said, \"We're coming in.\" As soon as we said that the police department went in and these other people were exhausted, but had we not said we're going in, we were ready to go in, we were going in the following morning, wherever you have a Democrat city, not in all cases, but if you look at the really troubled cities in our country, they're Democrat-run and that's Biden."
    },
    {
      "text": "They're weak, they're ineffective. I'm president, but I can only do what I'm allowed to do. George. I don't need insurrection. I don't need an insurrection act to take care of 250 anarchists. We can do that very easily with the National Guard. We proved that in Minneapolis. They came in after the city was burning. And the thing I don't really get is that the news media is saying, \"No, these are peaceful."
    },
    {
      "text": "These are peaceful.\" And right over the reporter, it was a CNN reporter, right over his shoulder, and you saw that, right over his shoulder, the city is burning. It looked like it was Berlin during the war. It was the craziest thing I've ever seen, and he's trying to say, I don't know why the news media tries to make so light of it. These are not protests. These are far greater than protests. Oh, very good. Thank you. That's all right. And just take your time. That's fine. George has plenty of time. I hope, right?"
    },
    {
      "text": "Thank you. Did you say your mom got COVID? Terrible. And that's okay. It's okay. Very nice. So, we are doing something with immigration that I think is going to be very strong because we want people to come into our country, people like you and like your mother, and that just shows how vicious the COVID is, especially when you have another problem, you have a heart problem or another type of a problem. And it's a very sad story, but we want people to come into our country."
    },
    {
      "text": "We want them to come in, a lot of people, but we want them to come in through a legal system, through a system that they love our country, they work to come into our country, a merit system, and we're working on something very hard right now and in a very short time, we're going to be announcing it. And I think it's going to have quite an impact. I think it's going to be something that actually will be popular for all. I mean, as far as your situation with your mother, that is just devastating."
    },
    {
      "text": "Because I can imagine how you feel and sounds like a great woman, and I'll tell you, I'm pretty good with people. She gave us a great daughter, a great child. What she's done with you, the way you are, the love that you have for your mother, I can see that. It's hard, and so many people, and they die alone. They die alone because this is such a vicious thing. You can't go there and hold their hand. You can't give them a kiss goodnight. It's a terrible, terrible thing."
    },
    {
      "text": "And hopefully the vaccines are going to be very soon. Hopefully. Did you have COVID? You didn't have it, right? You didn't have it, mother. We'll have it taken care of. It's going to get taken care of. The vaccines are going to make a big difference. What has made a big difference is Remdesevir."
    },
    {
      "text": "We have many things now and things are going to be announced soon, which frankly, if you take a look at some of the things we're doing in terms of the word wouldn't be cure, but the word would be therapeutically or therapeutics, we have some incredible things which is so important. And I view that actually in a certain way is more important than the vaccine where you can go into a hospital and get your mother and give her a transfusion or a shot and they can get better, get better much faster."
    },
    {
      "text": "So we have some of those things and they've been very, very successful, but we have others coming out and in order to get them, we had to get the FDA to approve these products, these very sophisticated medicines, I guess you could call them medicine, but we had to get them approved very quickly and they did it. Dr. Hahn, the head of the FDA, Alex Azar, they've really done a fantastic job. I believe George that none of this would have happened in another administration. And I think you know that."
    },
    {
      "text": "The FDA is approving things at a level that they've never done and at speed with which they've never acted before. Hi Ashley. So I think without question, I would say, because things were going so well, I think I'd have to say the whole COVID, the China virus as I call it because it comes from China so I think it's a much more accurate term. But it's been very difficult, it's been so sad. As an example, talking to you about your mother, it's just such a sad situation."
    },
    {
      "text": "Yeah, we're getting there, we will get there, we're going to, it's going to happen, but it's been very difficult, nobody's seen anything like this probably since 1970 [inaudible :03]. I learned that life is very fragile. I knew people that were powerful people, strong people, good people, and they got knocked out by this and died. Six people. It was five until about two weeks ago, now it's six."
    },
    {
      "text": "But I've learned that life is very fragile because these were strong people and all of a sudden they were dead, they were gone, and it wasn't their fault. It was the fault of a country that could have stopped it. And I made a great trade deal with China, I feel so differently about that deal now. It's a great deal. It was good for the farmers, good for the manufacturers, but I don't view it the same way."
    },
    {
      "text": "It was good for us, but I don't view it the same way because of the horror of this disease that really could have been stopped at the border. I don't think so. I think what I did by closing up the country, I think I saved two, maybe two and a half, maybe more than that lives. I really don't think so. I think we did a very good job. I don't know if that's been recognized. We've made a lot of governors feel good. We've made some, reputationally. We've enhanced their reputation."
    }
  ]
}