{
  "speech_id": "443",
  "title": "Transcript: Donald Trump Says He’ll Have His SCOTUS Pick ‘Next Week’, ‘Most Likely’ Will Be a Woman",
  "date": "20200919",
  "url": "https://www.rev.com/blog/transcripts/transcript-donald-trump-says-hell-have-his-scotus-pick-next-week-most-likely-will-be-a-woman",
  "topics": "Economy, Government Policy, Technology",
  "num_segments": 8,
  "content": [
    {
      "text": "Well, they're going to report the full scope of the deal very soon, very soon, but it'll be totally controlled by Oracle and Walmart. All of the control is Walmart and Oracle, two great American companies. You have the combination of the Walmart, that's obvious, and the high tech of Oracle, and the genius of the two leaders of those companies. Okay? Speaker 3: () [crosstalk :33]."
    },
    {
      "text": "Senator Collins said, \"We'd like to see the next president be the one to nominate a Supreme Court Justice.\" What do you think about that? Who said that? Speaker 3: () Senator Collins. Speaker 4: () Collins. Well, I totally disagree with her. We have an obligation. We won, and we have an obligation as the winners to pick who we want. That's not the next president. Hopefully, I'll be the next president- Speaker 5: () What about Obama? But we're here now. Right now, we're here."
    },
    {
      "text": "And we have an obligation to the voters, all of the people, the millions of people that put us here in the form of a victory. We have an obligation to them, to all of those voters, and it's a very simple thing. So I would disagree. If that's what she said, that's not the way I read it. I read it differently. But if that's what she said, I totally disagree. Speaker 6: () [crosstalk :17] How many people are on your short list? Do you have a short list? I do. I have a short list. Speaker 4: () How many?"
    },
    {
      "text": "I've had a short list for a while. We added a number of people onto the list, the previous list. We have about 45 altogether. I do indeed have a short list. I've gotten to know many of them. I think it's probably, from a legal standpoint, from a sophisticated understanding of the law, from a constitutional standpoint, I think it's the greatest list ever assembled. Speaker 6: () What do you think of [crosstalk :48]?"
    },
    {
      "text": "And I think that the other side should show their radical left list, and I think you'll be surprised. Speaker 6: () President Trump, what do you think of Amy Coney Barrett? A lot of people think she's the front runner. Well, she's very highly respected. I can say that. Speaker 6: () Would you like the new lead to be a woman? I could see most likely it would be a woman. Yeah, I think I can say that it would be a woman. If somebody were to ask me now, I would say that a woman would be in first place, yes."
    },
    {
      "text": "The choice of a woman I would say would certainly be appropriate. Speaker 7: () [crosstalk :23] Barbara Lagoa. She's an extraordinary person. I've heard incredible things about her. I don't know her. She's Hispanic and highly respected. Miami. Highly respected. Speaker 8: () Sir, President Obama said in 2016, Merrick Garland, he had a chance to [inaudible :42]. That was an election year. Why should [inaudible :44] get a chance to [inaudible :46] in the election year?"
    },
    {
      "text": "Well, that's called the consequences of losing an election. He lost the election. He didn't have the votes. When you lose elections, sometimes things don't work out well. Speaker 3: () He didn't lose the election. [crosstalk :56] And by the way, I have to say this. Judge Garland is highly respected. I have a lot of respect for him. I do. I have a lot of respect for him, but it's the consequences of an election. Speaker 9: () Do you expect a vote before the election or after the election? Well, I don't know."
    },
    {
      "text": "We're working with all of the Republican senators and working with Mitch McConnell, and we'll be making a decision. I would think before it would be very good, but we'll be making a decision. I think the process can go very, very fast. I'll be making my choice soon, and when the choice is made, I'll be sending it over to Mitch and the Senate, and they will do what they have to do. I think we'll have a very popular choice, whoever it may be, but we'll be sending it over to the Senate. Speaker 10: () Mr."
    }
  ]
}