{
  "speech_id": "444",
  "speaker": "Trump",
  "title": "Donald Trump Rally on 9/18/24 in Uniondale",
  "date": "20240919",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-rally-on-9-18-24-in-uniondale",
  "topics": "Economy, Immigration, Veterans Affairs, Infrastructure, Government Policy",
  "num_segments": 69,
  "content": [
    {
      "text": "When I told some people in Washington, \"Yeah, I'm going up to New York, we're doing a campaign speech.\" They said, \"What do you mean New York? You can't ever. Nobody can win. Republicans can't win.\" I said, \"I can win New York. We can win New York. We're going to win New York.\" () And if you vote for me, I'm going to reduce your taxes, reduce your crime, and reduce your levels of stress because you have a lot of stress."
    },
    {
      "text": "The only thing that I will increase are your incomes and your love for your state will come roaring back again. () Throughout American history from generation to generation, New York has always set the standard for American life and they have, it's been a high standard too. Our cities were the center of business, arts, culture, our streets, ports, waterways. They were the arteries of American commerce. They were absolute arteries."
    },
    {
      "text": "() And our towns like Uniondale, Levittown, Hicksville, Huntington, these were great, great towns where you grew up and you loved and you stayed, but look at what has happened to New York and the other states all run by radical left Democrats, every single one of them. () Our heavy industries have exported overseas and our middle class has been eviscerated right here at home, been eviscerated. Housing costs are out of control. Inflation has cost a typical family $28,000."
    },
    {
      "text": "Think of it, in less than four years, $28, 000. And we have filthy encampments. We have horrible, disgusting, dangerous, filthy encampments of junkies and homeless people living in places that our children used to play little league baseball, which they don't get to play very much anymore, do they? () Over the past three years, in New York City, there has been a 29% increase in robbery, a 36% increase in felony assault, a 42% increase in grand larceny, a 75% increase in carjackings."
    },
    {
      "text": "Did you buy a nice car lately? Well, 200 police officers leave the NYPD, New York's finest, I always say. I knew it well. New York's finest. They leave every single month, 200 people a month. Incredible people. They're incredible people. () The trains and subways are squalid and unsafe. The median of our highway, all those medians, they spend all that money, they're falling down, they're rotting. Businesses are fleeing."
    },
    {
      "text": "The mobs of illegal migrants are being put up in luxury hotels at your expense while our great veterans live on the freezing or steaming sidewalks right outside the main entrance to where the migrants enter their hotel. Think of that. Think of it. () We have veterans lying on the street, squalid lying on the streets, sometimes freezing, sometimes it's hot, it's summer, and they're looking at people come in, just came into our country and they're going up to the 17th floor of their suite."
    },
    {
      "text": "How crazy has our country become? () And can you imagine what those veterans, when they watch this must be saying... But listen to this, can you also imagine what the migrants must be thinking? They're saying, \"Can you believe this? We just came from a place,\" in many cases, they were in prisons and now they're living in hotel suites while our veterans are living on the street."
    },
    {
      "text": "() And so, I say to the people of New York, with crime at record levels, with terrorists and criminals pouring in, and with inflation eating your hearts out, vote for Donald Trump. What the hell do you have to lose? What do you have to lose? What do you have to lose? Think of it. What the hell do you have to lose? Some of you will remember, that was a phrase that I used for our Black population years ago in 2016."
    },
    {
      "text": "I said, \"With the worst housing conditions, the worst education, the worst this, the worst that, the most crime.\" I went through 12 different things and it wasn't in the sheets, and I'm saying, \"Boy, that's really terrible. And I was at like 2%, not too good. And I said to the Black population gathered in front of me, \"Vote for Trump, what the hell do you have to lose?\" I said that, same thing. () And you know what happened? I got eviscerated when I went backstage."
    },
    {
      "text": "I went backstage, but I'm not like Biden where he takes... I fight back with my people. Remember, we still signed the check. They said, \"Sir, that's a terrible thing to have said.\" I said, \"What is?\" \"What you said, \"What the hell do you have to lose?\" It's terrible. It's demeaning. It's horrible.\" I said, \"But it's true.\" () You know what happened? The next day, I picked up 10 points with the Black population."
    },
    {
      "text": "And now, because of all we've done, we're at the highest level of Black support in the history of the Republican Party. () And by the way, the Hispanic support... Do we have any Hispanics? The Hispanic support is off the charts and they don't know what the hell to do about it. It's off the charts. And we just had some great polling come out. I think the most accurate poll over the last eight or nine years was Rasmussen. They just came out with a poll that we're five up, we're five up, five up."
    },
    {
      "text": "We should be 35 up to be honest with you, but some people can't break an old habit. That's really what it is. () So I say to you, vote for Trump and I will turn it around very quickly. With four more years of Kamala Harris, New York state will be like a third-world nation if it isn't already, it is. I think it is. With Trump, the Empire State will once again be the envy of the entire world. We will have no crime, only success."
    },
    {
      "text": "And unlike your current radical Democrat regime, I'm not driven by partisan ideology, I'm driven by results and I'm driven by New York common sense. It's common sense, right? Right? It's common sense. () I like to say the party, it is is a great party. I like to say the party is, really, we're conservative and all that, right? Who knows? You know what we are? We're really people with common sense. We need walls. We need good elections. We want low taxes. We want great police officers that are well taken care of."
    },
    {
      "text": "We don't want to defund the police. () With a party of common sense, more than anything else, and it's picked up a lot of steam, it's true, my first week back in the Oval Office, I will clean up and call up your governor and mayors all across your state and I will tell them, \"It's time to work together.\" They're largely Democrats. \"It's time to work together for the good of the people,\" going to do it."
    },
    {
      "text": "And despite all of the persecution I've endured from the corrupt judicial system in New York, it's a corrupt system, I love the people of this state and I want to give back. I want to give back to you. I've had a great life, I want to give back to you. We're going to give it back to you. We're going to make this city and we're going to make this state incredible again. () Together we will rebuild our roads, bridges, highways, and airports. They're falling apart. They're falling down."
    },
    {
      "text": "We will renovate New York Subway. Oh, it was beautiful. I used to go to school on the subway. Can you believe it? I mean, I like to say it's not so long ago, but it probably is. What do you think, Bruce? I guess it is. () But my parents would drop me off at a subway and I'd go to Union Turnpike or I'd go to wherever I... They had no fear that I was going to be disappearing. They would take me to a subway, put me on and say, \"Bye darling."
    },
    {
      "text": "Bye.\" If you do that today, you have about a 75% chance that you'll never see your child again. What the hell has happened here? What has happened? () We will renovate the New York Subway so that the greatest city in the world finally has again the greatest transit system anywhere in the world. You have the basics. We have to clean it. We have to take care of it. We have to give it a little love. And we have to get the criminals the hell out there."
    },
    {
      "text": "We will once again support our incredible police officers, New York's finest, a lot of them. I've got the support. To me, this is so important. I think to you, it's... Every single police group in the nation is supporting me. The other day, The Fraternal Order, it's the largest, they gave us 400,000 police and they gave us a unanimous endorsement, we have it from everybody, have it from everybody."
    },
    {
      "text": "We will work with the mayors and the governor to rebuild your defunded and depleted police forces, including New York's finest and NYPD. () Look, I know so much about it. I love New York's Finest. I used to be in Brooklyn. I had an office with my father in Brooklyn. And we used to go, in Brooklyn, to a White Castle. Did anyone ever hear of a White Castle? And my father would say, \"No, that's the best place. Only 12 cents a hamburger.\" Remember 12 seconds? () Bruce? We had a... Bruce? How good is Bruce?"
    },
    {
      "text": "Bruce Blakeman, one of the greats. He won in an upset. This was another. This is a Republican. He ran a couple of times. You couldn't beat this hoax of Democrats. He ended up winning. He's done such a good job, he's now unbeatable. They don't even run anybody against him. Great. Great. Really great. () I got a lot of them. Joe Cairo's here. Joe, are we going to win, Joe? What do you think? Joe Cairo. Don't mess with Joe, right, Joe? We love you, man. Your family's great too."
    },
    {
      "text": "() But I will stop the Kamala crime wave and we will do everything we can. We're going to get these violent criminals behind bars. We're going to get them out of our country. We're going to take them back to the country from which they came. () A few months ago, I visited with the grieving family of a New York City police officer, Jonathan Diller. You know Jonathan Diller? I was hoping his family could be with us."
    },
    {
      "text": "He was just 31 years old, gunned down during a traffic stop by a vicious thug, leaving behind his incredible wife, Stephanie and family. And family, their one-year-old son. What a son. And it's... Are you here? Are they here? They could be here. Is- Is Stephanie here? Because it was a bond. And she was so great. And I think she's here. It's hard when you have 19,000 people. And Stephanie, unlike a lot of my friends, doesn't want adulation. Honestly, what she wants more than... she wants her husband back."
    },
    {
      "text": "That's what she wants. She doesn't want adulation. I have other friends, you'd find them, I have other friends if you said their name, they'd be jumping up, \"Here I am. Here I am.\" Stephanie doesn't want that. What a great family. What a great family. And what a great guy he was. () The criminal charged with savagely murdering Officer Diller was previously arrested by the NYPD 21 times, right? 21 times, Bruce."
    },
    {
      "text": "And the accomplice driving the car had been arrested 14 times, but he was actually much worse, he was more vicious. 14 times, but he was actually far more vicious. () This is the kind of story we hear every single day under radical Democrat policies like cashless bail, cashless bail. You kill somebody and you're out on the streets in two hours. Cashless bail has been a disaster for our country. Kamala Harris wanted it no matter where she went."
    },
    {
      "text": "She boasted about being the leader of the movement of cashless bail, just like she led the effort to defund the police. She was the leader of the effort to defund the police, and now she's running for president. () But a little while ago, a little while ago, like everything else, no fracking, no this, she changed her mind. Now she says she likes the police. She can't say love, but she says like."
    },
    {
      "text": "She's made a lot of progress, but you know the first thing that would happen is she will go to defunding the police if that's even possible to think about. () But when I get back into the Oval Office, the madness ends and the law and order is going to return to our country. A fully reformed Federal Department of Justice will deliver massive public safety funding for New York and other Democrat-run cities that are under siege. But in exchange, they will give our police back their protection and their respect."
    },
    {
      "text": "We are going to take care of our police and we're going to respect our police, everyone here does. () I tell the officers all the time, \"You have no idea how the people love you, but sometimes they don't feel it because of what the Democrats do to them, they will end deadly sanctuary city policies. They will terminate cashless bail. And they will return to proven policing methods like we had under Mayor Rudy Giuliani that made New York City the safest big city in America."
    },
    {
      "text": "Simultaneously, we are going to make life in New York state affordable again. Little word, affordable. A vote for Kamala Harris is a vote for four more years of job losses. Look at what's happening, businesses that are fleeing, money draining out of your state, and hundreds of thousands of illegal migrants sucking your public resources dry. I've always heard, for 20 years, I've heard that New York City has no money, and yet they're going to spend 3 billion on illegal migrants."
    },
    {
      "text": "And they're not getting it from the federal government. You wonder, they never had money, but they have $3 billion to take care of people that came into our country illegally. Doesn't make sense. () But under the Trump Economic Plan, we will cut your energy prices in half within 12 months, half because we have more liquid gold under our feet and we don't use it. We go to places like Venezuela when we have more than Russia, we have more than Saudi Arabia. You remember, I got ANWR approved in Alaska."
    },
    {
      "text": "It's the biggest site anywhere in the world, probably bigger than Saudi Arabia, bigger than Russia. () And what did they do? In the first week in office, Ronald Reagan tried so hard, he couldn't get it, I got it. The biggest site in the world, Alaska. And in the first week in office, they terminated it. We'll have it back very quickly, I promise you that. () We will rapidly defeat inflation. We're going to bring your prices down. All they're doing is they've cut it, but you're up 55 or 60%."
    },
    {
      "text": "People that used to live a nice life four years ago, they can't afford an apple. () They showed a picture of a woman the other day. I said, \"Boy, that's sad. That should never happen to her.\" She went to the counter, the cashier, she had three apples, and when she was standing with the cashier, she realized she didn't have enough money for one of the apples, and she took the apple, brought it back, and she bought two apples. That shouldn't be happening in our country. That shouldn't be happening in our country."
    },
    {
      "text": "() We will cut interest rates, cut insurance costs. And insurance is horrible. And massively, we will cut your taxes again. Harry, get up. Harry. Harry, get your fat ass out of the couch. You're going to vote for Trump today, Harry. Get up, Harry. Come on, let's go. Let's go, Harry. () We've got to vote. Got to vote. And I believe we have the vote. You know, it's an interesting thing. Evangelical Christians, they tend not to vote very much. If they did, you'd never lose. Gun owners, I have the total endorsement of the NRA."
    },
    {
      "text": "Have had it from the beginning. Gun owners don't vote, meaning they don't vote in a proportion that they should. Very small numbers vote. It's probably rebellion. Who knows what it is? The gun owners have to get out and vote. Evangelicals, Christians have to get out and vote. People have to get out. There are some groups that don't vote like they should and we're going to win. () We're pleased to be joined tonight by members of Congress that are really terrific, that are warriors, really warriors."
    },
    {
      "text": "And one of them in particular. I love what she did to that woman at Harvard. Oh, that was not pretty. Elise Stefanik, where is Elise? Where is she? Where is she? She is so great. Where the hell is she? Thank you, Elise. Boy, she was great. () Mark Molinaro, great. Nick LaLota. Nick? Thank you, Nick. Great job. He's doing a good job. Here's has another one doing a good job, I gave him a big endorsement. Anthony D'Esposito. He's doing a great job. Thank you, Anthony. Salt, salt Anthony. Remember fellas, salt."
    },
    {
      "text": "Brandon Williams is doing great. Thank you, Brandon. Thank you very much. Nick Langworthy, terrific guy. Claudia Tenney. Where's Claudia? Where's Claudia? She's been amazing. Congressional candidate, Mike LiPetri. Where's Mike? Thank you, Mike. Good. I heard you're leading big. () And Allison Esposito, she's a tough one. Allison, thank you. Thank you very much. It's tough when you have this many people. I'm looking around. Where's one person? Thank you very much, Allison. Beautiful. Senate candidate. Mike Sapriacone."
    },
    {
      "text": "Mike Sapriacone. Come on, Mike. Where's Mike? You've got to win Mike. We got to win that one, Mike. You could do that. You could do that. () A former senator and a friend of mine for a long time and we had disputes every once in a while, but generally I would say it was a 10 relationship and he was a tough cookie, Senator Al D'Amato, right? Good man. A good man, a great lawyer and congressman, and he helped me a lot during impeachment hoax number one and impeachment hoax number two. They were hoaxes."
    },
    {
      "text": "() Congressman Lee Zeldin. He's great, and he's a big part of our campaign and I want to bring him to Washington with us. He's a great lawyer. Get ready. Ambassador to Israel, David Friedman, who's fantastic. A mayor who was a fantastic mayor, very shy kind of a guy. He took crime. It was terrible. It was at a level that was as bad as today and he made New York the safest big city in the world, Rudy Giuliani. Boy, Rudy, isn't that great?"
    },
    {
      "text": "And his son, who happens to be a great golfer, a lot of people say, \"Oh, how's Andrew?\" \"Not that good.\" Let me tell you, he's seriously good. Andrew Giuliani, thank you. Andrew. Thank you, Andrew doing a good job. () And a very beautiful little boy who went through hell. But I brought him some presents. That's why I was late for you today. I brought him presents."
    },
    {
      "text": "I said, \"Liam, do you think the crowd of 20,000 plus a lot of people outside,\" we put up big televisions on the back of the building, but that's not like being here. It's wonderful. Hello out there. I hope you're enjoying it. Big, big, beautiful screens. We have big screens, not quite like being in the third row, first row. But Liam LaCastro is here and he is a great young man. He's gone through a lot, but he's going to be better soon. Right, Liam? And I got him the most beautiful presents."
    },
    {
      "text": "Because in your honor, I am announcing tonight that as President I will make the ground zero sight at the World Trade Center, a national monument protected and maintained by the United States government, so that hallowed ground and the memory of those who perished there will be preserved for all time, preserved forever. And you deserve it. A lot of great people. I met him last week. Thank you. Thank you."
    },
    {
      "text": "Well, and I met him last week with the ceremony and it was a beautiful ceremony and met a lot of fan fantastic people. The New Yorkers who created the 9/11 National Memorial Museum really did an amazing job, didn't they? And many of them are here today and I want to thank them. And I want to ensure that their outstanding work is sustained forever. And that's what we've done by doing this. () So we are just 48 days away from the most important election in American history. The most important. The most."
    },
    {
      "text": "Stand up, just now you can stand up. They didn't put your name down. Turn around. Who is he? Name him. He took care of business, right? It's my man. Good. Boy, I'm glad I didn't forget you. Good guy. Good friend of mine for a long time. Whenever I had problems they'd look at him and they'd say, \"Let's leave Trump alone.\" Thank you, man. Thank you. We appreciate it. Great, great gentleman."
    },
    {
      "text": "() Kamala Harris is for wide open borders with terrorists and criminals pouring into our country, more inflation, even higher than the last four years, which was a record. She wants to pack the Supreme Court. Think of that one. And today I heard it all, I thought they wanted maybe 11, maybe they wanted 13. That's an unlucky number. So maybe it would be 15 instead of nine."
    },
    {
      "text": "But instead of nine, Kamala wants to bring up potentially as many as 25 justices so that they can rig the system like they rig everything else, including elections. () And maybe one of the worst things of all, she's a true believer. And again, I said this before, if you wanted to defund the police, if you've been there even for a day in your mind, you want to defund the police, even for one day, you are not qualified to be the President of the United States."
    },
    {
      "text": "Because anybody who wants to defund the police, we can't have it. We can't have it. It'll go down. It'll go down. We're not going to let our country fail. It's too great. And you know what? If we don't win this election, it's very possible. We'll never have another chance. We have to do it. You have to get out. You have to vote. () But Kamala vowed to abolish ICE. She supports free healthcare for illegal aliens. How about that one? You don't get free healthcare. These are all things that she would for years."
    },
    {
      "text": "Now for the last little while she's saying, \"No, I don't really think I thought was right anymore.\" 15 different things. She wants mass amnesty and citizenship for all illegals, which means totally bankrupting Social Security and Medicare. She wants to put illegal aliens into your Social Security and your Medicare system, which guarantees their bankruptcy."
    },
    {
      "text": "She says, \"We must not utter the words illegal alien again or radical Islamic terrorist again.\" () And think of this during her three-and-a-half years, to me, this is the worst thing I talk about tonight. It's unbelievable. During her period of three and a half years, she was in charge of the border, she lost more than 325,000 migrant children, many of whom have been trafficked, raped, and many of whom are dead, many of whom are dead. Think of what that is. That's like Yankee Stadium filled up many, many times."
    },
    {
      "text": "Think of it, think of it. () As California Attorney General, she redefined child sex trafficking, assault with a deadly weapon and rape of an unconscious person. I'd never heard of this. Rape of a very unconscious person as totally nonviolent crimes. She vowed repeatedly to ban fracking. She imposed a natural gas export ban that is crushing the state of Pennsylvania. I'm way up in Pennsylvania, by the way. This helps, because she's not going to let."
    },
    {
      "text": "You know, the day after the election, all of these things come back. I hope you know that. She praised the idea of a tax rate of between 70% and 80%. And her only idea for solving inflation is to impose communist-inspired price controls, which have never worked. () She pledged to abolish ... Does anybody here of private healthcare? You worked hard?"
    },
    {
      "text": "She wants to abolish anybody that's worked hard and made some money, private healthcare, no more private health care and force everyone into a socialist government-run healthcare with high taxes and deadly wait times. And she even endorsed free sex change operations for illegal aliens in detention, all at taxpayer expense. Now, think of that one. They come into the country illegally and they say, \"I want to change my sex.\" \"Oh, that's okay.\" She's totally in favor of it."
    },
    {
      "text": "I'm sure she'll deny it now, but that's what she is. (:04) In 2021, Joe Biden tasked Kamala Harris with bringing broadband to rural America. Rural America was dying for it, and gave her $42 billion to do the job. Three years later, right now, not a single home has been connected to broadband. Everyone's saying, \"What happened to the money?\" $42 billion, not one home. And in the Midwest, you read this, in the Midwest, they built eight charging stations. That's like a gas pump with electricity, right? Eight."
    },
    {
      "text": "They spent $9 billion to build eight charging stations. Other than that, it really works well. I will end the electric mandate on cars immediately. (:51) And I have to say this, look, Elon Musk is great. He's a great guy and he makes a great car. And as strong as I am of this, because I think they're incredible, but it's limited. Some people want him and some people love them. I think they're incredible and he makes a great product. Maybe the best product I hear. And he understands this."
    },
    {
      "text": "Some people have to go far distances. Some people don't want the additional cost. Some people don't want their car built in China. Electric cars will be built in China. I'm going to bring back the auto industry. We're going to have gasoline- powered cars, we're going to have hybrids, we're going to have electric cars, we're going to have everything. The new one is hydrogen. I heard about that the other day, hydrogen. There's one little problem: if it blows up, you're dead."
    },
    {
      "text": "(:58) And yesterday, three agencies of the Kamala Harris and Joe Biden administration, the FBI, the office of the Director of National Intelligence, and Cybersecurity and Infrastructure Security Agency, they just released a report confirming that Iran actors hacked into the Trump campaign's email accounts, and in turn sought to give the hacked materials to the Biden-Harris campaign. They gave them all of the materials because Biden is working with Iran."
    },
    {
      "text": "And Iran doesn't exactly like me because they were ready to make a deal, except we had an election that was rigged and stolen. And look at what's happening to our world now. (:43) But no, Iran hacked into my campaign. I don't know what the hell they found. I'd like to find out. Couldn't have been too exciting. But they gave to the Biden campaign. I can't believe it. Oh, yes, I can. But this is really foreign election interference. This is real election interference."
    },
    {
      "text": "Not the phony crap that they've been trying to pin on me with Russia, Russia, Russia for years. Whatever happened to Russia, Russia, Russia? Remember the 51 intelligence agents? They said, \"No, no, the laptop from hell, it's Russia.\" No, it was Hunter. It was Hunter. Remember that? We had to go two-and-a-half years. And then they finally said, \"All right,\" the Mueller, remember Mueller? He said, in millions of phone calls, Trump didn't make one to Russia. They went through every phone call I made. Can you imagine?"
    },
    {
      "text": "In millions of calls, not one call to ... And a lot of people apologized for that, but not enough people apologized. They wasted time and money. They spent hundreds of millions of dollars going after me, and they got nothing. They got nothing. But we cannot allow this insanity to continue anymore. That's why less than two months from now, we are going to tell Kamala that we've had enough. Kamala, you've been a terrible vice president. You will be an even worse president. We're not going to take it anymore, Kamala."
    },
    {
      "text": "Kamala, you are fired. Get out. You are fired. We are not going to take it anymore, Kamala. (:54) That was a little line from The Apprentice, which I'm sure you haven't seen. What a great show. Was The Apprentice good or what? From the moment we take back the White House from Kamala Harris, I believe we are going to have the four greatest years in the history of our country. Starting on day one, I will seal the border and stop the migrant invasion. -- an invasion like no country has ever seen before."
    },
    {
      "text": "We will stop it immediately. We will carry out the largest deportation operation of criminals in American history. We're getting them out of our country. (:39) We will make America the dominant energy producer in the world by far. We have more than anybody else. And we have literally, we have more, think of it, we have more than Saudi Arabia. We have more than anybody else, especially when you add ANWR in Alaska, which we will reinstitute immediately. We're going to use it, along with growth."
    },
    {
      "text": "We are going to grow, grow, grow, to start paying down our debt. We have $35 trillion in national debt. We are all set to do it. And then we got hit by COVID. We had to focus on that, and then we gave back ... (:12) I got great marks on the military. We took out ISIS, wiped out ISIS 100%. We did it in four weeks. It was supposed to take four years, five years. And I got great marks in the economy. Never got great marks on COVID because they didn't want to give them to me. But the fact is, we did an unbelievable job."
    },
    {
      "text": "Nobody knew what the hell it was. It came from China, it came from the Wuhan lab. I said all these things, and we did an unbelievable job. And we handed over a country whose stock market was higher than it was just prior to COVID coming in, and amazing. But we did have to focus on that. Think of what China did to us. The world has $60 trillion, and millions and millions of people dead over that disaster. Think of that. The whole world. Even China suffered very much. They suffered at the end more than almost anybody."
    },
    {
      "text": "(:14) I will turn the United States into a manufacturing superpower more than it has ever been before. We're going to bring back the car industry. We're going to bring back the car industry. Other countries that make us pay a tax to do business with them will be charged the same tax when they send their product into the United States. We have countries, not only China, many, many countries, many of them are allies. Some of the worst trading countries are allies. Don't let that word surprise you."
    },
    {
      "text": "They're allies, they're friends of ours, and they take advantage of us horribly on the military with NATO and on trade. It will be called the Trump Reciprocal Trade Act. And if China or any other country charges us a 200, or 100, or 300% percent tax, then we will charge them a like 100, 200, 300% tax in return. You charge us, we charge you. (:21) And my message is very simple. Make your product right here in Uniondale, make your product in America. Make your product in America and only in America."
    },
    {
      "text": "And if you do that, Bruce, you won't have to pay a tax. And they'll be coming in here like you wouldn't believe. The worst that happens, we'll take it a lot of money, but we don't even want that. We want them to make their product. We're going to bring back the auto industry. Right now, China's building some of the largest auto plants in the world and they're building them in Mexico."
    },
    {
      "text": "And they think they're going to build these massive plants, literally the biggest in the world, they're going to make millions of cars and sell them without tax across our border. We will put a tariff on all of those cars to a point where they won't be able to sell them because we want them to build their plants in the United States and hire many of the people in this audience, and that's what's going to happen. (:16) And we also have something that's basic, but wow. People said, \"You're really smart."
    },
    {
      "text": "Where the hell did you think of this one?\" No tax on tips. So if you're a waitress, a caddy, a driver. But maybe better, no tax on overtime. And we'll get it done. We'll get it done. Unlike him with student loan debt that went nowhere just to talk. I get it all done. Remember what they say: promises made, promises kept. That's me. (:04) And ready? For the seniors. Do we have any seniors in the audience? Raise your hand. You ready? No tax on Social Security benefits. No tax on Social Security benefits."
    },
    {
      "text": "And you know why you deserve it? Because you lived like hell with the highest inflation probably in the history of our country, and you couldn't make ends meet. Now you're not going to have to pay tax on your Social Security benefits. And I will always protect Social Security and Medicare. And they won't. They're going to destroy it. They're putting the migrants all over the place, including there. And while working Americans catch up, we're going to put a temporary cap on credit card interest rates."
    },
    {
      "text": "We're going to cap it at around 10%. We can't let them make 25% and 30%. (:07) We will terminate the green new Scam and spend trillions of dollars. We're going to take the green new Scam, one of the greatest scams in the history of our country. Remember when they used to say global warming? They don't say that anymore. They say climate change because the planet's actually getting cooler. Climate change, Chuck, climate change is different. Just Chuck Zito. Oh, I feel safe with him in the front row."
    },
    {
      "text": "Are you afraid of climate change, Chuck? Because now it's no longer global warming because that wasn't working so well because it was getting cooler. Now it's climate change because that covers, if it's warmer, it's cooler. We're going to take all of that money. We are going to take it and we're going to rebuild ... We'"
    }
  ]
}