{
  "speech_id": "446",
  "speaker": "Trump",
  "title": "Trump Ukraine Whistleblower Comment Transcript: Trump on Whether He Asked Ukraine to Investigate Biden’s Son",
  "date": "20190920",
  "url": "https://www.rev.com/blog/transcripts/trump-ukraine-whistleblower-comment-transcript-trump-on-whether-he-asked-ukraine-to-investigate-bidens-son",
  "topics": "Foreign Policy, Government Policy",
  "num_segments": 4,
  "content": [
    {
      "text": "... story. It's a partisan whistle blower. Shouldn't even have information. I've had conversations with many leaders, they're always appropriate. I think Scott can tell you that. Always appropriate. At the highest level always appropriate. And anything I do, I fight for this country. I fight so strongly for this country. It's just another a political hack job. That's all it is. It doesn't matter what I discussed, but I will say this."
    },
    {
      "text": "Somebody ought to look into Joe Biden's statement, because it was disgraceful, where he talked about billions of dollars that he's not giving to a certain country unless a certain prosecutor's taken off the case. So somebody ought to look into that. And you wouldn't because he's a Democrat and the fake news doesn't look into things like that. It's a disgrace. [crosstalk :55] But I had a great conversation with numerous people."
    },
    {
      "text": "I don't even know exactly who you're talking about, but I had a great conversation with numerous people, numerous leaders, and I always look for the conversation that's going to help the United States the most. That's very important. I don't know the identity of the whistle blower. I just hear it say partisan person, meaning it comes out from another party. But I don't have any idea. But I can say that it was a totally appropriate conversation. It was actually a beautiful conversation."
    },
    {
      "text": "And this is no different than the press has had a very bad week with Justice Kavanaugh and all of those ridiculous charges and all of the mistakes made at The New York Times and other places. You've had a very bad week and this will be better than all of them. This is another one. So keep playing it up because you're going to look really bad when it falls. I guess I'm about 22 and 0, and I'll keep it that way. I don't want to talk about any conversation, [crosstalk :59] other than just say, great conversation."
    }
  ]
}