{
  "speech_id": "455",
  "title": "Donald Trump Speech Honoring Bay of Pigs Veterans Transcript September 23",
  "date": "20200923",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-speech-honoring-bay-of-pigs-veterans-transcript-september-23",
  "topics": "Foreign Policy, Veterans Affairs",
  "num_segments": 25,
  "content": [
    {
      "text": "Well, thank you very much, please. Thank you very much. And I'm delighted to welcome you to the White House as we honor the Cuban-American veterans of the Bay of Pigs invasion, brave people, great people. I was honored to receive the endorsement of the Bay of Pigs Veterans Association in 2016. And they gave me a beautiful award and I have it very proudly on a wall of great importance to me."
    },
    {
      "text": "And I just understood that once again, I've received your official endorsement and support and I very much thank you for that. Thank you all very much. That's a great honor. It's a great honor. Today, we reaffirm our ironclad solidarity with the Cuban people and our eternal conviction that freedom will prevail over the sinister forces of communism and evil of many different forms. 60 years ago, the Cuban Patriots formed Brigade 2506 in a daring effort to liberate their homeland from the communist Castro regime."
    },
    {
      "text": "Today, we declare America's unwavering commitment to a free Cuba, and you will have that. You will have that very soon. We're glad to be joined. They will have it, Mike, won't they? It's happening very fast actually. We're glad to be joined by Vice-President Mike Pence and you know what I'd like to do. I'd like to have Mike come up, say a few words. He's very much wedded to what you are believers in. He believes in Cuba and he believes in a lot of help for you. So, Mike, please come up and say a few words."
    },
    {
      "text": "Thank you very much, Michael. We appreciate it. And it's great. And I know that all of the great people that I just met that love Cuba so much, they appreciate your help very much. They so stated. And thank you as well to Deputy Secretary of State Steven [inaudible :]. Thank you very much. Ambassador to the organization of American States, Carlos Trujillo. Carlos, thank you very much. And a friend of mine, a great gentleman, just recovered from a very serious bout, but he is strong."
    },
    {
      "text": "There's nothing going to take him down. Mario Diaz Balart. Mario, thank you Mario. Great job. Mario's Great and I know you're a thousand percent and you did it fast. You're strong. You're very strong, Mario. Anthony Gonzalez, great football player, by the way, great, great football player. All the way through the NFL. That's great. And we got Ohio State going. We have the whole Big 10. We got that done, didn't we, Anthony? And you helped. And I appreciate it. Thank you very much. And Alex Mooney, Alex thank you very much."
    },
    {
      "text": "Thank you Alex. I also want to recognize Maricio Klaver Carone who has just been elected as the first American to lead the Inter-American Development Bank. That's big stuff. He's been my friend and he agrees with what I said. And when I talked to you about Venezuela, it was much different than the so-called experts. The experts that have been talking about it for 20 years and nothing happens."
    },
    {
      "text": "And when I talked about Cuba, much different and my friend would get up and say, \"The only one that's been right about this for two years is President Trump.\" Hence he's heading this big bank now. It's amazing. See if you say nice things about the president that's what happens, but congratulations, you deserve it. You're going to be fantastic. Thank you very much. This milestone underscores our historic partnerships across Latin America."
    },
    {
      "text": "On April 17th, 1961, the 1,400 Cuban exiles of brigade 206, landed at the Bay of Pigs. They were met by fierce airstrikes by heavy fire, very, very heavy and 20,000 soldiers from the Castro regime. These brave warriors fought three grueling days. The brutal Castro regime imprisoned them for 20 months until the United States negotiated their release. Today were profoundly honored by their presence. We're joined by these 20 incredible veterans, Brigade, 2506 and their families. Could I ask you to stand please?"
    },
    {
      "text": "Because [inaudible :41] that's great. You're looking good, too. Looking good. Wow. That's great. Good looking people in Cuba. That's a good looking group. I appreciate you being here. This is tremendous. It's an honor. You've been honoring me for four years and now I'm honoring you and that's a nice way to do it. Speaker 3: () [inaudible :13] the next four years. Well, thank you very much. No, we really appreciate it. We will honor your courage with my Administration's determination to defeat communism and socialism."
    },
    {
      "text": "And we will do that in our own country, too. We're in the process of doing it right now, and it has stepped, in my opinion, beyond the word socialism. And we are meeting it with great force. My Administration stands with every citizen of Cuba and Nicaragua and Venezuela in their fight for liberty. And we work for the day when this will become a fully free hemisphere and it will be for the first time in human history, a fully free hemisphere, and we will have it. We will have it, and it's going to happen."
    },
    {
      "text": "It's going to happen sooner rather than later, a lot of things are going on right now that I can tell you about, but I will be soon. The Obama-Biden administration made a weak, pathetic, one-sided deal with a Castro dictatorship that betrayed the Cuban people and enrich the communist regime. I canceled the Obama-Biden sellout to the Castro regime."
    },
    {
      "text": "We will not lift sanctions until all political prisoners are freed, freedoms of assembly and expression are respected, all political parties are legalized and free elections are scheduled. They will have to go through a lot, but things are happening. And it's very interesting to see the level at which they're happening. Earlier this year, we also demanded the release of human rights activists, Jose Daniel Ferrer."
    },
    {
      "text": "Today as part of our continuing fight against communist oppression, I am announcing that the treasury department will prohibit U.S. travelers from staying at properties owned by the Cuban government. We're also further restricting the importation of Cuban alcohol and Cuban tobacco. These actions will ensure that U.S. dollars do not fund the Cuban regime and go directly to the Cuban people. Big difference, big difference, really. We're also imposing strict sanctions on the dictatorships of Nicaragua and Venezuela."
    },
    {
      "text": "We brought criminal charges against Maduro for his narco-terrorism. The courageous veterans here today bear witness to how socialism, radical mobs, and violent communists ruined the nation. Now the Democrat party is unleashing socialism, right within our own beautiful country. Today, we proclaim that America will never be a socialist or communist country, and I'm going to add that word. [inaudible :19]. First time I've ever said that."
    },
    {
      "text": "I've never added the other word, but I think it's appropriate, mike, when you look at the kind of ideology we're also facing. When you see the rioters, looters, anarchists, and then you see the press, the media play right into their hands. It's so sad to see the media, the way they're being used. The media is being used like fools, they're being used. And it's very sad to watch but we will prevail. It's the first time I've said that though, socialism and communism."
    },
    {
      "text": "We did not fight tyranny abroad only to let Marxists destroy our beloved country. Together, we will defend our freedom and our American way of life, and we will defend it strongly and successfully as we've been doing. Then as we celebrate Hispanic heritage month, we give thanks to the countless ways that Hispanic-Americans uplift and inspire our nation. They've been so good to me. And I must tell you that the big story is the poll numbers. Trump has gone through the roof with the poll numbers from Hispanics."
    },
    {
      "text": "They're all talking about it. I just watched something and read a couple of articles and they don't know what's happening. I guess they didn't know I love you, but I do. They're incredible people, incredible people. They knew it, but they were all shocked. Hasn't been a time when something like this has happened. Nearly 60,000 Hispanic-Americans serve as police officers. More than 300,000 Hispanic-Americans serve in the military. Over half of the border patrol agents are Hispanic and they're incredible."
    },
    {
      "text": "I've gotten to know so many of them, they're incredible. More than three million Hispanic-owned small businesses provide jobs for millions of Americans. They're fabulous business people. Hispanic Americans teach their children to love our country, honor our history and respect our great American flag. Hispanic Americans embody the American dream and my administration is delivering for you that American dream like nobody has ever delivered for the Hispanic-Americans. And hopefully for everybody else."
    },
    {
      "text": "We implemented the historic tax cuts, regulation cuts. And I recently created the Hispanic Prosperity Initiative to expand economic opportunity. Before the China virus, we achieved the lowest Hispanic-American unemployment rate ever recorded in our country, it's not even close. Last year, Hispanic-American poverty reached an all-time low. We built the greatest economy in history and now we're doing it again. We closed it up."
    },
    {
      "text": "We saved millions and millions of lives, and now we opened it up and you've been hearing about the V. We have a V, we may have a super V and it's coming back fast. We're going to have a very good third quarter. That'll be announced just prior to the election. So I'm putting myself at risk when I say that, because if it's not good. You can imagine there'll be playing what I just said. They won't say that I'm here representing the Hispanic-Americans or Cubans or anything else."
    },
    {
      "text": "They'll just say, \"Look what he said,\" but I'm willing to take that chance. We're going to have a great third quarter. And next year is going to be one of the greatest economic years we've ever had. We feel very confident based on everything. In the last four months, 3.3 million Hispanic-Americans were hired to fill new jobs, a record. I've taken bold action to defend the right to religious Liberty and the right to life."
    },
    {
      "text": "We are protecting school choice for over one million Hispanic-American students, such a big deal. In a second term, I will provide school choice to every family in America. We want every American to have a limitless future. Here with us, today is Bay of Pigs veteran Umberto Cortina. Where's Umberto? Stand up. Come on up. Who founded a small business in Miami and was elected to the Florida State House. Umberto, say a few words. Good, please be careful. I don't want you falling on me."
    },
    {
      "text": "You'll never, you'll never be the same if you fall- You know if you fall, they'll never let you forget. No matter how good you speech. Umberto, no matter how good your speech, it won't matter, right? Please, you'll have a good one. Thank you very much. Thank you, Umberto, very much. Thank you. Thank you very much. That's great. Thank you very much Umberto. Mario, would you please come up and say a couple of words, please? Thank you. Thank you Mario, very much. It's my honor. And it's my honor, thank you very much."
    },
    {
      "text": "Also with us today is Colonel Johnny Lopez de la Cruz, I love that name. President of the Bay of Pigs Veterans Association who was so nice to me four years ago, who went on to serve for 27 years in the United States military. Johnny, please come up, please. Thank you. Thank you very much. Great job. The veterans we honor today are a powerful testament to all that a free people can achieve. In the past six decades, you have built strong families, thriving businesses, and vibrant communities."
    },
    {
      "text": "Today, we thank God for the blessings we share as citizens of the greatest country on earth, and we hope, pray and work for the day when the people of Cuba can finally reclaim their glorious destiny. It will happen soon. Thank you and God bless America. Thank you very much."
    }
  ]
}