{
  "speech_id": "457",
  "title": "Trump Rally in North Carolina",
  "date": "20240923",
  "url": "https://www.rev.com/blog/transcripts/trump-rally-in-north-carolina-2",
  "topics": "Economy, Immigration",
  "num_segments": 78,
  "content": [
    {
      "text": "Oh, what a crowd this is. That's a big, beautiful... We flew over, and I said, \"That's a lot of people. That's a lot of people.\" As far as the eye can see. I hope you can see back there, it's a long way back. I want to thank everybody, and hello to North Carolina. And I'm thrilled to be back in this incredible state with thousands of hard-working, God-fearing, American patriots. Amazing, amazing people. () We have a little thing called that election coming up, but we're going to win this election."
    },
    {
      "text": "I don't know if you've seen the polls, but they're very good. We'll be going over that in just a minute, but we're doing really well, and I appreciate it. And we've won this state every election; the primaries, we've won, we've won the general elections, and we got one more left before we make America great again. Have to do it again. We have to do it again, because they really loused things up in four years, didn't they? Didn't they just, what they've done?"
    },
    {
      "text": "Exactly 45 days from now, we're going to win North Carolina, we're going to defeat Kamala Harris, and we're going to make America great again. We're going to make it great again. When you cast your ballot for Trump this November- Thank you very much. That's the best seat in the house, I always said it. They can't see me too well, but oftentimes, they're picked to be movie stars, they're so beautiful. All of the fake news up there, you think you have the best seat. See, you think you have the best seat."
    },
    {
      "text": "Actually, they do, because what happens is Hollywood is watching, and every once in a while they see a face, they see this beautiful face, and they don't see your face, they only see the back of your head. Would anybody like to change seats? Would you rather change? I didn't think so. I didn't think so. When you cast your ballot for Trump this November, it means that America's borders will be instantly secured. Can you believe what they've done?"
    },
    {
      "text": "What they have done to our country, with millions and millions of people walking right through our border? It means the price of household goods will start to plummet, groceries and rent will no longer break your budgets, and you will have thousands of dollars of savings by the end of the year. Let me just tell you, we're going to get your energy cost down in one year. We're going to get your energy cost down by 50%. We'll cut it in half. We're going to cut it in half."
    },
    {
      "text": "It means young people will once again be able to afford a mortgage and a home. Thank you very much. Uncle Sam. Look, Uncle Sam is here! I love Uncle Sam. I love Uncle Sam. Look at him. It means the streets of your cities will be safe and clean. The homeless encampments will be gone. They're going to be gone. Oh, you have to see some of these encampments, what they've done to our cities, and we've got to take care of the people, but they're destroying our cities."
    },
    {
      "text": "And instead of a planet on the edge of global war, we will have world peace. We won't have World War III, which we're very close. We're very close to having right now. That's the future that awaits the America that we love under President Donald J. Trump. But if you cast your vote for Kamala Harris... Comrade, comrade. We call her comrade. You're voting for four more years of brutal job losses, higher taxes, surging prices, falling wages, and economic depression and despair."
    },
    {
      "text": "Other than that, you'll be doing quite well, I think, actually. A vote for Kamala Harris means 40 or 50 million more illegal aliens will invade across our borders, stealing your money, stealing your jobs, stealing your life. It means your police forces will be gutted, your guns will be confiscated, and savage criminals will run wild in the streets. So, that's what it means. You know what? That's what it means."
    },
    {
      "text": "She's always said, \"We will confiscate all guns.\" Now she's saying, \"Oh no, guns, I think they're wonderful.\" Right? Doesn't work that way. They're going to confiscate your guns. I'm the one that's protecting it. You know we got the total endorsement of every gun group, including the NRA? And we have protected your Second Amendment. And if you think it was easy, it was not easy. If Kamala Harris is re-elected, she will kill the American Dream forever."
    },
    {
      "text": "() She's not competent to be president either, but I don't want to be rude. I don't want to be rude! She's not competent to be president. Did you see her on Oprah? That's not going to be... That's not going to be president. Oprah didn't know what the hell to do. Oprah was embarrassed, she wanted to hide under the table. But she's a professional and she was able to sort of disguise it. No, she wanted to go right under the table."
    },
    {
      "text": "Vote Trump, and we will bring back the American Dream bigger, better, and stronger than ever before. () Kamala can't be trusted with your economy or anything else. How this happened, explain it to me, please? How did this happen? And we all saw what happened, and we see what happened. Kamala was a total disaster yesterday and at every other interview, she's been just a free fall. I don't know what the hell's going on. She can't do an interview. She doesn't want to do them. Something's wrong. Let's just take a look."
    },
    {
      "text": "Let me just see, we have a little video. We spend all the money on these screens. We want to use them a little bit. Let's play it, just for a second. Thank you. Speaker 1 It's not what you want. That's not what you want. Kamala and her group have seen what's happening to their campaign, and it's not going well for them. And they would like... Just announced a little while ago, as I was coming off the plane, they would like to do another debate."
    },
    {
      "text": "Although good entertainment value, a lot of people say, \"Oh, do it, it's great entertainment.\" I've already done two. One with Crooked Joe Biden at CNN, and the other one with Kamala on ABC. CNN was very fair, I thought. Joe was driven out of the race. It was a coup, by the way, but he was driven out of the race, and they've been widely criticized by the radical left lunatics for all of the fairness, they were very fair."
    },
    {
      "text": "In other words, they won't be fair again, because they took a lot of abuse from the radical left. ABC was three-on-one, but I was given credit for having done a very, very good job. I appreciate that. We did a great job. It was three-on-one. () The problem with another debate is that it's just too late. Voting has already started. She's had her chance to do it with Fox. Fox invited us on, and I waited and waited, and they turned it down. They turned it down."
    },
    {
      "text": "But now she wants to do a debate right before the election with CNN, because she's losing badly. It's like a fighter. She sees the polls, she sees what's happening, she's losing badly, but it's like a fighter who goes into the ring and gets knocked out. The first thing he says is, \"I want a rematch! I want a rematch!\" () And I won all of the primaries. Remember, she won none. She went into no primaries. She got no votes. Biden, in all fairness, I'm no fan. But in all fairness to him, he got 14 million votes."
    },
    {
      "text": "She got none. She's done one debate. I've done two. It's too late to do another. I'd love to, in many ways, but it's too late. The voting is cast. The voters are out there immediately. Is everybody voting? Please get out and vote. I would rather see one-day voting, paper ballots, voter ID, and proof of citizenship, and we have a nice, honest election. We have one state, you go forever. It's like for two and a half months, and then they have the right to delay the count for weeks and weeks. The whole thing is crazy."
    },
    {
      "text": "We're going to get it changed. We got to get in. When we get in, we're going to get this craziness changed. () Everyone knows that Kamala Harris cannot explain how she would make your life better, because it's really her policies that have destroyed this country in the last three years. She was the border czar. Now she says she wasn't the border czar. It doesn't matter. She was in charge of the border, put there by Sleepy Joe Biden. He wanted to go to the beach. She said, \"I don't have time."
    },
    {
      "text": "I got to go to the beach and sleep.\" Who the hell sleeps on camera? You have cameras watching. I don't want to ever fall asleep on live television. () Kamala Harris costs your family $28,000 in higher prices. Last month alone she lost, think of this, last month, they lost, in this country, 438,000 full-time jobs. That's a government number, including 24,000 manufacturing jobs. That's last month. And the interest rates are lowered for political reasons, but they're also lowered because the country's not doing well."
    },
    {
      "text": "We would rather have you as president, think of this. If you would rather have me as president, or, okay, let's do this. Let's do a poll. You ready? Who wants Trump as president? I'm shocked. Is there anyone brave enough to raise your hand? Who wants Kamala as president? I'm looking for one brave soul. That would be very brave. Who would you rather have as your president? Radical liberal Kamala Harris, who created the worst economy in your life? It's the worst economy that we've ever had, under them."
    },
    {
      "text": "Or the businessman who created the greatest economy in the history of our country and in the history of the world? We created the greatest. () Kamala Harris is promising war on American energy. Oh, she's after energy. Oh, she's after it. You know what they did? She came in, they closed up all of the energy. The prices started going crazy. So, Biden started screaming, \"Get back to what Trump was doing!\" But if they won this election, the day after they win, your energy prices are going to double and triple."
    },
    {
      "text": "You know that. The largest tax hikes on families in American history, is what they say, the largest small business tax hikes in American history, and the most crippling regulations in American history. () All of this is shutting down power plants and banning gasoline-powered cars or trucks. Would anybody like to drive, on occasion, a beautiful gasoline-driven car? We want a gasoline-powered... Now, they do have a new one. Hydrogen. The problem is it tends to blow up every once in a while."
    },
    {
      "text": "And you go many, many blocks in the air. You say, \"What happened with...\" So, that's a little bit early. But we want new technology, we want hybrids, we want a lot of things. Under the Trump economic plan, we will cut your energy prices in half. Within, mark it down, and you can get very angry at me if we don't do it, within 12 months, your energy prices will be cut in half. We have more liquid gold under our feet than anybody else. And we will rapidly defeat inflation."
    },
    {
      "text": "() So, inflation is a misnomer, because the inflation is now getting stabilized, because our country is doing badly. But the prices have been driven up here and people can't afford the groceries. I told this story the other day, a woman, sort of elderly woman, it was sad, goes up to the counter, register, puts three apples on, and then realizes she can't afford it. And she took one apple, brought it back into the refrigeration. Came back, and she took two apples. That shouldn't be happening in this country."
    },
    {
      "text": "That shouldn't be happening. And by slashing inflation, we will cut interest rates and reduce the monthly cost of your typical mortgage by $1,000. $1,000 a month. Listen. () So, interest rates with me were at 2%. Interest rates with her and Joe, I got to add him, I don't know. Is he still the president? I'm trying to figure it out. I hate to waste the time by saying \"and him\", because I don't think, I don't know, is he the president? Because yesterday, his wife took over the cabinet meeting, right?"
    },
    {
      "text": "Said, \"I'm going to ask my wife to take...\" He hasn't had a cabinet meeting in two years. And yesterday, they finally had it. And he said, \"I'm going to let Jill handle it.\" A lot of things are happening there. A lot of bad things are happening. We will massively cut taxes for workers. We will have no tax on tips. We will have no tax on overtime. And no tax on Social Security benefits for our great seniors. No tax. And it makes sense, because the seniors have been hurt so badly with inflation."
    },
    {
      "text": "So, we're going to have no tax on Social Security for our seniors. And while working Americans catch up, we're going to put a temporary cap on interest rates on credit card debt at 10%. Some people are paying 25 and 30%. It's crazy. In theory, that's against the law. Okay? Called the usury laws. But in theory, that's against, so we're going to cap it for a period of time at 10%. This election is about the economy, this election is about the border. That's what it is. And I am your border president."
    },
    {
      "text": "Young guy, I don't know where the hell he is, a lot of people out here, but when he screams, \"You've got to save us, President Trump,\" that we need a scream like that, that you would think in this country, that you even need something like that, it's very sad, but we're going to save you. We will. We did it once, we're going to do it again, and we're going to do it at even a higher level. An even higher level."
    },
    {
      "text": "() That's one of the big reasons why I just won the overwhelming endorsement of the rank-and-file membership of the Teamsters. They voted for Trump. They voted for Trump. Last month, American Board Workers lost, think of this, 1.3 million jobs, and their voters. American workers lost 1.3 million jobs. Meanwhile, the migrants picked up 635,000 jobs, plus another 700,000 or 800,000 jobs at least that we know of. But the Americans lost jobs. What a disgrace."
    },
    {
      "text": "You read some of this and you hear the facts, you find it hard to believe it could be happening actually. () Because, you know, the Republican Party has become a party of common sense. I call it the party of common sense. We're conservative. But it's a become a party. Where is the common sense in open borders and high taxes and the job numbers that I just read to you?"
    },
    {
      "text": "Even Federal Reserve chair, Jerome Powell, said this week, quote, \"The influx across the borders has been one of the things that has allowed unemployment to rise and rise substantially.\" To save your jobs, you must vote for Trump. Very simple. Very simple. () So in the latest Rasmussen poll just out- ... Thank you. Remember I used to talk about the polls, right? I used to talk about the polls and I forgot about it because I won the primaries by so much, I didn't have to talk about them."
    },
    {
      "text": "But in the latest Rasmussen poll, you know what happened with Joe? We beat him by, I think, 21 points. And they said, \"You got to get out. You can't win.\" And he got out. So now I got a second race. This never happened. I, think of it, spent a hundred million dollars on beating Joe and we beat him and he couldn't win and they went to him and they said, \"You can't win. You're out.\" You're not supposed to say that to a president, but they said, \"Joe, you're out. Get out of here, Joe.\" And really, they took it over."
    },
    {
      "text": "() He got 14 million votes and she got none. And then they never thought she was going to get it, but it turned out that she got it because they wanted to be politically correct. She didn't get one vote. She didn't win one primary. She was the first one that quit the race when they had 22 candidates where Biden won it. But in the latest Rasmussen poll against her, just came out, we're eight points up. In the New York Times/ Siena poll, can you believe New York Times?"
    },
    {
      "text": "They can't be happy, we're nine points up in the Midwest alone. In the Emerson poll, highly respected, we're three up in Georgia and leading Arizona by a lot, Wisconsin by a lot. And I think we're really doing well in Pennsylvania. That's what the word is. () But remember, don't get too carried away, they cheat. That's what they do. They cheat. Too big to rig. We got to get out there. Everybody's got to vote. And in the American Greatness poll, we're beating Kamala by three here in a place called North Carolina."
    },
    {
      "text": "And one that's very exciting, a poll just came out where we're actually leading in the state of Virginia, which no Republican has won in a long time. But take nothing for granted, you have to get out and vote. You just have to get out and vote. We cannot accept it. It's the only thing they do well, they cheat. Their policies are no good. Their government is no good. Their management is no good, but they cheat like nobody can cheat. () We're pleased to be joined today by a senator that I'm very proud of actually."
    },
    {
      "text": "He ran and won and beat somebody who was tough. And I recommended before that Lara run for that office. But Lara said, \"I have a beautiful family, a husband, and two the most beautiful kids,\" you're going to meet one of them in a minute, \"because we happened to name her Carolina.\" () And we have a great gentleman named Ted Budd, a congressman and he's fantastic. And so I said, \"Ted, you want to do it? I'm going to give you my...\" And I gave him the endorsement. And he has been a great senator. Ted Budd. Ted."
    },
    {
      "text": "Hi, Ted. He's done a fantastic job. Also. I was early with him too, Dan Bishop, who is fantastic. Dan, you're looking good. You're looking good. Thank you, Dan. He's great. He's a warrior. David Rouser. David Rouser. David. We love David. And Anna Paulina Luna. I want to say it perfectly. Anna. She's so popular in Florida. I don't know what's your next move. Stay just relaxed. But what's your next move? She is so popular and she's a warrior. They're all warriors, that whole group."
    },
    {
      "text": "() North Carolina Republican Party Chairman, he's been incredible, Jason Simmons, you know Jason. Thank you Jason. How are we doing? Are we okay? Okay. We got to be okay. We got to win. This is a very important state. We win this state, I think it's going to be over fast. And we've won it every time. Every time. So we're we're five and 0, including primaries. RNC Chairman, he was so good. And you know what he was good on? Stopping the cheating."
    },
    {
      "text": "Because when other places were winning, we're going to win 10 o'clock in the evening. Then at 3:02, a lot of ballots came in, but they didn't come in here. He had 603 lawyers and he was tough as hell. And I said, \"That's the guy I want to run the RNC with Lara.\" They're doing an unbelievable job. () And by the way, Lara's here. Would you stand up? Lara and Eric. Lara and Eric. I call it a super couple. That's a super couple. Thank you, and you're doing a great job, Lara. And he's doing a great job."
    },
    {
      "text": "He's the most subpoenaed human being in the history of the United States. Every day he gets a subpoena from Congress, from a crooked DA, a crooked AG, Democrat areas only. But man, he's tough as hell. He was such a nice young man just a little while ago. Now he's become like a hardened, tough... I said, \"Is that my beautiful Eric?\" But it is. () And he's still beautiful. And he's smart and he is tough and he's handled it so well. Eric, stand up separately. Come on."
    },
    {
      "text": "He is the most subpoenaed man in the history of our country. He got more subpoenas than the late, great Al Capone. Al Capone is like a baby compared to Eric. Thanks, Eric. Good. Great job, honey. Great job. And Robeson County Commissioner, Michael. Where's Michael Whatley by the way? Where are you? Where are you, Michael? Stand up. We're counting on this guy. I didn't take him from any other state. I took him right from here. He was your party chairman. () And it's true though."
    },
    {
      "text": "You see, about 11 o'clock, 12 o'clock and then 3:02, you'd see these states that were easy wins. They sort of fell off because of COVID and lots of problems. They were lots of problems. But bottom line, they cheated and they fell off. But you know a place that didn't fall off? North Carolina and it was headed up by that man. So Michael, you better win or you're never going to be able to come back here. He doesn't win, he won't be at RNC and he will no longer be in North Carolina. He'll be looking for a job."
    },
    {
      "text": "I think he's going to win. And that's what he's focused. () I said, \"You know, we don't need votes. What we need is honesty in the election.\" If we have honesty, we have all the votes we need. And by the way, before I forget, I don't want to forget. You have about 30 of the most incredible women that follow me all over the place, and they're from North Carolina. Unbelievable. They follow me all over the country. They're from North Carolina. Isn't it nice.? Isn't it nice to finally be here?"
    },
    {
      "text": "You don't have to travel to California, Texas. They travel all over the place. They're great. They're great and we love them and they're beautiful. I don't get the husband, they're all happily married, right? I don't quite get it. () And here's another one. Look at that, they didn't want to sit with you. They wanted a better location. That's the boss. Thank you very much. It's great honor. And we also have front-row Joes. They're all over the place."
    },
    {
      "text": "They stand in line for two, three days because they want to get that front row. Thank you very much. And they've seen plenty. And they were there, unfortunately, in Butler. That was a hell of a day, sitting right where he was sitting right now. That was a hell of a day. That was something. Never let that happen. () And also, Robeson County Commissioner and member of the Lumbee Tribe, a friend of mine and a friend of ours, John Cummings. Where's John? Thank you, John."
    },
    {
      "text": "John is a real supporter and we appreciate it very much and we're going to make sure that you guys are okay because they have not been treated properly by this administration as we know. Thank you. You can tell everybody. The Lumbee Tribe has been wrongfully denied federal recognition for more than a century. Only a century? That's not that long. Century, it's hundred years, it's not that long. But no, we're going to take care of it. We'll take care of it right at the beginning. All right? You can tell them."
    },
    {
      "text": "() Biden and Obama promised that they want to remedy the injustice, but they never did it. They broke their promise. And today, I'm officially announcing that if I am elected in November, I will sign legislation granting the great Lumbee Tribe the federal recognition that it deserves. Okay? You'll be all set. And I got to know them, they're great. But unfortunately, we weren't in office when that happened, but they treated him very badly. Thank you very much, John."
    },
    {
      "text": "() We all have, and I said too, I alluded to it, a very important member of my family, far more important than Eric or Lara. And her name is Carolina. And she's beautiful and she's sweet, and she doesn't know how evil life is. She hasn't experienced it yet, but she does know how great life is. And we want to make life great for everybody here, and we're going to do that. Can I ask Carolina to come up? Is that possible? Carolina. She sat on my lap during the Republican Convention. Make America great again."
    },
    {
      "text": "Go ahead, you shout it. That was great, honey. Wow. What a good job. I can see the new senator, when Ted someday, he's going to say, sir, I've had it. I can't do it any longer. He's going to resign or leave and we're going to have Carolina get in there and run. Anyway. Would anybody like to meet Luke, her brother? Luke, come on up. Thank you sweetheart. Thank you. Great job. So cute. Oh, he doesn't want to get off the stage. Oh, wow. Look at that. He's got the gene. Thank you. Thank you, Luke. I said say MAGA."
    },
    {
      "text": "I whispered into his ear, so cute. I said say MAGA. He said, \"Vote for grandpa.\" He didn't care what I said and that was actually much better. That was much better. Thanks Luke. Thanks Carolina. Thank you honey. What great kids. Great people. That's the whole family is a wonderful family. Thank you. Thank you very much. They're really helping. () Lara's all over the state. As you know, Lara grew up here and she loves the state and she spends more time here than anyplace else, and she really loves the state and so do we."
    },
    {
      "text": "It's been a very special experience. Thank you. Thank you, Lara for the help too. Appreciate it. () We are seven weeks away from the most important election in the history of our country and Kamala Harris is the most radical left nominee ever to seek the presidency by far. The problem with her is nobody knew who the hell she was. When you say, oh, Harris is running, nobody knows the last name. I could say it today. If I just told Harris is running, you'd say, who the hell is Harris? () Look at the people up front."
    },
    {
      "text": "They're friends of mine. They're tough, smart, rich people, actually very good. They've made a lot of money in this state, but when I say Harris, they say, who the hell is Harris? We have no... They know Kamala, but they don't know Harris. They know comrade. They also know comrade, and that's what she is. She's a comrade. Harris is running and she wants to open your borders."
    },
    {
      "text": "() I'll tell you what, 21 million people, and that's really not including gotaways, came into this country and they came in from a lot of bad places. Do you know that crime all over the world is down? In Venezuela, it's down 72% because they've taken their criminals and they've dumped them into the United States. It's down 70 and nothing good is going to happen with that. All over the world, not just South America, crime is way down, way down and what shame that is."
    },
    {
      "text": "What shame that is, and you see it how bad it's getting when you look at what's going on with the migrants attacking villages and cities all throughout the Midwest in particular right now, but it's all over. () She's going to deliver rampant inflation and she wants to pack the Supreme Court, our great Supreme Court. Instead of nine Justices, Kamala wants to bring it up. The other day for the first time I heard a number, it's got to be an odd number."
    },
    {
      "text": "They didn't like the number 13, so instead of going to 15, they went to 25. I understand they want 25. They want to pack our courts immediately and we can't ever let them do that and we're going to stop them and we have to stop them at the presidency. Ideally, we're going to do well, Ted, with the Senate, but we have to stop them with the presidency. We have to stop them ideally. You have some great congressmen and congresspeople running. We have to stop them there. 25 justices is what she's looking for."
    },
    {
      "text": "That's the real number so she can rig the system. () She was an original creator of Defund the Police movement, just so you know. She's been there for 15 years. If you're there for one week, you cannot vote for her for president, okay? Anybody that wants, even had a thought, of defunding our great police law enforcement can no longer serve or even be thought of to be president. I met a lot of the officers backstage, they're incredible, the job they do and we appreciate it. She wants to defund the police."
    },
    {
      "text": "() She wanted to do it in Minneapolis. That's why she picked this character, this weird guy, I said weird. JD and I are not weird. We got a lot of problems, but we're not weird. He is a weird dude, isn't he though? She got to meet him, he's a radical left lunatic, during the burning of Minnesota. They burned the whole state. Minneapolis was like a fire pit, and I saw a CNN announcer saying, well, this has been a friendly gathering and behind him, the entire city was burning down."
    },
    {
      "text": "Nobody's ever seen it, it looked like World War II. No, we're not going to do it and we're going to stop World War III, by the way. We're going to stop it. We're going to stop it, cold. () Kamala Harris vowed to abolish ICE under border czar Harris. Venezuelan gangs have taken over entire apartment buildings in Aurora, Colorado. The government, the governor is petrified in Colorado. He's a liberal governor. He doesn't know what to do. The guy is so scared of these guys, and maybe you can't blame them."
    },
    {
      "text": "They have military-style weapons, AK-47 Supremes. They've got stuff that's unbelievable. They're young, they're tough, nasty people, and they got a lot of them. They came in from Venezuela in that case, in Aurora's case. You have a great sheriff in town, but the sheriff is looking at this. He said, wow, that's a lot of firepower. They're in the real estate business. They're taking over buildings, they're doing it the old-fashioned way."
    },
    {
      "text": "() She supports free healthcare for illegal aliens while our hospitals and emergency rooms are being overrun by migrants. If you want to go to a hospital because you have an emergency and you pay taxes in North Carolina for 40 years, you won't be able to get in and some places you don't even have a chance of getting in. You know that, you don't even have a chance."
    },
    {
      "text": "() She wants mass amnesty and citizenship for all illegals, and she says that she must, anybody that utters the word, think of this, the words illegal alien, radical, Islamic terrorist. She said, don't you ever use those terms, but here's the worst. Think of this. She lost 325,000 migrant children. They're gone. They're gone. Many are dead. Many are just kidnapped. Many are working in slavery. 325,000. That's filling up, pick a nice stadium. Let's go to New York. Pick Yankee Stadium. It holds 55,000. Think of that."
    },
    {
      "text": "You could fill it up, so many times you could fill it up, it would never end. 325,000 young children are missing, many are dead, and that's under their watch. It's the most cruel thing and the press, the fake news right there, they won't talk about it. They don't want to talk about it. They don't want to talk about any of the bad things. () As California Attorney General, she redefined child sex trafficking. That's a term."
    },
    {
      "text": "Assault with a deadly weapon, and rape of an unconscious person and also other names that are too bad to name. I'm not going to name them because these young children are here. We don't want to name them. As nonviolent crimes, she said they're nonviolent crimes. Think of that, rape of an unconscious woman. () She vowed repeatedly to ban fracking. She imposed natural gas export. Think of that. She banned natural gas exports where we would've made a fortune. Everybody wanted our oil and gas."
    },
    {
      "text": "She banned it and it's crushing Pennsylvania. She praised the idea of 70 to 80 percent tax rates and she pledged to abolish private healthcare. People in this audience, some have private healthcare. They want to pay a little bit more and they want to have great healthcare and force everyone onto socialist government run healthcare with high taxes and deadly wait times. People are waiting online at these places for four months for the most routine examination. () She wants to ban the sale of gas powered vehicles."
    },
    {
      "text": "She's already banned them, which will destroy North Carolina's way of life. She even endorsed free sex changes for illegal aliens. We're going to do operations. I mean, it's not even believable, and she's running. She's running. Think of it, sex change for people that are in prisons and detention centers if they ask for it and she wants it. Check it out because it's not even believable, but it's true."
    },
    {
      "text": "() As DA and as Attorney General, she destroyed the great city of San Francisco, one of the greatest cities in our country just 15 years ago, and she destroyed the state of California. People are leaving. She led the change in California law so that if you steal less than $950 worth of merchandise, you are not prosecuted. If you steal more than $ 950 worth of merchandise, you're also not prosecuted, frankly. () You see these criminals going into a store, they go into a store with a calculator."
    },
    {
      "text": "Let's see, that's $10, $12. They want to keep it under $950. Can you imagine being able to steal a thousand dollars worth of stuff and you're not going to be prosecuted? () She even lied to the American people about Joe Biden's cognitive abilities. A great disservice to the American people. Think of it. We had a man who was cognitively impaired dealing with Russia, China, Kim Jong Un of North Korea. Nuclear weapons all over the place. All of these countries, and she said, no, no, I found him to be fine."
    },
    {
      "text": "She didn't find him to be fine, she lied. () She lied about McDonald's. She said she worked in McDonald's. She said she worked in McDonald's. Oh, she worked over the french fries. It was so hot, the heat. The heat, it was so hot. She'd burn her hand every once in a while on the grease. Oh, McDonald's. It was a lie. She'd never worked at McDonald's and the fake news doesn't want to mention it. They had a big thing about her job at McDonald's and they went there and the manager's been there a long time."
    },
    {
      "text": "Other people have been there a long time. Say, no, no, she never worked here. Never worked here. She lied. () That sounds simple, but that's really bad. It was a pure and simple lie. She never worked at McDonald's and didn't Oprah ask her about her time at McDonald's? She just sort of didn't want to answer that one. Let me not talk about that. Oprah said, you work at McDonald's, that's great. Oprah didn't hear the end results."
    },
    {
      "text": "She never worked there, so Kamala just sort of hid under the desk along with every other answer she gave. () That's why less than two months from now, we are going to tell her that we've had enough, Kamala. We can't take it anymore. Kamala, you are the worst vice president in history. Kamala, you are fired. Get out of here. Get the hell out of here. You are fired. Get out of here. () Let's talk about our great women, because women have gone through a lot. They've gone through a lot."
    },
    {
      "text": "Women are poorer than they were four years ago. Are less healthy than they were four years ago. Are less safe on the streets than they were four years ago. Are paying much higher prices for groceries and everything else than they were four years ago. Are more stressed and depressed and unhappy than they were four years ago. Are less optimistic and confident in the future than they were just four years ago. I will fix all of that, women, I will fix all of that and I will fix it fair."
    },
    {
      "text": "() At long last, this national nightmare that we're going through will be over. Women will be happy, healthy, confident, and free. You'll no longer be thinking about abortion because it is now where it always had to be with the states and with the vote of the people. The people are now voting and many of those votes are far more liberal than we thought, but every legal scholar, every Republican and Democrat for years didn't want it in federal."
    },
    {
      "text": "They wanted it in the states and a vote of the people, and that's what's happening right now and with the powerful exceptions like those that Ronald Reagan insisted on. () Ronald Reagan insisted on the exceptions for rape, incest, and life of the mother, but not allowing for Democrat-demanded late-term abortion in the seventh, eighth, and ninth month, or even execution of a baby after birth, which is what they want. I asked her about it during the debate and she didn't want to answer it."
    },
    {
      "text": "I said, are you willing to have an abortion on a woman in the ninth month? She didn't want to answer. The answer is yes, and think of it, even after birth. It's called execution. I will protect women at a level never seen before. They will finally be healthy, hopeful, safe and secure. Their lives will be happy, beautiful, and their lives will be great again. So women, we love you. We're going to take care of you. Thank you. We're going to take care of you. () That's where they've always wanted it."
    },
    {
      "text": "Everybody, every legal scholar in the country, that's where they wanted it. From the moment we take back the White House from Kamala Harris, I believe we're going to have the four greatest years in the history of our country. () Starting on day one, I will seal the border and stop this horrible migrant invasion that is destroying our country. We will carry out the largest deportation operation of criminals in American history."
    },
    {
      "text": "We will end inflation and make America affordable again, and we will get your energy bills cut in half within 12 months. We will come, that's right, thank you. We will become energy independent and then energy dominant like no country has ever been before. () Remember, again, we have more than Saudi Arabia. We have more than Russia by a lot. We will open ANWR because ANWR, a lot of you know what ANWR is. The biggest site, maybe in the world, in Alaska. It took every, it took years, decades."
    },
    {
      "text": "Nobody could get it approved. Ronald Reagan failed, everybody failed. I got it approved. () In the first week, they closed it. The most dominant, the biggest, probably the biggest oil site anywhere in the world, we'll get it open very quickly and we'll start producing tremendous amounts of oil and energy. () We will stop the outsourcing and turn the United States into a manufacturing superpower, that includes automobiles by the way."
    },
    {
      "text": "Other countries that make us pay a tax or a tariff to do business with them will be charged the same tax or tariff when they send their product into the United States. It will be called the Trump Reciprocal Trade Act. It basically says that if China or any other country charges us 100 or 200 percent tax or tariff, then we will charge them a 100 or 200 percent tax or tariff in return. () That message is very simple. Make your product here in the United States of America, you have absolutely no tariff to pay."
    },
    {
      "text": "It works beautifully and it's going to bring business like you wouldn't believe. Nobody's been able to do it except me. We were doing it and then we had to take care of COVID. COVID, our gift from China. The China virus came in and we did a great job. Never got credit like we did in the economy, the military. We defeated ISIS, but we' Thank you very much. Thank you North Carolina. Go out and vote. God bless you. God bless you. Thank you very much."
    }
  ]
}