{
  "speech_id": "458",
  "title": "Trump Speaks To Jewish Group in Washington",
  "date": "20240923",
  "url": "https://www.rev.com/blog/transcripts/trump-speaks-to-jewish-group-in-washington",
  "topics": "Foreign Policy",
  "num_segments": 20,
  "content": [
    {
      "text": "Thank you very much, Miriam. I don't know if you know it. It's a great lady. This is a great lady. This is a great one. Thank you, Miriam. Thank you very much. Thank you very much everybody. All right, let's sit down. Let's talk about Israel or Ishrael as they say. I love the pronunciation. I love it, but you really are. You're a great lady, a great woman, my friend, and I've known you and Sheldon for a long time. We lost Sheldon and nobody like him, right? You would say that nobody like him, but nobody like you either."
    },
    {
      "text": "And he's very proud of you right now. Thank you very much. And I'd also like to thank Rabbis, Yehuda Kaploun and Yaakov Kaploun. Senators Rick Scott, doing well. Where's Rick? He's doing well. I saw a poll. And another one who's doing well is Ted Cruz. Ted, stand up, Ted. Thank you, Ted. Thank you. And Lindsay doesn't have to do well because he's got another few years to go before he runs. Something nice about that. But Lindsay Graham is terrific. Terrific guy. Bill Hagerty, who's fantastic. Bill, thank you very much."
    },
    {
      "text": "And Joni Ernst, where's Joni Ernst? Joni, thank you very much, Joni, great. Doing a great job. Those farmers love Joni. I'll tell you, she was tough, right? You came to see me and I thought I made a deal. And then she said, \"No, no, no. We want more and more and more.\" But that's what you're supposed to have, right? Good job, Joni. And you got it. Former Senator Norm Coleman. Norm, thank you. Thank you. Norm, look good. And a spectacular person. Elise Stefanik. Spectacular."
    },
    {
      "text": "() What she did to that woman at Harvard with the big, big fat glasses. That woman had no idea what was happening. That was beautiful to watch, actually. A friend of mine, Carlos Jimenez, thank you, Carlos. Got a lot of power here. There's a lot of power here. This is like the old days because frankly, there's been a movement going on. I call it AOC plus three, but the plus three a lot more. We have to end that. We have to end it. We have to end it fast. I've never seen anything like it. John Carter, please. John."
    },
    {
      "text": "Where's John? Thank you, John. Thank you very much. Good job. Mario Diaz-Balart. Mario, thank you. Thank you, Mario. Byron Donalds. Boy, he is a popular guy, and he is a great guy with a great future. Good. I didn't see you back there. He has so many pictures with me, didn't need a picture. He doesn't want another picture. () Ronnie Jackson. What a great guy. Think of this. He was an admiral, a great admiral, respected by everybody."
    },
    {
      "text": "Then he became the White House doctor, took care of maybe Bush a little bit and Obama, right? And then Trump. And they asked him, \"Who's the most healthy of the group?\" And he said, \"Not even a contest.\" \"Who?\" \"Trump. Trump.\" In fact, he said Trump would live for 200 years if he didn't eat junk food. I don't know if I liked that, but that was okay. Great doctor. Now he's a really popular congressman and he is our friend. And when I had a little ear problem, he was there."
    },
    {
      "text": "He literally came from Texas and he did a great job and I appreciate it very much. Ronny, thank you. Once you're a doctor, you're always a doctor. Even if you're a congressman, I guess, right? Don't you think. () Somebody who's been really spectacular, especially for the last few months, I don't know what happened to him, but boy, he likes me a lot better now than he used to. Michael Lawler, am I corrected that? Where's Michael, right? Something happened, but he likes me better now than it used to."
    },
    {
      "text": "And I like that because he's a good man. Great man. Mike Flood. Mike, thank you. Virginia Fox, Virginia, thank you, Virginia. Michael Waltz, who's doing a great job in defending all of us on television, he's doing a great job on television. () And a spectacular woman, a beautiful woman, I'm not allowed to say that anymore because it usually puts you out of politics, but I've said much worse than that. But she's a beautiful woman and she really is with the most incredible family."
    },
    {
      "text": "And she came to me about endorsing someone in her area who had no chance. And I said, \"Okay, we'll do it,\" against an incumbent Republican that I didn't like very much and probably didn't like me. So we took a chance, Mary, didn't we? Mary Miller? We took a chance and our candidate won in a landslide, right? That was great. We don't like having to do that, but in that case, we had no choice. () Ambassador, Lana Marks, who was terrific. Thank you, Lana. Good job. You did a great job as Ambassador."
    },
    {
      "text": "West Virginia Treasurer, Riley Moore. Thank you, Riley, thank you. Going on to very big things actually. Jacob Helberg. Jacob, thank you. Thank you, Jacob. Great job. Somebody who's very talented, knows a lot about a lot at a very young age, Morgan Ortagus. Morgan, thank you darling. And also somebody who defends me so well, Elizabeth Pipko, Elizabeth. Wow, I watched you last night, Elizabeth, you were brutal to this other person. They didn't have a chance last night, Elizabeth, thank you very much. I appreciate it."
    },
    {
      "text": "We need all the defense we can get. () And a friend of mine and a man who's actually a great environmentalist, he really is a great one, and he wrote a book on Donald Trump is a great environmentalist, which is actually true, but a lot of people don't know that. But I'm an environmentalist with common sense. I like buildings to have windows. They'd like to close up all windows. The building should be built 90 stores tall, but that doesn't matter, but can't have any windows."
    },
    {
      "text": "The things you're doing with the green new scam is just unbelievable. 97 trillion. How can we do that? I think that's very doable. 97 trillion. Most people don't know what that means. Nobody knows. Nobody's ever heard of a number. To do the green new scam the way they want it. 97. That's more than China, the United States and every country in the world for the next 200 years has, but they go along with it anyway, but he is, he's a great gentleman and a friend of mine, Ed Russo. Where is Ed?"
    },
    {
      "text": "I'll tell you, that's great that Ed is here. Wow. () Before we begin, I just want to mention some polls that just came out, and I've decided to go back to doing this because they never release the polls when they're good and they've been really good and they don't release them, and unless one comes out, they had one that came out the other day with interviewed 51% Democrat, 22% Republican, Trump's down by six."
    },
    {
      "text": "They said, \"How the hell can you win on a poll like that when you're down by...\" They interview 40% more Democrats, and then they say, \"If you're down by six, that means you're actually winning by about 15.\" But we don't go with that. () But we do go with the respected polls and we go with polls because they don't want to release them because they've all been pretty good in the very, very, I think, accurate poll over the last nine or 10 years."
    },
    {
      "text": "I think Rasmussen's been really one of the best, and it was just released a little while ago. I'm leading by eight points against a woman that you cannot, especially, you cannot allow to happen. I mean, honestly, you are generally, Jewish people, we have a lot of good Christians there that love Israel, by the way. In many ways they love Israel more than Jewish people love Israel, which is shocking, but nevertheless, we'll take it, right?"
    },
    {
      "text": "() We have a lot of great Christians that love Israel, but we're up by eight with Rasmussen. We're at 52 to 44, so that's a big one. And we're up by 11 with independents in Rasmussen also just came out. That's a lot because as you know Rick Scott, we were talking about a little while, independents are very important, and when you're up by that number, that's a pretty good thing. () Then the Emerson poll, highly respected."
    },
    {
      "text": "We're up in Arizona, we're up in Wisconsin, and we're up substantially in Pennsylvania, and those are the three that they did. And in the New York Times poll even, which is shocking because I wouldn't say they love me. I wouldn't say I love them either, but I'm up by nine in the Midwest. That's a big one. And the Atlanta Journal-Constitution, we're up by at least three in Georgia and CNN has us up, I love seeing it, like a CNN, and then we're up. So if you're up five, you're probably up 20 or something."
    },
    {
      "text": "But in CNN, we're up five in Arizona. The Daily Express poll has us up five in all of the battleground states, which is great. () So I say 47 days from now, we're going to defeat Kamala Harris. You have to defeat Kamala Harris. More than any other people on Earth, Israel, I believe, has to defeat her. You know that, and I've never said this before. I'm thinking, Miriam more than any people on Earth, Israel has to defeat her."
    },
    {
      "text": "I really believe that it's a disaster for Israel and you know why, and you've heard her statements. We're going to take back our country and we're going to make Israel great again, and we're going to make America great again. We're going to make them both great again, greater than ever before. () We've gathered today to talk about the scourge of anti-Semitism. Tonight, we're two weeks away from the one-year anniversary of the worst attack on the Jewish people since the Holocaust."
    },
    {
      "text": "Without question on October 7th, which would've never happened if I was president, by the way, I have to always preface it by saying it would've never ever happened. Innocent men, women, children, and babies were tortured, maimed, kidnapped, and killed. () It was an amazing sight, especially if you were able to see, and you don't want to necessarily see it. Some of the tapes and film that was made of the atrocity. It was a wake-up call for the entire world, and you have to take it that it is a wake-up call."
    }
  ]
}