{
  "speech_id": "470",
  "speaker": "Trump",
  "title": "Trump Makes Campaign Stop in North Carolina",
  "date": "20240926",
  "url": "https://www.rev.com/blog/transcripts/trump-makes-campaign-stop-in-north-carolina",
  "topics": "Economy, Climate, Government Policy",
  "num_segments": 32,
  "content": [
    {
      "text": "Where are the missing 818,000 jobs? Remember they said 800, and they were fake jobs and they thought they'd be caught, but they thought it was going to be after the election, not before the election. They had a leaker. Thank you, Mr. Leaker. They had a leaker who leaked the fact that they falsified the numbers. Nobody talks about it. The press refuses to write it. We don't want to hear Kamala's fake promises, even something like she worked very long and hard hours over french fries at McDonald's."
    },
    {
      "text": "She'd never worked at McDonald's. It was a fake story. It was a fake story. The press now refuses to write it because it's so... This is a very simple one. She said she worked at McDonald's and she didn't. Not highly sophisticated, not complicated. It was a lie. She never worked at McDonald's over the hot french fries."
    },
    {
      "text": "I think I'm going to a McDonald's in two weeks actually, and I'm going to work the french fries, because I will have worked longer and harder at McDonald's than she did if I do that even for a half an hour. () So we want to hear an apology for all of the jobs and all of the lives that she's destroyed. Think of it. They created 818,000 fake jobs so that the job numbers would look better, but they got caught before the election. They were going to announce it after the election that it was a mistake."
    },
    {
      "text": "It wasn't a mistake, it was fraud. And the attorney general should look into it because nobody's ever had that kind of a mistake before in this country. 800, almost a million jobs, a mistake, but she got caught. ... thing. The only one going to make a lot of money are going to be the appraisers, the accountants, and the lawyers that will drive our country into a depression like in 1929. In addition, Kamala is shutting down power plants nationwide causing electricity prices to soar by more than 100%."
    },
    {
      "text": "And over the years I've been into politics, but mostly on the other side, like writing checks for politicians, campaign contributions, extremely legal, but I've been on the other side, campaign contributions, and I've seen on occasion a politician make one change in policy. Maybe two. She's made 15. She wants to confiscate your guns, she wants to do this, she wants to that. () She wants absolutely there will be no fracking. She said it all over the place."
    },
    {
      "text": "You got to see 2018, 2019, \"There will be no fracking in this...\" Now she's saying, \"Oh, fracking would be fine.\" She was in charge of the \"Defund the police\" movement. She's a radical left person. Her father is a Marxist professor. He teaches what his daughter is now trying to teach you. No, we don't want Marxists to be running our country because it's a short way to... Speaker 1 Oh no, we pass socialism. We never had socialism. I always said, we will not ever be a socialist country."
    },
    {
      "text": "And I was right, because they skipped socialism. They went down to communism. I was right. Got to keep myself right. No, we skipped socialism. This is unbelievable that this woman is running. She's a communist. Her views are communist. She destroyed San Francisco. The greatest city in this country 15, 20 years ago was San Francisco. She destroyed San Francisco as D.A, she destroyed California as the attorney general. She was attorney general of California. She destroyed it."
    },
    {
      "text": "The most beautiful place on earth, the best weather, beautiful ocean and everything, and now you look at it, look at what it's done. And Nuscombe, Gavin, Nuscombe has done a terrible job. He's a terrible governor. () She's destroyed it and she'll destroy the United States of America if she becomes president. And all those things that she wanted... A politician always goes back to where they came from; defund the police. Think of it, she headed up \"defund the police\" for years."
    },
    {
      "text": "She was one of the originators of \"Defund the police.\" Anybody that wants to defund the police and is a party to that even for one day has no right to be the president of the United States. Right? Under my plan, we will cut energy and electricity prices in half, not only for businesses but for our great young ladies from North Carolina. They're pretty rich people, I think. I don't think it's going to matter to them, but it's going to matter to a lot. Will cutting the energy prices mean anything to you ladies?"
    },
    {
      "text": "Still good, right? It's money. () But we're going to cut it in half. Not only for your businesses, but for everybody. Within 12 months, we will double our electricity capacity to compete with China and other countries on artificial intelligence. People don't know the AI. Artificial intelligence is a big thing. Everybody wants it. China's already building massive electric plans. To be able to compete, you need more than double the electricity that you already have in this country or you can't compete."
    },
    {
      "text": "It is an electricity-eating monster. And we're going to be able to do that and we'll be more than able to compete. We're going to be able to get it done, but not if somebody else is president. It'll be a disaster. To slash burdens on workers and businesses, we will cut 10 old regulations for every one new regulation. So I cut more regulations during my four-year term than any other president in history during any term, and we're going to keep it going. Some of them have been put back by Biden and Harris."
    },
    {
      "text": "() And to the autoworkers of our country, we love you. I am pinpointing you for greatness. China is right now building major auto plants in Mexico. They didn't start them with me. They knew that it wasn't going to work with me. As soon as I left, they started building. And they think they're going to sell their cars into the United States and destroy Michigan, South Carolina, North Carolina, Georgia, a lot of other places where they make autos or auto parts and it's not going to happen."
    },
    {
      "text": "We will put a 100% tariff on every single car that they want to come across our border and tell them only that they'll get rid of the tariff under one circumstance; if you build your plant not in Mexico but into the United States and use our people as your workers. I will bring automobile manufacturing back to the highest level in the history of our country. We will be like it was 50 years ago when there was virtually nobody else to compete with us."
    },
    {
      "text": "We're going to bring back the automobile manufacturing at a level that we haven't seen before in many, many years. Maybe never. () Vote Trump and you'll see a mass exodus of manufacturing from China to Pennsylvania. You haven't heard that too much. From Germany to Georgia, from South Korea to North Carolina. You're going to see a tremendous exodus the other way. You haven't seen that. We were getting ready to do it and then a lot of bad things happened."
    },
    {
      "text": "We did much better by the way, in the election of 2020 than we did in 2016. Just remember that. Millions and millions of votes. More votes than any sitting president in the history of our country, but they beat us by a whisker. They beat us by little whisker. He beat us from the basement. As we save our economy, we'll also seal the border and stop the migrant invasion into our country. It's the greatest invasion that we've ever had into our country."
    },
    {
      "text": "What they've done to our country is incredible, and what they're doing to our country. () Under border czar, Harris, millions and millions of people are pouring in right now from all over the world; prisons, jails, insane asylums, mental institutions, terrorists; all at record levels. We've never had anything like this. And I feel so sorry for the towns and the cities where they are. They're causing havoc and the mayors always want to be politically correct."
    },
    {
      "text": "I don't want to embarrass them, but one particular mayor is saying, \"We're looking for translators because the people speak no English.\" You shouldn't be looking for translators. You should be looking for people to take them out of our country and bring them back from where they came because your town and city is being destroyed. The 21 million illegals she let in are now creating havoc throughout the country. Aurora, Colorado and Springfield, Ohio are just two examples."
    },
    {
      "text": "What they're going through in those places is unbelievable. I mean, they're literally taking over those towns. They're taking over hundreds. Those are [inaudible :22], hundreds of towns and cities throughout our country, including the big ones. () Look at New York, all of the people, what's happened to the quality of life. The quality of life is a whole different deal. Chicago, take a look at what's happening in Chicago. Look at LA, look at what's happening in Los Angeles."
    },
    {
      "text": "They're taking over your cities; your big ones, your small ones, your towns. It's not sustainable by anybody. Yet after almost four years, border czar, Kamala Harris, has reportedly decided that for political reasons, that it's finally time for her to visit the southern border. Think of it, she was the border czar. For almost four years she's never been there. She went to one little area, but it was... I'd like to go there too with our great first lady and have a nice lunch."
    },
    {
      "text": "This was not the border that she should be looking at. I can tell you the real border because I've been there many times. She finally went after almost four years, and the reason is because her polls are crashing. () She's not doing well, because I don't believe the people of this country are stupid. I think they're very smart, and you're not going to let her ruin this country like she did San Francisco or Los Angeles. She ruined the entire state of California."
    },
    {
      "text": "She's trying to con the public, but remember, she is the one who terminated Remain In Mexico. I had a policy, it was not easy to get, with the president of Mexico, who I got along with great, but he is a smart man and he took advantage of our country. I said, \"We have to have Remain In Mexico.\" He looked at me like I was crazy. I said, \"No, no, no, I'm not. I want Remain In Mexico until we find out if these people are qualified to come in.\" And they stayed in Tijuana."
    },
    {
      "text": "They stayed all over Mexico, hundreds of thousands of people, and we took them in very, very slowly. I don't know if they could put up my world's favorite chart, I don't know. I don't know, we're in a factory right now. We don't have billboards, I don't think. () But the greatest chart... I love that chart, because that chart saved my life. It was a chart on immigration. It was a chart on immigration; blue, gold and red. I love it very much."
    },
    {
      "text": "If I didn't have that chart, I probably wouldn't be speaking to you right now. But it shows basically that we had the best and lowest immigration numbers and that included drugs and human trafficking and a lot of other things that we've ever had in the history of our country. So Remain In Mexico, they canceled our asylum agreements with Central American nations. Ended Title XLII, a very important program implemented nationwide, catch-and-release. I had catch-and-release, but I catch-and-release in Mexico."
    },
    {
      "text": "We catch-and-release into the United States, never to see these people again until they murder somebody and then we see them. () And we allowed them through absolute stupidity to destroy the very fabric of our nation. Millions of people were allowed to come in totally unvetted, totally unchecked from places unknown. I was with Tom Homan recently. He told me that the last check was, they came in from 168 different countries. Most people don't even know there are that many countries."
    },
    {
      "text": "Actually there are quite a bit more than that. 168 countries were represented with illegal aliens coming in from the Congo in Africa. They come in a lot from the Congo, from jails in the Congo. They open their jails. From South America, Venezuela, all of the countries. They're letting them out of their prisons and jails. They're letting them out. Their jail population's way down, their mental institution population, but this is all over the world."
    },
    {
      "text": "They come from the Middle East, they come from Asia, they come from parts of Europe. They come into our country. Many of them are major, major criminals, murderers. () When Kamala speaks about the border, her credibility is less than zero. I hope you're going to remember that on Friday when she tells you about the border. Ask her just one simple question, \"Why didn't you do it four years ago? Why didn't you do it four years ago?\" They've got very little time left thank God. Very little time left."
    },
    {
      "text": "That's all you have to do. I give this to the fake news media because they don't cover it properly. They don't even talk about the border. Say, \"Why didn't you do it four years ago when you first came in? Why are you waiting three and a half, almost four years?\" Kamala's migrant invasion has particularly devastated the Black community and the Hispanic community, including all of the people, the jobs, what they've done. The jobs are going to illegal migrants that came into our country illegally."
    },
    {
      "text": "Our Black population all over the country, our Hispanic population, are losing their jobs. They're citizens of America. They're losing their jobs. () Most of the jobs that were created in our country, and almost all were bounced back. They came from me. Bounced back. Every pandemic has a big bounce back at the end of a pandemic and we had a very quick bounce back, and we did a great job on the pandemic. Never got the credit I got for the military. We rebuilt it. We beat ISIS very quickly. Very rapidly."
    },
    {
      "text": "They said it was going to take five years to beat ISIS. ISIS was defeated in four weeks. Our military is great. Some of the people on the top, I know every one of them. Outside of those people, our military is not woke. You could put some of these people into a room and scream at them for two years and they'd walk out of that room. They wouldn't be woke. We have a great military and they proved that with the defeat of ISIS. So last month, American-born workers lost 1.3 million jobs. This is last month."
    },
    {
      "text": "And of the 1.3 million jobs, migrants, illegal people that came in illegally into our country got 635,000 jobs. They got more jobs than anybody else. () The Black population and the Hispanic population is being devastated by Biden and Kamala Harris by these millions of people that are coming into our country. And unions will be next, you watch. The unions are going to be devastated by this. And I've been right about everything."
    },
    {
      "text": "They have a hat, \"Trump was right about everything.\" I actually was right about everything, right? And the Republican Party, which has become the party of common sense, we believe that American jobs should go to American citizens, not illegal aliens. We believe that strongly. And that's one more reason why we begin the largest deportation operation in American history. Starting with the criminals, the murderers, the drug dealers, the people from prisons. We're going to get them out of our country."
    },
    {
      "text": "We're going to get them out fast. The terrorists, we have record numbers of terrorists. In 2019, border patrol reported one terrorist came into the country under the Trump administration. I don't even believe that could be possibly correct, but that's what they say. Zero. Over a period of years they said 11 came in. () Let me tell you, right now, we have more terrorists coming. Thousands coming into our country than we've ever even thought possible, and these are rough terrorists."
    }
  ]
}