{
  "speech_id": "478",
  "title": "Donald Trump Says Proud Boys Should “Stand Down” Transcript September 30",
  "date": "20200930",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-says-proud-boys-should-stand-down-after-debate-transcript-september-30",
  "topics": "Government Policy",
  "num_segments": 7,
  "content": [
    {
      "text": "Okay, thank you very much. We're going to Minnesota. I thought the debate last night was great. We've gotten tremendous reviews on it. We're hitting what people want. Law and order, which Biden was unable to even talk about because he'd lose the radical left, his radical left followers. I don't think there's too many of them left, but I thought it was a great evening. It was an exciting evening. I see the ratings were very high, and it was good to be there. Felt very comfortable, and I appreciate all the good words."
    },
    {
      "text": "So we are going now, and we're going to have a big rally. A lot of people are showing up. Yeah. I don't know who the Proud Boys are. I mean, you'll have to give me a definition, because I really don't know who they are. I can only say they have to stand down and let law enforcement do their work. Law enforcement will do the work more and more as people see how bad this radical liberal Democrat movement is, and how weak. The law enforcement is going to come back stronger and stronger."
    },
    {
      "text": "But again, I don't know who Proud Boys are. But whoever they are, they have to stand down, let law enforcement do their work. Just stand by. Look, law enforcement will do their work. They're going to stand down. They have to stand down. Everybody, they have to stand... Whatever group you're talking about. Let law enforcement do the work. Now, Antifa is a real problem, because the problem is on the left and Biden refuses to talk about it. He refuses to issue the words law and order."
    },
    {
      "text": "You saw that last night when he choked up. He can't say the words, because he'll lose the rest of the left. So he's got to condemn Antifa. Antifa is a very bad group. Yeah. I want law and order to be a very important part. It's a very important part of my campaign. And when I say that, what I'm talking about is law enforcement has to... Police have to take care, and they should stop defunding the police like they've done in New York, like they've done in New York. I just told you."
    },
    {
      "text": "I've always denounced any form, any form of any of that. You have to denounce. Joe Biden has to say something about Antifa. It's not a philosophy. These are people that hit people over the head with baseball bats. He's got to come out and he's got to be strong, and he's got to condemn Antifa. And it's very important that he does it. I can't hear a word you're saying. I can't hear. I hear he doesn't want to go forward, but that's up to him. I mean- Yeah, I would like to."
    },
    {
      "text": "By every measure, we won the debate easily last night. I think he was very weak. He looked weak. He was whining. Yeah, we won the debate by almost every poll that I saw. If you look at the various polls... I looked at about six of them. We won every one of them. So, no, I don't mind debating him. I hear he wants to get out of the debates. I don't know, that's up to him. Yeah, it does concern me. And crime generally concerns me, any form of crime. And let law enforcement take care of it. So we had a problem in New York."
    },
    {
      "text": "They have a hundred thousand ballots that are a mess. They were all confused, all mixed up. Now they say they're going to redo them. Well, what are they going to do with a hundred thousand ballots that have already been sent? This is exactly what I'm talking about. It's a big, big, big scale problem. A hundred thousand ballots went out to New York with the wrong names on them, wrong envelopes, wrong addresses, wrong everything, and now they want to redo the ballots."
    }
  ]
}