{
  "speech_id": "490",
  "speaker": "Trump",
  "title": "Donald Trump Greg Gutfeld Interview Transcript: Vaccines, “Toughest” Part of Presidency",
  "date": "20210909",
  "url": "https://www.rev.com/blog/transcripts/donald-trump-greg-gutfeld-interview-transcript-vaccines-toughest-part-of-presidency",
  "topics": "Healthcare, Government Policy",
  "num_segments": 9,
  "content": [
    {
      "text": "Well, first of all, I say, why is she not doing it? Does she have some kind of religious thing? Skeptical. Well, she's Russian. That's the end of that. No. Very smart and very hard-headed. I think I know your wife a little bit, right? But she's great. And let her do what she wants to do. I got vaccinated and I feel very good. I think we saved millions and millions of people worldwide. In 1917 they say approximately a hundred million people died. I think we could have been into that situation because it was very bad."
    },
    {
      "text": "And now if you're vaccinated, the other thing that shows that if you do get sick, you don't get sick like they were before, meaning you don't die. So I would recommend, but I also say that, let her have her freedom. [inaudible :18] freedom, right? She needs freedom. I probably have to agree with that. Well, I had two forms of presidency. Number one, I had to run the country, work on the world and do things, and the other thing I had to survive."
    },
    {
      "text": "The survival was much tougher because I had fake Mueller people coming after me. I had 19 really haters after me. I had every form of law enforcement after me. It started from the day I came down the escalator. It never stops. I have every prosecutor after me. They're looking at deals that I did years and years ago, I forgot about them. It is a disgrace. So I had to survive, number one."
    },
    {
      "text": "And number two, really, I guess I'd put it in a different order, but if you don't survive, you can't do a good job in terms of running. So I had survival and I had running the country. And I would say the survival was actually much tougher. Somebody said, \"What was the toughest, president?\" A friend of mine. Very successful guy, used to call me Don, Donny, Donald. Now he said ... You lose all your friends because you're president. They're all afraid to talk to you. \"Mr. President, could I ask you one question?"
    },
    {
      "text": "Who was the toughest to deal with it? Was it China? Could it be Putin in Russia? What about North Korea? Kim Jong-un?\" I said, \"Well, the toughest actually was the United States. Dealing with these maniacs that we have over here with Pelosi and Schumer and all of them. That was probably the toughest. Far tougher than a lot of world leaders.\" And isn't that a shame when you think about it? Isn't it a shame? But you also gained friends. Sure. Right."
    },
    {
      "text": "Trump- They call them a lot of things, but derangement syndrome seems ... and there is something like that. It's crazy. And why would they do that? We rebuilt the military. We took care of everything. We came up, whether you say vaccines are helping people medically, right to try, where they were able to try somebody dying. And we have drugs that might work and you couldn't use them. Taxes, by the way. Regulations, the largest tax cut in history, largest regulation cut by far in history, in all records."
    },
    {
      "text": "It must be my personality. We did a great job. I rebuilt the military, all that beautiful stuff, that brand new stuff and you know who has it now? The Taliban. I built it for the Taliban. It wasn't supposed to happen. Now we see these beautiful, perfect brand new rifles, and these guys are carrying two. And they're wearing our uniforms and they're flying our helicopters, and it's a disgrace. Well, it is Christmas. They're still celebrating. Okay. So I told you about Abdul, funny stuff."
    },
    {
      "text": "And when I first spoke to him by phone, I said, \"Nice to speak to you by phone, Abdul.\" And he goes, \"Ah.\" They're ferocious people. You go to Broadway shows, they fight. They like to fight. They've been fighting for about a thousand years. How we- By the way I say ... You do? I like it actually. It's very interesting, and I've been saying it for a long time. Our country, the worst decision ever made was going into the quicksand, which is called the Middle East."
    },
    {
      "text": "$2 trillion and millions of lives, because I like to count both sides, okay? Millions of lives and the place has been obliterated. And it's more dangerous now, if you think about it. I had them in check. I wiped out ISIS, you know who I took out. I took out the leaders, the biggest people, bigger than anybody. Nobody even believes what I did. And in a few months, it can all be dissipated."
    }
  ]
}