{
  "speech_id": "493",
  "title": "Trump Speaks at Fraternal Order of Police Meeting",
  "date": "20240909",
  "url": "https://www.rev.com/blog/transcripts/trump-speaks-at-fraternal-order-of-police-meeting",
  "topics": "Immigration, Government Policy",
  "num_segments": 19,
  "content": [
    {
      "text": "Thank you very much. Wow. Thank you. Well, I want to thank you very much and it's an honor to be... And sit down, please. Go ahead. We'll stay together for a little while. This is a big endorsement for me. This is 3,077. Boy, that's a lot of protection. That's big protection and we appreciate it very much. It's an honor and I'm thrilled to be back with the incredible heroes and patriots of the Fraternal Order of Police, an incredible group and a group that's highly respected all over the country."
    },
    {
      "text": "You don't hear it, but I will tell you. It's true. To all of the law enforcement men and women here today. I respect you so much. I admire you. And as your president, I will always back the blue as I did. I backed the blue more than any other person. () I was not a defunder like Kamala. She was a defunder. She was a 10-year defunder. You defund when you want to defund for 10 years, that's the end of that one. I think I could leave right now, and you say there's no way that we're not voting for that guy."
    },
    {
      "text": "That's the ultimate, isn't it? Before we begin, big news today is that the Manhattan D.A. witch hunt against me has been postponed because everyone realizes that there was no case because I did nothing wrong. It's a witch hunt. It's an attack by my political opponents in Washington, D.C. And comrade Kamala Harris and radical left opponents for purposes of election interference. That's all that was. And it's a case that should have never been brought. It should have never been brought."
    },
    {
      "text": "() Importantly, the public understands this and so does every legal scholar, expert and luminary, including people and just highly respected people like the people in this room are highly respected, like Andy McCarthy, Jonathan Turley, Alan Dershowitz, Mark Levin, Stephen Calabrese, David Rifkin, Greg Jarrett, Katie and Andrew Cherkasky, and even from CNN, Eli Honig. I appreciate that, Eli, because he's been great. They all said it's a case that is not a case. Shouldn't even be brought. Politics."
    },
    {
      "text": "But I greatly appreciate the words in the letter today from the judge. He said, \"If necessary being utilized in the decision, because there should be no if necessary. This case should rightfully be terminated immediately.\" And as we prepare for the most important election in the history of our country, it's the most important election we've ever had because our country's going bad. You may have noticed. You take a look at some of the people pouring into our country by the millions."
    },
    {
      "text": "() In addition, there was a big political victory today in a certain place called North Carolina. Has anybody heard of North Carolina? I even have a grandchild, very beautiful grandchild, named Carolina. And Lara's here today. Where is Lara? Where are you? Right there. Right there. Carolina's a beauty. She's beautiful, and Eric came. He doesn't come too often for this. He'd rather do his own speeches. People would rather hear him. So it's a great couple. Beautiful children, great couple. She loves this state so much."
    },
    {
      "text": "And she said, \"Oh, don't worry, you're going to win. They love you here.\" And she grew up here and had a great life here. I don't know if her life is as good now, frankly. She loves this place. And she says, \"Don't worry.\" I said, \"Well, if anything bad happens, I'm blaming you.\" That'll be the end. But we've won it four times. We've won the primaries, we won everything. We've won the primaries and then we won just another big one."
    },
    {
      "text": "We won by a lot, and we have to win one more election and we'll be six and 0 in North Carolina. () We love North Carolina and thank you for both being here. That's great. It's an honor. Your appeals court ruled today that Robert F. Kennedy Jr.'s name should be taken off the ballot. And that sounds like a bad thing for him. It's not. It's actually a great thing. He's an incredible team player and he didn't want anybody to be voting his name. Because, as you know, he fully endorsed us. He's with us."
    },
    {
      "text": "He's going to be watching out for women's health and everybody's health and got a lot of great things to say. He is very smart and very good, a great person and very popular. So they didn't want to have, and we didn't, but he didn't either. He didn't want to have his name so he gets some votes even though he was with us, and we just won in the court. They said, \"No, it has to be left up there.\" And some people wouldn't realize it, so rather than voting for us, vote for him."
    },
    {
      "text": "And that wouldn't help us very much, would it? And so that was a big thing. () It means that all of those who love Bobby, and there's a lot of them and all that he stands for, especially regarding the health and well-being of us, can vote. They vote for me now. So all of the Bobby people are going to vote for me and I appreciate the decision. When I grew up, we revered the men and women that we knew. I grew up in New York, and you've all heard of New York's Finest. New York's Finest. Who's from New York?"
    },
    {
      "text": "Oh, there they are. New York's Finest endorsed me, and they're not supposed to. They said, \"We don't care. We're endorsing you anyway.\" But I appreciate it. Thank you very much. () I think we've been endorsed by every police group or slightly related, even if they're slightly related, we've gotten every one of them and I appreciate it. There's nobody we can respect more. I consider you in this room to be America's finest."
    },
    {
      "text": "You're all over the country, all over from the country, all over the place, and we really appreciate you being here. Got to meet a lot of you backstage, just amazing people. All you want to do is see our country be safe and prosperous and we want to love our country and we want to have reason to love it. The people of this country know it. We know all about you and the great job that you do, and the people of this country respect you greatly for it."
    },
    {
      "text": "So I just want to thank you on behalf of everybody because I see it. () I'm all over, and this is a group that's respected like never before. Unfortunately, we were talking a little while ago, and it's probably also a profession that's under more danger and threat than ever before, which we hate to see. I visit a lot of families of police officers who are no longer with us, and we have to give back the power and respect that they deserve more than anybody. And we're going to do that."
    },
    {
      "text": "You're going to solve the problem. We have crime-ridden cities like we've never seen before. We've never seen anything like it, and you can do it. I said to 12 of your representatives backstage, I said, \"So if I give you the authorization to get rid of the crime, can you do it?\" They look at me like, what a stupid question. Of course we can. () So we're going to be doing that, but that's why I am so deeply honored to receive the Fraternal Order of Police official endorsement for President of the United States."
    },
    {
      "text": "Thank you all very much in the room. I know you vote on that. Thank you very much. Great honor. Thank you. Thank you very much. Thank you very much. Thank you, Patrick. I want to thank Patrick and every officer here this afternoon. It's really something I will not forget. 373,000, and Patrick just corrected the teleprompter. How did you add the other 4,000 people? They want to join so badly because they think we're going to win. Everyone now wants to be- He said he doesn't think he knows. Thank you very much."
    },
    {
      "text": "So to think that numbers like that... I mean, that's a big group. That's the largest group in the country by far, I guess. I also want to thank RNC Chairman, Michael Watley, who used to be as the Republican Party chairman of the state, and we won the state so beautifully and frankly, so easily, and he was very much into securing the vote. That's why he's the head of the whole. If we can keep the cheating down to a minimum, because these people cheat, they cheat like hell."
    },
    {
      "text": "If we can keep it down to a minimum, we win easily. If we had, let's say, a beautiful vote counter, an honest person comes down from on high to count the votes, we win. I could stop campaigning. I could tell Michael and Lara, I don't have to come anywhere anymore. I'm just going to relax. But we have to win. Too big to rig is the statement we use. But Michael and Lara, who's the co-chair, have been working really hard, so thank you Lara very much. We appreciate it. Very much appreciate it."
    },
    {
      "text": "() As we gather today, American cities, suburbs, and towns are totally under siege. Kamala Harris and the communist left have unleashed a brutal plague of bloodshed, crime, chaos, misery and death upon our land. Other than that, they're doing actually quite well. Thank you. Just yesterday, three police officers were shot in Milwaukee very tragically. 31 people were shot and five were killed in Chicago over Labor Day weekend. Can you imagine that? It's worse than in Afghanistan."
    },
    {
      "text": "We hear about Afghanistan and all these places. They don't compare with numbers like this. Baltimore is now facing the single most deadly drug crisis of any city in American history, and the number of homeless people on the streets of New York has just reached a 20-year high, and it's going a lot higher than that. Hundreds of thousands of illegal aliens. () Look at all that fake news back there, but you can't. They don't like illegal migrant. They don't like illegal alien. They don't like anything."
    }
  ]
}