{
  "query_id": "000",
  "query_text": "In fact, they(the current government with Biden and Harris) never took the tariff off because it was so much money, they can't. ",
  "query_topics": [
    "Economy",
    "Government Policy"
  ],
  "speaker": "Trump",
  "results": {
    "In fact, they(the current government with Biden and Harris) never took the tariff off because it was so much money, they can't. ": [
      {
        "match_score": 0.6792923,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "481",
          "title": "Trump Rally in Walker, Michigan",
          "date": "20240930",
          "topics": "Immigration, Government Policy"
        },
        "matched_segment": {
          "segment_id": 61,
          "text": "I'm sure he doesn't know about it too much. But the Biden people said, \"We can't get rid of these tariffs. They're making too much money.\" But what they're also doing, maybe more importantly, their cars aren't coming in and they're not destroying Detroit and South Carolina and North Carolina and Georgia and all the other places that are involved with making autos and parts. () They're not coming in. And we made a fortune on it. And now all we're doing is taking ... We were ready to do that."
        },
        "context": {
          "previous": "If you don't make your product here, then you will have to pay a tax or tariff when you send your product into the United States, and we will take in hundreds of billions of dollars into our treasury and use that money to benefit the American citizens. So with China as an example, I took in hundreds of billions of dollars in taxes and tariffs. No other president took in 10 cents. In fact, they left it on because they can't get it off because it's taken in so much money that the Biden people ...",
          "next": "And then we had a little strange election result. I'm not going to let that happen again. In my first term, I ended NAFTA, the worst trade deal ever made and replaced it with the USMCA, the best trade deal ever made. I withdrew from the job-killing Trans-Pacific partnership. By the way, if that deal would've been approved ... It was negotiated by Barack Hussein Obama. Have you heard of him, Barack Hussein? Remember Rush Limbaugh Rush, we love Rush. He used to go, \"Barack Hussein Obama.\" () Mr."
        }
      },
      {
        "match_score": 0.6659741,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "448",
          "title": "Donald Trump Campaign Speech Transcript Vandalia, Ohio September 21",
          "date": "20200921",
          "topics": "Economy, Government Policy, Technology"
        },
        "matched_segment": {
          "segment_id": 80,
          "text": "Because we have done more in the first three and a half years than any administration in the history of the country. And I say that and these fake news people don't even question it. There's nobody done what we've done. Between our military, between our trade, between our energy independence. All of the things, we could go on forever. But Biden vowed to remove those tariffs. He wants to remove the tariffs. You know when I made the deal with China, I said I have to leave the tariffs on."
        },
        "context": {
          "previous": "Look, you think this guy's going to be tough in China? His son? No, no. Think of it. And then he takes ads. \"He's going to be tough on China.\" This guy, they looted him and Obama. And in all fairness, not just the eight years, this has gone on for 25, 30 years. Probably the biggest reason I decided to run and give up one of the greatest lives anyone's ever had for this, for this. But you know why I like it?",
          "next": "They said, \"You got to be kidding.\" They wanted one thing, the removal of the tariffs, and I wouldn't do it. We wouldn't do it. I said no. But Biden said the other day, he wants to take the... He doesn't know what a tariff is first of all. \"Sleepy Joe would like to remove the tariffs off China. They're paying billions of dollars a year. Could we take them off?\" \"Absolutely. What are they exactly?\" But it wouldn't even happen that way. The radical left, which likes China, the radical left would walk into his office."
        }
      },
      {
        "match_score": 0.6515604,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "475",
          "title": "Donald Trump Speaks During UAW Strike Transcript",
          "date": "20230928",
          "topics": "Economy, Government Policy"
        },
        "matched_segment": {
          "segment_id": 41,
          "text": "But it remains in place to this day. Not because they wanted to, but because they have no choice. () And it's no exaggeration to state that the Trump presidency and the deftly used and applied Trump tariffs and taxes saved the American auto industry from extinction time and time again. And we're going to do a version of it that's going to make you bigger and better and stronger. It's not even going to be a contest with where you are right now."
        },
        "context": {
          "previous": "Is that okay with you? Is that okay? UAW, is that okay? And a lot of people don't know this, but I imposed a whopping 27.5% tariff and tax on all Chinese automobiles coming into our country. And this magnificent tariff, they can't get it off because they make so much money with it. And by the way, if they took it off, you'd be out of business right away. They want to take it off. They're trying to take it off. But it's so good, it's so powerful, it's so strong. But they would take over your industry totally.",
          "next": "But crooked Joe Biden is back like a wretched old vulture trying to finish off his prey. Can you believe it? I don't know. I just don't know. I see some of these things that are happening. I say, I wonder if he has any idea that this stuff is happening? Biden's job killing EV mandate has dictated that nearly 70% of all cars sold in the United States must be fully electric less than 10 years from now. Do you believe that? These are built specifically for people that want to take very short trips, okay?"
        }
      }
    ]
  }
}