{
  "query_id": "001",
  "query_text": "We handed them(pandemic) over a country where the economy and where the stock market was higher than it was before the pandemic came in.",
  "query_topics": [
    "Economy",
    "Healthcare"
  ],
  "speaker": "Trump",
  "results": {
    "We handed them(pandemic) over a country where the economy and where the stock market was higher than it was before the pandemic came in.": [
      {
        "match_score": 0.76568544,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "360",
          "title": "Trump Town Hall on Univision",
          "date": "20241017",
          "topics": "Economy, Government Policy"
        },
        "matched_segment": {
          "segment_id": 19,
          "text": "() We did a great job in keeping it all going. We ended up where the stocks were higher, despite all of the COVID, China virus that came into our country. The stocks ... When I handed over, the stocks were higher than they were previous to the COVID coming in. So we had to focus on that obviously, but we had the best economy that we've ever had. We're going to have that again. () What's going to solve the problem is growth."
        },
        "context": {
          "previous": "Good question. So we do, we have record national debt. We've never had anything like it before. We were getting ready to start paying down debt, and then we got hit with a thing called COVID or the China virus, and that had to be the focus. We needed to help businesses stay in business. If we didn't do the job we did ... Linda McMahon did a great job, Small Business Association. If we didn't do the job that we did, you wouldn't have any companies. You would've been in a depression like in 1929.",
          "next": "It's a thing called growth that nobody even talks about from the Democrat standpoint because they don't know about growth. But we're going to bring companies in, we're going to bring tremendous business to our country, and that's going to solve that. () Also, waste, fraud, and abuse. We have Elon Musk, who's a fantastic guy and a fantastic genius. He's a genius at a lot of things, but he's a great business person also in addition to sending rockets. You saw his rocket come down the other day and land."
        }
      },
      {
        "match_score": 0.7424863,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "011",
          "title": "Donald Trump Addresses NRA Meeting in Indianapolis Transcript",
          "date": "20230417",
          "topics": "Gun Control"
        },
        "matched_segment": {
          "segment_id": 9,
          "text": "() We put it into high gear, like we did for four years when this country had no problems, and then COVID came in and we got it back. When you think about it, it was amazing. We actually left it with a stock market that was higher than just pre-COVID coming in. It was an amazing job that we did. We built it twice, but there was nothing like it. There was nothing like it."
        },
        "context": {
          "previous": "I'll tell you what, if I weren't running, which isn't going to happen, or if I was doing badly in the polls, and we're not going to let that happen either, we're killing them in the polls, are you seeing the numbers? They wouldn't be doing anything. They'd be after somebody else. They wouldn't be talking. But we're going to show you some of the polls in a little while, you're going to be amazed. We really made a lot of progress over the last month.",
          "next": "Even right to try, I hope nobody needs it, right to try, where you can use this advanced medical treatments that won't be approved for five or six years by the FDA, but we got them to move a lot faster, I will tell you, on everything, but won't be approved by the FDA for years, and we've saved thousands and thousands of lives with right to try. But we did a lot, we did a lot. () 2024 is the year that we will defeat these nation-wrecking globalists, Marxists, RINOs, and tyrants once and for all."
        }
      },
      {
        "match_score": 0.7371171,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "169",
          "title": "Donald Trump Speech Transcript at Spirit of America Showcase",
          "date": "20200702",
          "topics": "Economy, Education, Healthcare, Social Justice"
        },
        "matched_segment": {
          "segment_id": 13,
          "text": "We had 50 days the likes of which we've never had in the history of the stock market, which to me means jobs. And it's lifting up 401Ks and retirement savings for American workers. We're doing numbers like nobody's ever seen before, take a look at 401Ks. In a pandemic, we're almost even with where we were before the pandemic started and nobody would have said that was possible, nobody at all. We built the greatest economy in the history of the world and we're now doing it again."
        },
        "context": {
          "previous": "But only that strong foundation allowed us to be up here today talking about these records, setting job numbers and other numbers that we're producing. Because America's economy is now roaring back to life like nobody's ever seen before nobody's ever seen numbers like this. In May retail sales surge by nearly 18%, that's a record. We recently saw the best 50 day increase in the history of the stock market. So we had 50 days, go back a couple of weeks.",
          "next": "And I think we'll do even better the second time than we did the first time, unless somebody comes along and says, let's raise taxes on everybody. And they're raising taxes, not only on cooperations, they'll just go to another country and they'll do just fine. But they're raising taxes on people and middle income people and they're losing jobs. So you can't allow that to happen. All of this incredible job that we've done will go down like that. It will be a terrible, terrible sight."
        }
      }
    ]
  }
}