{
  "query_id": "002",
  "query_text": "I had no inflation, virtually no inflation, they had the highest inflation, perhaps in the history of our country because I've never seen a worse period of time. ",
  "query_topics": [
    "Economy"
  ],
  "speaker": "Trump",
  "results": {
    "I had no inflation, virtually no inflation, they had the highest inflation, perhaps in the history of our country because I've never seen a worse period of time. ": [
      {
        "match_score": 0.73867756,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "475",
          "title": "Donald Trump Speaks During UAW Strike Transcript",
          "date": "20230928",
          "topics": "Economy, Government Policy"
        },
        "matched_segment": {
          "segment_id": 70,
          "text": "The inflation that you have now, we didn't have inflation. We had the greatest economy in the history of our country. You know that because you went four years like you've never had in your history, in the history of Michigan. () To the striking workers, I support you in your goal of fair wages and greater stability, and I truly hope you get a fair deal for yourselves and your families."
        },
        "context": {
          "previous": "It's not going to work for you. It can't work. And I learned a lot today with this great family. I tell you, they said it just won't work. They don't need anything that you have right here in Michigan, and they have beautiful product. () There's no such thing as a fair transition to the end of your way of life. You're going to lose your beautiful way of life. For auto workers, Biden's forced transition is a transition to hell. It's a transition to hell. It's a transition to unemployment and to inflation without end.",
          "next": "But if your union leaders will not demand that crooked Joe repeal his electric vehicle mandate immediately, then it doesn't matter what hourly word you get, it just doesn't make a damn bit of difference because in two to three years, you will not have one job in this state. And you've seen it happen before. () You've seen what happened where massive percentages of your industry went to other countries like Mexico, like China, like South Korea, like Japan."
        }
      },
      {
        "match_score": 0.7301154,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "406",
          "title": "Trump Town Hall in North Carolina",
          "date": "20241007",
          "topics": "Veterans Affairs, Government Policy"
        },
        "matched_segment": {
          "segment_id": 10,
          "text": "And these clowns took over, and what they've done to our country, between that and so many other things, what they've done to our country. But inflation was the worst we've ever had, I think. They say, \"Oh, it was only 48 years.\" Somebody, one of the fake news back there, they corrected me one time. They said, \"No, 48 years.\" \"Oh, okay.\" But it wasn't. I believe it was the worst that we've ever had. Speaker 9 And that's been one of the big problems."
        },
        "context": {
          "previous": "My favorite piece of paper, my favorite chart, but we had a chart. Do you have something up here that you could show? I love that chart. Oh, I love that chart. If I didn't look to the right, I wouldn't be going to Butler tomorrow. We're going to Butler tomorrow. If I didn't look over... () So no, but if you look at the chart, at the arrow on the bottom, that shows the lowest number in the history of our country. That was the day I left office.",
          "next": "But to me, and I know that you talk about the bad economy, you talk about all the costs and the costs are so bad, to me, the worst is the border, because it's like what they're doing is they're destroying our country. And it's not easy. We're going to get them out. We're going to have the largest deportation in history. I'm not proud to say that either, but it's a tough thing to do. () And Ana, we're going to get the criminals out. We're going to start with the worst of them, and we're going to get them out."
        }
      },
      {
        "match_score": 0.72949713,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "009",
          "title": "Donald Trump Rally in Schnecksville, Pennsylvania",
          "date": "20240416",
          "topics": "Economy, Foreign Policy, Immigration, Technology"
        },
        "matched_segment": {
          "segment_id": 28,
          "text": "I want to say they respected me. But the fact is, none of this stuff would be happening. None of it would be happening right now. We'd have a country that would be peaceful, prosperous. We would've had no inflation. Inflation was caused by energy. This stupid person, what he did with energy was that it went up 40, 50, 60%. That affects everything. Everything. If you make donuts, everything is more expensive. It's so bad."
        },
        "context": {
          "previous": "Everybody's fighting. Russia, Ukraine, Israel. The Middle East is blowing up. Everything's blowing up. China's going to be next with Taiwan, because of weakness. China's going to be next. What's going on?\" () He said, \"Bring Donald Trump back as president, and it'll all stop. It'll all stop.\" He said it. And he said something else, and I wouldn't say it, because I wouldn't really like the word. \"China was afraid of Donald Trump. Russia was afraid of Donald Trump. Everybody was afraid.\" I don't want to say that.",
          "next": "When you look at food prices now, where it's gone up by double and triple and quadruple, and you can never get that back. But we're going to get it way down, I promise you. () And we're going to bring your energy so low that other things will follow. And that's what happened. It's very simple. Instead of trying to have corrupt prosecutors fight his battles, he's incompetent, and what he's doing, and I don't believe it's even him. I think it's the people that want to keep their jobs around him. They're Communists."
        }
      }
    ]
  }
}