{
  "query_id": "003",
  "query_text": "Well, the reason I'm doing that vote（about abortion ban) is because…they have abortion in the ninth month. They even have, and you can look at the previous governor of West Virginia, he said the baby will be born and we will decide what to do with the baby. In other words, we'll execute the baby",
  "query_topics": [
    "Healthcare",
    "Social Justice"
  ],
  "speaker": "Trump",
  "results": {
    "Well, the reason I'm doing that vote（about abortion ban) is because…they have abortion in the ninth month. They even have, and you can look at the previous governor of West Virginia, he said the baby will be born and we will decide what to do with the baby. In other words, we'll execute the baby": [
      {
        "match_score": 0.76879346,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "408",
          "title": "Donald Trump Sean Hannity Interview Transcript October 8, Trump Says He’s Ready to Hold Rallies",
          "date": "20201008",
          "topics": "Healthcare"
        },
        "matched_segment": {
          "segment_id": 20,
          "text": "But he endorsed a Governor of Virginia who not only executed a baby late term abortion, but executed a baby because he said the baby can be born and then you can kill the baby. He's totally in favor of that. I can tell you, your pro-life groups are... They're in mess. This is their one shot because what's going on is so bad. It's so evil. The governor of Virginia said, we will execute the baby after the baby is born, that's..."
        },
        "context": {
          "previous": "The Second Amendment is very important. It's a big thing that we campaign on it. I protected this. If I weren't president, you wouldn't have a Second Amendment right now. And Biden does it. Nobody's talks about life anymore, pro-life. Is he pro-life? No, he's not pro-life. What is he? Why don't you ask him that question? He doesn't want to talk about it.",
          "next": "When you talk about late term abortion, this is early term execution, and it's a very, very bad thing. But you don't ever hear everybody talking about pro-life, pro-choice with Biden. Did you ever hear it? I haven't heard it. Very rarely do you hear it? I don't think he'd know how to discuss it. But very importantly, a Second Amendment. They just don't discuss the Second Amendment. He's going to take your guns away. So everybody with a gun, you can't vote for him because you're not going to have your gun."
        }
      },
      {
        "match_score": 0.7621224,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "221",
          "title": "Trump Campaigns at Faith & Freedom Conference",
          "date": "20240625",
          "topics": "Gun Control, Immigration, Government Policy"
        },
        "matched_segment": {
          "segment_id": 47,
          "text": "The people are now deciding, and some states are a little bit more conservative and some states are much more liberal. () If the radical democratic streams get their way, they will have a federal law for abortion to rip the baby out of the womb in the seventh, eighth and ninth month and even execute the baby after birth. They have that the governor- The governor, think of it, the governor of Virginia, previous governor, we have a great governor of Virginia right now, but..."
        },
        "context": {
          "previous": "It's now up to the will of the people in each state. Some states will be more conservative, other states will be more liberal. It's happening now. You see the votes are all taking place, and it's the way every legal scholar and just about all the Democrats and all the Republicans and conservatives and liberals, they all wanted it that way and we did something that was amazing. () The big problem was it was caught up in the federal government, but the people will decide and that's the way it should be.",
          "next": "Glenn Youngkin is doing a great job, but the previous governor of Virginia, you want to make that very clear because he's doing great, the previous was not so good, but he actually made that statement, \"We'll put the baby down after the baby's... We'll put that... And you'll decide what to do.\" () And there are states that allow that. They're the radical ones on this issue. Far and away, the radical ones, not us."
        }
      },
      {
        "match_score": 0.75043297,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "088",
          "title": "Trump Addresses National Association of Black Journalists",
          "date": "20240805",
          "topics": "Economy, Social Justice, Government Policy"
        },
        "matched_segment": {
          "segment_id": 38,
          "text": "Most people believe in the three exceptions. Most Republicans believe in the exceptions, but they don't want to see an abortion in the ninth month or the eighth month. Almost everybody agrees to that, and they certainly don't want to see, in the case of the governor of Virginia, the former governor I might add, who said, we set the baby aside and then we decide what to do, meaning what do we do, we execute the baby. That's a radical, horrible position, and some people want that. I don't want it."
        },
        "context": {
          "previous": "A little bit surprising to a lot of people, but the people are now voting and it's taking this issue that's been going on for 52 years and has torn our country apart, and it's giving it to the people to vote on, and they're voting, and many states have already voted, others are in the process of voting, and it's bringing it back to the people and a vote of the people, and it's not at all radical. () And again, you have to follow your heart. I happen to believe in the three exceptions.",
          "next": "Most people don't. But not mentally. Look, mentally. He's shot. He's shot. But most people- Most people, I know many people in their eighties and their nineties that are in great shape, some of our greatest leaders. You look at throughout the world, world history, the greatest leaders, some of the greatest leaders in the world were in their eighties. Oh, absolutely. I think I'd know. I think I'd know. Look, if I came onto a stage like this and I got treated so rudely is this woman treated me."
        }
      }
    ]
  }
}