{
  "query_id": "004",
  "query_text": "Now, I believe in the exceptions for rape, incest, and life of the mother. I believe strongly in it. Ronald Reagan did also. Eighty-five percent of Republicans do--exceptions. It's very important. But we were able to get it.",
  "query_topics": [
    "Healthcare",
    "Government Policy"
  ],
  "speaker": "Trump",
  "results": {
    "Now, I believe in the exceptions for rape, incest, and life of the mother. I believe strongly in it. Ronald Reagan did also. Eighty-five percent of Republicans do--exceptions. It's very important. But we were able to get it.": [
      {
        "match_score": 0.81463885,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "093",
          "title": "Trump Speaks at Alabama GOP Dinner after New Indictment Transcript",
          "date": "20230807",
          "topics": "Immigration, Government Policy"
        },
        "matched_segment": {
          "segment_id": 29,
          "text": "On both sides, they felt it should be. Now, like President Ronald Reagan before me, I support the three exceptions for rape, incest, and the life of the mother. I will say that in terms of running, you have to go with your heart. You have to go with what you want. () But the three exceptions, to me, are very important, and the three exceptions, I think, to a large portion of the people on this issue, are very important. Very, very important."
        },
        "context": {
          "previous": "Pro-lifers have a tremendous power now with that termination to negotiate. They had none. They didn't have any before that ruling. They had no power whatsoever. They could kill babies at any time they wanted, including after what we would call birth. They could kill babies. () Now they have tremendous power to negotiate because they don't have Roe v. Wade. This moves the issue back to the states where all legal scholars felt it should be, out of the federal government and back to the states. That's a big deal.",
          "next": "Remember, the Democrats are the radicals on this issue, and you have to remember that. We're not the radicals on this issue. The Democrats are the radicals because they're willing to kill babies in their fifth and sixth and seventh and eighth and ninth month and even after birth. () Remember the governor of Virginia, that whack job who thought he was Michael Jackson, remember?"
        }
      },
      {
        "match_score": 0.79144907,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "044",
          "title": "Trump Holds News Conference at Mar-a-Lago",
          "date": "20240812",
          "topics": "Economy, Immigration, Foreign Policy, Government Policy"
        },
        "matched_segment": {
          "segment_id": 60,
          "text": "And then you have Texas and you have other places where it may be different. () But the issue has been brought back to the States now, and like Ronald Reagan, I believe in the exceptions for rape, incest, and life of the mother, I believe strongly. I think that that's a very important thing. I think when you don't... You have to follow your heart, but when you don't believe, and the exceptions, I think it's much tougher, it's a much tougher issue."
        },
        "context": {
          "previous": "They wanted to get rid of Roe v. Wade, and that's Democrats, Republicans and Independents and everybody, liberals, conservatives, everybody wanted it back in the States, and I did that. Now, the states are voting, and frankly some of the votes are much more, if you could say liberal than you would think. Ohio turned out to be... They had a big vote and it turned out to be a much more liberal standing than people would've thought. Kansas, the same thing.",
          "next": "What I've done is I've done what every Democrat and every Republican wanted to have done, and we brought that issue back to the States, and now the States are voting on it, and frankly, some of the votes are a lot different than people would've thought, but it's the vote of the people that's taking care of it. () And when you think about the radical, the Democrats are really the radical ones on this because they're allowed to do abortion on the eighth and ninth month and even after birth."
        }
      },
      {
        "match_score": 0.7912005,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "277",
          "title": "CNN Donald Trump Town Hall 5/10/23 Transcript",
          "date": "20230511",
          "topics": "Economy, Immigration, Foreign Policy, Government Policy, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 52,
          "text": "This has been going on, actually a couple of Democrats too. But for 50 years this has been going on. I was able to do it and I was very honored to do it. But by doing it, things are happening that are very, very positive. And I happen to believe in the exceptions. The life of the mother, rape, incest, like Ronald Reagan believed in the exceptions. But I happen to believe that. I think it's frankly important to do that. But a lot of people are against that. A relatively small number."
        },
        "context": {
          "previous": "They were walking into people's homes and killing people. They had no protection. Said, \"Go out and buy guns.\" People went out and bought guns and it went way down. The numbers went way down because they had security. If you look at Chicago, Chicago has the single toughest gun policies in the nation. They are so tough, you can't breathe. New York too and other places also. All of those places are the worst and most dangerous places. So that's not the answer. It's such a great question. Republicans. For 50 years.",
          "next": "But the way I look, I think it's very important to say this. I consider the other side to be radical. Because the other side under Roe v, Wade and other things, the other side, they're radical because they will remember the debate with Hillary Clinton. I said, rip the baby out of the womb at the end of the ninth month. They will kill the baby in the ninth month. If you look at that crazy Governor of Virginia from the former governor where he said, no, the baby will be born."
        }
      }
    ]
  }
}