{
  "query_id": "005",
  "query_text": "I'm not signing a ban (on abortion). And there's no reason to sign a ban.",
  "query_topics": [
    "Healthcare"
  ],
  "speaker": "Trump",
  "results": {
    "I'm not signing a ban (on abortion). And there's no reason to sign a ban.": [
      {
        "match_score": 0.67493165,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "441",
          "title": "Meet The Press Full Donald Trump Interview Transcript",
          "date": "20230918",
          "topics": "Economy, Immigration, Foreign Policy, Veterans Affairs, Government Policy"
        },
        "matched_segment": {
          "segment_id": 46,
          "text": "I would sit down with both sides, and I'd negotiate something, and we'll end up with peace in that issue for the first time in 52 years. I'm not going to say I would, or I wouldn't. I mean, the Sanctus is willing to sign a five week and six week ban. I think what he did is a terrible thing and a terrible mistake. But we'll come up with a number. But at the same time, Democrats won't be able to go out in six months, seven months, eight months, and allow an abortion."
        },
        "context": {
          "previous": "What's going to happen is, you're going to come up with a number of weeks or months? You're going to come up with a number that's going to make people happy, because 92% of the Democrats don't want to see abortion after a certain period of time. Are you talking about a complete ban? Well, people are starting to think of 15 weeks. That seems to be a number that people are talking about right now.",
          "next": "And Kristen, you have to look at this because you said no. You have some states that are allowed to kill the child after birth, and you can't allow that. But you have legislation. Kristen, you have legislation in certain states, where it's allowed. The governor of Virginia, previous governor, who was a wack... I call him the Michael Jackson governor. Excuse me. That governor said you can kill the baby after birth. We'll agree to a number of weeks, where both sides will be happy."
        }
      },
      {
        "match_score": 0.6212303,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "093",
          "title": "Trump Speaks at Alabama GOP Dinner after New Indictment Transcript",
          "date": "20230807",
          "topics": "Immigration, Government Policy"
        },
        "matched_segment": {
          "segment_id": 28,
          "text": "Pro-lifers have a tremendous power now with that termination to negotiate. They had none. They didn't have any before that ruling. They had no power whatsoever. They could kill babies at any time they wanted, including after what we would call birth. They could kill babies. () Now they have tremendous power to negotiate because they don't have Roe v. Wade. This moves the issue back to the states where all legal scholars felt it should be, out of the federal government and back to the states. That's a big deal."
        },
        "context": {
          "previous": "Look what they just gave us with colleges. You actually, if you get good marks, you can actually get in. You don't have to take second fiddle to somebody that didn't get good marks. Last year, those justices ruled on a thing called Roe v. Wade. They ended it, and nobody thought that was possible. () I have to tell you, from the Republican and conservative standpoint, you have to learn how to talk about pro-life. You have to learn how to talk about that decision because you don't know how to talk about it.",
          "next": "On both sides, they felt it should be. Now, like President Ronald Reagan before me, I support the three exceptions for rape, incest, and the life of the mother. I will say that in terms of running, you have to go with your heart. You have to go with what you want. () But the three exceptions, to me, are very important, and the three exceptions, I think, to a large portion of the people on this issue, are very important. Very, very important."
        }
      },
      {
        "match_score": 0.6120808,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "441",
          "title": "Meet The Press Full Donald Trump Interview Transcript",
          "date": "20230918",
          "topics": "Economy, Immigration, Foreign Policy, Veterans Affairs, Government Policy"
        },
        "matched_segment": {
          "segment_id": 51,
          "text": "You go, life of the mother, rape, incest. I think most of them are there. That's a big statement. Well, I don't know what he's saying, because before he wanted you can't have abortion. Excuse me. Now, all of a sudden, he's saying 15 weeks. I said, wow, where did that come from? That's a radical change. Look, something is going to happen that's going to be good for everybody. I'm, almost like, a mediator in this case. They wanted Roe v. Wade terminated, because it was inappropriate. We got it done."
        },
        "context": {
          "previous": "The most powerful people that are anti- abortion are okay with that now. And you know what? They weren't okay with that even a year ago. Well, Mike Pence said something about 15 weeks, too, which was a big change for Mike Pence, because Mike Pence had no exceptions. I have exceptions, by the way. I think people should have exceptions. I think if it's rape or incest or the life of the mother, I think, you have to have exceptions. Now, I will tell you that I think most people, most Republicans are willing.",
          "next": "Something's going to happen. It's going to be a number of weeks. Something's going to happen where both sides are going to be able to come together, and then we'll be able to go onto other things like the economy or military. What I say is very, simple because you can't put words in my mouth like that. Because you've been hearing me talk about this issue, and I think, I talk about it very productively. It could be a state ban, it could be a federal ban, but Democrats want that too."
        }
      }
    ]
  }
}