{
  "query_id": "006",
  "query_text": "It(the number of undocumented immigrants in my largest domestic deportation plan) is much higher (than 11 million), because of them(Biden and Harris’ government). They allowed criminals. Many, many, millions of criminals. They allowed terrorists. They allowed common street criminals. They allowed people to come in, drug dealers, to come into our country, and they're now in the United States.",
  "query_topics": [
    "Immigration",
    "Government Policy"
  ],
  "speaker": "Trump",
  "results": {
    "It(the number of undocumented immigrants in my largest domestic deportation plan) is much higher (than 11 million), because of them(Biden and Harris’ government). They allowed criminals. Many, many, millions of criminals. They allowed terrorists. They allowed common street criminals. They allowed people to come in, drug dealers, to come into our country, and they're now in the United States.": [
      {
        "match_score": 0.759609,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "381",
          "title": "Donald Trump Speaks at Campaign Event in Derry, New Hampshire Transcript",
          "date": "20231024",
          "topics": "Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 76,
          "text": "We will put all of us together, but I will be the leader on this. Put America first. We're going to put America first. Very simple. Under Biden, 270,000 illegal aliens were detected charging across our border. It was like an invasion. In September alone, it's a record, nobody's ever seen that. 270,000. It's larger than most cities. Millions have infiltrated since he took office. I believe the real number is 15 million people. You hear 3, 4, 5, sometimes. I believe the number is 15 million. Many are terrorists."
        },
        "context": {
          "previous": "We're the only ones doing well. But she flip-flopped. Last week you saw that disaster after proposing to flood America with refugees from Gaza. Oh, that sounds like a wonderful idea, doesn't it? So, DeSanctus and bird brain are too weak and too timid and politically ... We need people that are going to defend our country. Our country is in trouble. We need people that are going to defend our country. And I'm the only candidate who says it with relish. I say it with pride.",
          "next": "Hannibal Lecter was from an insane asylum.\" They said, \"Sir, that's very tough.\" \"Of course, it's true, right?\" \"Yes, it's true, but it's a very tough...\" I said, \"Then I'll say it if it's true.\" They're emptying out their mental institutions, insane asylums, their prisons and their jails, and you have many, many thousands of terrorists pouring into our country. And I'll tell you, does anybody want to hear the snake? Speaker 8 Because we have it and people, they always want to hear the snake. But I love it."
        }
      },
      {
        "match_score": 0.75259364,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "492",
          "title": "Trump Rally in Wisconsin",
          "date": "20240909",
          "topics": "Economy, Immigration, Government Policy"
        },
        "matched_segment": {
          "segment_id": 83,
          "text": "Thank you, Gretchen. Great. That's great. Thank you very much. Appreciate it Gretchen. As borders are, Kamala Harris let in over 20 million, they're now saying the number could be 25 million illegal aliens from 168 different countries. Most people don't even know that you have that many countries, coming from prisons and jails and insane asylums and mental institutions, and terrorists at a level that we've never seen before. I told this a few times."
        },
        "context": {
          "previous": "Also with us is famed country singer and she wrote some songs that have been top of the line and a winner of awards all over the place. Gretchen Wilson, where's Gretchen? Gretchen, thank you very much. Great job. Great job. Do you want to come up Gretchen? Okay, come up. Come up. Come up. What the hell? It's a Saturday. We have all day, right? Come on. Thank you. Thank you, it's a great honor, thank you, Gretchen, very nice. Yes, it sure [inaudible :41] Thank you, Gretchen. [inaudible :49] Beautiful words, thank you.",
          "next": "We were, during the border patrol is fantastic, and ICE, and our whole thing with the police officers, they're all, these are people that are brave and great, and they really want to do their job, but they came out with the border patrol, a study on terrorism, and they said in 2019, my year, they said, not one terrorist came into the country. Now I don't really believe that, it can't be that good. It can't be, because now we have thousands coming in."
        }
      },
      {
        "match_score": 0.745394,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "230",
          "title": "Donald Trump Speech Transcript at North Carolina GOP Convention Dinner June 5",
          "date": "20210605",
          "topics": "Immigration, Government Policy"
        },
        "matched_segment": {
          "segment_id": 52,
          "text": "I think around 92% had criminal records. Now, they're all being set free and released back into your communities. They don't want to bring them back. If they are back, they actually have a new policy that, if we took them out, they're going to let them come back in. It's the most incredible thing I've ever heard. But the border is just the beginning of the Biden disasters. As you know, we handed the new administration the greatest economy in the history of the world. We passed massive tax cuts. The largest ever."
        },
        "context": {
          "previous": "And these are some of the finest people you'll ever meet. I got to know so many of them and they're among the finest people you'll ever, ever meet. It's true. They love our country. Despite the worst border crisis in history, we've had the smallest number of illegal alien removals ever. ... had the smallest number of illegal alien removals ever recorded. 92% of illegal aliens we removed in 2020 had criminal records. You believe that? Over 90 and very substantially probably higher than that.",
          "next": "Larger than our great friend, Ronald Reagan. Record regulation cuts, historic pro-American trade deals, and achieved American energy independence. How's your gasoline price doing? Actually, I guess, you were hit worse than any state from what I understand on the cyber attack. It's incredible. It's a lack of respect. After the pandemic began, we launched the fastest economic recovery on record. We produced three vaccines and numerous therapeutics to defeat the virus."
        }
      }
    ]
  }
}