{
  "query_id": "007",
  "query_text": "And told by their(undocumented immigrants’) countries like Venezuela don't ever come back or we're going to kill you. Do you know that crime in Venezuela and crime in countries all over the world is way down? You know why? Because they've taken their criminals off the street and they've given them to her(Harris) to put into our country. ",
  "query_topics": [
    "Immigration",
    "Foreign Policy"
  ],
  "speaker": "Trump",
  "results": {
    "And told by their(undocumented immigrants’) countries like Venezuela don't ever come back or we're going to kill you. Do you know that crime in Venezuela and crime in countries all over the world is way down? You know why? Because they've taken their criminals off the street and they've given them to her(Harris) to put into our country. ": [
      {
        "match_score": 0.8051547,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "481",
          "title": "Trump Rally in Walker, Michigan",
          "date": "20240930",
          "topics": "Immigration, Government Policy"
        },
        "matched_segment": {
          "segment_id": 18,
          "text": "() Now because in Venezuela, their crime is down 72% because they've taken their criminals, they're gang members, they're drug dealers, and they brought them into the United States of America, and they're also releasing almost all of their prisoners. Soon the almost will be gone, their prisons will be empty, their mental institutions and insane asylums will be empty. They're dumping them in our country. And I never had proof."
        },
        "context": {
          "previous": "Their crime rate is down in Caracas. () In fact, I suggest if I lose, I'll tell you what it's possible because they cheat. That's the only way we're going to lose because they cheat. They cheat like hell. If we lose the next time, we're going to have the same group of people in Caracas Venezuela because it's much safer than any place in our country if she wins, much safer. So let's go to Caracas. It was a very unsafe place.",
          "next": "And those fake news reporters back there, they never, they say \"Trump, what would he know about that? What would he know?\" You know why? It's common sense. We're a party of common sense, by the way, just so you know, common sense. () So these numbers just came out. Nobody's ever seen these numbers for years. Nobody's ever seen them. And probably some patriot in ICE or somebody just did something. They just said, the country's going bad. You can't have a country like that."
        }
      },
      {
        "match_score": 0.7865354,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "228",
          "title": "Donald Trump Interview on the Will Cain Show",
          "date": "20240604",
          "topics": "Economy, Immigration, Foreign Policy, Government Policy"
        },
        "matched_segment": {
          "segment_id": 63,
          "text": "They're streetwise and they're smart and they love their country, or they want to do a good job for their country or themselves, doesn't matter because whatever it is, and they're moving all of their bad people into our country. And Venezuela just reported that their crime is down 72% in a year. You know why? Because they moved all their criminals into the United States. And the next time we do an interview, we'll do it in Venezuela because it'll be much safer than being in our country."
        },
        "context": {
          "previous": "What we're doing, what we're going on. I got to know that leaders of all the countries, and they're at the top of their game. () They're very sharp, they're vicious. That's why they're doing so well, Honduras, all of them. I know every one of them. And they're very streetwise people. You know that better than anybody.",
          "next": "Well, the second part of that question is so great and so tough because the radical left is going to start saying, oh, look. So you'll get rid of 10 really bad ones and one beautiful mother who they think is guilty of something, and maybe she is, maybe, and it'll become a story or a family that's a good family and came in wrong and they're going to show it, then it's going to always be tough. It's not going to be easy, and we have to use a lot of good judgment."
        }
      },
      {
        "match_score": 0.7865314,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "492",
          "title": "Trump Rally in Wisconsin",
          "date": "20240909",
          "topics": "Economy, Immigration, Government Policy"
        },
        "matched_segment": {
          "segment_id": 101,
          "text": "I will get these monster criminals out of Wisconsin. I will get them out of our country. We're going to get them out fast. We're going to get them out fast, very fast. They'll soon be back on the streets and jails of Caracas, Venezuela and other places from where they came. Think of it though. Venezuela crime is down 72%. People are saying, oh, isn't it wonderful, Venezuela? In fact, if they win, we're never going to lose touch with each other if they win, but we won't come here. It'll be too dangerous."
        },
        "context": {
          "previous": "They're in the real estate business. Isn't that nice? They were in jail two months ago. Now they're in the real estate business in Colorado just two days ago, right here in small town Wisconsin. (:16) What a beautiful place. However, a member of a savage Venezuela gang was arrested for sexually assaulting a woman and attacking viciously a child. He's charged with suffocation, child abuse, sexual assault, and many other things. Bad guy, shouldn't be in the country, came out of jail, came out of jail in his country.",
          "next": "We will have a meeting. (:15) We will have a rally in Caracas, Venezuela, because it will be safe by comparison to Wisconsin. So we'll all hop in a flight. We'll go over to Caracas, Venezuela or one of hundreds of other countries that are safer than the US because our country is a very unsafe country now, and we're really subject to what these people want to do. And these are violent people. These are people that were criminals at the worst level in their cities all over the world."
        }
      }
    ]
  }
}