{
  "query_id": "008",
  "query_text": "the FBI defraud--they were defrauding statements(that violent crimes come down). They didn't include the worst cities. They didn't include the cities with the worst crime. It was a fraud.",
  "query_topics": [
    "Government Policy"
  ],
  "speaker": "Trump",
  "results": {
    "the FBI defraud--they were defrauding statements(that violent crimes come down). They didn't include the worst cities. They didn't include the cities with the worst crime. It was a fraud.": [
      {
        "match_score": 0.76127505,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "064",
          "title": "Vance and Trump rally in Asheboro, NC",
          "date": "20240822",
          "topics": "Economy, Government Policy"
        },
        "matched_segment": {
          "segment_id": 16,
          "text": "No, they lied about the crime numbers. The crime numbers, it didn't look bad. Then they found out that many of the worst places weren't included in the numbers, and that was done by the FBI, which is sad. (:07) Four years ago, our country was strong and respected like never before. Our allies admired us. Our enemies feared us because everyone knew that as an American president, I was all about putting America first. That's true."
        },
        "context": {
          "previous": "Maybe none. They don't talk about the border. Our great border czar doesn't talk about the border, but they mentioned me more than any other category. I'm now a category. They had me down today as a category. (:38) That's all they talk about. Trump. We've driven them crazy. They have Trump derangement syndrome. We've driven them crazy and they should be driven crazy. They've done a terrible job for our country in every single way. There's not a thing they've done well except cheat and lie. They lie about stats.",
          "next": "Under my leadership, we rebuilt the United States military, created Space Force, and we made our allies pay their fair share and their fair dues. We went to NATO. We say, \"You're not paying. You got to pay.\" If you remember, President Bush would go and he'd make a speech. Obama would go, he'd make a speech. They all made speeches. This one didn't even make a speech, this last one. But I went, I said, \"Nobody is paying. You got to pay.\" And they did pay hundreds of billions of dollars."
        }
      },
      {
        "match_score": 0.738201,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "064",
          "title": "Vance and Trump rally in Asheboro, NC",
          "date": "20240822",
          "topics": "Economy, Government Policy"
        },
        "matched_segment": {
          "segment_id": 12,
          "text": "But their real number is probably 40 to 50% because a lot of the things in their numbers aren't included. (:48) I saw another one where the FBI releases crime statistics and they weren't that bad, and then they left out little things like New York, Chicago. They left out various areas and that wasn't so good. Your life savings will be totally wiped out if you put somebody like that in there with him, how about him? How about him?"
        },
        "context": {
          "previous": "And Comrade Kamala, she's comrade. The most radical left person ever to run for a high political office in our country gets another four years, millions of jobs, and it'll vanish overnight. She gets four more years, you're going to see jobs vanish. Millions and millions will vanish and inflation will completely destroy our country. We'll have inflation worse than they've given us. When I gave it to them, I had virtually no inflation, and now their number's up to 22, 23%.",
          "next": "She'll destroy our country just like she destroyed San Francisco, just like she destroyed California. (:21) With the Trump victory, we'll once again have the greatest economy in history. We're going to do things that are going to make us so great so fast. We're going to bring it back. We're going to make America strong again. We're going to make America great again. It's going to be fantastic. It's going to be fantastic."
        }
      },
      {
        "match_score": 0.712504,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "361",
          "title": "Trump Town Hall in Pennsylvania",
          "date": "20241017",
          "topics": "Foreign Policy, Economy, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 9,
          "text": "I'll give you an example on housing and on different things like crime statistics are fake. They were fake statistics. They didn't include some cities that were really bad. So the crime looked like it was just bad as opposed to being horrific. Jobs, 818,000 fake jobs they added, and they padded the job numbers a couple of months ago so that they'd look better on jobs. 818,000, they were fake."
        },
        "context": {
          "previous": "Because when they say, \"Oh...\" Although they had very bad inflation numbers last month, you saw that- Very, very bad inflation numbers, despite the big... They did this big drop, probably too big a drop. I'm not going to get into that, but we're going to get the prices down because the damage has been done. If we had no inflation now, such damage has been done. In my opinion, the biggest inflation in the history of our country. They didn't include a lot of the bad numbers.",
          "next": "They were fraudulent jobs and they thought they'd announced the real numbers after the election, but we had a whistleblower or somebody that let it out. () So they cheated us on, think of that, 818,000 jobs. They cheated. Usually when you have those numbers, it's 9,000 jobs off it. This is almost 1,000,000 jobs off. It's not even possible. So we're going to bring things and Reid, you're going to buy that house and you're going to pay 2.5%, 3% interest."
        }
      }
    ]
  }
}