{
  "query_id": "009",
  "query_text": "Fracking? She(Harris)'s been against it for 12 years. Uh, defund the police. She's been against [sic] that forever.…She gave up at least 12 and probably 14 or 15 different policies. Like, she was big on defund the police.",
  "query_topics": [
    "Climate",
    "Social Justice"
  ],
  "speaker": "Trump",
  "results": {
    "Fracking? She(Harris)'s been against it for 12 years. Uh, defund the police. She's been against [sic] that forever.…She gave up at least 12 and probably 14 or 15 different policies. Like, she was big on defund the police.": [
      {
        "match_score": 0.8131825,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "434",
          "title": "Trump Rally in Las Vegas",
          "date": "20240916",
          "topics": "Immigration, Gun Control, Government Policy"
        },
        "matched_segment": {
          "segment_id": 74,
          "text": "() Harris and Biden waged war on American energy, opened up the Russian pipeline, Nord Stream 2 that I had closed, but shut down the Keystone XL Pipeline that I had opened. She reentered the horribly unfair to the United States US-Paris Climate Accord. I want it to be the Nevada Climate Accord, not the Paris. It's the most unfair document you've ever seen. And she has always said, \"I will ban fracking.\" And she has always said, \"I will defund the police.\" She was the head of the Defund the Police movement."
        },
        "context": {
          "previous": "The people that pour into our country illegally. () Now Kamala is pushing the largest individual and small business tax increase in American history. And she said that a 70 to 80% tax rate is something that's very, very doable. \" It's a bold idea,\" she said, \"and it must be discussed.\" Now she changed that a little bit, but with a politician, they always go back to their original thought.",
          "next": "Anybody that was with that scam for even a week is not fit to serve as the President of the United States. As California Attorney General, she redefined child sex trafficking, assault with a deadly weapon and rape of an unconscious person. These are categories, all categories, horrible categories, but she redefined them as, in all cases, nonviolent crimes. () Kamala supports states being able to take minor children and perform sex change operations on them without their parents' consent. Did you know that?"
        }
      },
      {
        "match_score": 0.75560904,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "444",
          "title": "Donald Trump Rally on 9/18/24 in Uniondale",
          "date": "20240919",
          "topics": "Economy, Immigration, Veterans Affairs, Infrastructure, Government Policy"
        },
        "matched_segment": {
          "segment_id": 24,
          "text": "She boasted about being the leader of the movement of cashless bail, just like she led the effort to defund the police. She was the leader of the effort to defund the police, and now she's running for president. () But a little while ago, a little while ago, like everything else, no fracking, no this, she changed her mind. Now she says she likes the police. She can't say love, but she says like."
        },
        "context": {
          "previous": "And the accomplice driving the car had been arrested 14 times, but he was actually much worse, he was more vicious. 14 times, but he was actually far more vicious. () This is the kind of story we hear every single day under radical Democrat policies like cashless bail, cashless bail. You kill somebody and you're out on the streets in two hours. Cashless bail has been a disaster for our country. Kamala Harris wanted it no matter where she went.",
          "next": "She's made a lot of progress, but you know the first thing that would happen is she will go to defunding the police if that's even possible to think about. () But when I get back into the Oval Office, the madness ends and the law and order is going to return to our country. A fully reformed Federal Department of Justice will deliver massive public safety funding for New York and other Democrat-run cities that are under siege. But in exchange, they will give our police back their protection and their respect."
        }
      },
      {
        "match_score": 0.74783695,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "465",
          "title": "Trump Rally in Georgia",
          "date": "20240925",
          "topics": "Economy, Foreign Policy"
        },
        "matched_segment": {
          "segment_id": 112,
          "text": "I've been involved on the other side for a long time with helping people out. But I've watched for a long time and I've seen people change one or two policies, but I've never seen people change 15 policies. (:54) She wants to confiscate your gun. Now, she said, \"Oh, I won't do that.\" She wants to have no fracking. She's 100 times no fracking. There will be no fracking in Pennsylvania, right? No fracking. Now she's saying, \"Oh, I'd love to have fracking.\" But they always go back to where they were."
        },
        "context": {
          "previous": "(:03) So, number one, we're going to make America safe because we have to have a safe country or nobody's going to want to come here. And with her, she doesn't know what the word safe is. She was the head of defund the police. Anybody that heads up defund the police is not qualified to be a president of the United States. And anybody that lies like she lies... She lies about everything. She changed 15 policies. Now, I've watched politics for a long time.",
          "next": "They always go back because that's it, she's a Marxist philosophy. Her father is a Marxist philosopher and he taught her well and that's what you got and you can't have that. Our country is not ready for this and hopefully never will be. (:29) Remember one other thing, and I think it's terrible, she lied about McDonald's."
        }
      }
    ]
  }
}