{
  "query_id": "010",
  "query_text": "But if she(Harris) won the election, the day after that election, they'll go back to destroying our country and oil will be dead, fossil fuel will be dead. We'll go back to windmills and we'll go back to solar, where they need a whole desert to get some energy to come out.",
  "query_topics": [
    "Climate",
    "Energy"
  ],
  "speaker": "Trump",
  "results": {
    "But if she(Harris) won the election, the day after that election, they'll go back to destroying our country and oil will be dead, fossil fuel will be dead. We'll go back to windmills and we'll go back to solar, where they need a whole desert to get some energy to come out.": [
      {
        "match_score": 0.71889824,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "009",
          "title": "Donald Trump Rally in Schnecksville, Pennsylvania",
          "date": "20240416",
          "topics": "Economy, Foreign Policy, Immigration, Technology"
        },
        "matched_segment": {
          "segment_id": 8,
          "text": "But the day after the election, first of all, if he wins, our country is going to be destroyed the day after the election, if he wins. He will stop drilling and he'll go back to wind, which doesn't work. He'll go back to all sorts of things that don't work. And they've proven that. () When it comes to Biden, he launched an extremist crusade actually to smash oil and gas, but Pennsylvania is one of the big oil and gas largely due to me. He wanted to smash it."
        },
        "context": {
          "previous": "When I'm back in the White House, we will end Joe Biden's inflation train wreck, and we will tell Pennsylvania \"Drill, baby, drill.\" Get back to drilling. () Under my leadership, we had energy independence, and soon we would've had energy dominance. We were going to be dominant. We were bigger than Russia. We were bigger than Saudi Arabia. And then he stopped. But then he started again. He went back to Trump policies because the price started going up so high.",
          "next": "Biden has imposed a savage natural gas export ban that's putting countless Pennsylvania jobs at risk. He's risking your lives, he's risking your jobs, but he doesn't care because all he cares about is the Green New Scam, the Green New Deal, the Green New Scam. The Green New Scam, one of the biggest hoaxes. () Biden's also trying to abolish gasoline-powered automobiles and force everyone into an all electric car."
        }
      },
      {
        "match_score": 0.71584857,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "457",
          "title": "Trump Rally in North Carolina",
          "date": "20240923",
          "topics": "Economy, Immigration"
        },
        "matched_segment": {
          "segment_id": 19,
          "text": "Or the businessman who created the greatest economy in the history of our country and in the history of the world? We created the greatest. () Kamala Harris is promising war on American energy. Oh, she's after energy. Oh, she's after it. You know what they did? She came in, they closed up all of the energy. The prices started going crazy. So, Biden started screaming, \"Get back to what Trump was doing!\" But if they won this election, the day after they win, your energy prices are going to double and triple."
        },
        "context": {
          "previous": "We would rather have you as president, think of this. If you would rather have me as president, or, okay, let's do this. Let's do a poll. You ready? Who wants Trump as president? I'm shocked. Is there anyone brave enough to raise your hand? Who wants Kamala as president? I'm looking for one brave soul. That would be very brave. Who would you rather have as your president? Radical liberal Kamala Harris, who created the worst economy in your life? It's the worst economy that we've ever had, under them.",
          "next": "You know that. The largest tax hikes on families in American history, is what they say, the largest small business tax hikes in American history, and the most crippling regulations in American history. () All of this is shutting down power plants and banning gasoline-powered cars or trucks. Would anybody like to drive, on occasion, a beautiful gasoline-driven car? We want a gasoline-powered... Now, they do have a new one. Hydrogen. The problem is it tends to blow up every once in a while."
        }
      },
      {
        "match_score": 0.7124897,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "316",
          "title": "Donald Trump Rally Speech Transcript Rome, Georgia November 1",
          "date": "20201101",
          "topics": "Economy, Government Policy, Gun Control"
        },
        "matched_segment": {
          "segment_id": 12,
          "text": "Biden's energy ban will send every state from Georgia, Michigan, Pennsylvania into crushing poverty. And you know that, the whole thing is ridiculous. The Green New Deal AOC plus three, I don't even think they ever took... Did they take even an environmental course? Ilhan Omar is a part of that deal. No, no, no. She loves our country very much. As luck... that's why I'm going to win Minnesota because of her. As long as I'm president, we will remain number one producer of oil and natural gas anywhere in the world."
        },
        "context": {
          "previous": "How about the other day? He walks past the press, the media, the fake news. And he walks past, \"Sir, what flavor ice cream is that?\" He's walking out of an ice cream store. \"It's vanilla and chocolate.\" They don't ask me questions like that. It'll cause massive layoffs, exploding energy prices and crippling blackouts, just like they have in California. They're doing great with California energy, right? They have brownouts; they don't want to call it blackouts, but it'll end up being blackouts very soon.",
          "next": "We are now number one. And something you haven't heard very much of for ever, we are totally energy independent, isn't that nice? I don't think we're going to let them turn that around on us. People that have no clue, especially Biden, he truly doesn't have a clue. Our opponent's agenda is a war on workers, a war on faith, and a war on our great police. Biden says he's running as a proud Democrat."
        }
      }
    ]
  }
}