{
  "query_id": "013",
  "query_text": "We did have an agreement(with the Taliban) negotiated by Mike Pompeo. It was a very good agreement. The reason it was good, we were getting out. We wouldn't have lost the soldiers. We wouldn't have left many Americans behind. And we wouldn't have left…$85 billion worth of brand new beautiful military equipment behind. ",
  "query_topics": [
    "Foreign Policy",
    "Government Policy"
  ],
  "speaker": "Trump",
  "results": {
    "We did have an agreement(with the Taliban) negotiated by Mike Pompeo. It was a very good agreement. The reason it was good, we were getting out. We wouldn't have lost the soldiers. We wouldn't have left many Americans behind. And we wouldn't have left…$85 billion worth of brand new beautiful military equipment behind. ": [
      {
        "match_score": 0.7419873,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "228",
          "title": "Donald Trump Interview on the Will Cain Show",
          "date": "20240604",
          "topics": "Economy, Immigration, Foreign Policy, Government Policy"
        },
        "matched_segment": {
          "segment_id": 44,
          "text": "We would've left with dignity and strength and then you take out your equipment. They left $85 billion worth of equipment. I rebuilt the entire military. $85 billion of it was left in Afghanistan, and they're one of the biggest of the Taliban, they're one of the biggest sellers of military equipment now. Well, in the whole world, I think they're number two because they're selling... Because they don't need 730,000 rifles. They have 730,000. I mean, I don't know what... We go to fight a war. What did they do? What?"
        },
        "context": {
          "previous": "Nevertheless, there were people that helped us take them out. But we have Americans left behind. We have 13 dead soldiers. Incredible. The parents largely, they came here shortly after that and we're going to have them back too. () We sat, they said, \"Well, we won't see President Trump. He'll come maybe for a couple of minutes.\" I stayed with them for four hours. We listened to music up in the deck. It was beautiful. It was just nice. They're great people. They're devastated. That would've never happened.",
          "next": "37 rifles for every soldier we have, it's crazy, but we had 730 some odd thousand rifles, and then we had 72,000 vehicles. () Many of them armor plated, you know how expensive with four inch armor, four inch like this on the bottom. They sell all that stuff. They're one of the largest because they don't need all of it. They can keep instead of... Think of what 72,000 vehicles is. If you take the biggest used parking lot, used car lot in Texas, think Texas, they have big... They probably have what? 500 cars here."
        }
      },
      {
        "match_score": 0.7396097,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "057",
          "title": "Donald Trump Sean Hannity Interview on Afghanistan August 17: Transcript",
          "date": "20210818",
          "topics": "Foreign Policy, Veterans Affairs"
        },
        "matched_segment": {
          "segment_id": 2,
          "text": "That blows the helicopters in Vietnam away. That's not even a contest. This has been the most humiliating period of time I have ever seen. Yeah, we had a great deal. We worked on it very hard. Mike Pompeo, a brilliant guy, and many others worked on it endlessly, meetings with the Taliban. Of course, you have to meet with the Taliban. They're the ones that you're negotiating with. I spoke on numerous occasions to the head of the Taliban and we had a very strong conversation."
        },
        "context": {
          "previous": "And you're dealing with thousands and thousands of Americans and others that are stranded and very dangerously really stranded in Afghanistan. So, it's something that you can't even believe that a thing like this could... I looked at that big monster cargo plane yesterday with people grabbing the side and trying to get flown out of Afghanistan because of their fear, their incredible fear. And they're blowing off the plane from 2,000 feet up in the air. Nobody's ever seen anything like that.",
          "next": "I told him up front, I said: \"Look, before we start, let me just tell you right now that if anything bad happens to Americans or anybody else, or if you ever come over to our land, we will hit you with a force that no country has ever been hit with before, a force so great that you won't even believe it. And your village, and we know where it is...\" and I named it, \"will be the first one.\" \"The first bombs will be dropped right there.\" Yeah. To Mullah Baradar, who is probably the top person now."
        }
      },
      {
        "match_score": 0.73004293,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "063",
          "title": "Donald Trump Cullman, Alabama Rally Speech Transcript",
          "date": "20210822",
          "topics": "Immigration, Foreign Policy, Government Policy"
        },
        "matched_segment": {
          "segment_id": 50,
          "text": "I could just see this, the leadership of the Taliban standing there, somebody walking up, \"Sir, the soldiers have left Afghanistan.\" He goes, \"What?\" \"The soldiers have left.\" And they've left all of their citizens behind and they've left $83 billion worth of equipment behind, including brand new Apache helicopters, thousands of Humvee vehicles with armor guard, equipment that nobody has ever even seen before, it was so sophisticated and good."
        },
        "context": {
          "previous": "They were tired of being blasted. They were tired. They're tough. Everybody's tough. But you know what? We're tougher, he just said it. But nobody would know it. Nobody would know it. When you look at what's happening, nobody would know it. But we're tougher, I'd like to explain that to Abdul and to everybody else. We're much tougher. Please remember that. It's hard for them to understand that now after watching this. Think of that, the soldiers have left.",
          "next": "So can you imagine these guys Abdul and his friends sitting there, that the United States soldiers, our military, has left. They walked in, they walked in and they took everything. It's crazy. It's crazy. I've never seen anything so stupid in my life. Somebody said, \"Don't say it, Sir. It's not good.\" I asked yesterday, I was with a group of people and there was a five year old child. And I explained the situation to the five year old child."
        }
      }
    ]
  }
}