{
  "query_id": "014",
  "query_text": "And what we will do is we're looking at different (health insurance)plans. If we can come up with a plan that's going to cost our people, our population, less money and be better health care than Obamacare, then I would absolutely do it. But until then, I'd run it as good as it can be run.",
  "query_topics": [
    "Healthcare"
  ],
  "speaker": "Trump",
  "results": {
    "And what we will do is we're looking at different (health insurance)plans. If we can come up with a plan that's going to cost our people, our population, less money and be better health care than Obamacare, then I would absolutely do it. But until then, I'd run it as good as it can be run.": [
      {
        "match_score": 0.82679904,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "271",
          "title": "Donald Trump Fox News Town Hall Transcript",
          "date": "20200306",
          "topics": "Healthcare, Immigration, Government Policy"
        },
        "matched_segment": {
          "segment_id": 37,
          "text": "It's a much different plan. And what we'd like to do is totally kill it, but come up, before we do that, with something that's great. What we've done is we've really managed Obamacare, the remaining portion, we get rid of the bad part, but the remaining portion really well. And before I got involved, you know what was happening with the rates on Obamacare. They were going up at levels that nobody's ever seen before. We are managing it. And I had a decision to make. This was very important."
        },
        "context": {
          "previous": "That's where you paid a fortune not to pay for horrible healthcare and insurance, and it had a tremendous impact. Preexisting conditions, 100% we take care of. But we have many healthcare plans now where it's 60%, even 65% less expensive than Obamacare. It's better than Obamacare, and what we really have left is the carcass of Obamacare or you could call it new healthcare, because without preexisting... without the whole thing with the individual mandate, it's a whole different ball game.",
          "next": "I said to my people, and we have great people, [Sema :47], Azar, I mean great people that are so good at it. I said, \"You know, I have a little problem. Do we manage it great until we get something much better? Or do we manage it poorly and say Obamacare's horrible.\" And I said, \"We've got to do the right thing."
        }
      },
      {
        "match_score": 0.7779731,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "351",
          "title": "Donald Trump NBC Town Hall Transcript October 15",
          "date": "20201015",
          "topics": "Healthcare"
        },
        "matched_segment": {
          "segment_id": 40,
          "text": "We'd like to terminate it, and we want a much less expensive healthcare that's a much better healthcare, and that's where we're aiming. And if we can do that, and we have a very good chance of doing it, but we've also brought down the price of Obamacare. The problem with Obamacare, it basically is never going to be great, and I want to give great healthcare. So important. And thank you very much. It is a big issue for me too. That's right. That's right."
        },
        "context": {
          "previous": "By the way, we're always protecting people with pre-existing conditions, and I can't say that more strongly, but we've been able to bring healthcare costs way down. Now, I took over Obamacare, got rid of the individual mandate, made it good, managed it much better. Remember, they had the $5 billion website disaster, and all of the problems they had. The problem with Obamacare, it's not good.",
          "next": "In order to replace it with a much better healthcare at a much lower price. And always, under all circumstances, we are going to protect the Republicans. And maybe I changed the party a lot over the last three years, but we will protect people with preexisting conditions. And Savannah, what I want to do, get rid of the terrible Obamacare. I've already done it to a large extent because as you know, the individual mandate is gone. That was the worst part. No, no. We have done- That's right."
        }
      },
      {
        "match_score": 0.765926,
        "metadata": {
          "speaker": "Trump",
          "speech_id": "460",
          "title": "Donald Trump ‘America First Healthcare’ Speech Transcript September 24",
          "date": "20200924",
          "topics": "Healthcare, Immigration"
        },
        "matched_segment": {
          "segment_id": 12,
          "text": "Simultaneously with all of this, we are joining in a lawsuit to end this ill-conceived plan. I'm in court to terminate this really, really terrible situation. If we win, we will have a better and less expensive plan that will always protect individuals with pre-existing conditions. If we lose, what we have now is better than the original version of Obamacare by far. Much better. Much better. Again, we will always protect patients with pre-existing conditions."
        },
        "context": {
          "previous": "That was Alex and that was Seema, And you did a fantastic job. But it's still unacceptable to me because it's too expensive and doesn't really do the job as well as we could have. So what we have now is a much better plan. It is no longer Obamacare, because we've gotten rid of the worst part of it, the individual mandate, and made it much less expensive. A lot of that was through good management. We manage it properly. We have tremendous people working on it.",
          "next": "So today, I'm laying out my vision for the future of American healthcare with the America First Healthcare plan. As we restore America to full strength, the first healthcare plan will be a core part of our national renewal. In a few moments, I'll sign an executive order outlining the three pillars of my plan and directing my administration to implement these critical reforms. The first pillar of my plan is more choice, more choice for American patients. Very important."
        }
      }
    ]
  }
}