{
  "query_id": "015",
  "query_text": "When I had it, I had tariffs and yet I had no inflation. we've had a terrible economy because inflation has--which is really known as a country buster. It breaks up countries. We have inflation like very few people have ever seen before. Probably the worst in our nation's history. We were at 21%. But that's being generous because many things are 50, 60, 70, and 80% higher than they were just a few years ago. This has been a disaster for people, for the middle class, but for every class. ",
  "query_topics": [
    "Economy",
    "Government Policy"
  ],
  "results": {
    "When I had it, I had tariffs and yet I had no inflation. we've had a terrible economy because inflation has--which is really known as a country buster. It breaks up countries. We have inflation like very few people have ever seen before. Probably the worst in our nation's history. We were at 21%. But that's being generous because many things are 50, 60, 70, and 80% higher than they were just a few years ago. This has been a disaster for people, for the middle class, but for every class. ": {
      "Trump": [
        {
          "match_score": 0.8317199,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "088",
            "title": "Trump Addresses National Association of Black Journalists",
            "date": "20240805",
            "topics": "Economy, Social Justice, Government Policy"
          },
          "matched_segment": {
            "segment_id": 11,
            "text": "The inflation is absolutely destroying our middle class, our working class, virtually every class. Inflation is a disaster in our country. Inflation is a country buster. It breaks every country, and we had, in my opinion, the worst inflation we've had, they say it's 58 years, but I think it's much more than that. () It's been devastating, and if you just take a look at a lot of things they don't include like interest rates. Interest rates went from 2.4% to 10% and you can't get the money. People can't buy houses."
          },
          "context": {
            "previous": "And, by the way, their crime rate is going down and our crime rate is going to be a disaster. Sure. So first of all, it's very hard to hear you for whatever reason because of the fact that they have bad equipment 'cause I guess this woman was unable to get the right equipment. But it's very hard for me to hear you, but I can hear every other word. It's very difficult, actually. But so I don't know if they can fix it or do something with it, but I'll do the best I can with it.",
            "next": "They no longer have the American dream. Young people, young Black people, they don't have the American dream anymore. They can't buy a house. They can't borrow the money because of the cost of the money. They can't because of the cost of housing, because of the cost of build it, because of inflation. Inflation is a disaster, and it's destroying our country and it's destroying the Black community probably as much or more- ... than any- You know what we have to do?"
          }
        },
        {
          "match_score": 0.81268823,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "284",
            "title": "Donald Trump Holds Rally in Wisconsin on 5/01/24",
            "date": "20240502",
            "topics": "Economy, Immigration, Education"
          },
          "matched_segment": {
            "segment_id": 19,
            "text": "Everybody said, this isn't me. This is everybody. We had the greatest, we had no inflation. Today, your inflation so high, it doesn't matter if you make money, it doesn't matter. It eats you alive. Inflation is what they call a country buster. You go back 200 years, 300 years to countries with inflation, they got busted. Ask Germany, how was inflation many, many years ago? It destroyed the country. It is a country buster and we have record horrible inflation. And now, it's getting worse."
          },
          "context": {
            "previous": "The price of gasoline was $2 and even less than that a gallon. Think of that. We had periods of time where it was $1.57, $1.87. How does that sound to you? () But under $2 a gallon, the 30-year mortgage rate was at a record low, the lowest ever recorded $2... Think of this, 2.65%, that's what your mortgage rates were. Now you can't get a mortgage. If you want to pay 8 or 9%, you still can't get them. And we had no inflation. We had no inflation. We had the greatest economy in history. This is...",
            "next": "And now they think they're not going to be able to cut interest rates, because it's getting worse. You don't hear that and they don't talk about it. And the fake news, these people right over here, they don't want to talk about it, but it's getting worse. () But then Biden came in and unleashed mayhem on our economy just like he unleashed mayhem on our border. The border, there's never been anything like this, a border like this. There's never been anything in the world."
          }
        },
        {
          "match_score": 0.78272223,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "360",
            "title": "Trump Town Hall on Univision",
            "date": "20241017",
            "topics": "Economy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 2,
            "text": "Hopefully they'll be very extremely easy questions. But I look forward to being with you for a little while. Thank you very much. Okay. Well, thank you very much. Look, this is a problem caused by this administration. Four years ago, you had no inflation. Now you have record-setting inflation. What they've done to this country is incredible in so many different ways, incredibly bad. We have people complaining about groceries, about prices, about rent, about everything."
          },
          "context": {
            "previous": "() Just very special people, brilliant, energetic, and somehow just ... They've attracted to me, I've attracted to them, and we look forward to having a big win. We're going to create a lot of jobs. We create jobs. That's what I do. Right next door, I own Doral, and a lot of you have seen that. A lot of you are from the area. That's been a big success. We have tremendous numbers of Hispanic people going there and working there. () So we're going to see what you have to say and we're going to answer some questions.",
            "next": "Interest rates went from 2% to 10% and you can't get the money. You want to buy a house. You can't buy a house anymore. You can't do anything. () But the biggest thing I hear about is just what you said, groceries, the food. So we didn't have inflation. We had a great situation for everything, for virtually everything. When they came in, they spent and they also blew my energy policies up. So we had inexpensive energy. Now you have the most expensive thing on the list is energy."
          }
        },
        {
          "match_score": 0.7777237,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "174",
            "title": "Trump Rally in Grand Rapids, Michigan",
            "date": "20240722",
            "topics": "Healthcare, Veterans Affairs"
          },
          "matched_segment": {
            "segment_id": 28,
            "text": "Look at every country that's had inflation. And we had, I believe, the greatest inflation in the history of our country. They don't even report it properly because they leave the worst numbers out. They don't talk about interest rates that went to 10, 11, 12% and you can't get the money. So what does that mean, 12%, if you can't get the money. It means it's higher. () From 2%, we will seal the border and we will stop this terrible invasion that's destroying our country. We'll crush migrant crime."
          },
          "context": {
            "previous": "I'll say, \"The red light just went off.\" () No, but actually the radical left reporters of which there are quite a few, I can't believe it. I don't know why they'd have them, but the radical left reporters say the guys wrote, \"Wasn't it until two years in that we became destroyed with inflation?\" Inflation is a country buster. It's a class buster. It busts everything. Low-income, middle-income especially, and they get bust. They're busted. The country gets busted. () Look at Germany from centuries ago.",
            "next": "We're going to crush migrant crime. Oh, we have a new form of crime now. It's called migrant crime. The only good thing about these migrants coming in is they make our gang members and criminals look like the nicest people you've ever met. These people are much tougher. They come from all over the world, not just from South America. We're going to return law and order to our streets and restore patriotism to our schools."
          }
        },
        {
          "match_score": 0.77485615,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "360",
            "title": "Trump Town Hall on Univision",
            "date": "20241017",
            "topics": "Economy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 3,
            "text": "Interest rates went from 2% to 10% and you can't get the money. You want to buy a house. You can't buy a house anymore. You can't do anything. () But the biggest thing I hear about is just what you said, groceries, the food. So we didn't have inflation. We had a great situation for everything, for virtually everything. When they came in, they spent and they also blew my energy policies up. So we had inexpensive energy. Now you have the most expensive thing on the list is energy."
          },
          "context": {
            "previous": "Hopefully they'll be very extremely easy questions. But I look forward to being with you for a little while. Thank you very much. Okay. Well, thank you very much. Look, this is a problem caused by this administration. Four years ago, you had no inflation. Now you have record-setting inflation. What they've done to this country is incredible in so many different ways, incredibly bad. We have people complaining about groceries, about prices, about rent, about everything.",
            "next": "That is such a big category that it leads to everything. Everything else follows. () Everything follows energy. We have more liquid gold under our feet than anybody else. There's no other country that has liquid gold like we do. That's oil and gas. We're going to bring your energy costs down, and with your energy costs, everything is going to come down. We're going to also make jobs available so you can afford, literally much easier. We're going to have many more jobs that we have right now. () We set a record."
          }
        }
      ],
      "Harris": [
        {
          "match_score": 0.60208714,
          "metadata": {
            "speaker": "Harris",
            "speech_id": "115",
            "title": "Harris Speech in Pittsburgh",
            "date": "20240926",
            "topics": "Economy, Healthcare, Government Policy, Veterans Affairs"
          },
          "matched_segment": {
            "segment_id": 13,
            "text": "A survey of top economists by the Financial Times and the University of Chicago found that by an overwhelming 70 to 3% margin, my plan would be better for keeping inflation low. Objective economists have been very clear. And they create nearly 50% of private sector jobs and they strengthen our middle class. And if we can harness the entrepreneurialism of the American people and unlock the full potential of aspiring founders and small business owners, I am optimistic that no one will be able to outpace us."
          },
          "context": {
            "previous": "I had the experience of dealing with that when I was Attorney General. We will take on big pharma, and cap the cost of prescription drugs for all Americans just like we did for our seniors. Now, by contrast, Donald Trump has no intention of lowering costs for the middle class. In fact, his economic agenda would actually raise prices. And listen, that's not just my opinion.",
            "next": "() By contrast, Donald Trump, when he was president, has been described by one of the nation's leading experts on small businesses in a piece he published in a major paper as not being good for small businesses. In fact, the title... The title... Wait, because I'm bearing the lead right now. One of the leading experts on small businesses published a piece in one of the major newspapers, and the title, I'm going to quote, Does Donald Trump Hate Small Businesses? And their answer was yes. Their answer was yes."
          }
        }
      ],
      "Trump_avg_score": 0.7959,
      "Harris_avg_score": 0.6021,
      "Combined_avg_score": 0.7636
    }
  }
}