{
  "query_id": "016",
  "query_text": "On top of that, we have millions of people pouring into our country from prisons and jails, from mental institutions and insane asylums. And they're coming in and they're taking jobs that are occupied right now by African Americans and Hispanics and also unions. Unions are going to be affected very soon. ",
  "query_topics": [
    "Economy",
    "Immigration",
    "Social Justice"
  ],
  "results": {
    "On top of that, we have millions of people pouring into our country from prisons and jails, from mental institutions and insane asylums. And they're coming in and they're taking jobs that are occupied right now by African Americans and Hispanics and also unions. Unions are going to be affected very soon. ": {
      "Trump": [
        {
          "match_score": 0.8685377,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "088",
            "title": "Trump Addresses National Association of Black Journalists",
            "date": "20240805",
            "topics": "Economy, Social Justice, Government Policy"
          },
          "matched_segment": {
            "segment_id": 9,
            "text": "() Unions are being very badly affected by all of the millions of people that are pouring into our country. And one thing, Harris, as we discussed, many of these people are coming in from mental institutions, from prisons, from jails. They're gang members in other countries. Other countries are setting loose their prisoners. They're opening up their prisons and their mental institutions, and they're taking their bad people, drug dealers, gang members, and they're bringing them into the United States."
          },
          "context": {
            "previous": "The first group of people, the Black population is affected most by that, and Kamala is allowing it to happen. She's the border czar. She's the worst border czar in the history of the world. There's never been a border czar like this. She's never even essentially been. She said she was there once, but not the right part of the border. So she was a border czar. She's done a horrible job. These people are coming into our country and they're taking Black jobs and Hispanic jobs and, frankly, they're taking union jobs.",
            "next": "And, by the way, their crime rate is going down and our crime rate is going to be a disaster. Sure. So first of all, it's very hard to hear you for whatever reason because of the fact that they have bad equipment 'cause I guess this woman was unable to get the right equipment. But it's very hard for me to hear you, but I can hear every other word. It's very difficult, actually. But so I don't know if they can fix it or do something with it, but I'll do the best I can with it."
          }
        },
        {
          "match_score": 0.8064761,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "071",
            "title": "Donald Trump Speaks at the Southern Border",
            "date": "20240826",
            "topics": "Immigration, Government Policy"
          },
          "matched_segment": {
            "segment_id": 30,
            "text": "And it's also really badly hurt our Black population and our Hispanic population because these people are taking their jobs. The jobs now are way down for the Black population and the Hispanic population because we have millions of illegal aliens that have poured into our country. They've taken the jobs of African-Americans and Hispanics, and that was obvious to me. Next is going to be unions, you watch. The unions are going to start going well because those jobs are going to be taken to."
          },
          "context": {
            "previous": "In this direction, it's as far as you can see is wall, we have no problem there, but they come in where they refuse to put it up. That was when I first realized that they want open borders. I thought nobody could be so foolish or stupid to want open borders and have the world's criminal population pour into our country. That's what's happening. () But it shattered so many families' lives and stolen so many incredible young lives.",
            "next": "We're honored to really be here with these incredible people and in particular with some grieving families. And this is a group of people that I've gotten to know, they're incredible people, they've lost a loved one, and thousands of thousands of others are out there, and they are grieving also, but they're not out with you and sitting in this hot sun. I will say this, that at least it gives us a good reason. We' Take care of yourself. Absolutely. [inaudible :40]. Thank you, [inaudible :29]. Thank you very much."
          }
        },
        {
          "match_score": 0.7870604,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "491",
            "title": "Trump Speaks after Appeal Argument",
            "date": "20240909",
            "topics": "Economy, Immigration"
          },
          "matched_segment": {
            "segment_id": 56,
            "text": "So foreigners coming in illegally, largely illegally, into our country, took the jobs of native-born Americans. And I've been telling you that's what's going to happen. Because we have millions and millions of people pouring into our country, many from prisons and jails and mental institutions and insane asylums, traffickers, human traffickers, women traffickers, sex traffickers. Which by the way, that's the kind of thing that people should be looking at, because it's horrible."
          },
          "context": {
            "previous": "Same case. And he refused to do so. He wanted two cases. So two cases, two sets of lawyers, two everything. It's really, really very disgraceful. () Let me talk about job numbers because, as you know, they just came out and they're a basic disaster. They are really bad. You had numbers that are shocking. Native-born Americans, we lost 1.3 million jobs. While foreign-born Americans were able to take all of those jobs.",
            "next": "And it's turning out that migrant crime is far worse than any crime that we've ever experienced. () If you look at Aurora, Colorado, they're taking over the place. They took over buildings, and this is just the beginning. You haven't seen anything yet. You haven't seen... They've allowed well over 20 million people in my opinion. Other people say, well, it's only 13. No, no, it's much more than 20. I think it's much more than 20."
          }
        },
        {
          "match_score": 0.7819204,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "361",
            "title": "Trump Town Hall in Pennsylvania",
            "date": "20241017",
            "topics": "Foreign Policy, Economy, Veterans Affairs"
          },
          "matched_segment": {
            "segment_id": 22,
            "text": "The farmers in this country, we're going to get them straightened out. We're going to get your prices down. () But you asked another question about safety and also about black population jobs and Hispanic population, in particular those two. So when millions of people pour into our country, they're having a devastating effect on black families and Hispanic families more than any others. I think it's going to spread to a lot of other places. I think it's going to spread to unions."
          },
          "context": {
            "previous": "Our farmers aren't being treated properly, and we had a deal with China and it was a great deal. I never mentioned it because once COVID came in, I said that was a bridge too far because I had a great relationship with President Xi and he's a fierce man and he's a man that likes China and I understand that, but we had a deal and he was perfect on that deal. $50 billion he was going to buy. We were doing numbers like you wouldn't believe for the farmer, but the farmers are very badly hurt.",
            "next": "I think unions are going to have a big problem because employers are just not going to pay the price. And it's a very bad thing that's happening. So they're coming in, many are coming in from jails and prisons and mental institutions and insane asylum. That's like step above insane asylum. () And whenever I go Hannibal Lecter, you know what I'm talking about. They always go the fake news. That's a lot of fake news back there too. They always mention, it's a way of demeaning. They say, \"Hannibal Lecter."
          }
        },
        {
          "match_score": 0.77793425,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "479",
            "title": "Trump Holds Event in Wisconsin",
            "date": "20240930",
            "topics": "Economy, Infrastructure, Foreign Policy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 31,
            "text": "Two years ago I said, \"These people that are coming across the border illegally by the millions are taking the jobs of the black population of America and the Hispanic population of America.\" () Have you seen their job numbers recently? They won't release them, I guarantee, until after the election. But you take a look at the black population job numbers. You take a look at the Hispanic population job numbers. And the unions are going to be next. The unions are going to get hit hard by this."
          },
          "context": {
            "previous": "But they're bringing them into our country at levels never seen before. And your law enforcement over here had... You just had a problem here in this beautiful place we'll talk about. But what they're doing to us... And I saw that it's also the fact that they're taking all of our black populations' jobs and our Hispanic populations' jobs. You haven't seen the real job numbers yet. And I said this also.",
            "next": "They come in illegally, they take everybody's jobs, and you don't know who you're hiring. Our country is being destroyed. This is the worst president and the worst vice president in history. And you got to get out and vote. () Isn't this a wonderful and inspiring speech? I got people sitting in the front row. They're going, \"Oh, my God.\" They thought they'd be out there jumping up and down. Make America great again. We're going to do that. Don't worry. We haven't gotten to that part yet."
          }
        }
      ],
      "Harris": [],
      "Trump_avg_score": 0.8044,
      "Combined_avg_score": 0.8044
    }
  }
}