{
  "query_id": "017",
  "query_text": "And, this will be one of the greatest mistakes in history for them(Biden and Harris’ government) to allow. Millions of people let in. And all over the world crime is down except here. Crime here is up and through the roof. Despite their fraudulent statements that they made. Crime in this country is through the roof. And we have a new form of crime. It's called migrant crime. And it's happening at levels that nobody thought possible. The FBI defraud--they were defrauding statements(that violent crimes come down). They didn't include the worst cities. They didn't include the cities with the worst crime. It was a fraud. Just like their number of 818,000 jobs that they said they created turned out to be a fraud.",
  "query_topics": [
    "Immigration",
    "Government Policy",
    "Economy"
  ],
  "results": {
    "And, this will be one of the greatest mistakes in history for them(Biden and Harris’ government) to allow. Millions of people let in. And all over the world crime is down except here. Crime here is up and through the roof. Despite their fraudulent statements that they made. Crime in this country is through the roof. And we have a new form of crime. It's called migrant crime. And it's happening at levels that nobody thought possible. The FBI defraud--they were defrauding statements(that violent crimes come down). They didn't include the worst cities. They didn't include the cities with the worst crime. It was a fraud. Just like their number of 818,000 jobs that they said they created turned out to be a fraud.": {
      "Trump": [
        {
          "match_score": 0.75129914,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "246",
            "title": "Donald Trump Speaks at Rally in Ohio",
            "date": "20240318",
            "topics": "Immigration, Government Policy"
          },
          "matched_segment": {
            "segment_id": 20,
            "text": "Now we have a new form of crime. I call it Biden migrant crime, but it's too long. So let's just call it migrant crime. We have a new category. You have vicious crimes, you have violent crimes, you have all these, now we have migrant crimes and they're rough. They're rough and it's going to double up. And you see what's happening. Throughout the world right now, I don't know if you know this, crime is way, way down. You know why? Because they sent us their criminals. That's why. It's true. It's true."
          },
          "context": {
            "previous": "You fight a crooked election and they indict you. They don't indict the guys that made the election crooked. They go, \"The people that want to have honest elections get themselves in trouble,\" because these people are sick in Washington. And we are going to change it around fast. I'll tell you right now. () But among my very first actions upon taking office will be to stop the invasion of our country and send Joe Biden's illegal aliens back home. These are the roughest people you've ever seen.",
            "next": "They sent, do you know Venezuela is down 66% because they sent us their gang members and their gangsters. They sent us their drug dealers and their murderers. They're all coming into our country and Venezuela now, their crime is down 66%. And all over the world, crime is down because they've sent them to the United States of America because we have a stupid president that allows this to happen. Stupid. Thank goodness we have JD here. That's all I can tell you. Boy. Hi, JD."
          }
        },
        {
          "match_score": 0.7342781,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "064",
            "title": "Vance and Trump rally in Asheboro, NC",
            "date": "20240822",
            "topics": "Economy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 16,
            "text": "No, they lied about the crime numbers. The crime numbers, it didn't look bad. Then they found out that many of the worst places weren't included in the numbers, and that was done by the FBI, which is sad. (:07) Four years ago, our country was strong and respected like never before. Our allies admired us. Our enemies feared us because everyone knew that as an American president, I was all about putting America first. That's true."
          },
          "context": {
            "previous": "Maybe none. They don't talk about the border. Our great border czar doesn't talk about the border, but they mentioned me more than any other category. I'm now a category. They had me down today as a category. (:38) That's all they talk about. Trump. We've driven them crazy. They have Trump derangement syndrome. We've driven them crazy and they should be driven crazy. They've done a terrible job for our country in every single way. There's not a thing they've done well except cheat and lie. They lie about stats.",
            "next": "Under my leadership, we rebuilt the United States military, created Space Force, and we made our allies pay their fair share and their fair dues. We went to NATO. We say, \"You're not paying. You got to pay.\" If you remember, President Bush would go and he'd make a speech. Obama would go, he'd make a speech. They all made speeches. This one didn't even make a speech, this last one. But I went, I said, \"Nobody is paying. You got to pay.\" And they did pay hundreds of billions of dollars."
          }
        },
        {
          "match_score": 0.7227336,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "492",
            "title": "Trump Rally in Wisconsin",
            "date": "20240909",
            "topics": "Economy, Immigration, Government Policy"
          },
          "matched_segment": {
            "segment_id": 2,
            "text": "You watch those millions and millions of people pour into our country. We have no idea from where, who they are. We know nothing about them, and I'll tell you, many of them are bad. Many of them are among the worst in the world. () Under the Harris-Biden regime, your government imported murderers, child predators, and serial rapists from all over the planet while weaponizing law enforcement to jail political opponents here at home. They do that, and they think it's wonderful."
          },
          "context": {
            "previous": "We are going to defeat Comrade Kamala Harris, and we are going to win the White House, that gorgeous, beautiful White House. We're going to win it, and we're going to turn this country around because this country is a failing nation right now. It's a laughingstock all over the world. () Over the past four years, our country has seen the sickness and corruption of the Washington swamp exposed like never before. You've seen it. You've been watching it.",
            "next": "It's like a third world country, only they loot the economy. They give trillions and trillions of dollars to their left-wing cronies while you pay the cost of rampant inflation, which is what's happened, rampant inflation, bad energy policy, and just pouring out money like it was water. () They run your country for their own power and profit while erasing your borders, assaulting your freedom, indoctrinating your children, and selling your jobs to China, Mexico, and all of these other foreign lands."
          }
        },
        {
          "match_score": 0.7138822,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "218",
            "title": "Donald Trump Rally in Philadelphia",
            "date": "20240624",
            "topics": "Economy, Immigration, Foreign Policy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 10,
            "text": "And after the election and January 20th, it's going to get real good. Going to get real good. () Going to go fast. We're going to give immunity to our police. So if they arrest somebody or if they speak a little bit harshly, they won't be discarded. They won't be destroyed. They won't be thrown in jail because they raise their voice to a criminal. They won't lose their family, they won't lose their home, they won't lose their pension. But the FBI crime statistics Biden is pushing are fake."
          },
          "context": {
            "previous": "It's called the Biden Migrant crime, right? Biden Migrant. And all these millions of people that have come in here, they're just getting warmed up because they wanted to feel it out. They didn't know what the words politically correct mean because in their country, if they did what they do over here, they'd be shot and killed instantly. They can't believe what's happening over here. So it's only going to get worse. It's going to get worse and worse right up to the election.",
            "next": "They're fake just like everything else in this administration. Now he's even saying that all his mishaps were fake. They say the fake news covered him in a fake manner. That's a lot of fake news. That's a lot of fake news back there. () All we want them to do is be honest because they're all going out of business. Nobody believes them anymore. And it didn't help when they went along with the Biden scam. What is he called? What does he call it? You know what he calls it?"
          }
        },
        {
          "match_score": 0.7109391,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "270",
            "title": "Donald Trump Rally in Richmond",
            "date": "20240304",
            "topics": "Immigration, Government Policy"
          },
          "matched_segment": {
            "segment_id": 51,
            "text": "Last year, a sadistic illegal alien released by crooked Joe Biden was arrested for raping an 11-year-old girl in Texas and strangling her to death after knocking on the door of her home. Her father later discovered her body badly beaten and stuffed under her bed. The father came home and found her like that, no one more innocent. () We're not going to have one more innocent American life. We can't let this go on. Migrant crime is going to be at a level that we've never seen crime before. We have bad crime."
          },
          "context": {
            "previous": "Everybody that was in my administration, they loved him, the wife, the family. The wife was walking to the car. He was picking up the wife where she worked. This guy came up, wanted the car, and shot him. He died right in front of the wife. () This is our capital. We're going to change it. We're going to change it around. We're going to be so tough.",
            "next": "But now you can add this to it. They've let 15 million people ... I'll tell you that's what I think the number is, and I think it's going to be 18 million by the time we get the worst president in our history out of office. () This is why a central question in this election is whether the foreign armies of Joe Biden has smuggled across our border ... He's letting armies of people come in, military age. They smuggle them across our border. They walk into our border. They don't even have to smuggle anymore."
          }
        }
      ],
      "Harris": [],
      "Trump_avg_score": 0.7266,
      "Combined_avg_score": 0.7266
    }
  }
}