{
  "query_id": "018",
  "query_text": "We're doing tariffs on other countries.And the tariff will be substantial in some cases. I took in billions and billions of dollars, as you know, from China. In fact, they(the current government with Biden and Harris) never took the tariff off because it was so much money, they can't. It would totally destroy everything that they've set out to do. They're taking in billions of dollars from China and other places. They've left the tariffs on. ",
  "query_topics": [
    "Economy",
    "Foreign Policy",
    "Government Policy"
  ],
  "results": {
    "We're doing tariffs on other countries.And the tariff will be substantial in some cases. I took in billions and billions of dollars, as you know, from China. In fact, they(the current government with Biden and Harris) never took the tariff off because it was so much money, they can't. It would totally destroy everything that they've set out to do. They're taking in billions of dollars from China and other places. They've left the tariffs on. ": {
      "Trump": [
        {
          "match_score": 0.84718335,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "160",
            "title": "Donald Trump CPAC 2021 Speech Transcript Dallas, TX",
            "date": "20210711",
            "topics": "Immigration, Government Policy, Social Justice"
          },
          "matched_segment": {
            "segment_id": 122,
            "text": "Imposing massive tariffs to protect American workers and bring jobs and factories and billions and billions of dollars back. You know that? Back to our shores. We made a great deal with China, which has immeasurably helped our farmers and manufacturers, and we put the Chinese Communist Party on defense for the first time ever in our history of our country. We never took in 10 cents. They're paying us millions. It's interesting. Biden, he wants to end the tariffs. If he does, China will take over the whole deal."
          },
          "context": {
            "previous": "You know, they're dying to say, Matt, that we made a bipartisan deal. You don't have to do that, because you're getting fleeced. It's all green new deal stuff. It's nonsense. And it's going to destroy our country. And inflation's going to be a big problem. We can't let it happen. Despite the pleading and begging of the outsourcers and globalists, I took on China like no president had ever done before.",
            "next": "Okay? But they're finding it hard to do. He campaigned on ending tariffs, which was stupid. Although maybe not so stupid, right? You know what happened. You know what happened. But he campaigned on ending tariffs. So ridiculous. We're taking billions and billions, and we convinced the world that we have to watch China. When I took over, we had a deficit with China of 507 billion dollars. That's not sustainable. 507. Not million. 507 million's a lot. 507 billion dollars."
          }
        },
        {
          "match_score": 0.83535844,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "436",
            "title": "Donald Trump Mosinee, WI  Rally Speech Transcript September 17",
            "date": "20200917",
            "topics": "Economy, Foreign Policy, Immigration"
          },
          "matched_segment": {
            "segment_id": 123,
            "text": "Biden has vowed to remove those tariffs and allow China to resume its pillaging. He wants to take the tariffs off that are paying us tens of billions of dollars a year. I fought like hell to keep them into the China deal and he wants to remove them. So tens of billions of dollars, billions and billions, I gave it to the farmers. I gave it to a lot of people, but I gave most of it by far, to the US Treasury. He wants to take them off. So let me just ask you just a very innocent question."
          },
          "context": {
            "previous": "In 2017, I signed a historic executive order making government policy to buy American and hire American. I'm watching this Biden and he's got his sign in front, \"Buy American. Oh, by American.\" I've been saying that for like 20 years, right? Where the hell has this guy been? They were actually accusing him of plagiarism. I also took the toughest ever action to stand up to China's rampant theft of Wisconsin jobs. And it's all jobs, but you got hit particularly hard.",
            "next": "There's a young man, about four years old up front, I think he could give the answer. Who do you think would like to have China? How do you think China would feel about this election? In one case, they paid billions and billions of dollars a month to the US. We never got ever, 10 cents from China. In the other case, he said, \"We're going to take them off.\" I think they might be inclined to go for Sleepy Joe. This is like a dream for China. Joe Biden's agenda is made in China. My agenda is made in the USA."
          }
        },
        {
          "match_score": 0.8076996,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "213",
            "title": "Donald Trump Campaign Rally in Racine, Wisconsin",
            "date": "20240620",
            "topics": "Economy, Immigration, Foreign Policy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 72,
            "text": "Not one president took out 10 cents. In fact, Biden wants to revoke the tariffs, but he can't, because it's so much money. He can't do it. He just can't do it. () I also will pass the Trump Reciprocal Trade Act. That's if China or any other country makes us pay 100% or 200% tariff or tax, we will make them pay a reciprocal tariff or tax of 100% or 200% right back. And it's not only China, it's many countries. We have countries that charge us tremendous taxes and tariffs, so we don't charge them anything."
          },
          "context": {
            "previous": "They built their military because of stupid people. And one thing, somebody said it, you don't even think about it. I read it two nights ago. Donald Trump was the one that brought up China and the tremendous threat that China is, and the amount of money that China takes out of our country every year. You never heard that until I came along. And it's one thing to talk about it, but I did talk about it. But I was doing something. We took out hundreds of billions of dollars out of China.",
            "next": "And I was changing that, and got a lot of it changed with South Korea, with Japan, made a new deal with Japan. Japan was really, Prime Minister Abe, he was great of Japan. He was assassinated. He was a great friend of mine. He was a great gentleman. He loved his people. He loved his country. I went to him. I said, \"The trade deal between Japan and the United States is the most unfair thing I think I've ever seen.\" They sell cars to us, we can't sell cars to them. They sell food to us, we can't sell food to them."
          }
        },
        {
          "match_score": 0.80672187,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "481",
            "title": "Trump Rally in Walker, Michigan",
            "date": "20240930",
            "topics": "Immigration, Government Policy"
          },
          "matched_segment": {
            "segment_id": 60,
            "text": "If you don't make your product here, then you will have to pay a tax or tariff when you send your product into the United States, and we will take in hundreds of billions of dollars into our treasury and use that money to benefit the American citizens. So with China as an example, I took in hundreds of billions of dollars in taxes and tariffs. No other president took in 10 cents. In fact, they left it on because they can't get it off because it's taken in so much money that the Biden people ..."
          },
          "context": {
            "previous": "We will give you the lowest taxes, the lowest energy costs because we have the energy, the lowest regulatory burden. I cut regulations more than any other president in the history of our country. And we'll give you free access to the biggest and best market on the planet. () That's us. But only if you make your product here in America and hire American workers.",
            "next": "I'm sure he doesn't know about it too much. But the Biden people said, \"We can't get rid of these tariffs. They're making too much money.\" But what they're also doing, maybe more importantly, their cars aren't coming in and they're not destroying Detroit and South Carolina and North Carolina and Georgia and all the other places that are involved with making autos and parts. () They're not coming in. And we made a fortune on it. And now all we're doing is taking ... We were ready to do that."
          }
        },
        {
          "match_score": 0.7953184,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "355",
            "title": "Trump Speaks in Chicago",
            "date": "20241016",
            "topics": "Economy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 3,
            "text": "But we got hundreds of billions of dollars just from China alone, and I hadn't even started yet. But tariffs are two things, if you look at it. Number one, it's for protection of the companies that we have here and the new companies that will move in, because we're going to have thousands of companies coming into this country. We're going to grow it like it's never grown before, and we're going to protect them when they come in because we're not going to have somebody undercut them."
          },
          "context": {
            "previous": "It needs a public relations firm to help it, but to me it's the most beautiful word in the dictionary. But that's like for what company are you talking about? Okay, look, I've brought in with tariffs and I was just getting started. Then COVID came and we had a ... because I tell you what, I did a very good job in COVID. Nobody knew what the hell it was. I call it the China virus because I like being a little more accurate when that came.",
            "next": "And I could give you an example of this if you want. Would you like me to? Because I just- ... I just found out about it. So I've been talking about for the last year about Detroit and how horribly it has been. It's just horrible because we've been talking about Detroit's coming back for 40 years, and it's never come back. And it's very dependent on the car industry. Well, they've lost 60% of the business over a long period of time. And what happened is I found out a friend of mine builds auto plants."
          }
        }
      ],
      "Harris": []
    }
  }
}