{
  "query_id": "019",
  "query_text": "At the same time in her own way she hates the Arab population because the whole place is gonna get blown up, Arabs, Jewish people, Israel. Israel will be gone. It would have never happened. Iran was broke under Donald Trump. Now Iran has $300 billion because they took off all the sanctions that I had. Iran had no money for Hamas or Hezbollah or any of the 28 different spheres of terror. And they are spheres of terror. Horrible terror. They had no money for terror. They were broke. Now they're a rich nation. And now what they're doing is spreading that money around. Look at what's happening with the Houthis and Yemen. Look at what's going on in the Middle East. This would have never happened. ",
  "query_topics": [
    "Foreign Policy",
    "Government Policy"
  ],
  "results": {
    "At the same time in her own way she hates the Arab population because the whole place is gonna get blown up, Arabs, Jewish people, Israel. Israel will be gone. It would have never happened. Iran was broke under Donald Trump. Now Iran has $300 billion because they took off all the sanctions that I had. Iran had no money for Hamas or Hezbollah or any of the 28 different spheres of terror. And they are spheres of terror. Horrible terror. They had no money for terror. They were broke. Now they're a rich nation. And now what they're doing is spreading that money around. Look at what's happening with the Houthis and Yemen. Look at what's going on in the Middle East. This would have never happened. ": {
      "Trump": [
        {
          "match_score": 0.74042267,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "113",
            "title": "Donald Trump Delivers Speech in South Carolina",
            "date": "20240212",
            "topics": "Immigration, Government Policy"
          },
          "matched_segment": {
            "segment_id": 58,
            "text": "For four straight years, it didn't happen. Likewise, the horrifying attack on Israel would never have happened. They wouldn't even have thought of doing such a horrible thing if President Trump was in the Oval Office. Iran was broke under Trump and the Trump administration. They didn't have the money to fund Hamas and Hezbollah and all of the other instruments of terror. They had no money at all."
          },
          "context": {
            "previous": "(:06) We are a nation that surrendered in Afghanistan, leaving dead soldiers, American citizens, me $85 billion worth of the finest military equipment anywhere in the world and also abandoning Bagram, one of the biggest military bases anywhere in the world and only one hour away from where China makes its nuclear weapons. We are a nation that allowed Russia and Ukraine to fight, killing hundreds of thousands of people, and it will only get worse. (:39) It would never have happened with me as your president.",
            "next": "(:16) But those sanctions were lifted by the corrupt Biden administration, and now Iran is a rich country with $200 billion and another $6 billion for hostages. Think of it, $6 billion for five hostages and $10 billion for electricity for Iraq, all compliments of the incompetent Biden administration. China, with Taiwan, is watching, and they're next. We're a nation that allows radical left terrorists to violently attack our cities, leaving behind massive destruction and death."
          }
        },
        {
          "match_score": 0.7075569,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "326",
            "title": "Donald Trump at “Commit to Caucus” Event in Iowa",
            "date": "20231120",
            "topics": "Economy, Immigration, Foreign Policy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 110,
            "text": "They have tremendous amounts of money. They're a very rich country. And when I was there, they were broke and everybody talked about it. In fact, I saw one of the people that are up there, a real terrible reporter, but said the other day, \"One thing I will say, Iran was broke when Trump was running this country. They couldn't do anything. They didn't have the money. They couldn't feed terrorism."
          },
          "context": {
            "previous": "So, I said, \"Give me the bad news.\" Well, the bad news because I saw they got six, he got six, five and five, $6 billion. I said, You mean are they paying anything to us?\" \"No, we give them 6 billion,\" meaning we free up. That's the same thing as far as I'm concerned. (:11) Then, the other day, yesterday they approved $10 billion more, $10 billion more and Iran now... And that's peanuts compared to what they've been allowed to make with the oil. They have probably $125 billion now.",
            "next": "Now they have so much money they don't know what to do with it.\" (:49) And with the historic Abraham Accords, I even made peace in the Middle East and that would've gone on and we would've had every country, I think including Iran, in that deal ultimately. But they did nothing with it. They did nothing For four straight years, I kept America safe, I kept Israel safe, I kept Ukraine safe, and I kept the whole world safe. And we will again as the 47th President of the United States, right?"
          }
        },
        {
          "match_score": 0.70015216,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "236",
            "title": "Trump Campaigns in Georgia and Responds to the SOTU Address",
            "date": "20240311",
            "topics": "Economy, Foreign Policy, Immigration, Infrastructure, Government Policy"
          },
          "matched_segment": {
            "segment_id": 138,
            "text": "And for four straight years, it didn't happen. Likewise, the horrifying attack on Israel would never have happened. They wouldn't even have thought of doing such a thing if President Trump was in the Oval Office. Iran was broke under the Trump administration. They didn't have the money to fund Hamas, Hezbollah, and all of the other instruments of terror that they funded previously. But those sanctions were lifted by a corrupt Biden administration."
          },
          "context": {
            "previous": "We are a nation that surrendered in Afghanistan leaving dead soldiers, American citizens, and $85 billion worth of the finest military equipment in the world behind, and also abandoning Bagram, one of the biggest military bases anywhere in the world and only one hour away from where China makes its nuclear weapons. And we are a nation that allowed Russia and Ukraine to fight killing hundreds of thousands of people and it will only get worse. (:23) It would never have happened with me as your president.",
            "next": "And now, Iran is a rich country again with $221 billion and another $6 billion that they got for hostages from us, and 10 billion for electricity to Iraq, all compliments of an incompetent Biden administration. They gave them so many compliments and they gave them so much money. And China with Taiwan is next. We are a nation that allows radical left terrorists to violently attack our cities, leaving behind massive destruction and death. And nothing happens to the criminals that do these terrible things."
          }
        },
        {
          "match_score": 0.6979605,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "465",
            "title": "Trump Rally in Georgia",
            "date": "20240925",
            "topics": "Economy, Foreign Policy"
          },
          "matched_segment": {
            "segment_id": 105,
            "text": "Iran was ready to make a deal, they would've made a deal in two minutes. They had no money. They had no money. And now, they have $300 billion, they made it all in three and a half years. What a shame. What opportunity has been wasted. When Kamala speaks, be advised, and we have to tell, this woman has allowed record numbers of people into our country. They're from all over the world. They're now creating criminal havoc throughout the country. Aurora, Colorado, you saw that?"
          },
          "context": {
            "previous": "He was going to put this category, those that make fentanyl and ship it to the United States was going to get the death penalty. And I told him, \"If you don't that, we're not going to do trading with China. We're going to go cold turkey. We're not trading and we're going to put tariffs on anything that gets through, big ones.\" (:42) And he agreed to do it, and then Biden of course, dropped the ball, just like he dropped the ball on Israel with Iran.",
            "next": "Where Venezuelan gangs are taking over real estate, they've become real estate developers. How nice. (:25) No, they're taking over real estate and they have weapons that even our military hasn't seen. Who's giving them these weapons? But Aurora is a mess. The governor is a mess. The governor is a Democrat and he's a radical-left Democrat and he's not too popular right now because they're going to take over a lot more than Aurora."
          }
        },
        {
          "match_score": 0.6941832,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "159",
            "title": "Trump Rally in Florida on 7/09/24",
            "date": "20240710",
            "topics": "Immigration, Climate, Healthcare, Foreign Policy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 43,
            "text": "They wouldn't even have thought of doing such a thing if President Trump was in the Oval Office. Iran was broke under the Trump administration. They didn't have the money to fund Hama, Hezbollah, and all of the other instruments of terror that they use. But those sanctions were lifted by a corrupt Biden administration. And now Iran is a rich country with 250 billion. Think of that. (:04) Iran, from nothing, they were broke. They now have $250 billion. $6 billion they also got for hostages. $6 billion."
          },
          "context": {
            "previous": "And also abandoning Bagram, one of the biggest military bases anywhere in the world and only one hour away from where China makes its nuclear weapons. And we are a nation that allowed Russia and Ukraine to fight killing hundreds of thousands of people and it will only get worse. It would never have happened with me as your president. And for four straight years it didn't happen. Likewise, the horrifying attack on Israel would've never happened.",
            "next": "And for electricity to Iraq, they were given $10 billion. All compliments of an incompetent Biden administration. And China with Taiwan is next. We are a nation that allows radical left terrorists to violently attack our cities, leaving behind massive destruction and death, and nothing happens to the criminals to do these terrible things. There is no punishment. But when people who love our country protest on January 6th in Washington, they become hostages, unfairly imprisoned for long periods of time."
          }
        }
      ],
      "Harris": [],
      "Trump_avg_score": 0.7081,
      "Combined_avg_score": 0.7081
    }
  }
}