{
  "query_id": "020",
  "query_text": "I had a choice to make: Do I save [the Affordable Care Act] and make it as good as it can be, or do I let it rot? And I saved it.",
  "query_topics": [
    "Healthcare"
  ],
  "results": {
    "I had a choice to make: Do I save [the Affordable Care Act] and make it as good as it can be, or do I let it rot? And I saved it.": {
      "Trump": [
        {
          "match_score": 0.80920506,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "371",
            "title": "Donald Trump Leaked Unedited 60 Minutes Interview Transcript",
            "date": "20201022",
            "topics": "Economy, Gun Control, Government Policy"
          },
          "matched_segment": {
            "segment_id": 28,
            "text": "I had a choice to make. Do I manage the remainder of whatever's left of this whole thing called Obamacare, which is no good, do I manage it well or manage it badly? If I manage it well, politically, maybe that's not good [crosstalk :03]. I decide- Politically, maybe that's not good. I decided to manage it well. No, I don't want to leave it, I want to see what happens. Here's what happens. We may be stuck with it if we lose in the Supreme Court, in which case, we're wasting a lot of words."
          },
          "context": {
            "previous": "We got it terminated, terminated through the legislature, signed, done. That means Obamacare is no longer Obamacare. We got rid of the most important element of Obamacare. And it was the worst element of Obamacare that nobody wanted, nobody liked. So Obamacare essentially was terminated as we know it. Now we have the carcass of Obamacare- We managed it well. Lesley, we've managed it well. I had a choice to make, when we got rid of the individual mandate, nobody believed we could do that and I did it.",
            "next": "If we win, we will come up with a much... And we will do that. Come up with a much better healthcare for much less money, always protecting people with pre-existing conditions. No, you're only trying to... I wish you would interview Joe Biden like you interview me. It would be so good. You know what? I don't mind it, I don't mind it. But when I watch him walk out of his store, he's in the midst of a scandal, his family is corrupt, okay? He's corrupt. He's a corrupt politician. And he's walking with ice cream."
          }
        },
        {
          "match_score": 0.78590363,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "410",
            "title": "Donald Trump Rush Limbaugh Interview “Radio Rally” Transcript October 9",
            "date": "20201009",
            "topics": "Economy, Healthcare, Education, Government Policy"
          },
          "matched_segment": {
            "segment_id": 51,
            "text": "Sort of I have terminated Obamacare, because once you get rid of the individual mandate it's no longer Obamacare. But I had a choice to make, Rush. It was a big choice. Do I maintain Obamacare, the remnants of Obamacare after the mandate? Do I maintain it well, or do I run it badly? I could have done it either way. I have very good people over there, Alex Azar and Seema, the whole group. I said, you know what, we've got to run it as well as it can be run. I have no choice."
          },
          "context": {
            "previous": "That's where you had to pay a fortune for the privilege of not paying for bad health insurance. You understand that, right? So I got rid of it, and I got rid of it through the law. I got rid of it in our tax decrease. We got the biggest tax decrease in the history of our country. We would have never been able to build up the economy if we didn't get that. But one of the things I got in there, I got rid of the individual mandate. What I want to do is... And we're fighting to terminate.",
            "next": "I could have run it badly and made everybody angry, but I didn't do that. I ran it really well. Knowing that it's run really well, it's still no good. It's still not good. It's much better than when they ran it. They couldn't even do... Remember, they spent $5 billion on the server, if you remember. They couldn't get the server right. That's correct. Come up with a great health care plan that's much less expensive and does include people with preexisting conditions, that's what I want to do."
          }
        },
        {
          "match_score": 0.7648014,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "431",
            "title": "Donald Trump ABC News Town Hall Transcript with George Stephanopoulos in Philadelphia",
            "date": "20200916",
            "topics": "Healthcare, Infrastructure, Government Policy, Technology"
          },
          "matched_segment": {
            "segment_id": 53,
            "text": "You're going to have new healthcare, and the preexisting condition aspect of it will always be in my plan, and I've said that loud and clear- And, we got rid of the individual mandate, which essentially ended Obamacare- George, I had a decision to make. Do I run... We gutted out the worst parts of Obamacare. Now, I have to make this decision. This is three years ago. Do we run Obamacare well and do a good job, and do the best, even though it's never going to be very good, or do we let it run badly?"
          },
          "context": {
            "previous": "Wouldn't pertain to you, but it'd pertain to a lot of people where they were going literally bust because they didn't want to have health insurance, and they were paying for it anyway, and it was no good. Obamacare was a disaster. Obamacare is too expensive. The premiums are too high. It's a total disaster.",
            "next": "Probably letting it run badly would've been a better political decision, but I couldn't do that. We have run it so much better than Obama ran it. Now, it's not the same because I got rid of the most unpopular thing and a very unfair thing, which was the individual mandate. George, we have run it really well, but we also have now other..."
          }
        },
        {
          "match_score": 0.7490844,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "271",
            "title": "Donald Trump Fox News Town Hall Transcript",
            "date": "20200306",
            "topics": "Healthcare, Immigration, Government Policy"
          },
          "matched_segment": {
            "segment_id": 37,
            "text": "It's a much different plan. And what we'd like to do is totally kill it, but come up, before we do that, with something that's great. What we've done is we've really managed Obamacare, the remaining portion, we get rid of the bad part, but the remaining portion really well. And before I got involved, you know what was happening with the rates on Obamacare. They were going up at levels that nobody's ever seen before. We are managing it. And I had a decision to make. This was very important."
          },
          "context": {
            "previous": "That's where you paid a fortune not to pay for horrible healthcare and insurance, and it had a tremendous impact. Preexisting conditions, 100% we take care of. But we have many healthcare plans now where it's 60%, even 65% less expensive than Obamacare. It's better than Obamacare, and what we really have left is the carcass of Obamacare or you could call it new healthcare, because without preexisting... without the whole thing with the individual mandate, it's a whole different ball game.",
            "next": "I said to my people, and we have great people, [Sema :47], Azar, I mean great people that are so good at it. I said, \"You know, I have a little problem. Do we manage it great until we get something much better? Or do we manage it poorly and say Obamacare's horrible.\" And I said, \"We've got to do the right thing."
          }
        },
        {
          "match_score": 0.7391332,
          "metadata": {
            "speaker": "Trump",
            "speech_id": "307",
            "title": "Transcript: Donald Trump Signs Nurse’s Day Proclamation, Contradicts Nurse on PPE",
            "date": "20200506",
            "topics": "Healthcare, Economy, Government Policy"
          },
          "matched_segment": {
            "segment_id": 25,
            "text": "See, I don't view it as a termination. I view this as getting great healthcare. Because Obamacare, we run it really well. I had a decision to make, I said this yesterday. We took over Obamacare. We got rid of the individual mandate, which basically was the end of Obamacare. In a formal sense, it was really the end of Obamacare, and few people are challenging the fact that we can do that. So we got rid of the individual mandate. I had a decision to make."
          },
          "context": {
            "previous": "So what I'm saying here, John, is we're going to replace Obamacare with great healthcare, at a lesser price, and preexisting conditions will be included, and you won't have the individual mandate, which was expensive, and terrible, and very unfair to everybody, and it was very unpopular. No, I don't know about that suggestion. I think I've spoken a lot about this to Bill Barr, and we're totally in lockstep with all of the many states that want to see much better healthcare.",
            "next": "Do I want to have Obamacare run as well as it can run, or do I want to have it run really badly, so everybody could say Obamacare is terrible? Politically, I could do the other, I should let it run badly. But I can't do that, because I'm president for the people, and we ran that much better than President Obama ran it, much better than the last administration ran it, SEMA, and Alex, and everybody, and spent a lot of money and running it properly. It's still not good."
          }
        }
      ],
      "Harris": [
        {
          "match_score": 0.6543162,
          "metadata": {
            "speaker": "Harris",
            "speech_id": "020",
            "title": "Harris and Walz Hold First Rally",
            "date": "20240807",
            "topics": "Economy, Healthcare, Education, Social Justice, Gun Control, Veterans Affairs"
          },
          "matched_segment": {
            "segment_id": 15,
            "text": "(:44) In Washington, Tim worked to raise the minimum §wage, to protect the freedom of workers to join a union, and he cast one of the critical votes to pass the Affordable Care Act, which of course gave health insurance to tens of millions of Americans. I'm going to tell you, when we win, Tim and I will continue to make the Affordable Care Act even stronger. We will. (:46) Now let's talk about what we're dealing with on the other side."
          },
          "context": {
            "previous": "(:42) So it was Coach Walz's students who actually helped him decide to run for office. And he served 12 years in Congress representing a purple district as he reached across the aisle to get things done. He was the highest ranking enlisted man to ever serve in the United States Congress, and the top Democrat on the Veterans Committee, and he was known as one of Capitol Hill's best marksman, winning a bipartisan sharp shooting contest year after year.",
            "next": "So on that last topic, if Donald Trump gets the chance, he will end the Affordable Care Act and take us back to a time when insurance companies have the power to deny people with pre-existing conditions. You remember what that was like? Children with asthma, breast cancer survivors, grandparents with diabetes. Well, Governor Walz and I will not let that happen because we believe healthcare should be a right and not just a privilege for those who can afford it."
          }
        },
        {
          "match_score": 0.63004875,
          "metadata": {
            "speaker": "Harris",
            "speech_id": "020",
            "title": "Harris and Walz Hold First Rally",
            "date": "20240807",
            "topics": "Economy, Healthcare, Education, Social Justice, Gun Control, Veterans Affairs"
          },
          "matched_segment": {
            "segment_id": 16,
            "text": "So on that last topic, if Donald Trump gets the chance, he will end the Affordable Care Act and take us back to a time when insurance companies have the power to deny people with pre-existing conditions. You remember what that was like? Children with asthma, breast cancer survivors, grandparents with diabetes. Well, Governor Walz and I will not let that happen because we believe healthcare should be a right and not just a privilege for those who can afford it."
          },
          "context": {
            "previous": "(:44) In Washington, Tim worked to raise the minimum §wage, to protect the freedom of workers to join a union, and he cast one of the critical votes to pass the Affordable Care Act, which of course gave health insurance to tens of millions of Americans. I'm going to tell you, when we win, Tim and I will continue to make the Affordable Care Act even stronger. We will. (:46) Now let's talk about what we're dealing with on the other side.",
            "next": "As governor, Tim has continued to fight for working families. He secured paid leave for workers in Minnesota and he refused as governor to allow any student in their public schools to go hungry, so he made school breakfast and lunch free for every child. And Tim Walz and I, we agree about many things including when our middle class is strong, America is strong. And strengthening in the middle class will be my defining goal as I am President of the United States."
          }
        }
      ]
    }
  }
}